[
	{
		"qid": 3000201,
		"question": "what is myuutsu's pokemon type?",
		"answer": [
			"Psychic Pokémon"
		],
		"function": "none",
		"commonness": -21.248555286146384,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pokemon.pok_mon_type",
					"class": "base.pokemon.pok_mon_type",
					"friendly_name": "Pokémon type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mewtwo",
					"class": "base.pokemon.pok_mon",
					"friendly_name": "myuutsu",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pokemon.pok_mon.pok_mon_type",
					"friendly_name": "Pokémon type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pokemon.pok_mon_type . \nVALUES ?x1 { :en.mewtwo } \n?x1 :base.pokemon.pok_mon.pok_mon_type ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 3000202,
		"question": "what is myuutwo's pokemon type?",
		"answer": [
			"Psychic Pokémon"
		],
		"function": "none",
		"commonness": -21.248555286146384,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pokemon.pok_mon_type",
					"class": "base.pokemon.pok_mon_type",
					"friendly_name": "Pokémon type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mewtwo",
					"class": "base.pokemon.pok_mon",
					"friendly_name": "myuutwo",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pokemon.pok_mon.pok_mon_type",
					"friendly_name": "Pokémon type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pokemon.pok_mon_type . \nVALUES ?x1 { :en.mewtwo } \n?x1 :base.pokemon.pok_mon.pok_mon_type ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 4000000,
		"question": "what rank is lady companion of the garter?",
		"answer": [
			"Lady Companion"
		],
		"function": "none",
		"commonness": -20.158811374247886,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "royalty.chivalric_rank",
					"class": "royalty.chivalric_rank",
					"friendly_name": "Chivalric Rank",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.lady_companion_of_the_garter",
					"class": "royalty.chivalric_title",
					"friendly_name": "Lady Companion of the Garter",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "royalty.chivalric_title.rank",
					"friendly_name": "Rank"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :royalty.chivalric_rank . \nVALUES ?x1 { :en.lady_companion_of_the_garter } \n?x1 :royalty.chivalric_title.rank ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 4000001,
		"question": "what rank is lady of the garter?",
		"answer": [
			"Lady Companion"
		],
		"function": "none",
		"commonness": -20.158811374247886,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "royalty.chivalric_rank",
					"class": "royalty.chivalric_rank",
					"friendly_name": "Chivalric Rank",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.lady_companion_of_the_garter",
					"class": "royalty.chivalric_title",
					"friendly_name": "lady of the garter",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "royalty.chivalric_title.rank",
					"friendly_name": "Rank"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :royalty.chivalric_rank . \nVALUES ?x1 { :en.lady_companion_of_the_garter } \n?x1 :royalty.chivalric_title.rank ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 4000100,
		"question": "lady companion of the garter is what chivalric rank?",
		"answer": [
			"Lady Companion"
		],
		"function": "none",
		"commonness": -20.158811374247886,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "royalty.chivalric_rank",
					"class": "royalty.chivalric_rank",
					"friendly_name": "Chivalric Rank",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.lady_companion_of_the_garter",
					"class": "royalty.chivalric_title",
					"friendly_name": "Lady Companion of the Garter",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "royalty.chivalric_title.rank",
					"friendly_name": "Rank"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :royalty.chivalric_rank . \nVALUES ?x1 { :en.lady_companion_of_the_garter } \n?x1 :royalty.chivalric_title.rank ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 4000101,
		"question": "lady of the garter is what chivalric rank?",
		"answer": [
			"Lady Companion"
		],
		"function": "none",
		"commonness": -20.158811374247886,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "royalty.chivalric_rank",
					"class": "royalty.chivalric_rank",
					"friendly_name": "Chivalric Rank",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.lady_companion_of_the_garter",
					"class": "royalty.chivalric_title",
					"friendly_name": "lady of the garter",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "royalty.chivalric_title.rank",
					"friendly_name": "Rank"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :royalty.chivalric_rank . \nVALUES ?x1 { :en.lady_companion_of_the_garter } \n?x1 :royalty.chivalric_title.rank ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 4000400,
		"question": "what rank accompanies the lady companion of the garter?",
		"answer": [
			"Lady Companion"
		],
		"function": "none",
		"commonness": -20.158811374247886,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "royalty.chivalric_rank",
					"class": "royalty.chivalric_rank",
					"friendly_name": "Chivalric Rank",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.lady_companion_of_the_garter",
					"class": "royalty.chivalric_title",
					"friendly_name": "Lady Companion of the Garter",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "royalty.chivalric_title.rank",
					"friendly_name": "Rank"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :royalty.chivalric_rank . \nVALUES ?x1 { :en.lady_companion_of_the_garter } \n?x1 :royalty.chivalric_title.rank ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 4000401,
		"question": "what rank accompanies the lady of the garter?",
		"answer": [
			"Lady Companion"
		],
		"function": "none",
		"commonness": -20.158811374247886,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "royalty.chivalric_rank",
					"class": "royalty.chivalric_rank",
					"friendly_name": "Chivalric Rank",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.lady_companion_of_the_garter",
					"class": "royalty.chivalric_title",
					"friendly_name": "lady of the garter",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "royalty.chivalric_title.rank",
					"friendly_name": "Rank"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :royalty.chivalric_rank . \nVALUES ?x1 { :en.lady_companion_of_the_garter } \n?x1 :royalty.chivalric_title.rank ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 4000500,
		"question": "lady companion of the garter is known by which chivalric rank?",
		"answer": [
			"Lady Companion"
		],
		"function": "none",
		"commonness": -20.158811374247886,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "royalty.chivalric_rank",
					"class": "royalty.chivalric_rank",
					"friendly_name": "Chivalric Rank",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.lady_companion_of_the_garter",
					"class": "royalty.chivalric_title",
					"friendly_name": "Lady Companion of the Garter",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "royalty.chivalric_title.rank",
					"friendly_name": "Rank"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :royalty.chivalric_rank . \nVALUES ?x1 { :en.lady_companion_of_the_garter } \n?x1 :royalty.chivalric_title.rank ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 4000501,
		"question": "lady of the garter is known by which chivalric rank?",
		"answer": [
			"Lady Companion"
		],
		"function": "none",
		"commonness": -20.158811374247886,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "royalty.chivalric_rank",
					"class": "royalty.chivalric_rank",
					"friendly_name": "Chivalric Rank",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.lady_companion_of_the_garter",
					"class": "royalty.chivalric_title",
					"friendly_name": "lady of the garter",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "royalty.chivalric_title.rank",
					"friendly_name": "Rank"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :royalty.chivalric_rank . \nVALUES ?x1 { :en.lady_companion_of_the_garter } \n?x1 :royalty.chivalric_title.rank ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 5000000,
		"question": "which office granted the patent mouse?",
		"answer": [
			"United States Patent and Trademark Office"
		],
		"function": "none",
		"commonness": -15.489207396185584,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.patent_office",
					"class": "law.patent_office",
					"friendly_name": "Patent office",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mouse",
					"class": "law.us_patent",
					"friendly_name": "Mouse",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.us_patent.patent_office",
					"friendly_name": "Patent office"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.patent_office . \nVALUES ?x1 { :en.mouse } \n?x1 :law.us_patent.patent_office ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 5000001,
		"question": "which office granted the patent tilt wheel?",
		"answer": [
			"United States Patent and Trademark Office"
		],
		"function": "none",
		"commonness": -15.489207396185584,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.patent_office",
					"class": "law.patent_office",
					"friendly_name": "Patent office",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mouse",
					"class": "law.us_patent",
					"friendly_name": "tilt wheel",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.us_patent.patent_office",
					"friendly_name": "Patent office"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.patent_office . \nVALUES ?x1 { :en.mouse } \n?x1 :law.us_patent.patent_office ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 5000002,
		"question": "which office granted the patent computer mouse?",
		"answer": [
			"United States Patent and Trademark Office"
		],
		"function": "none",
		"commonness": -15.489207396185584,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.patent_office",
					"class": "law.patent_office",
					"friendly_name": "Patent office",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mouse",
					"class": "law.us_patent",
					"friendly_name": "computer mouse",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.us_patent.patent_office",
					"friendly_name": "Patent office"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.patent_office . \nVALUES ?x1 { :en.mouse } \n?x1 :law.us_patent.patent_office ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 5000100,
		"question": "the patent for the mouse was filed where?",
		"answer": [
			"United States Patent and Trademark Office"
		],
		"function": "none",
		"commonness": -15.489207396185584,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.patent_office",
					"class": "law.patent_office",
					"friendly_name": "Patent office",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mouse",
					"class": "law.us_patent",
					"friendly_name": "Mouse",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.us_patent.patent_office",
					"friendly_name": "Patent office"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.patent_office . \nVALUES ?x1 { :en.mouse } \n?x1 :law.us_patent.patent_office ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 5000101,
		"question": "the patent for the tilt wheel was filed where?",
		"answer": [
			"United States Patent and Trademark Office"
		],
		"function": "none",
		"commonness": -15.489207396185584,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.patent_office",
					"class": "law.patent_office",
					"friendly_name": "Patent office",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mouse",
					"class": "law.us_patent",
					"friendly_name": "tilt wheel",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.us_patent.patent_office",
					"friendly_name": "Patent office"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.patent_office . \nVALUES ?x1 { :en.mouse } \n?x1 :law.us_patent.patent_office ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 5000102,
		"question": "the patent for the computer mouse was filed where?",
		"answer": [
			"United States Patent and Trademark Office"
		],
		"function": "none",
		"commonness": -15.489207396185584,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.patent_office",
					"class": "law.patent_office",
					"friendly_name": "Patent office",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mouse",
					"class": "law.us_patent",
					"friendly_name": "computer mouse",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.us_patent.patent_office",
					"friendly_name": "Patent office"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.patent_office . \nVALUES ?x1 { :en.mouse } \n?x1 :law.us_patent.patent_office ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 5000300,
		"question": "where was the patent mouse filed?",
		"answer": [
			"United States Patent and Trademark Office"
		],
		"function": "none",
		"commonness": -15.489207396185584,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.patent_office",
					"class": "law.patent_office",
					"friendly_name": "Patent office",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mouse",
					"class": "law.us_patent",
					"friendly_name": "Mouse",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.us_patent.patent_office",
					"friendly_name": "Patent office"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.patent_office . \nVALUES ?x1 { :en.mouse } \n?x1 :law.us_patent.patent_office ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 5000301,
		"question": "where was the patent tilt wheel filed?",
		"answer": [
			"United States Patent and Trademark Office"
		],
		"function": "none",
		"commonness": -15.489207396185584,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.patent_office",
					"class": "law.patent_office",
					"friendly_name": "Patent office",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mouse",
					"class": "law.us_patent",
					"friendly_name": "tilt wheel",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.us_patent.patent_office",
					"friendly_name": "Patent office"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.patent_office . \nVALUES ?x1 { :en.mouse } \n?x1 :law.us_patent.patent_office ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 5000302,
		"question": "where was the patent computer mouse filed?",
		"answer": [
			"United States Patent and Trademark Office"
		],
		"function": "none",
		"commonness": -15.489207396185584,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.patent_office",
					"class": "law.patent_office",
					"friendly_name": "Patent office",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mouse",
					"class": "law.us_patent",
					"friendly_name": "computer mouse",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.us_patent.patent_office",
					"friendly_name": "Patent office"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.patent_office . \nVALUES ?x1 { :en.mouse } \n?x1 :law.us_patent.patent_office ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 5000400,
		"question": "in which office was the patent mouse filed?",
		"answer": [
			"United States Patent and Trademark Office"
		],
		"function": "none",
		"commonness": -15.489207396185584,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.patent_office",
					"class": "law.patent_office",
					"friendly_name": "Patent office",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mouse",
					"class": "law.us_patent",
					"friendly_name": "Mouse",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.us_patent.patent_office",
					"friendly_name": "Patent office"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.patent_office . \nVALUES ?x1 { :en.mouse } \n?x1 :law.us_patent.patent_office ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 5000401,
		"question": "in which office was the patent tilt wheel filed?",
		"answer": [
			"United States Patent and Trademark Office"
		],
		"function": "none",
		"commonness": -15.489207396185584,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.patent_office",
					"class": "law.patent_office",
					"friendly_name": "Patent office",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mouse",
					"class": "law.us_patent",
					"friendly_name": "tilt wheel",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.us_patent.patent_office",
					"friendly_name": "Patent office"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.patent_office . \nVALUES ?x1 { :en.mouse } \n?x1 :law.us_patent.patent_office ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 5000402,
		"question": "in which office was the patent computer mouse filed?",
		"answer": [
			"United States Patent and Trademark Office"
		],
		"function": "none",
		"commonness": -15.489207396185584,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.patent_office",
					"class": "law.patent_office",
					"friendly_name": "Patent office",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mouse",
					"class": "law.us_patent",
					"friendly_name": "computer mouse",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.us_patent.patent_office",
					"friendly_name": "Patent office"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.patent_office . \nVALUES ?x1 { :en.mouse } \n?x1 :law.us_patent.patent_office ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 5000500,
		"question": "what location was the mouse patent filed at?",
		"answer": [
			"United States Patent and Trademark Office"
		],
		"function": "none",
		"commonness": -15.489207396185584,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.patent_office",
					"class": "law.patent_office",
					"friendly_name": "Patent office",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mouse",
					"class": "law.us_patent",
					"friendly_name": "Mouse",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.us_patent.patent_office",
					"friendly_name": "Patent office"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.patent_office . \nVALUES ?x1 { :en.mouse } \n?x1 :law.us_patent.patent_office ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 5000501,
		"question": "what location was the tilt wheel patent filed at?",
		"answer": [
			"United States Patent and Trademark Office"
		],
		"function": "none",
		"commonness": -15.489207396185584,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.patent_office",
					"class": "law.patent_office",
					"friendly_name": "Patent office",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mouse",
					"class": "law.us_patent",
					"friendly_name": "tilt wheel",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.us_patent.patent_office",
					"friendly_name": "Patent office"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.patent_office . \nVALUES ?x1 { :en.mouse } \n?x1 :law.us_patent.patent_office ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 5000502,
		"question": "what location was the computer mouse patent filed at?",
		"answer": [
			"United States Patent and Trademark Office"
		],
		"function": "none",
		"commonness": -15.489207396185584,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.patent_office",
					"class": "law.patent_office",
					"friendly_name": "Patent office",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mouse",
					"class": "law.us_patent",
					"friendly_name": "computer mouse",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.us_patent.patent_office",
					"friendly_name": "Patent office"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.patent_office . \nVALUES ?x1 { :en.mouse } \n?x1 :law.us_patent.patent_office ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]