[
	{
		"qid": 102000100,
		"question": "what is the largest wrecked ship in terms of displacement?",
		"answer": [
			"RMS Titanic"
		],
		"function": "argmax",
		"commonness": -16.262269650587,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.disaster2.wrecked_ship",
					"class": "base.disaster2.wrecked_ship",
					"friendly_name": "Wrecked ship",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "366.0^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "366.0",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "boats.ship.displacement",
					"friendly_name": "Displacement"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.disaster2.wrecked_ship . \n{\nSELECT (MAX(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :base.disaster2.wrecked_ship . \n?y0 :boats.ship.displacement ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :boats.ship.displacement ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 102000200,
		"question": "which wrecked ship has the largest displacement?",
		"answer": [
			"RMS Titanic"
		],
		"function": "argmax",
		"commonness": -16.262269650587,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.disaster2.wrecked_ship",
					"class": "base.disaster2.wrecked_ship",
					"friendly_name": "Wrecked ship",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "366.0^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "366.0",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "boats.ship.displacement",
					"friendly_name": "Displacement"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.disaster2.wrecked_ship . \n{\nSELECT (MAX(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :base.disaster2.wrecked_ship . \n?y0 :boats.ship.displacement ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :boats.ship.displacement ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 102000300,
		"question": "what ship wreck displaces the most water?",
		"answer": [
			"RMS Titanic"
		],
		"function": "argmax",
		"commonness": -16.262269650587,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.disaster2.wrecked_ship",
					"class": "base.disaster2.wrecked_ship",
					"friendly_name": "Wrecked ship",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "366.0^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "366.0",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "boats.ship.displacement",
					"friendly_name": "Displacement"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.disaster2.wrecked_ship . \n{\nSELECT (MAX(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :base.disaster2.wrecked_ship . \n?y0 :boats.ship.displacement ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :boats.ship.displacement ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 102000400,
		"question": "which wrecked ship takes up the most displaced space?",
		"answer": [
			"RMS Titanic"
		],
		"function": "argmax",
		"commonness": -16.262269650587,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.disaster2.wrecked_ship",
					"class": "base.disaster2.wrecked_ship",
					"friendly_name": "Wrecked ship",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "366.0^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "366.0",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "boats.ship.displacement",
					"friendly_name": "Displacement"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.disaster2.wrecked_ship . \n{\nSELECT (MAX(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :base.disaster2.wrecked_ship . \n?y0 :boats.ship.displacement ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :boats.ship.displacement ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 102000500,
		"question": "in terms of displacement, which wrecked ship is the largest?",
		"answer": [
			"RMS Titanic"
		],
		"function": "argmax",
		"commonness": -16.262269650587,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.disaster2.wrecked_ship",
					"class": "base.disaster2.wrecked_ship",
					"friendly_name": "Wrecked ship",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "366.0^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "366.0",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "boats.ship.displacement",
					"friendly_name": "Displacement"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.disaster2.wrecked_ship . \n{\nSELECT (MAX(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :base.disaster2.wrecked_ship . \n?y0 :boats.ship.displacement ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :boats.ship.displacement ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 103000000,
		"question": "big sky's highest landing zone is what?",
		"answer": [
			"Rose Meadows LZ"
		],
		"function": "argmax",
		"commonness": -19.016960745117075,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.bigsky.landing_zone",
					"class": "base.bigsky.landing_zone",
					"friendly_name": "Landing Zone",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "400^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "400",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.bigsky.landing_zone.altitude_msl_ft",
					"friendly_name": "Altitude (MSL, ft)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.bigsky.landing_zone . \n{\nSELECT (MAX(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :base.bigsky.landing_zone . \n?y0 :base.bigsky.landing_zone.altitude_msl_ft ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :base.bigsky.landing_zone.altitude_msl_ft ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 103000100,
		"question": "where is the topmost landing zone of big sky?",
		"answer": [
			"Rose Meadows LZ"
		],
		"function": "argmax",
		"commonness": -19.016960745117075,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.bigsky.landing_zone",
					"class": "base.bigsky.landing_zone",
					"friendly_name": "Landing Zone",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "400^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "400",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.bigsky.landing_zone.altitude_msl_ft",
					"friendly_name": "Altitude (MSL, ft)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.bigsky.landing_zone . \n{\nSELECT (MAX(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :base.bigsky.landing_zone . \n?y0 :base.bigsky.landing_zone.altitude_msl_ft ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :base.bigsky.landing_zone.altitude_msl_ft ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 103000200,
		"question": "what is the landing zone of big sky with the highest altitude?",
		"answer": [
			"Rose Meadows LZ"
		],
		"function": "argmax",
		"commonness": -19.016960745117075,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.bigsky.landing_zone",
					"class": "base.bigsky.landing_zone",
					"friendly_name": "Landing Zone",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "400^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "400",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.bigsky.landing_zone.altitude_msl_ft",
					"friendly_name": "Altitude (MSL, ft)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.bigsky.landing_zone . \n{\nSELECT (MAX(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :base.bigsky.landing_zone . \n?y0 :base.bigsky.landing_zone.altitude_msl_ft ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :base.bigsky.landing_zone.altitude_msl_ft ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 103000400,
		"question": "the big sky features which highest landing zone?",
		"answer": [
			"Rose Meadows LZ"
		],
		"function": "argmax",
		"commonness": -19.016960745117075,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.bigsky.landing_zone",
					"class": "base.bigsky.landing_zone",
					"friendly_name": "Landing Zone",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "400^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "400",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.bigsky.landing_zone.altitude_msl_ft",
					"friendly_name": "Altitude (MSL, ft)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.bigsky.landing_zone . \n{\nSELECT (MAX(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :base.bigsky.landing_zone . \n?y0 :base.bigsky.landing_zone.altitude_msl_ft ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :base.bigsky.landing_zone.altitude_msl_ft ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 104000000,
		"question": "find the tallest racehorse in the world.",
		"answer": [
			"Denman"
		],
		"function": "argmax",
		"commonness": -16.627143175933792,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.horseracing.racehorse",
					"class": "base.horseracing.racehorse",
					"friendly_name": "Racehorse",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "1.75^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "1.75",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.organism.height_meters",
					"friendly_name": "Height"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.horseracing.racehorse . \n{\nSELECT (MAX(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :base.horseracing.racehorse . \n?y0 :biology.organism.height_meters ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :biology.organism.height_meters ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 104000100,
		"question": "search for the racehorse that is taller than any other in the world?",
		"answer": [
			"Denman"
		],
		"function": "argmax",
		"commonness": -16.627143175933792,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.horseracing.racehorse",
					"class": "base.horseracing.racehorse",
					"friendly_name": "Racehorse",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "1.75^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "1.75",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.organism.height_meters",
					"friendly_name": "Height"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.horseracing.racehorse . \n{\nSELECT (MAX(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :base.horseracing.racehorse . \n?y0 :biology.organism.height_meters ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :biology.organism.height_meters ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 104000200,
		"question": "what is the tallest racehorse in the world?",
		"answer": [
			"Denman"
		],
		"function": "argmax",
		"commonness": -16.627143175933792,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.horseracing.racehorse",
					"class": "base.horseracing.racehorse",
					"friendly_name": "Racehorse",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "1.75^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "1.75",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.organism.height_meters",
					"friendly_name": "Height"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.horseracing.racehorse . \n{\nSELECT (MAX(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :base.horseracing.racehorse . \n?y0 :biology.organism.height_meters ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :biology.organism.height_meters ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 104000300,
		"question": "which racehorse is the tallest?",
		"answer": [
			"Denman"
		],
		"function": "argmax",
		"commonness": -16.627143175933792,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.horseracing.racehorse",
					"class": "base.horseracing.racehorse",
					"friendly_name": "Racehorse",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "1.75^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "1.75",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.organism.height_meters",
					"friendly_name": "Height"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.horseracing.racehorse . \n{\nSELECT (MAX(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :base.horseracing.racehorse . \n?y0 :biology.organism.height_meters ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :biology.organism.height_meters ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 104000400,
		"question": "what racehorse currently holds the record for being the tallest in the world?",
		"answer": [
			"Denman"
		],
		"function": "argmax",
		"commonness": -16.627143175933792,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.horseracing.racehorse",
					"class": "base.horseracing.racehorse",
					"friendly_name": "Racehorse",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "1.75^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "1.75",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.organism.height_meters",
					"friendly_name": "Height"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.horseracing.racehorse . \n{\nSELECT (MAX(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :base.horseracing.racehorse . \n?y0 :biology.organism.height_meters ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :biology.organism.height_meters ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 105000000,
		"question": "what is the smallest exoplanet we have discovered?",
		"answer": [
			"Kepler-11 b"
		],
		"function": "argmin",
		"commonness": -18.17448845844666,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.exoplanetology.exoplanet",
					"class": "base.exoplanetology.exoplanet",
					"friendly_name": "Exoplanet",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "1.97^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "1.97",
					"question_node": 0,
					"function": "argmin"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.exoplanetology.exoplanet.radius_earth",
					"friendly_name": "Radius (earth)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.exoplanetology.exoplanet . \n{\nSELECT (MIN(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :base.exoplanetology.exoplanet . \n?y0 :base.exoplanetology.exoplanet.radius_earth ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :base.exoplanetology.exoplanet.radius_earth ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 105000100,
		"question": "which exoplanet has the smallest radius?",
		"answer": [
			"Kepler-11 b"
		],
		"function": "argmin",
		"commonness": -18.17448845844666,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.exoplanetology.exoplanet",
					"class": "base.exoplanetology.exoplanet",
					"friendly_name": "Exoplanet",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "1.97^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "1.97",
					"question_node": 0,
					"function": "argmin"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.exoplanetology.exoplanet.radius_earth",
					"friendly_name": "Radius (earth)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.exoplanetology.exoplanet . \n{\nSELECT (MIN(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :base.exoplanetology.exoplanet . \n?y0 :base.exoplanetology.exoplanet.radius_earth ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :base.exoplanetology.exoplanet.radius_earth ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 105000200,
		"question": "what planet outside of our solar system is the smallest?",
		"answer": [
			"Kepler-11 b"
		],
		"function": "argmin",
		"commonness": -18.17448845844666,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.exoplanetology.exoplanet",
					"class": "base.exoplanetology.exoplanet",
					"friendly_name": "Exoplanet",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "1.97^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "1.97",
					"question_node": 0,
					"function": "argmin"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.exoplanetology.exoplanet.radius_earth",
					"friendly_name": "Radius (earth)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.exoplanetology.exoplanet . \n{\nSELECT (MIN(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :base.exoplanetology.exoplanet . \n?y0 :base.exoplanetology.exoplanet.radius_earth ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :base.exoplanetology.exoplanet.radius_earth ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 105000300,
		"question": "among the exoplanets we know of, which can be described as having the smallest radius?",
		"answer": [
			"Kepler-11 b"
		],
		"function": "argmin",
		"commonness": -18.17448845844666,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.exoplanetology.exoplanet",
					"class": "base.exoplanetology.exoplanet",
					"friendly_name": "Exoplanet",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "1.97^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "1.97",
					"question_node": 0,
					"function": "argmin"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.exoplanetology.exoplanet.radius_earth",
					"friendly_name": "Radius (earth)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.exoplanetology.exoplanet . \n{\nSELECT (MIN(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :base.exoplanetology.exoplanet . \n?y0 :base.exoplanetology.exoplanet.radius_earth ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :base.exoplanetology.exoplanet.radius_earth ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 105000400,
		"question": "what is the exoplanet that has the known smallest radius?",
		"answer": [
			"Kepler-11 b"
		],
		"function": "argmin",
		"commonness": -18.17448845844666,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.exoplanetology.exoplanet",
					"class": "base.exoplanetology.exoplanet",
					"friendly_name": "Exoplanet",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "1.97^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "1.97",
					"question_node": 0,
					"function": "argmin"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.exoplanetology.exoplanet.radius_earth",
					"friendly_name": "Radius (earth)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.exoplanetology.exoplanet . \n{\nSELECT (MIN(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :base.exoplanetology.exoplanet . \n?y0 :base.exoplanetology.exoplanet.radius_earth ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :base.exoplanetology.exoplanet.radius_earth ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 106000000,
		"question": "which block cipher has a block size smaller than 128 bits?",
		"answer": [
			"Data Encryption Standard",
			"Blowfish",
			"Triple DES",
			"FEAL",
			"RC5",
			"RC2"
		],
		"function": "<",
		"commonness": -16.991179030228317,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.computerscience.block_cipher",
					"class": "base.computerscience.block_cipher",
					"friendly_name": "Block cipher",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "128^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "128",
					"question_node": 0,
					"function": "<"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.computerscience.block_cipher.block_sizes",
					"friendly_name": "Block sizes"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.computerscience.block_cipher . \nFILTER (?x1 < 128)\n?x0 :base.computerscience.block_cipher.block_sizes ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 106000200,
		"question": "what block ciphers have a block size of 128 bits or less?",
		"answer": [
			"Data Encryption Standard",
			"RC5",
			"Triple DES",
			"FEAL",
			"Blowfish",
			"RC2"
		],
		"function": "<",
		"commonness": -16.991179030228317,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.computerscience.block_cipher",
					"class": "base.computerscience.block_cipher",
					"friendly_name": "Block cipher",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "128^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "128",
					"question_node": 0,
					"function": "<"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.computerscience.block_cipher.block_sizes",
					"friendly_name": "Block sizes"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.computerscience.block_cipher . \nFILTER (?x1 < 128)\n?x0 :base.computerscience.block_cipher.block_sizes ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 107000100,
		"question": "find me distilled spirits with abv no higher than 40.0.",
		"answer": [
			"Basil Hayden's",
			"Green Spot",
			"Ten High",
			"Frysk Hynder",
			"Old Crow",
			"Père François V.S.",
			"New Holland Beer Barrel Bourbon",
			"Mekhong",
			"Cougar Bourbon",
			"Kubanskaya",
			"Virginia Gentleman",
			"Alberta Premium"
		],
		"function": "<=",
		"commonness": -17.031402011683234,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "distilled_spirits.distilled_spirit",
					"class": "distilled_spirits.distilled_spirit",
					"friendly_name": "Distilled spirit",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "40.0^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "40.0",
					"question_node": 0,
					"function": "<="
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "distilled_spirits.distilled_spirit.abv",
					"friendly_name": "Alcohol content"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :distilled_spirits.distilled_spirit . \nFILTER (?x1 <= 40.0)\n?x0 :distilled_spirits.distilled_spirit.abv ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]