[
	{
		"qid": 77000102,
		"question": "what is the current discovery status of 2003ub313?",
		"answer": [
			"Published"
		],
		"function": "none",
		"commonness": -22.408345197865902,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.astronomical_discovery_status",
					"class": "astronomy.astronomical_discovery_status",
					"friendly_name": "Astronomical Discovery Status",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.eris",
					"class": "astronomy.astronomical_discovery",
					"friendly_name": "2003ub313",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "astronomy.astronomical_discovery.status",
					"friendly_name": "Status"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.astronomical_discovery_status . \nVALUES ?x1 { :en.eris } \n?x1 :astronomy.astronomical_discovery.status ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 78000000,
		"question": "what models does chevrolet produce?",
		"answer": [
			"Chevrolet Corvair 900 Monza",
			"Chevrolet Agile",
			"Chevrolet Lakewood",
			"Chevrolet Parkwood",
			"Chevrolet Beretta",
			"Chevrolet SS",
			"Chevrolet Firenza CanAm",
			"Chevrolet Camaro",
			"Chevrolet Fleetline",
			"Chevrolet Aveo",
			"Holden Caprice",
			"Chevrolet Kodiak",
			"Cerv 1",
			"Chevrolet Celebrity",
			"Chevrolet Trailblazer",
			"Chevrolet Beauville",
			"Chevrolet Corsica",
			"Chevrolet Nomad",
			"Chevrolet Colorado",
			"Chevrolet Impala",
			"Corvette Mako Shark",
			"Chevrolet Constantia",
			"Chevrolet Bison",
			"Chevrolet Corvair",
			"Chevrolet Cobalt SS",
			"Chevrolet Yeoman",
			"Chevrolet Greenbrier",
			"Chevrolet Suburban",
			"Chevrolet Volt",
			"Chevrolet Lumina",
			"Geo Metro",
			"Chevrolet Astro",
			"Chevrolet SS",
			"Chevrolet Venture",
			"Chevrolet Apache",
			"Chevrolet Bruin",
			"Chevrolet Celta",
			"Chevrolet C/K",
			"Chevrolet Cosworth Vega",
			"Chevrolet S-10",
			"Geo Sprint",
			"Chevrolet Advance Design",
			"Chevrolet Cruze",
			"Chevrolet 400",
			"Chevrolet Lumina",
			"Chevrolet Cavalier",
			"Maruti Versa",
			"Chevrolet Cobalt",
			"Corvair Monza GT",
			"Chevrolet Aerovette",
			"Chevrolet Lumina Z34",
			"Chevrolet Orlando",
			"Chevrolet Kingswood",
			"Chevrolet Corvette Convertible",
			"Chevrolet Omega",
			"Chevrolet Townsman",
			"Chevrolet Sequel",
			"Chevrolet Chevy II / Nova",
			"Chevy Spark EV",
			"Chevrolet Bel Air",
			"Chevrolet Chevelle SS 454",
			"Chevrolet Chevelle Laguna",
			"Chevrolet Styleline",
			"Chevrolet Traverse",
			"Yenko Camaro",
			"Chevrolet Silverado",
			"Maruti Esteem",
			"Chevrolet Monte Carlo",
			"Chevrolet Nova SS",
			"Geo Spectrum",
			"Chevrolet Titan",
			"Chevrolet Chevelle COPO 427",
			"Opel Vectra",
			"Chevrolet Tavera",
			"Chevrolet Equinox",
			"Chevrolet Tahoe",
			"Chevrolet Delray",
			"Chevrolet 150",
			"Chevrolet Biscayne",
			"Chevrolet Aveo",
			"Chevrolet Task Force",
			"Chevrolet 210",
			"Chevrolet El Camino",
			"Chevrolet Express",
			"Chevrolet Kadett",
			"Chevrolet Captiva",
			"1957 Chevrolet",
			"Geo Prizm",
			"Chevrolet Marajó",
			"General Motors Sequel",
			"Chevrolet S-10 Blazer",
			"Chevrolet Corvette C6 ZR1",
			"Corvette Stingray",
			"Chevrolet HHR",
			"Chevrolet Vega",
			"Chevrolet SSR",
			"Chevrolet Corvette",
			"Chevrolet Chevette",
			"Chevrolet Sonic",
			"Chevrolet LUV",
			"Chevrolet Caprice LS",
			"Chevrolet Avalanche",
			"Chevrolet Citation",
			"Chevrolet S-10 EV",
			"Chevrolet Impala SS",
			"Chevrolet Sprint",
			"Chevrolet Corvair 500",
			"Chevrolet Vectra",
			"Chevrolet K5 Blazer",
			"Chevrolet Monza",
			"Chevrolet Spark",
			"Chevrolet Opala",
			"Chevrolet Chevelle",
			"Chevrolet Uplander",
			"Chevrolet Malibu",
			"Chevrolet Montana",
			"Chevrolet Impala",
			"Chevrolet Superior",
			"Chevrolet Caprice",
			"Saturn Astra",
			"Chevrolet Lumina APV",
			"Chevrolet Tracker"
		],
		"function": "none",
		"commonness": -11.69797241596795,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "automotive.model",
					"class": "automotive.model",
					"friendly_name": "Automobile Model",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.chevrolet",
					"class": "automotive.make",
					"friendly_name": "Chevrolet",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "automotive.make.model_s",
					"friendly_name": "Model(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :automotive.model . \nVALUES ?x1 { :en.chevrolet } \n?x1 :automotive.make.model_s ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 78000001,
		"question": "what models does chevy produce?",
		"answer": [
			"Chevrolet Nova SS",
			"Chevrolet Celebrity",
			"Chevrolet Sequel",
			"Chevrolet Chevette",
			"Yenko Camaro",
			"Chevrolet Trailblazer",
			"Chevrolet Constantia",
			"Chevrolet Silverado",
			"Chevrolet Vectra",
			"Chevrolet 210",
			"Chevrolet C/K",
			"Chevrolet Citation",
			"Chevrolet Corvair 900 Monza",
			"Chevrolet Kadett",
			"Chevrolet Fleetline",
			"Chevrolet Bison",
			"Chevrolet Biscayne",
			"Chevrolet Cobalt",
			"Chevrolet Opala",
			"Chevrolet Captiva",
			"Chevrolet Chevelle COPO 427",
			"Cerv 1",
			"Chevrolet Malibu",
			"Chevrolet Aerovette",
			"Chevrolet Lumina Z34",
			"Chevrolet Firenza CanAm",
			"Chevrolet Kodiak",
			"Geo Prizm",
			"Chevrolet Equinox",
			"Corvette Mako Shark",
			"Chevrolet Delray",
			"Chevrolet Caprice LS",
			"Chevrolet Task Force",
			"Chevrolet Lakewood",
			"Chevrolet Styleline",
			"Chevrolet SS",
			"Geo Sprint",
			"Chevrolet Tahoe",
			"Chevrolet Impala",
			"Chevrolet Apache",
			"Holden Caprice",
			"Chevrolet Lumina",
			"Opel Vectra",
			"1957 Chevrolet",
			"Chevrolet Parkwood",
			"Chevrolet Suburban",
			"Chevrolet Lumina",
			"Chevrolet Cobalt SS",
			"Corvette Stingray",
			"Chevrolet S-10 Blazer",
			"Chevrolet Marajó",
			"Chevrolet Lumina APV",
			"Chevrolet Volt",
			"Chevrolet Aveo",
			"Chevrolet Avalanche",
			"Chevrolet Corvette C6 ZR1",
			"Chevrolet Caprice",
			"Chevrolet Vega",
			"General Motors Sequel",
			"Chevrolet Colorado",
			"Chevrolet Celta",
			"Chevrolet Superior",
			"Chevrolet Beretta",
			"Chevrolet Impala SS",
			"Chevrolet Venture",
			"Chevrolet Chevelle Laguna",
			"Chevrolet Chevelle SS 454",
			"Chevrolet Advance Design",
			"Chevrolet 150",
			"Maruti Versa",
			"Chevrolet Corsica",
			"Chevrolet Corvette Convertible",
			"Chevrolet Chevelle",
			"Chevrolet Astro",
			"Chevy Spark EV",
			"Chevrolet Camaro",
			"Chevrolet SS",
			"Chevrolet K5 Blazer",
			"Chevrolet Omega",
			"Corvair Monza GT",
			"Chevrolet Beauville",
			"Chevrolet LUV",
			"Chevrolet Sprint",
			"Chevrolet Nomad",
			"Chevrolet 400",
			"Chevrolet Monte Carlo",
			"Chevrolet Uplander",
			"Geo Spectrum",
			"Chevrolet Montana",
			"Chevrolet Corvair 500",
			"Chevrolet Sonic",
			"Chevrolet Cosworth Vega",
			"Chevrolet Orlando",
			"Chevrolet Express",
			"Chevrolet HHR",
			"Chevrolet Cavalier",
			"Maruti Esteem",
			"Chevrolet Corvair",
			"Chevrolet Yeoman",
			"Geo Metro",
			"Saturn Astra",
			"Chevrolet Titan",
			"Chevrolet Chevy II / Nova",
			"Chevrolet Agile",
			"Chevrolet Corvette",
			"Chevrolet El Camino",
			"Chevrolet Townsman",
			"Chevrolet Monza",
			"Chevrolet Kingswood",
			"Chevrolet S-10 EV",
			"Chevrolet Aveo",
			"Chevrolet Cruze",
			"Chevrolet Impala",
			"Chevrolet Bel Air",
			"Chevrolet Tavera",
			"Chevrolet Tracker",
			"Chevrolet Traverse",
			"Chevrolet Greenbrier",
			"Chevrolet Spark",
			"Chevrolet Bruin",
			"Chevrolet SSR",
			"Chevrolet S-10"
		],
		"function": "none",
		"commonness": -11.69797241596795,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "automotive.model",
					"class": "automotive.model",
					"friendly_name": "Automobile Model",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.chevrolet",
					"class": "automotive.make",
					"friendly_name": "chevy",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "automotive.make.model_s",
					"friendly_name": "Model(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :automotive.model . \nVALUES ?x1 { :en.chevrolet } \n?x1 :automotive.make.model_s ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 78000002,
		"question": "what models does chevrolets produce?",
		"answer": [
			"Chevrolet Chevy II / Nova",
			"Chevrolet Apache",
			"Chevrolet Yeoman",
			"Chevrolet Tavera",
			"Chevrolet Chevelle SS 454",
			"Chevrolet Equinox",
			"Chevrolet Chevette",
			"Chevrolet Task Force",
			"Chevrolet Tracker",
			"Chevrolet Citation",
			"Chevrolet Cruze",
			"Chevrolet Corvair",
			"Chevrolet Suburban",
			"Chevrolet Astro",
			"Chevrolet Uplander",
			"Chevrolet 400",
			"Chevrolet Impala SS",
			"Chevrolet Montana",
			"Chevrolet Lumina",
			"Chevrolet Beauville",
			"Holden Caprice",
			"Chevrolet Styleline",
			"Chevrolet Avalanche",
			"Chevrolet Greenbrier",
			"Chevrolet Kodiak",
			"Maruti Versa",
			"Chevrolet Corsica",
			"Chevrolet Venture",
			"Chevrolet Orlando",
			"Chevrolet Impala",
			"Chevrolet Nomad",
			"Chevrolet S-10",
			"Chevrolet Monza",
			"Chevrolet Lumina",
			"Chevrolet Trailblazer",
			"Chevrolet Express",
			"Chevrolet Firenza CanAm",
			"Chevrolet Constantia",
			"Chevrolet Aveo",
			"Geo Prizm",
			"Chevrolet Lumina Z34",
			"Chevrolet Townsman",
			"Chevrolet Advance Design",
			"Chevrolet Malibu",
			"Chevrolet Vectra",
			"Chevrolet Parkwood",
			"Chevrolet Lakewood",
			"Chevrolet 150",
			"Chevrolet Vega",
			"Chevrolet Caprice LS",
			"Corvette Mako Shark",
			"Chevrolet Spark",
			"Chevrolet Opala",
			"Opel Vectra",
			"Chevrolet Impala",
			"Chevrolet Kadett",
			"Chevrolet Sonic",
			"Geo Metro",
			"Chevrolet Silverado",
			"Chevy Spark EV",
			"Yenko Camaro",
			"Chevrolet Monte Carlo",
			"Chevrolet Chevelle",
			"Chevrolet Caprice",
			"Chevrolet Corvair 900 Monza",
			"Chevrolet Captiva",
			"Chevrolet K5 Blazer",
			"Corvette Stingray",
			"Chevrolet Traverse",
			"Chevrolet S-10 EV",
			"Chevrolet Sequel",
			"Chevrolet S-10 Blazer",
			"General Motors Sequel",
			"Chevrolet Superior",
			"Chevrolet Cobalt",
			"Chevrolet Omega",
			"Chevrolet SSR",
			"Chevrolet Corvette",
			"Chevrolet Aveo",
			"Saturn Astra",
			"Chevrolet Nova SS",
			"Chevrolet El Camino",
			"1957 Chevrolet",
			"Chevrolet Colorado",
			"Chevrolet Corvair 500",
			"Chevrolet Chevelle Laguna",
			"Chevrolet Lumina APV",
			"Chevrolet Cavalier",
			"Maruti Esteem",
			"Chevrolet Corvette C6 ZR1",
			"Chevrolet Bel Air",
			"Chevrolet Beretta",
			"Chevrolet Marajó",
			"Chevrolet 210",
			"Chevrolet C/K",
			"Chevrolet Titan",
			"Chevrolet Corvette Convertible",
			"Chevrolet Volt",
			"Chevrolet Delray",
			"Corvair Monza GT",
			"Chevrolet Fleetline",
			"Chevrolet Kingswood",
			"Geo Spectrum",
			"Chevrolet Camaro",
			"Chevrolet Cosworth Vega",
			"Chevrolet HHR",
			"Chevrolet Biscayne",
			"Chevrolet SS",
			"Chevrolet Aerovette",
			"Chevrolet Celta",
			"Cerv 1",
			"Geo Sprint",
			"Chevrolet Celebrity",
			"Chevrolet Sprint",
			"Chevrolet Cobalt SS",
			"Chevrolet Tahoe",
			"Chevrolet Bruin",
			"Chevrolet Agile",
			"Chevrolet LUV",
			"Chevrolet Chevelle COPO 427",
			"Chevrolet Bison",
			"Chevrolet SS"
		],
		"function": "none",
		"commonness": -11.69797241596795,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "automotive.model",
					"class": "automotive.model",
					"friendly_name": "Automobile Model",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.chevrolet",
					"class": "automotive.make",
					"friendly_name": "chevrolets",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "automotive.make.model_s",
					"friendly_name": "Model(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :automotive.model . \nVALUES ?x1 { :en.chevrolet } \n?x1 :automotive.make.model_s ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 78000200,
		"question": "what models has chevrolet made?",
		"answer": [
			"Chevrolet Citation",
			"General Motors Sequel",
			"Chevrolet HHR",
			"Chevrolet Task Force",
			"Chevrolet Trailblazer",
			"Holden Caprice",
			"Chevrolet Beretta",
			"Chevrolet Montana",
			"Chevrolet Nova SS",
			"Chevrolet Avalanche",
			"Chevrolet LUV",
			"Chevrolet Nomad",
			"Chevrolet Astro",
			"Chevrolet SSR",
			"Chevrolet Corsica",
			"Chevrolet Advance Design",
			"Geo Metro",
			"Opel Vectra",
			"Chevrolet Captiva",
			"Chevrolet SS",
			"Geo Spectrum",
			"Chevrolet Firenza CanAm",
			"Chevrolet Spark",
			"1957 Chevrolet",
			"Chevrolet Sprint",
			"Chevrolet Colorado",
			"Chevrolet Caprice",
			"Chevrolet Marajó",
			"Chevrolet 400",
			"Maruti Versa",
			"Chevrolet S-10 EV",
			"Chevrolet Monza",
			"Chevrolet Sequel",
			"Chevrolet Lakewood",
			"Chevrolet Titan",
			"Chevrolet Kingswood",
			"Geo Sprint",
			"Chevrolet Bruin",
			"Chevrolet Lumina",
			"Chevy Spark EV",
			"Chevrolet Caprice LS",
			"Chevrolet Chevelle SS 454",
			"Chevrolet Bison",
			"Saturn Astra",
			"Chevrolet Styleline",
			"Chevrolet Lumina APV",
			"Corvair Monza GT",
			"Chevrolet Equinox",
			"Chevrolet Corvair 900 Monza",
			"Chevrolet Sonic",
			"Chevrolet Celebrity",
			"Chevrolet Bel Air",
			"Chevrolet Cobalt",
			"Chevrolet Impala SS",
			"Chevrolet 150",
			"Corvette Mako Shark",
			"Chevrolet Uplander",
			"Maruti Esteem",
			"Chevrolet Express",
			"Chevrolet Townsman",
			"Chevrolet C/K",
			"Chevrolet K5 Blazer",
			"Chevrolet Tahoe",
			"Chevrolet Kodiak",
			"Chevrolet Vega",
			"Chevrolet Cruze",
			"Chevrolet Yeoman",
			"Geo Prizm",
			"Chevrolet Chevette",
			"Chevrolet Constantia",
			"Cerv 1",
			"Chevrolet Cosworth Vega",
			"Chevrolet Tracker",
			"Chevrolet Celta",
			"Chevrolet Chevy II / Nova",
			"Chevrolet Parkwood",
			"Chevrolet Chevelle",
			"Chevrolet Corvette C6 ZR1",
			"Chevrolet Kadett",
			"Chevrolet Aveo",
			"Chevrolet Tavera",
			"Chevrolet Impala",
			"Chevrolet Omega",
			"Chevrolet Camaro",
			"Chevrolet Cavalier",
			"Chevrolet Impala",
			"Yenko Camaro",
			"Chevrolet Vectra",
			"Chevrolet 210",
			"Chevrolet Venture",
			"Chevrolet Lumina",
			"Chevrolet Chevelle Laguna",
			"Chevrolet Corvair 500",
			"Chevrolet Corvette",
			"Chevrolet Superior",
			"Chevrolet Aveo",
			"Chevrolet Aerovette",
			"Chevrolet Corvair",
			"Chevrolet Cobalt SS",
			"Chevrolet Monte Carlo",
			"Chevrolet Silverado",
			"Chevrolet Biscayne",
			"Corvette Stingray",
			"Chevrolet Agile",
			"Chevrolet Malibu",
			"Chevrolet Opala",
			"Chevrolet El Camino",
			"Chevrolet Suburban",
			"Chevrolet Fleetline",
			"Chevrolet Beauville",
			"Chevrolet Apache",
			"Chevrolet Greenbrier",
			"Chevrolet Chevelle COPO 427",
			"Chevrolet Traverse",
			"Chevrolet Volt",
			"Chevrolet Lumina Z34",
			"Chevrolet Corvette Convertible",
			"Chevrolet S-10",
			"Chevrolet S-10 Blazer",
			"Chevrolet SS",
			"Chevrolet Orlando",
			"Chevrolet Delray"
		],
		"function": "none",
		"commonness": -11.69797241596795,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "automotive.model",
					"class": "automotive.model",
					"friendly_name": "Automobile Model",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.chevrolet",
					"class": "automotive.make",
					"friendly_name": "Chevrolet",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "automotive.make.model_s",
					"friendly_name": "Model(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :automotive.model . \nVALUES ?x1 { :en.chevrolet } \n?x1 :automotive.make.model_s ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 78000201,
		"question": "what models has chevy made?",
		"answer": [
			"Chevrolet S-10 EV",
			"Chevrolet Equinox",
			"Chevrolet Lumina",
			"Chevrolet LUV",
			"Chevy Spark EV",
			"Chevrolet SS",
			"Chevrolet Trailblazer",
			"Chevrolet Caprice",
			"Maruti Esteem",
			"Chevrolet Titan",
			"Chevrolet Impala",
			"Geo Metro",
			"Chevrolet Chevy II / Nova",
			"Chevrolet Uplander",
			"Chevrolet Chevelle SS 454",
			"Chevrolet Express",
			"Chevrolet Corvette",
			"Chevrolet Camaro",
			"Chevrolet Parkwood",
			"Chevrolet Apache",
			"Saturn Astra",
			"Chevrolet Traverse",
			"Chevrolet Chevelle COPO 427",
			"Chevrolet Bruin",
			"Chevrolet Corvair 500",
			"Chevrolet Cobalt",
			"Chevrolet Agile",
			"Chevrolet Yeoman",
			"Chevrolet Impala SS",
			"Chevrolet Kodiak",
			"Chevrolet Tavera",
			"Chevrolet Caprice LS",
			"Chevrolet Bison",
			"Chevrolet Greenbrier",
			"Chevrolet Corsica",
			"Chevrolet Marajó",
			"Chevrolet Sprint",
			"Corvair Monza GT",
			"Chevrolet Kingswood",
			"Chevrolet Aveo",
			"Yenko Camaro",
			"Chevrolet Sonic",
			"Chevrolet Monza",
			"Chevrolet Impala",
			"1957 Chevrolet",
			"Chevrolet Styleline",
			"Cerv 1",
			"Chevrolet Lumina",
			"Chevrolet SSR",
			"Chevrolet Fleetline",
			"Chevrolet Lumina Z34",
			"Chevrolet Volt",
			"Chevrolet Astro",
			"Chevrolet 210",
			"Chevrolet C/K",
			"Chevrolet Colorado",
			"Chevrolet Task Force",
			"Chevrolet K5 Blazer",
			"Corvette Mako Shark",
			"Chevrolet Montana",
			"Chevrolet Corvair 900 Monza",
			"Chevrolet Vega",
			"Chevrolet Lakewood",
			"Chevrolet Avalanche",
			"Chevrolet Nomad",
			"Chevrolet Constantia",
			"Chevrolet S-10 Blazer",
			"Chevrolet Chevelle Laguna",
			"Chevrolet Corvair",
			"Chevrolet Citation",
			"Chevrolet Silverado",
			"Chevrolet Spark",
			"Chevrolet Beauville",
			"Chevrolet Cobalt SS",
			"Chevrolet Beretta",
			"Chevrolet S-10",
			"Chevrolet Tracker",
			"Opel Vectra",
			"Chevrolet Aveo",
			"Chevrolet Captiva",
			"Chevrolet Sequel",
			"Chevrolet 150",
			"Chevrolet Townsman",
			"Maruti Versa",
			"Chevrolet Aerovette",
			"Chevrolet Celebrity",
			"Chevrolet Omega",
			"Chevrolet Biscayne",
			"Geo Spectrum",
			"Chevrolet SS",
			"Chevrolet Vectra",
			"Chevrolet El Camino",
			"Chevrolet Suburban",
			"Corvette Stingray",
			"Chevrolet Venture",
			"Chevrolet Corvette Convertible",
			"Chevrolet 400",
			"Chevrolet Bel Air",
			"Chevrolet Tahoe",
			"Chevrolet Chevette",
			"Geo Sprint",
			"Chevrolet Malibu",
			"General Motors Sequel",
			"Chevrolet Delray",
			"Holden Caprice",
			"Geo Prizm",
			"Chevrolet Advance Design",
			"Chevrolet Lumina APV",
			"Chevrolet Nova SS",
			"Chevrolet Firenza CanAm",
			"Chevrolet Cavalier",
			"Chevrolet Monte Carlo",
			"Chevrolet Corvette C6 ZR1",
			"Chevrolet Superior",
			"Chevrolet Cosworth Vega",
			"Chevrolet Celta",
			"Chevrolet Opala",
			"Chevrolet Orlando",
			"Chevrolet Kadett",
			"Chevrolet Cruze",
			"Chevrolet Chevelle",
			"Chevrolet HHR"
		],
		"function": "none",
		"commonness": -11.69797241596795,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "automotive.model",
					"class": "automotive.model",
					"friendly_name": "Automobile Model",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.chevrolet",
					"class": "automotive.make",
					"friendly_name": "chevy",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "automotive.make.model_s",
					"friendly_name": "Model(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :automotive.model . \nVALUES ?x1 { :en.chevrolet } \n?x1 :automotive.make.model_s ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 78000202,
		"question": "what models has chevrolets made?",
		"answer": [
			"Corvette Stingray",
			"Chevrolet S-10 Blazer",
			"Chevrolet LUV",
			"Chevrolet Townsman",
			"Chevrolet Celta",
			"Chevrolet Kingswood",
			"Chevrolet Cobalt SS",
			"Chevrolet Kodiak",
			"Chevrolet Aerovette",
			"Chevrolet Sprint",
			"Geo Spectrum",
			"Chevrolet Advance Design",
			"Chevy Spark EV",
			"Chevrolet Aveo",
			"Chevrolet Lumina",
			"Chevrolet Monza",
			"Chevrolet SS",
			"Chevrolet Aveo",
			"Chevrolet Express",
			"Chevrolet Sequel",
			"Chevrolet El Camino",
			"Corvair Monza GT",
			"Chevrolet Firenza CanAm",
			"Chevrolet Tracker",
			"Chevrolet Impala SS",
			"Chevrolet Traverse",
			"Chevrolet Corsica",
			"Maruti Versa",
			"Opel Vectra",
			"Chevrolet Constantia",
			"Chevrolet 150",
			"Chevrolet Avalanche",
			"Chevrolet S-10",
			"Chevrolet Chevelle",
			"Chevrolet Camaro",
			"Chevrolet Corvette",
			"Chevrolet Bison",
			"Chevrolet Cosworth Vega",
			"Chevrolet Lumina Z34",
			"1957 Chevrolet",
			"Chevrolet Beretta",
			"Chevrolet Yeoman",
			"General Motors Sequel",
			"Chevrolet Venture",
			"Chevrolet Caprice",
			"Chevrolet Bel Air",
			"Chevrolet Caprice LS",
			"Chevrolet 210",
			"Chevrolet Lumina",
			"Corvette Mako Shark",
			"Chevrolet S-10 EV",
			"Chevrolet SS",
			"Chevrolet Biscayne",
			"Chevrolet Bruin",
			"Chevrolet Superior",
			"Chevrolet Delray",
			"Chevrolet HHR",
			"Chevrolet Nova SS",
			"Chevrolet Vega",
			"Chevrolet Sonic",
			"Chevrolet Montana",
			"Chevrolet Chevette",
			"Maruti Esteem",
			"Holden Caprice",
			"Chevrolet Astro",
			"Geo Sprint",
			"Chevrolet Marajó",
			"Chevrolet Corvair 500",
			"Chevrolet Volt",
			"Chevrolet Celebrity",
			"Chevrolet Kadett",
			"Chevrolet Greenbrier",
			"Saturn Astra",
			"Chevrolet Malibu",
			"Chevrolet 400",
			"Chevrolet Captiva",
			"Chevrolet Equinox",
			"Chevrolet Parkwood",
			"Chevrolet Fleetline",
			"Chevrolet Chevy II / Nova",
			"Chevrolet Suburban",
			"Chevrolet Corvair",
			"Chevrolet Cobalt",
			"Chevrolet Omega",
			"Chevrolet Lakewood",
			"Chevrolet Cavalier",
			"Cerv 1",
			"Chevrolet Task Force",
			"Chevrolet SSR",
			"Yenko Camaro",
			"Chevrolet Citation",
			"Chevrolet Orlando",
			"Geo Prizm",
			"Chevrolet Lumina APV",
			"Chevrolet Trailblazer",
			"Chevrolet Corvair 900 Monza",
			"Chevrolet Chevelle Laguna",
			"Chevrolet Cruze",
			"Chevrolet C/K",
			"Chevrolet Impala",
			"Chevrolet Styleline",
			"Chevrolet Titan",
			"Chevrolet Vectra",
			"Chevrolet Beauville",
			"Geo Metro",
			"Chevrolet K5 Blazer",
			"Chevrolet Chevelle SS 454",
			"Chevrolet Corvette C6 ZR1",
			"Chevrolet Impala",
			"Chevrolet Colorado",
			"Chevrolet Apache",
			"Chevrolet Chevelle COPO 427",
			"Chevrolet Nomad",
			"Chevrolet Silverado",
			"Chevrolet Tahoe",
			"Chevrolet Spark",
			"Chevrolet Opala",
			"Chevrolet Monte Carlo",
			"Chevrolet Tavera",
			"Chevrolet Uplander",
			"Chevrolet Corvette Convertible",
			"Chevrolet Agile"
		],
		"function": "none",
		"commonness": -11.69797241596795,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "automotive.model",
					"class": "automotive.model",
					"friendly_name": "Automobile Model",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.chevrolet",
					"class": "automotive.make",
					"friendly_name": "chevrolets",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "automotive.make.model_s",
					"friendly_name": "Model(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :automotive.model . \nVALUES ?x1 { :en.chevrolet } \n?x1 :automotive.make.model_s ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 78000300,
		"question": "what models of chevrolet are out there?",
		"answer": [
			"Chevrolet Colorado",
			"Chevrolet Omega",
			"Chevrolet Uplander",
			"Chevrolet Aveo",
			"Chevrolet Suburban",
			"Chevrolet Bruin",
			"Chevrolet LUV",
			"Chevrolet Venture",
			"Chevrolet S-10 EV",
			"Chevrolet HHR",
			"Chevrolet 400",
			"Chevrolet Corvair",
			"Chevrolet S-10",
			"Holden Caprice",
			"Chevrolet 210",
			"Chevrolet Lumina",
			"Chevrolet Opala",
			"Chevrolet Citation",
			"Chevrolet Vectra",
			"Chevrolet Marajó",
			"Chevrolet Styleline",
			"Chevrolet Monte Carlo",
			"Chevrolet Trailblazer",
			"Chevrolet Silverado",
			"Chevrolet Captiva",
			"Chevrolet Townsman",
			"Chevrolet 150",
			"Chevrolet Corvette",
			"Chevrolet Caprice",
			"Chevrolet Apache",
			"Chevrolet Lakewood",
			"Geo Metro",
			"Chevrolet Bel Air",
			"Geo Sprint",
			"Chevrolet Corvette Convertible",
			"Chevrolet Chevelle COPO 427",
			"Chevrolet El Camino",
			"Cerv 1",
			"Chevrolet Cavalier",
			"Chevrolet Sonic",
			"Chevrolet Spark",
			"Chevrolet Caprice LS",
			"Chevrolet Agile",
			"Chevrolet S-10 Blazer",
			"Chevrolet Delray",
			"Chevrolet Firenza CanAm",
			"Chevrolet Yeoman",
			"Chevrolet Lumina Z34",
			"Chevrolet Lumina APV",
			"Chevrolet Corvette C6 ZR1",
			"General Motors Sequel",
			"Chevrolet Impala",
			"Chevrolet Tahoe",
			"Chevrolet Cosworth Vega",
			"Geo Spectrum",
			"Chevrolet Nomad",
			"1957 Chevrolet",
			"Maruti Versa",
			"Chevrolet Chevy II / Nova",
			"Chevrolet Cobalt SS",
			"Chevrolet Lumina",
			"Chevrolet Sequel",
			"Chevrolet Corvair 500",
			"Chevrolet Equinox",
			"Chevrolet Aveo",
			"Chevrolet Camaro",
			"Corvette Mako Shark",
			"Chevrolet Vega",
			"Chevrolet Montana",
			"Chevrolet SS",
			"Chevrolet Corvair 900 Monza",
			"Chevrolet Impala",
			"Chevrolet Chevelle",
			"Chevrolet C/K",
			"Chevrolet Beauville",
			"Chevrolet Advance Design",
			"Chevrolet Tavera",
			"Chevrolet Sprint",
			"Chevrolet Bison",
			"Chevrolet Greenbrier",
			"Chevrolet Avalanche",
			"Chevrolet Chevelle Laguna",
			"Chevrolet Corsica",
			"Chevrolet Impala SS",
			"Chevrolet Parkwood",
			"Chevrolet Task Force",
			"Chevrolet Kadett",
			"Maruti Esteem",
			"Saturn Astra",
			"Chevrolet Fleetline",
			"Chevrolet Celebrity",
			"Chevrolet SSR",
			"Chevrolet K5 Blazer",
			"Chevrolet Tracker",
			"Chevrolet Volt",
			"Chevrolet Celta",
			"Chevrolet Beretta",
			"Chevrolet Nova SS",
			"Yenko Camaro",
			"Chevrolet Monza",
			"Chevrolet Titan",
			"Chevrolet Superior",
			"Corvair Monza GT",
			"Opel Vectra",
			"Chevrolet Constantia",
			"Chevrolet Kingswood",
			"Chevrolet Express",
			"Chevrolet Chevelle SS 454",
			"Chevrolet Cobalt",
			"Chevrolet Kodiak",
			"Chevrolet Traverse",
			"Chevrolet Chevette",
			"Chevrolet Astro",
			"Chevrolet Biscayne",
			"Chevrolet Cruze",
			"Corvette Stingray",
			"Chevrolet Aerovette",
			"Chevy Spark EV",
			"Geo Prizm",
			"Chevrolet SS",
			"Chevrolet Malibu",
			"Chevrolet Orlando"
		],
		"function": "none",
		"commonness": -11.69797241596795,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "automotive.model",
					"class": "automotive.model",
					"friendly_name": "Automobile Model",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.chevrolet",
					"class": "automotive.make",
					"friendly_name": "Chevrolet",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "automotive.make.model_s",
					"friendly_name": "Model(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :automotive.model . \nVALUES ?x1 { :en.chevrolet } \n?x1 :automotive.make.model_s ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]