[
	{
		"qid": 112000000,
		"question": "which concert venue has the largest capacity?",
		"answer": [
			"John Paul Jones Arena"
		],
		"function": "argmax",
		"commonness": -18.540528761849494,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.livemusic.concert_venue",
					"class": "base.livemusic.concert_venue",
					"friendly_name": "Concert Venue",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "14593^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "14593",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.livemusic.concert_venue.capacity",
					"friendly_name": "Capacity"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.livemusic.concert_venue . \n{\nSELECT (MAX(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :base.livemusic.concert_venue . \n?y0 :base.livemusic.concert_venue.capacity ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :base.livemusic.concert_venue.capacity ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 112000100,
		"question": "which venue has the most seats for a music concert?",
		"answer": [
			"John Paul Jones Arena"
		],
		"function": "argmax",
		"commonness": -18.540528761849494,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.livemusic.concert_venue",
					"class": "base.livemusic.concert_venue",
					"friendly_name": "Concert Venue",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "14593^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "14593",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.livemusic.concert_venue.capacity",
					"friendly_name": "Capacity"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.livemusic.concert_venue . \n{\nSELECT (MAX(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :base.livemusic.concert_venue . \n?y0 :base.livemusic.concert_venue.capacity ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :base.livemusic.concert_venue.capacity ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 112000200,
		"question": "what is the largest concert venue in terms of capacity?",
		"answer": [
			"John Paul Jones Arena"
		],
		"function": "argmax",
		"commonness": -18.540528761849494,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.livemusic.concert_venue",
					"class": "base.livemusic.concert_venue",
					"friendly_name": "Concert Venue",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "14593^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "14593",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.livemusic.concert_venue.capacity",
					"friendly_name": "Capacity"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.livemusic.concert_venue . \n{\nSELECT (MAX(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :base.livemusic.concert_venue . \n?y0 :base.livemusic.concert_venue.capacity ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :base.livemusic.concert_venue.capacity ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 112000300,
		"question": "which venue for music concert has the most seats?",
		"answer": [
			"John Paul Jones Arena"
		],
		"function": "argmax",
		"commonness": -18.540528761849494,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.livemusic.concert_venue",
					"class": "base.livemusic.concert_venue",
					"friendly_name": "Concert Venue",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "14593^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "14593",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.livemusic.concert_venue.capacity",
					"friendly_name": "Capacity"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.livemusic.concert_venue . \n{\nSELECT (MAX(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :base.livemusic.concert_venue . \n?y0 :base.livemusic.concert_venue.capacity ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :base.livemusic.concert_venue.capacity ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 113000000,
		"question": "the slowest bowling pace found in cricket is what?",
		"answer": [
			"Slow"
		],
		"function": "argmin",
		"commonness": -20.403989141389708,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "cricket.cricket_bowling_pace",
					"class": "cricket.cricket_bowling_pace",
					"friendly_name": "Cricket Bowling Pace",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "97^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "97",
					"question_node": 0,
					"function": "argmin"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "cricket.cricket_bowling_pace.max_speed_kmph",
					"friendly_name": "Max Speed"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :cricket.cricket_bowling_pace . \n{\nSELECT (MIN(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :cricket.cricket_bowling_pace . \n?y0 :cricket.cricket_bowling_pace.max_speed_kmph ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :cricket.cricket_bowling_pace.max_speed_kmph ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 113000100,
		"question": "which cricket bowling pace has the smallest max speed?",
		"answer": [
			"Slow"
		],
		"function": "argmin",
		"commonness": -20.403989141389708,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "cricket.cricket_bowling_pace",
					"class": "cricket.cricket_bowling_pace",
					"friendly_name": "Cricket Bowling Pace",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "97^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "97",
					"question_node": 0,
					"function": "argmin"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "cricket.cricket_bowling_pace.max_speed_kmph",
					"friendly_name": "Max Speed"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :cricket.cricket_bowling_pace . \n{\nSELECT (MIN(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :cricket.cricket_bowling_pace . \n?y0 :cricket.cricket_bowling_pace.max_speed_kmph ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :cricket.cricket_bowling_pace.max_speed_kmph ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 113000200,
		"question": "what is the slowest bowling pace in cricket?",
		"answer": [
			"Slow"
		],
		"function": "argmin",
		"commonness": -20.403989141389708,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "cricket.cricket_bowling_pace",
					"class": "cricket.cricket_bowling_pace",
					"friendly_name": "Cricket Bowling Pace",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "97^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "97",
					"question_node": 0,
					"function": "argmin"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "cricket.cricket_bowling_pace.max_speed_kmph",
					"friendly_name": "Max Speed"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :cricket.cricket_bowling_pace . \n{\nSELECT (MIN(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :cricket.cricket_bowling_pace . \n?y0 :cricket.cricket_bowling_pace.max_speed_kmph ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :cricket.cricket_bowling_pace.max_speed_kmph ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 113000300,
		"question": "in cricket, which bowling pace is the slowest?",
		"answer": [
			"Slow"
		],
		"function": "argmin",
		"commonness": -20.403989141389708,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "cricket.cricket_bowling_pace",
					"class": "cricket.cricket_bowling_pace",
					"friendly_name": "Cricket Bowling Pace",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "97^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "97",
					"question_node": 0,
					"function": "argmin"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "cricket.cricket_bowling_pace.max_speed_kmph",
					"friendly_name": "Max Speed"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :cricket.cricket_bowling_pace . \n{\nSELECT (MIN(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :cricket.cricket_bowling_pace . \n?y0 :cricket.cricket_bowling_pace.max_speed_kmph ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :cricket.cricket_bowling_pace.max_speed_kmph ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 114000000,
		"question": "which nascar race has the fewest recorded laps?",
		"answer": [
			"Johnsonville Sausage 200",
			"Pocono Mountains 125"
		],
		"function": "argmin",
		"commonness": -16.379526435471583,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.nascar.nascar_race",
					"class": "base.nascar.nascar_race",
					"friendly_name": "NASCAR Race",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "188^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "188",
					"question_node": 0,
					"function": "argmin"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.nascar.nascar_race.laps",
					"friendly_name": "Laps"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.nascar.nascar_race . \n{\nSELECT (MIN(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :base.nascar.nascar_race . \n?y0 :base.nascar.nascar_race.laps ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :base.nascar.nascar_race.laps ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 114000300,
		"question": "which nascar race has the least amount of laps?",
		"answer": [
			"Johnsonville Sausage 200",
			"Pocono Mountains 125"
		],
		"function": "argmin",
		"commonness": -16.379526435471583,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.nascar.nascar_race",
					"class": "base.nascar.nascar_race",
					"friendly_name": "NASCAR Race",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "188^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "188",
					"question_node": 0,
					"function": "argmin"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.nascar.nascar_race.laps",
					"friendly_name": "Laps"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.nascar.nascar_race . \n{\nSELECT (MIN(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :base.nascar.nascar_race . \n?y0 :base.nascar.nascar_race.laps ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :base.nascar.nascar_race.laps ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 114000400,
		"question": "which nascar race runs the fewest laps?",
		"answer": [
			"Pocono Mountains 125",
			"Johnsonville Sausage 200"
		],
		"function": "argmin",
		"commonness": -16.379526435471583,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.nascar.nascar_race",
					"class": "base.nascar.nascar_race",
					"friendly_name": "NASCAR Race",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "188^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "188",
					"question_node": 0,
					"function": "argmin"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.nascar.nascar_race.laps",
					"friendly_name": "Laps"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.nascar.nascar_race . \n{\nSELECT (MIN(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :base.nascar.nascar_race . \n?y0 :base.nascar.nascar_race.laps ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :base.nascar.nascar_race.laps ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 115000000,
		"question": "how many different nasa launch sites are there?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -13.845933476079551,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_launch_site",
					"class": "spaceflight.rocket_launch_site",
					"friendly_name": "Spaceport",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nasa",
					"class": "spaceflight.space_agency",
					"friendly_name": "NASA",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.space_agency.spaceports",
					"friendly_name": "Spaceports"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_launch_site . \nVALUES ?x1 { :en.nasa } \n?x1 :spaceflight.space_agency.spaceports ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 115000002,
		"question": "how many different national aeronautic and space administration launch sites are there?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -13.845933476079551,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_launch_site",
					"class": "spaceflight.rocket_launch_site",
					"friendly_name": "Spaceport",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nasa",
					"class": "spaceflight.space_agency",
					"friendly_name": "national aeronautic and space administration",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.space_agency.spaceports",
					"friendly_name": "Spaceports"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_launch_site . \nVALUES ?x1 { :en.nasa } \n?x1 :spaceflight.space_agency.spaceports ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 115000100,
		"question": "how many spaceports are operated by nasa?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -13.845933476079551,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_launch_site",
					"class": "spaceflight.rocket_launch_site",
					"friendly_name": "Spaceport",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nasa",
					"class": "spaceflight.space_agency",
					"friendly_name": "NASA",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.space_agency.spaceports",
					"friendly_name": "Spaceports"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_launch_site . \nVALUES ?x1 { :en.nasa } \n?x1 :spaceflight.space_agency.spaceports ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 115000101,
		"question": "how many spaceports are operated by national aeronautics and space administration?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -13.845933476079551,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_launch_site",
					"class": "spaceflight.rocket_launch_site",
					"friendly_name": "Spaceport",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nasa",
					"class": "spaceflight.space_agency",
					"friendly_name": "national aeronautics and space administration",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.space_agency.spaceports",
					"friendly_name": "Spaceports"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_launch_site . \nVALUES ?x1 { :en.nasa } \n?x1 :spaceflight.space_agency.spaceports ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 115000102,
		"question": "how many spaceports are operated by national aeronautic and space administration?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -13.845933476079551,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_launch_site",
					"class": "spaceflight.rocket_launch_site",
					"friendly_name": "Spaceport",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nasa",
					"class": "spaceflight.space_agency",
					"friendly_name": "national aeronautic and space administration",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.space_agency.spaceports",
					"friendly_name": "Spaceports"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_launch_site . \nVALUES ?x1 { :en.nasa } \n?x1 :spaceflight.space_agency.spaceports ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 115000200,
		"question": "nasa has how many launch sites?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -13.845933476079551,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_launch_site",
					"class": "spaceflight.rocket_launch_site",
					"friendly_name": "Spaceport",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nasa",
					"class": "spaceflight.space_agency",
					"friendly_name": "NASA",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.space_agency.spaceports",
					"friendly_name": "Spaceports"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_launch_site . \nVALUES ?x1 { :en.nasa } \n?x1 :spaceflight.space_agency.spaceports ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 115000201,
		"question": "national aeronautics and space administration has how many launch sites?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -13.845933476079551,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_launch_site",
					"class": "spaceflight.rocket_launch_site",
					"friendly_name": "Spaceport",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nasa",
					"class": "spaceflight.space_agency",
					"friendly_name": "national aeronautics and space administration",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.space_agency.spaceports",
					"friendly_name": "Spaceports"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_launch_site . \nVALUES ?x1 { :en.nasa } \n?x1 :spaceflight.space_agency.spaceports ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 115000300,
		"question": "how many launch sites is nasa running?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -13.845933476079551,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_launch_site",
					"class": "spaceflight.rocket_launch_site",
					"friendly_name": "Spaceport",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nasa",
					"class": "spaceflight.space_agency",
					"friendly_name": "NASA",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.space_agency.spaceports",
					"friendly_name": "Spaceports"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_launch_site . \nVALUES ?x1 { :en.nasa } \n?x1 :spaceflight.space_agency.spaceports ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 115000302,
		"question": "how many launch sites is national aeronautic and space administration running?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -13.845933476079551,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_launch_site",
					"class": "spaceflight.rocket_launch_site",
					"friendly_name": "Spaceport",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nasa",
					"class": "spaceflight.space_agency",
					"friendly_name": "national aeronautic and space administration",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.space_agency.spaceports",
					"friendly_name": "Spaceports"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_launch_site . \nVALUES ?x1 { :en.nasa } \n?x1 :spaceflight.space_agency.spaceports ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 115000400,
		"question": "how many launch sites does nasa have?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -13.845933476079551,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_launch_site",
					"class": "spaceflight.rocket_launch_site",
					"friendly_name": "Spaceport",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nasa",
					"class": "spaceflight.space_agency",
					"friendly_name": "NASA",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.space_agency.spaceports",
					"friendly_name": "Spaceports"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_launch_site . \nVALUES ?x1 { :en.nasa } \n?x1 :spaceflight.space_agency.spaceports ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 115000402,
		"question": "how many launch sites does national aeronautic and space administration have?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -13.845933476079551,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_launch_site",
					"class": "spaceflight.rocket_launch_site",
					"friendly_name": "Spaceport",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nasa",
					"class": "spaceflight.space_agency",
					"friendly_name": "national aeronautic and space administration",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.space_agency.spaceports",
					"friendly_name": "Spaceports"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_launch_site . \nVALUES ?x1 { :en.nasa } \n?x1 :spaceflight.space_agency.spaceports ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 116000000,
		"question": "find the count of short non-fictions talking about the united states of america.",
		"answer": [
			"8"
		],
		"function": "count",
		"commonness": -10.96133737549017,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.short_non_fiction",
					"class": "book.short_non_fiction",
					"friendly_name": "Short Non-fiction",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "book.book_subject",
					"friendly_name": "United States of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "book.book_subject.works",
					"friendly_name": "Works Written About This Topic"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.short_non_fiction . \nVALUES ?x1 { :en.united_states_of_america } \n?x1 :book.book_subject.works ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]