[
	{
		"qid": 236000100,
		"question": "which racehorse of the united states of america has its birthday in 1948?",
		"answer": [
			"Bold"
		],
		"function": "none",
		"commonness": -21.69399999535365,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.thoroughbredracing.thoroughbred_racehorse",
					"class": "base.thoroughbredracing.thoroughbred_racehorse",
					"friendly_name": "Thoroughbred racehorse",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "1948^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "1948",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "base.thoroughbredracing.thoroughbred_racehorse_origin",
					"friendly_name": "United States of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.organism.date_of_birth",
					"friendly_name": "Date of Birth"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.thoroughbredracing.thoroughbred_racehorse.country",
					"friendly_name": "Country"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.thoroughbredracing.thoroughbred_racehorse . \nVALUES ?x1 { \"1948\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \nVALUES ?x2 { :en.united_states_of_america } \n?x0 :biology.organism.date_of_birth ?x1 . \n?x0 :base.thoroughbredracing.thoroughbred_racehorse.country ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 236000101,
		"question": "which racehorse of the us has its birthday in 1948?",
		"answer": [
			"Bold"
		],
		"function": "none",
		"commonness": -21.69399999535365,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.thoroughbredracing.thoroughbred_racehorse",
					"class": "base.thoroughbredracing.thoroughbred_racehorse",
					"friendly_name": "Thoroughbred racehorse",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "1948^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "1948",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "base.thoroughbredracing.thoroughbred_racehorse_origin",
					"friendly_name": "us",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.organism.date_of_birth",
					"friendly_name": "Date of Birth"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.thoroughbredracing.thoroughbred_racehorse.country",
					"friendly_name": "Country"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.thoroughbredracing.thoroughbred_racehorse . \nVALUES ?x1 { \"1948\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \nVALUES ?x2 { :en.united_states_of_america } \n?x0 :biology.organism.date_of_birth ?x1 . \n?x0 :base.thoroughbredracing.thoroughbred_racehorse.country ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 236000102,
		"question": "which racehorse of the united states has its birthday in 1948?",
		"answer": [
			"Bold"
		],
		"function": "none",
		"commonness": -21.69399999535365,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.thoroughbredracing.thoroughbred_racehorse",
					"class": "base.thoroughbredracing.thoroughbred_racehorse",
					"friendly_name": "Thoroughbred racehorse",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "1948^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "1948",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "base.thoroughbredracing.thoroughbred_racehorse_origin",
					"friendly_name": "united states",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.organism.date_of_birth",
					"friendly_name": "Date of Birth"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.thoroughbredracing.thoroughbred_racehorse.country",
					"friendly_name": "Country"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.thoroughbredracing.thoroughbred_racehorse . \nVALUES ?x1 { \"1948\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \nVALUES ?x2 { :en.united_states_of_america } \n?x0 :biology.organism.date_of_birth ?x1 . \n?x0 :base.thoroughbredracing.thoroughbred_racehorse.country ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 236000200,
		"question": "in 1948 which racehorse from the united states of america was born?",
		"answer": [
			"Bold"
		],
		"function": "none",
		"commonness": -21.69399999535365,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.thoroughbredracing.thoroughbred_racehorse",
					"class": "base.thoroughbredracing.thoroughbred_racehorse",
					"friendly_name": "Thoroughbred racehorse",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "1948^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "1948",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "base.thoroughbredracing.thoroughbred_racehorse_origin",
					"friendly_name": "United States of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.organism.date_of_birth",
					"friendly_name": "Date of Birth"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.thoroughbredracing.thoroughbred_racehorse.country",
					"friendly_name": "Country"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.thoroughbredracing.thoroughbred_racehorse . \nVALUES ?x1 { \"1948\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \nVALUES ?x2 { :en.united_states_of_america } \n?x0 :biology.organism.date_of_birth ?x1 . \n?x0 :base.thoroughbredracing.thoroughbred_racehorse.country ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 236000201,
		"question": "in 1948 which racehorse from the us was born?",
		"answer": [
			"Bold"
		],
		"function": "none",
		"commonness": -21.69399999535365,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.thoroughbredracing.thoroughbred_racehorse",
					"class": "base.thoroughbredracing.thoroughbred_racehorse",
					"friendly_name": "Thoroughbred racehorse",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "1948^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "1948",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "base.thoroughbredracing.thoroughbred_racehorse_origin",
					"friendly_name": "us",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.organism.date_of_birth",
					"friendly_name": "Date of Birth"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.thoroughbredracing.thoroughbred_racehorse.country",
					"friendly_name": "Country"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.thoroughbredracing.thoroughbred_racehorse . \nVALUES ?x1 { \"1948\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \nVALUES ?x2 { :en.united_states_of_america } \n?x0 :biology.organism.date_of_birth ?x1 . \n?x0 :base.thoroughbredracing.thoroughbred_racehorse.country ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 236000202,
		"question": "in 1948 which racehorse from the united states was born?",
		"answer": [
			"Bold"
		],
		"function": "none",
		"commonness": -21.69399999535365,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.thoroughbredracing.thoroughbred_racehorse",
					"class": "base.thoroughbredracing.thoroughbred_racehorse",
					"friendly_name": "Thoroughbred racehorse",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "1948^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "1948",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "base.thoroughbredracing.thoroughbred_racehorse_origin",
					"friendly_name": "united states",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.organism.date_of_birth",
					"friendly_name": "Date of Birth"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.thoroughbredracing.thoroughbred_racehorse.country",
					"friendly_name": "Country"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.thoroughbredracing.thoroughbred_racehorse . \nVALUES ?x1 { \"1948\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \nVALUES ?x2 { :en.united_states_of_america } \n?x0 :biology.organism.date_of_birth ?x1 . \n?x0 :base.thoroughbredracing.thoroughbred_racehorse.country ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 236000300,
		"question": "which racehorse from the united states of america was born in 1948?",
		"answer": [
			"Bold"
		],
		"function": "none",
		"commonness": -21.69399999535365,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.thoroughbredracing.thoroughbred_racehorse",
					"class": "base.thoroughbredracing.thoroughbred_racehorse",
					"friendly_name": "Thoroughbred racehorse",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "1948^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "1948",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "base.thoroughbredracing.thoroughbred_racehorse_origin",
					"friendly_name": "United States of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.organism.date_of_birth",
					"friendly_name": "Date of Birth"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.thoroughbredracing.thoroughbred_racehorse.country",
					"friendly_name": "Country"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.thoroughbredracing.thoroughbred_racehorse . \nVALUES ?x1 { \"1948\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \nVALUES ?x2 { :en.united_states_of_america } \n?x0 :biology.organism.date_of_birth ?x1 . \n?x0 :base.thoroughbredracing.thoroughbred_racehorse.country ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 236000301,
		"question": "which racehorse from the us was born in 1948?",
		"answer": [
			"Bold"
		],
		"function": "none",
		"commonness": -21.69399999535365,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.thoroughbredracing.thoroughbred_racehorse",
					"class": "base.thoroughbredracing.thoroughbred_racehorse",
					"friendly_name": "Thoroughbred racehorse",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "1948^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "1948",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "base.thoroughbredracing.thoroughbred_racehorse_origin",
					"friendly_name": "us",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.organism.date_of_birth",
					"friendly_name": "Date of Birth"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.thoroughbredracing.thoroughbred_racehorse.country",
					"friendly_name": "Country"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.thoroughbredracing.thoroughbred_racehorse . \nVALUES ?x1 { \"1948\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \nVALUES ?x2 { :en.united_states_of_america } \n?x0 :biology.organism.date_of_birth ?x1 . \n?x0 :base.thoroughbredracing.thoroughbred_racehorse.country ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 236000302,
		"question": "which racehorse from the united states was born in 1948?",
		"answer": [
			"Bold"
		],
		"function": "none",
		"commonness": -21.69399999535365,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.thoroughbredracing.thoroughbred_racehorse",
					"class": "base.thoroughbredracing.thoroughbred_racehorse",
					"friendly_name": "Thoroughbred racehorse",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "1948^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "1948",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "base.thoroughbredracing.thoroughbred_racehorse_origin",
					"friendly_name": "united states",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.organism.date_of_birth",
					"friendly_name": "Date of Birth"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.thoroughbredracing.thoroughbred_racehorse.country",
					"friendly_name": "Country"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.thoroughbredracing.thoroughbred_racehorse . \nVALUES ?x1 { \"1948\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \nVALUES ?x2 { :en.united_states_of_america } \n?x0 :biology.organism.date_of_birth ?x1 . \n?x0 :base.thoroughbredracing.thoroughbred_racehorse.country ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 237000000,
		"question": "the horse body part of which the pastern is a part is the equivalent of which human part?",
		"answer": [
			"Toe"
		],
		"function": "none",
		"commonness": -33.82272755191237,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.anatomical_structure",
					"class": "medicine.anatomical_structure",
					"friendly_name": "Anatomical structure",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.horsefacts.equine_anatomy",
					"class": "base.horsefacts.equine_anatomy",
					"friendly_name": "equine anatomy",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.pastern",
					"class": "base.horsefacts.equine_anatomy",
					"friendly_name": "Pastern",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.horsefacts.equine_anatomy.human_equivalent",
					"friendly_name": "human equivalent"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "base.horsefacts.equine_anatomy.part_of",
					"friendly_name": "part of"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.anatomical_structure . \n?x1 :type.object.type :base.horsefacts.equine_anatomy . \nVALUES ?x2 { :en.pastern } \n?x1 :base.horsefacts.equine_anatomy.human_equivalent ?x0 . \n?x2 :base.horsefacts.equine_anatomy.part_of ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 237000100,
		"question": "which part of the human body equates to the region in a horse's structure which contains the pastern?",
		"answer": [
			"Toe"
		],
		"function": "none",
		"commonness": -33.82272755191237,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.anatomical_structure",
					"class": "medicine.anatomical_structure",
					"friendly_name": "Anatomical structure",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.horsefacts.equine_anatomy",
					"class": "base.horsefacts.equine_anatomy",
					"friendly_name": "equine anatomy",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.pastern",
					"class": "base.horsefacts.equine_anatomy",
					"friendly_name": "Pastern",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.horsefacts.equine_anatomy.human_equivalent",
					"friendly_name": "human equivalent"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "base.horsefacts.equine_anatomy.part_of",
					"friendly_name": "part of"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.anatomical_structure . \n?x1 :type.object.type :base.horsefacts.equine_anatomy . \nVALUES ?x2 { :en.pastern } \n?x1 :base.horsefacts.equine_anatomy.human_equivalent ?x0 . \n?x2 :base.horsefacts.equine_anatomy.part_of ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 237000200,
		"question": "what's the human equivalent of the horse body part of which the pastern is a part?",
		"answer": [
			"Toe"
		],
		"function": "none",
		"commonness": -33.82272755191237,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.anatomical_structure",
					"class": "medicine.anatomical_structure",
					"friendly_name": "Anatomical structure",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.horsefacts.equine_anatomy",
					"class": "base.horsefacts.equine_anatomy",
					"friendly_name": "equine anatomy",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.pastern",
					"class": "base.horsefacts.equine_anatomy",
					"friendly_name": "Pastern",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.horsefacts.equine_anatomy.human_equivalent",
					"friendly_name": "human equivalent"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "base.horsefacts.equine_anatomy.part_of",
					"friendly_name": "part of"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.anatomical_structure . \n?x1 :type.object.type :base.horsefacts.equine_anatomy . \nVALUES ?x2 { :en.pastern } \n?x1 :base.horsefacts.equine_anatomy.human_equivalent ?x0 . \n?x2 :base.horsefacts.equine_anatomy.part_of ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 237000300,
		"question": "a horse's pastern is part of a body part that can be compared to what body part on a human?",
		"answer": [
			"Toe"
		],
		"function": "none",
		"commonness": -33.82272755191237,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.anatomical_structure",
					"class": "medicine.anatomical_structure",
					"friendly_name": "Anatomical structure",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.horsefacts.equine_anatomy",
					"class": "base.horsefacts.equine_anatomy",
					"friendly_name": "equine anatomy",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.pastern",
					"class": "base.horsefacts.equine_anatomy",
					"friendly_name": "Pastern",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.horsefacts.equine_anatomy.human_equivalent",
					"friendly_name": "human equivalent"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "base.horsefacts.equine_anatomy.part_of",
					"friendly_name": "part of"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.anatomical_structure . \n?x1 :type.object.type :base.horsefacts.equine_anatomy . \nVALUES ?x2 { :en.pastern } \n?x1 :base.horsefacts.equine_anatomy.human_equivalent ?x0 . \n?x2 :base.horsefacts.equine_anatomy.part_of ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 238000000,
		"question": "which film actor is also a real estate broker, same as his/her parent?",
		"answer": [
			"Sherry Boucher"
		],
		"function": "none",
		"commonness": -17.88979586669183,
		"num_node": 3,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.actor",
					"class": "film.actor",
					"friendly_name": "Film actor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.real_estate_broker",
					"class": "people.profession",
					"friendly_name": "Real estate broker",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "people.person",
					"class": "people.person",
					"friendly_name": "Person",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "people.profession.people_with_this_profession",
					"friendly_name": "People With This Profession"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "people.person.parents",
					"friendly_name": "Parents"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "people.person.profession",
					"friendly_name": "Profession"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.actor . \nVALUES ?x1 { :en.real_estate_broker } \n?x2 :type.object.type :people.person . \n?x1 :people.profession.people_with_this_profession ?x0 . \n?x0 :people.person.parents ?x2 . \n?x2 :people.person.profession ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 238000001,
		"question": "which film actor is also a realtor, same as his/her parent?",
		"answer": [
			"Sherry Boucher"
		],
		"function": "none",
		"commonness": -17.88979586669183,
		"num_node": 3,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.actor",
					"class": "film.actor",
					"friendly_name": "Film actor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.real_estate_broker",
					"class": "people.profession",
					"friendly_name": "realtor",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "people.person",
					"class": "people.person",
					"friendly_name": "Person",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "people.profession.people_with_this_profession",
					"friendly_name": "People With This Profession"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "people.person.parents",
					"friendly_name": "Parents"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "people.person.profession",
					"friendly_name": "Profession"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.actor . \nVALUES ?x1 { :en.real_estate_broker } \n?x2 :type.object.type :people.person . \n?x1 :people.profession.people_with_this_profession ?x0 . \n?x0 :people.person.parents ?x2 . \n?x2 :people.person.profession ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 238000002,
		"question": "which film actor is also a real estate salesperson, same as his/her parent?",
		"answer": [
			"Sherry Boucher"
		],
		"function": "none",
		"commonness": -17.88979586669183,
		"num_node": 3,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.actor",
					"class": "film.actor",
					"friendly_name": "Film actor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.real_estate_broker",
					"class": "people.profession",
					"friendly_name": "real estate salesperson",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "people.person",
					"class": "people.person",
					"friendly_name": "Person",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "people.profession.people_with_this_profession",
					"friendly_name": "People With This Profession"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "people.person.parents",
					"friendly_name": "Parents"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "people.person.profession",
					"friendly_name": "Profession"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.actor . \nVALUES ?x1 { :en.real_estate_broker } \n?x2 :type.object.type :people.person . \n?x1 :people.profession.people_with_this_profession ?x0 . \n?x0 :people.person.parents ?x2 . \n?x2 :people.person.profession ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	}
]