[
	{
		"qid": 246000102,
		"question": "what are the common symptoms of fip and some disease caused by old age?",
		"answer": [
			"Fatigue",
			"Weight loss",
			"Fever",
			"Diarrhea",
			"Anemia",
			"Anorexia"
		],
		"function": "none",
		"commonness": -39.87995845215022,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pethealth.symptom",
					"class": "base.pethealth.symptom",
					"friendly_name": "Pet Disease Symptom",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.feline_infectious_peritonitis",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "fip",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "base.pethealth.pet_disease_or_medical_condition",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "Pet disease or medical condition",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.middle_aged_dog",
					"class": "base.pethealth.pet_disease_risk_factor",
					"friendly_name": "Old age",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pethealth.pet_disease_or_medical_condition.symptoms",
					"friendly_name": "Symptoms"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "base.pethealth.pet_disease_or_medical_condition.symptoms",
					"friendly_name": "Symptoms"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor",
					"friendly_name": "Pet Diseases with this Risk Factor"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pethealth.symptom . \nVALUES ?x1 { :en.feline_infectious_peritonitis } \n?x2 :type.object.type :base.pethealth.pet_disease_or_medical_condition . \nVALUES ?x3 { :en.middle_aged_dog } \n?x1 :base.pethealth.pet_disease_or_medical_condition.symptoms ?x0 . \n?x2 :base.pethealth.pet_disease_or_medical_condition.symptoms ?x0 . \n?x3 :base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 246000200,
		"question": "what are the characteristics of feline infectious peritonitis and old age diseases?",
		"answer": [
			"Fatigue",
			"Weight loss",
			"Fever",
			"Anorexia",
			"Anemia",
			"Diarrhea"
		],
		"function": "none",
		"commonness": -39.87995845215022,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pethealth.symptom",
					"class": "base.pethealth.symptom",
					"friendly_name": "Pet Disease Symptom",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.feline_infectious_peritonitis",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "Feline infectious peritonitis",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "base.pethealth.pet_disease_or_medical_condition",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "Pet disease or medical condition",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.middle_aged_dog",
					"class": "base.pethealth.pet_disease_risk_factor",
					"friendly_name": "Old age",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pethealth.pet_disease_or_medical_condition.symptoms",
					"friendly_name": "Symptoms"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "base.pethealth.pet_disease_or_medical_condition.symptoms",
					"friendly_name": "Symptoms"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor",
					"friendly_name": "Pet Diseases with this Risk Factor"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pethealth.symptom . \nVALUES ?x1 { :en.feline_infectious_peritonitis } \n?x2 :type.object.type :base.pethealth.pet_disease_or_medical_condition . \nVALUES ?x3 { :en.middle_aged_dog } \n?x1 :base.pethealth.pet_disease_or_medical_condition.symptoms ?x0 . \n?x2 :base.pethealth.pet_disease_or_medical_condition.symptoms ?x0 . \n?x3 :base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 246000202,
		"question": "what are the characteristics of fip and old age diseases?",
		"answer": [
			"Fatigue",
			"Weight loss",
			"Fever",
			"Anemia",
			"Anorexia",
			"Diarrhea"
		],
		"function": "none",
		"commonness": -39.87995845215022,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pethealth.symptom",
					"class": "base.pethealth.symptom",
					"friendly_name": "Pet Disease Symptom",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.feline_infectious_peritonitis",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "fip",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "base.pethealth.pet_disease_or_medical_condition",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "Pet disease or medical condition",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.middle_aged_dog",
					"class": "base.pethealth.pet_disease_risk_factor",
					"friendly_name": "Old age",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pethealth.pet_disease_or_medical_condition.symptoms",
					"friendly_name": "Symptoms"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "base.pethealth.pet_disease_or_medical_condition.symptoms",
					"friendly_name": "Symptoms"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor",
					"friendly_name": "Pet Diseases with this Risk Factor"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pethealth.symptom . \nVALUES ?x1 { :en.feline_infectious_peritonitis } \n?x2 :type.object.type :base.pethealth.pet_disease_or_medical_condition . \nVALUES ?x3 { :en.middle_aged_dog } \n?x1 :base.pethealth.pet_disease_or_medical_condition.symptoms ?x0 . \n?x2 :base.pethealth.pet_disease_or_medical_condition.symptoms ?x0 . \n?x3 :base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 246000300,
		"question": "which type of symptoms does the feline infectious peritonitis and old age diseases have in common?",
		"answer": [
			"Anorexia",
			"Fatigue",
			"Anemia",
			"Fever",
			"Diarrhea",
			"Weight loss"
		],
		"function": "none",
		"commonness": -39.87995845215022,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pethealth.symptom",
					"class": "base.pethealth.symptom",
					"friendly_name": "Pet Disease Symptom",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.feline_infectious_peritonitis",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "Feline infectious peritonitis",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "base.pethealth.pet_disease_or_medical_condition",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "Pet disease or medical condition",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.middle_aged_dog",
					"class": "base.pethealth.pet_disease_risk_factor",
					"friendly_name": "Old age",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pethealth.pet_disease_or_medical_condition.symptoms",
					"friendly_name": "Symptoms"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "base.pethealth.pet_disease_or_medical_condition.symptoms",
					"friendly_name": "Symptoms"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor",
					"friendly_name": "Pet Diseases with this Risk Factor"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pethealth.symptom . \nVALUES ?x1 { :en.feline_infectious_peritonitis } \n?x2 :type.object.type :base.pethealth.pet_disease_or_medical_condition . \nVALUES ?x3 { :en.middle_aged_dog } \n?x1 :base.pethealth.pet_disease_or_medical_condition.symptoms ?x0 . \n?x2 :base.pethealth.pet_disease_or_medical_condition.symptoms ?x0 . \n?x3 :base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 246000301,
		"question": "which type of symptoms does the feline infectious peritonitis and old diseases have in common?",
		"answer": [
			"Fatigue",
			"Anemia",
			"Fever",
			"Anorexia",
			"Weight loss",
			"Diarrhea"
		],
		"function": "none",
		"commonness": -39.87995845215022,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pethealth.symptom",
					"class": "base.pethealth.symptom",
					"friendly_name": "Pet Disease Symptom",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.feline_infectious_peritonitis",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "Feline infectious peritonitis",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "base.pethealth.pet_disease_or_medical_condition",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "Pet disease or medical condition",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.middle_aged_dog",
					"class": "base.pethealth.pet_disease_risk_factor",
					"friendly_name": "old",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pethealth.pet_disease_or_medical_condition.symptoms",
					"friendly_name": "Symptoms"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "base.pethealth.pet_disease_or_medical_condition.symptoms",
					"friendly_name": "Symptoms"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor",
					"friendly_name": "Pet Diseases with this Risk Factor"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pethealth.symptom . \nVALUES ?x1 { :en.feline_infectious_peritonitis } \n?x2 :type.object.type :base.pethealth.pet_disease_or_medical_condition . \nVALUES ?x3 { :en.middle_aged_dog } \n?x1 :base.pethealth.pet_disease_or_medical_condition.symptoms ?x0 . \n?x2 :base.pethealth.pet_disease_or_medical_condition.symptoms ?x0 . \n?x3 :base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 246000302,
		"question": "which type of symptoms does the fip and old age diseases have in common?",
		"answer": [
			"Anorexia",
			"Diarrhea",
			"Weight loss",
			"Fever",
			"Anemia",
			"Fatigue"
		],
		"function": "none",
		"commonness": -39.87995845215022,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pethealth.symptom",
					"class": "base.pethealth.symptom",
					"friendly_name": "Pet Disease Symptom",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.feline_infectious_peritonitis",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "fip",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "base.pethealth.pet_disease_or_medical_condition",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "Pet disease or medical condition",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.middle_aged_dog",
					"class": "base.pethealth.pet_disease_risk_factor",
					"friendly_name": "Old age",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pethealth.pet_disease_or_medical_condition.symptoms",
					"friendly_name": "Symptoms"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "base.pethealth.pet_disease_or_medical_condition.symptoms",
					"friendly_name": "Symptoms"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor",
					"friendly_name": "Pet Diseases with this Risk Factor"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pethealth.symptom . \nVALUES ?x1 { :en.feline_infectious_peritonitis } \n?x2 :type.object.type :base.pethealth.pet_disease_or_medical_condition . \nVALUES ?x3 { :en.middle_aged_dog } \n?x1 :base.pethealth.pet_disease_or_medical_condition.symptoms ?x0 . \n?x2 :base.pethealth.pet_disease_or_medical_condition.symptoms ?x0 . \n?x3 :base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 246000401,
		"question": "what are the common symptoms exhibited by feline infectious peritonitis and diseases caused by old?",
		"answer": [
			"Diarrhea",
			"Anorexia",
			"Weight loss",
			"Anemia",
			"Fatigue",
			"Fever"
		],
		"function": "none",
		"commonness": -39.87995845215022,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pethealth.symptom",
					"class": "base.pethealth.symptom",
					"friendly_name": "Pet Disease Symptom",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.feline_infectious_peritonitis",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "Feline infectious peritonitis",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "base.pethealth.pet_disease_or_medical_condition",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "Pet disease or medical condition",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.middle_aged_dog",
					"class": "base.pethealth.pet_disease_risk_factor",
					"friendly_name": "old",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pethealth.pet_disease_or_medical_condition.symptoms",
					"friendly_name": "Symptoms"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "base.pethealth.pet_disease_or_medical_condition.symptoms",
					"friendly_name": "Symptoms"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor",
					"friendly_name": "Pet Diseases with this Risk Factor"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pethealth.symptom . \nVALUES ?x1 { :en.feline_infectious_peritonitis } \n?x2 :type.object.type :base.pethealth.pet_disease_or_medical_condition . \nVALUES ?x3 { :en.middle_aged_dog } \n?x1 :base.pethealth.pet_disease_or_medical_condition.symptoms ?x0 . \n?x2 :base.pethealth.pet_disease_or_medical_condition.symptoms ?x0 . \n?x3 :base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 246000402,
		"question": "what are the common symptoms exhibited by fip and diseases caused by old age?",
		"answer": [
			"Anemia",
			"Diarrhea",
			"Anorexia",
			"Fatigue",
			"Weight loss",
			"Fever"
		],
		"function": "none",
		"commonness": -39.87995845215022,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pethealth.symptom",
					"class": "base.pethealth.symptom",
					"friendly_name": "Pet Disease Symptom",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.feline_infectious_peritonitis",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "fip",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "base.pethealth.pet_disease_or_medical_condition",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "Pet disease or medical condition",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.middle_aged_dog",
					"class": "base.pethealth.pet_disease_risk_factor",
					"friendly_name": "Old age",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pethealth.pet_disease_or_medical_condition.symptoms",
					"friendly_name": "Symptoms"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "base.pethealth.pet_disease_or_medical_condition.symptoms",
					"friendly_name": "Symptoms"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor",
					"friendly_name": "Pet Diseases with this Risk Factor"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pethealth.symptom . \nVALUES ?x1 { :en.feline_infectious_peritonitis } \n?x2 :type.object.type :base.pethealth.pet_disease_or_medical_condition . \nVALUES ?x3 { :en.middle_aged_dog } \n?x1 :base.pethealth.pet_disease_or_medical_condition.symptoms ?x0 . \n?x2 :base.pethealth.pet_disease_or_medical_condition.symptoms ?x0 . \n?x3 :base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 247000000,
		"question": "which athlete is the tallest who can fluently speak the language of the silent night carol?",
		"answer": [
			"Dwight Howard"
		],
		"function": "argmax",
		"commonness": -30.49627091141824,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.pro_athlete",
					"class": "sports.pro_athlete",
					"friendly_name": "Athlete",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "language.human_language",
					"class": "language.human_language",
					"friendly_name": "Human Language",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "0",
					"class": "type.float",
					"friendly_name": "0",
					"question_node": 0,
					"function": "argmax"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.silent_night",
					"class": "base.christmas.christmas_carol",
					"friendly_name": "Silent Night",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.languages",
					"friendly_name": "Languages"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "people.person.height_meters",
					"friendly_name": "Height"
				},
				{
					"start": 3,
					"end": 1,
					"relation": "base.christmas.christmas_carol.language",
					"friendly_name": "Language"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.pro_athlete . \n?x1 :type.object.type :language.human_language . \n{\nSELECT (MAX(?y2) AS ?x2)  WHERE { \n?y0 :type.object.type :sports.pro_athlete . \n?y1 :type.object.type :language.human_language . \nVALUES ?y3 { :en.silent_night } \n?y0 :people.person.languages ?y1 . \n?y0 :people.person.height_meters ?y2 . \n?y3 :base.christmas.christmas_carol.language ?y1 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y0 != ?y3 && ?y1 != ?y2 && ?y1 != ?y3 && ?y2 != ?y3  )\n}\n}\nVALUES ?x3 { :en.silent_night } \n?x0 :people.person.languages ?x1 . \n?x0 :people.person.height_meters ?x2 . \n?x3 :base.christmas.christmas_carol.language ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 247000001,
		"question": "which athlete is the tallest who can fluently speak the language of the silent night, holy night carol?",
		"answer": [
			"Dwight Howard"
		],
		"function": "argmax",
		"commonness": -30.49627091141824,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.pro_athlete",
					"class": "sports.pro_athlete",
					"friendly_name": "Athlete",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "language.human_language",
					"class": "language.human_language",
					"friendly_name": "Human Language",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "0",
					"class": "type.float",
					"friendly_name": "0",
					"question_node": 0,
					"function": "argmax"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.silent_night",
					"class": "base.christmas.christmas_carol",
					"friendly_name": "silent night, holy night",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.languages",
					"friendly_name": "Languages"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "people.person.height_meters",
					"friendly_name": "Height"
				},
				{
					"start": 3,
					"end": 1,
					"relation": "base.christmas.christmas_carol.language",
					"friendly_name": "Language"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.pro_athlete . \n?x1 :type.object.type :language.human_language . \n{\nSELECT (MAX(?y2) AS ?x2)  WHERE { \n?y0 :type.object.type :sports.pro_athlete . \n?y1 :type.object.type :language.human_language . \nVALUES ?y3 { :en.silent_night } \n?y0 :people.person.languages ?y1 . \n?y0 :people.person.height_meters ?y2 . \n?y3 :base.christmas.christmas_carol.language ?y1 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y0 != ?y3 && ?y1 != ?y2 && ?y1 != ?y3 && ?y2 != ?y3  )\n}\n}\nVALUES ?x3 { :en.silent_night } \n?x0 :people.person.languages ?x1 . \n?x0 :people.person.height_meters ?x2 . \n?x3 :base.christmas.christmas_carol.language ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 247000100,
		"question": "out of all the athletes who can speak the language from silent night who is the tallest?",
		"answer": [
			"Dwight Howard"
		],
		"function": "argmax",
		"commonness": -30.49627091141824,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.pro_athlete",
					"class": "sports.pro_athlete",
					"friendly_name": "Athlete",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "language.human_language",
					"class": "language.human_language",
					"friendly_name": "Human Language",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "0",
					"class": "type.float",
					"friendly_name": "0",
					"question_node": 0,
					"function": "argmax"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.silent_night",
					"class": "base.christmas.christmas_carol",
					"friendly_name": "Silent Night",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.languages",
					"friendly_name": "Languages"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "people.person.height_meters",
					"friendly_name": "Height"
				},
				{
					"start": 3,
					"end": 1,
					"relation": "base.christmas.christmas_carol.language",
					"friendly_name": "Language"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.pro_athlete . \n?x1 :type.object.type :language.human_language . \n{\nSELECT (MAX(?y2) AS ?x2)  WHERE { \n?y0 :type.object.type :sports.pro_athlete . \n?y1 :type.object.type :language.human_language . \nVALUES ?y3 { :en.silent_night } \n?y0 :people.person.languages ?y1 . \n?y0 :people.person.height_meters ?y2 . \n?y3 :base.christmas.christmas_carol.language ?y1 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y0 != ?y3 && ?y1 != ?y2 && ?y1 != ?y3 && ?y2 != ?y3  )\n}\n}\nVALUES ?x3 { :en.silent_night } \n?x0 :people.person.languages ?x1 . \n?x0 :people.person.height_meters ?x2 . \n?x3 :base.christmas.christmas_carol.language ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 247000101,
		"question": "out of all the athletes who can speak the language from silent night, holy night who is the tallest?",
		"answer": [
			"Dwight Howard"
		],
		"function": "argmax",
		"commonness": -30.49627091141824,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.pro_athlete",
					"class": "sports.pro_athlete",
					"friendly_name": "Athlete",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "language.human_language",
					"class": "language.human_language",
					"friendly_name": "Human Language",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "0",
					"class": "type.float",
					"friendly_name": "0",
					"question_node": 0,
					"function": "argmax"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.silent_night",
					"class": "base.christmas.christmas_carol",
					"friendly_name": "silent night, holy night",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.languages",
					"friendly_name": "Languages"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "people.person.height_meters",
					"friendly_name": "Height"
				},
				{
					"start": 3,
					"end": 1,
					"relation": "base.christmas.christmas_carol.language",
					"friendly_name": "Language"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.pro_athlete . \n?x1 :type.object.type :language.human_language . \n{\nSELECT (MAX(?y2) AS ?x2)  WHERE { \n?y0 :type.object.type :sports.pro_athlete . \n?y1 :type.object.type :language.human_language . \nVALUES ?y3 { :en.silent_night } \n?y0 :people.person.languages ?y1 . \n?y0 :people.person.height_meters ?y2 . \n?y3 :base.christmas.christmas_carol.language ?y1 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y0 != ?y3 && ?y1 != ?y2 && ?y1 != ?y3 && ?y2 != ?y3  )\n}\n}\nVALUES ?x3 { :en.silent_night } \n?x0 :people.person.languages ?x1 . \n?x0 :people.person.height_meters ?x2 . \n?x3 :base.christmas.christmas_carol.language ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	}
]