[
	{
		"qid": 147000400,
		"question": "how many buildings are there in the world trade center?",
		"answer": [
			"8"
		],
		"function": "count",
		"commonness": -12.331540563847096,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.building",
					"class": "architecture.building",
					"friendly_name": "Building",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.world_trade_center",
					"class": "architecture.building_complex",
					"friendly_name": "World Trade Center",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.building.building_complex",
					"friendly_name": "Building Complex"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.building . \nVALUES ?x1 { :en.world_trade_center } \n?x0 :architecture.building.building_complex ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 147000401,
		"question": "how many buildings are there in the wtc?",
		"answer": [
			"8"
		],
		"function": "count",
		"commonness": -12.331540563847096,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.building",
					"class": "architecture.building",
					"friendly_name": "Building",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.world_trade_center",
					"class": "architecture.building_complex",
					"friendly_name": "wtc",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.building.building_complex",
					"friendly_name": "Building Complex"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.building . \nVALUES ?x1 { :en.world_trade_center } \n?x0 :architecture.building.building_complex ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 147000402,
		"question": "how many buildings are there in the twin towers?",
		"answer": [
			"8"
		],
		"function": "count",
		"commonness": -12.331540563847096,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.building",
					"class": "architecture.building",
					"friendly_name": "Building",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.world_trade_center",
					"class": "architecture.building_complex",
					"friendly_name": "twin towers",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.building.building_complex",
					"friendly_name": "Building Complex"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.building . \nVALUES ?x1 { :en.world_trade_center } \n?x0 :architecture.building.building_complex ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 149000000,
		"question": "list all loudspeakers with a weight at least 82.0 kgs.",
		"answer": [
			"Von Schweikert VR-9SE",
			"Usher CP-8871",
			"Dynaudio Evidence Master",
			"Kef Muon",
			"Focal Grande Utopia EM",
			"Von Schweikert VR-11SE",
			"Hansen The Prince V2",
			"Wilson Audio Watt/Puppy System 8",
			"Hansen The Emperor",
			"Verity Leonore",
			"Bowers & Wilkins 801D",
			"Verity Audio Lohengrin II",
			"Wilson Audio Sasha",
			"Wilson Audio MAXX 3",
			"Usher CP-8571",
			"KEF Reference 207/2",
			"Magico Model 6",
			"Hansen The Knight",
			"Wilson Audio Alexandria X-2",
			"Aquila",
			"Verity Parsifal Ovation",
			"Focal Scala Utopia",
			"Audio Physic Kronos",
			"Verity Audio Sarastro II",
			"Rockport Mira Grand",
			"Dynaudio Consequence",
			"Rockport Arrakis",
			"Magico Ultimate II",
			"Dynaudio Evidence Temptation",
			"Rockport Altair",
			"Bowers & Wilkins 800D",
			"Usher BE-20",
			"Magico M5",
			"Magico Mini II",
			"Dali MegaLine III",
			"Usher BE-10",
			"Hansen The King V2",
			"Rockport Ankaa"
		],
		"function": ">=",
		"commonness": -18.414345215815008,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.audiobase.loudspeaker",
					"class": "base.audiobase.loudspeaker",
					"friendly_name": "Loudspeaker",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "82.0^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "82.0",
					"question_node": 0,
					"function": ">="
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.audiobase.audio_equipment.weight",
					"friendly_name": "Weight"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.audiobase.loudspeaker . \nFILTER (?x1 >= 82.0)\n?x0 :base.audiobase.audio_equipment.weight ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 149000100,
		"question": "which loudspeakers weigh equal to or more than 82.0 kg?",
		"answer": [
			"Verity Leonore",
			"Kef Muon",
			"Usher CP-8571",
			"Dynaudio Evidence Temptation",
			"Hansen The King V2",
			"Focal Grande Utopia EM",
			"Von Schweikert VR-11SE",
			"Dynaudio Evidence Master",
			"Hansen The Prince V2",
			"Wilson Audio Watt/Puppy System 8",
			"Magico Mini II",
			"Verity Audio Lohengrin II",
			"Audio Physic Kronos",
			"Bowers & Wilkins 800D",
			"Magico M5",
			"Von Schweikert VR-9SE",
			"Rockport Altair",
			"Focal Scala Utopia",
			"Magico Model 6",
			"Usher BE-20",
			"Usher BE-10",
			"Dynaudio Consequence",
			"Usher CP-8871",
			"Dali MegaLine III",
			"Hansen The Knight",
			"Aquila",
			"KEF Reference 207/2",
			"Rockport Ankaa",
			"Magico Ultimate II",
			"Wilson Audio Sasha",
			"Wilson Audio MAXX 3",
			"Hansen The Emperor",
			"Wilson Audio Alexandria X-2",
			"Verity Parsifal Ovation",
			"Rockport Mira Grand",
			"Rockport Arrakis",
			"Bowers & Wilkins 801D",
			"Verity Audio Sarastro II"
		],
		"function": ">=",
		"commonness": -18.414345215815008,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.audiobase.loudspeaker",
					"class": "base.audiobase.loudspeaker",
					"friendly_name": "Loudspeaker",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "82.0^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "82.0",
					"question_node": 0,
					"function": ">="
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.audiobase.audio_equipment.weight",
					"friendly_name": "Weight"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.audiobase.loudspeaker . \nFILTER (?x1 >= 82.0)\n?x0 :base.audiobase.audio_equipment.weight ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 149000300,
		"question": "which loudspeakers are heavier than 82.0 kg?",
		"answer": [
			"Dynaudio Evidence Temptation",
			"Hansen The Knight",
			"Hansen The Emperor",
			"Usher CP-8571",
			"Rockport Ankaa",
			"Verity Leonore",
			"Magico Ultimate II",
			"Magico M5",
			"Verity Audio Sarastro II",
			"Verity Audio Lohengrin II",
			"Magico Mini II",
			"Rockport Mira Grand",
			"KEF Reference 207/2",
			"Von Schweikert VR-11SE",
			"Wilson Audio Watt/Puppy System 8",
			"Magico Model 6",
			"Focal Grande Utopia EM",
			"Dynaudio Consequence",
			"Rockport Arrakis",
			"Usher BE-10",
			"Usher BE-20",
			"Wilson Audio Sasha",
			"Wilson Audio Alexandria X-2",
			"Verity Parsifal Ovation",
			"Rockport Altair",
			"Bowers & Wilkins 800D",
			"Hansen The Prince V2",
			"Usher CP-8871",
			"Hansen The King V2",
			"Wilson Audio MAXX 3",
			"Audio Physic Kronos",
			"Bowers & Wilkins 801D",
			"Focal Scala Utopia",
			"Von Schweikert VR-9SE",
			"Dali MegaLine III",
			"Kef Muon",
			"Aquila",
			"Dynaudio Evidence Master"
		],
		"function": ">=",
		"commonness": -18.414345215815008,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.audiobase.loudspeaker",
					"class": "base.audiobase.loudspeaker",
					"friendly_name": "Loudspeaker",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "82.0^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "82.0",
					"question_node": 0,
					"function": ">="
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.audiobase.audio_equipment.weight",
					"friendly_name": "Weight"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.audiobase.loudspeaker . \nFILTER (?x1 >= 82.0)\n?x0 :base.audiobase.audio_equipment.weight ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 150000000,
		"question": "how many works did fresh air review?",
		"answer": [
			"17"
		],
		"function": "count",
		"commonness": -17.153753519211833,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.reviewed_work",
					"class": "book.reviewed_work",
					"friendly_name": "Reviewed Work",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.fresh_air",
					"class": "book.review",
					"friendly_name": "Fresh Air",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "book.reviewed_work.reviews_of_this_work",
					"friendly_name": "Reviews Of This Work"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.reviewed_work . \nVALUES ?x1 { :en.fresh_air } \n?x0 :book.reviewed_work.reviews_of_this_work ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 150000100,
		"question": "how many works were reviewed by fresh air in total?",
		"answer": [
			"17"
		],
		"function": "count",
		"commonness": -17.153753519211833,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.reviewed_work",
					"class": "book.reviewed_work",
					"friendly_name": "Reviewed Work",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.fresh_air",
					"class": "book.review",
					"friendly_name": "Fresh Air",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "book.reviewed_work.reviews_of_this_work",
					"friendly_name": "Reviews Of This Work"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.reviewed_work . \nVALUES ?x1 { :en.fresh_air } \n?x0 :book.reviewed_work.reviews_of_this_work ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 150000200,
		"question": "what is the total amount of works reviewed by fresh air?",
		"answer": [
			"17"
		],
		"function": "count",
		"commonness": -17.153753519211833,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.reviewed_work",
					"class": "book.reviewed_work",
					"friendly_name": "Reviewed Work",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.fresh_air",
					"class": "book.review",
					"friendly_name": "Fresh Air",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "book.reviewed_work.reviews_of_this_work",
					"friendly_name": "Reviews Of This Work"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.reviewed_work . \nVALUES ?x1 { :en.fresh_air } \n?x0 :book.reviewed_work.reviews_of_this_work ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 150000300,
		"question": "fresh air has reviewed how many different works?",
		"answer": [
			"17"
		],
		"function": "count",
		"commonness": -17.153753519211833,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.reviewed_work",
					"class": "book.reviewed_work",
					"friendly_name": "Reviewed Work",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.fresh_air",
					"class": "book.review",
					"friendly_name": "Fresh Air",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "book.reviewed_work.reviews_of_this_work",
					"friendly_name": "Reviews Of This Work"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.reviewed_work . \nVALUES ?x1 { :en.fresh_air } \n?x0 :book.reviewed_work.reviews_of_this_work ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 151000001,
		"question": "in the us, how many tropical cyclones have hit?",
		"answer": [
			"24"
		],
		"function": "count",
		"commonness": -9.954693910239504,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "meteorology.tropical_cyclone",
					"class": "meteorology.tropical_cyclone",
					"friendly_name": "Tropical Cyclone",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "meteorology.cyclone_affected_area",
					"friendly_name": "us",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "meteorology.tropical_cyclone.affected_areas",
					"friendly_name": "Affected areas"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :meteorology.tropical_cyclone . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :meteorology.tropical_cyclone.affected_areas ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 151000002,
		"question": "in the united states, how many tropical cyclones have hit?",
		"answer": [
			"24"
		],
		"function": "count",
		"commonness": -9.954693910239504,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "meteorology.tropical_cyclone",
					"class": "meteorology.tropical_cyclone",
					"friendly_name": "Tropical Cyclone",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "meteorology.cyclone_affected_area",
					"friendly_name": "united states",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "meteorology.tropical_cyclone.affected_areas",
					"friendly_name": "Affected areas"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :meteorology.tropical_cyclone . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :meteorology.tropical_cyclone.affected_areas ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 151000100,
		"question": "united states of america has endured how many tropical cyclones in total?",
		"answer": [
			"24"
		],
		"function": "count",
		"commonness": -9.954693910239504,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "meteorology.tropical_cyclone",
					"class": "meteorology.tropical_cyclone",
					"friendly_name": "Tropical Cyclone",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "meteorology.cyclone_affected_area",
					"friendly_name": "United States of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "meteorology.tropical_cyclone.affected_areas",
					"friendly_name": "Affected areas"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :meteorology.tropical_cyclone . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :meteorology.tropical_cyclone.affected_areas ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 151000101,
		"question": "us has endured how many tropical cyclones in total?",
		"answer": [
			"24"
		],
		"function": "count",
		"commonness": -9.954693910239504,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "meteorology.tropical_cyclone",
					"class": "meteorology.tropical_cyclone",
					"friendly_name": "Tropical Cyclone",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "meteorology.cyclone_affected_area",
					"friendly_name": "us",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "meteorology.tropical_cyclone.affected_areas",
					"friendly_name": "Affected areas"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :meteorology.tropical_cyclone . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :meteorology.tropical_cyclone.affected_areas ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 151000102,
		"question": "united states has endured how many tropical cyclones in total?",
		"answer": [
			"24"
		],
		"function": "count",
		"commonness": -9.954693910239504,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "meteorology.tropical_cyclone",
					"class": "meteorology.tropical_cyclone",
					"friendly_name": "Tropical Cyclone",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "meteorology.cyclone_affected_area",
					"friendly_name": "united states",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "meteorology.tropical_cyclone.affected_areas",
					"friendly_name": "Affected areas"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :meteorology.tropical_cyclone . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :meteorology.tropical_cyclone.affected_areas ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 151000200,
		"question": "how many tropical cyclones have hit the united states of america?",
		"answer": [
			"24"
		],
		"function": "count",
		"commonness": -9.954693910239504,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "meteorology.tropical_cyclone",
					"class": "meteorology.tropical_cyclone",
					"friendly_name": "Tropical Cyclone",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "meteorology.cyclone_affected_area",
					"friendly_name": "United States of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "meteorology.tropical_cyclone.affected_areas",
					"friendly_name": "Affected areas"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :meteorology.tropical_cyclone . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :meteorology.tropical_cyclone.affected_areas ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 151000201,
		"question": "how many tropical cyclones have hit the us?",
		"answer": [
			"24"
		],
		"function": "count",
		"commonness": -9.954693910239504,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "meteorology.tropical_cyclone",
					"class": "meteorology.tropical_cyclone",
					"friendly_name": "Tropical Cyclone",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "meteorology.cyclone_affected_area",
					"friendly_name": "us",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "meteorology.tropical_cyclone.affected_areas",
					"friendly_name": "Affected areas"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :meteorology.tropical_cyclone . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :meteorology.tropical_cyclone.affected_areas ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 151000202,
		"question": "how many tropical cyclones have hit the united states?",
		"answer": [
			"24"
		],
		"function": "count",
		"commonness": -9.954693910239504,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "meteorology.tropical_cyclone",
					"class": "meteorology.tropical_cyclone",
					"friendly_name": "Tropical Cyclone",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "meteorology.cyclone_affected_area",
					"friendly_name": "united states",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "meteorology.tropical_cyclone.affected_areas",
					"friendly_name": "Affected areas"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :meteorology.tropical_cyclone . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :meteorology.tropical_cyclone.affected_areas ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 151000300,
		"question": "how many tropical cyclones affected the united states of america in history?",
		"answer": [
			"24"
		],
		"function": "count",
		"commonness": -9.954693910239504,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "meteorology.tropical_cyclone",
					"class": "meteorology.tropical_cyclone",
					"friendly_name": "Tropical Cyclone",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "meteorology.cyclone_affected_area",
					"friendly_name": "United States of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "meteorology.tropical_cyclone.affected_areas",
					"friendly_name": "Affected areas"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :meteorology.tropical_cyclone . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :meteorology.tropical_cyclone.affected_areas ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 151000301,
		"question": "how many tropical cyclones affected the us in history?",
		"answer": [
			"24"
		],
		"function": "count",
		"commonness": -9.954693910239504,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "meteorology.tropical_cyclone",
					"class": "meteorology.tropical_cyclone",
					"friendly_name": "Tropical Cyclone",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "meteorology.cyclone_affected_area",
					"friendly_name": "us",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "meteorology.tropical_cyclone.affected_areas",
					"friendly_name": "Affected areas"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :meteorology.tropical_cyclone . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :meteorology.tropical_cyclone.affected_areas ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 151000302,
		"question": "how many tropical cyclones affected the united states in history?",
		"answer": [
			"24"
		],
		"function": "count",
		"commonness": -9.954693910239504,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "meteorology.tropical_cyclone",
					"class": "meteorology.tropical_cyclone",
					"friendly_name": "Tropical Cyclone",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "meteorology.cyclone_affected_area",
					"friendly_name": "united states",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "meteorology.tropical_cyclone.affected_areas",
					"friendly_name": "Affected areas"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :meteorology.tropical_cyclone . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :meteorology.tropical_cyclone.affected_areas ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 151000500,
		"question": "the united states of america has been hit by how many tropical cyclones?",
		"answer": [
			"24"
		],
		"function": "count",
		"commonness": -9.954693910239504,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "meteorology.tropical_cyclone",
					"class": "meteorology.tropical_cyclone",
					"friendly_name": "Tropical Cyclone",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "meteorology.cyclone_affected_area",
					"friendly_name": "United States of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "meteorology.tropical_cyclone.affected_areas",
					"friendly_name": "Affected areas"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :meteorology.tropical_cyclone . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :meteorology.tropical_cyclone.affected_areas ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]