[
	{
		"qid": 244000700,
		"question": "who is the manager of the baseball team which was the runner up of 2007 world series?",
		"answer": [
			"Don Baylor",
			"Jim Leyland",
			"Clint Hurdle"
		],
		"function": "none",
		"commonness": -33.313388228157265,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "baseball.baseball_manager",
					"class": "baseball.baseball_manager",
					"friendly_name": "Baseball Manager",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "baseball.baseball_historical_managerial_position",
					"class": "baseball.baseball_historical_managerial_position",
					"friendly_name": "Baseball Historical Managerial Position",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "baseball.baseball_team",
					"class": "baseball.baseball_team",
					"friendly_name": "Baseball Team",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.2007_world_series",
					"class": "sports.sports_championship_event",
					"friendly_name": "2007 World Series",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "baseball.baseball_historical_managerial_position.manager",
					"friendly_name": "Manager"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "baseball.baseball_historical_managerial_position.team",
					"friendly_name": "Team"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "sports.sports_championship_event.runner_up",
					"friendly_name": "Runner-up"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :baseball.baseball_manager . \n?x1 :type.object.type :baseball.baseball_historical_managerial_position . \n?x2 :type.object.type :baseball.baseball_team . \nVALUES ?x3 { :en.2007_world_series } \n?x1 :baseball.baseball_historical_managerial_position.manager ?x0 . \n?x1 :baseball.baseball_historical_managerial_position.team ?x2 . \n?x3 :sports.sports_championship_event.runner_up ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 244000701,
		"question": "who is the manager of the baseball team which was the runner up of ws07?",
		"answer": [
			"Jim Leyland",
			"Clint Hurdle",
			"Don Baylor"
		],
		"function": "none",
		"commonness": -33.313388228157265,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "baseball.baseball_manager",
					"class": "baseball.baseball_manager",
					"friendly_name": "Baseball Manager",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "baseball.baseball_historical_managerial_position",
					"class": "baseball.baseball_historical_managerial_position",
					"friendly_name": "Baseball Historical Managerial Position",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "baseball.baseball_team",
					"class": "baseball.baseball_team",
					"friendly_name": "Baseball Team",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.2007_world_series",
					"class": "sports.sports_championship_event",
					"friendly_name": "ws07",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "baseball.baseball_historical_managerial_position.manager",
					"friendly_name": "Manager"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "baseball.baseball_historical_managerial_position.team",
					"friendly_name": "Team"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "sports.sports_championship_event.runner_up",
					"friendly_name": "Runner-up"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :baseball.baseball_manager . \n?x1 :type.object.type :baseball.baseball_historical_managerial_position . \n?x2 :type.object.type :baseball.baseball_team . \nVALUES ?x3 { :en.2007_world_series } \n?x1 :baseball.baseball_historical_managerial_position.manager ?x0 . \n?x1 :baseball.baseball_historical_managerial_position.team ?x2 . \n?x3 :sports.sports_championship_event.runner_up ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 245000000,
		"question": "who made an aircraft needing a crew of more than 16 ?",
		"answer": [
			"Joe Sutter",
			"Alan Mulally"
		],
		"function": ">",
		"commonness": -33.23829354806152,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "aviation.aircraft_designer",
					"class": "aviation.aircraft_designer",
					"friendly_name": "Aircraft designer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "aviation.aircraft_model",
					"class": "aviation.aircraft_model",
					"friendly_name": "Aircraft model",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "aviation.aviation_incident_aircraft_relationship",
					"class": "aviation.aviation_incident_aircraft_relationship",
					"friendly_name": "Aviation incident/aircraft relationship",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "literal",
					"id": "16^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "16",
					"question_node": 0,
					"function": ">"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "aviation.aircraft_model.designed_by",
					"friendly_name": "Designed by"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "aviation.aviation_incident_aircraft_relationship.aircraft_model",
					"friendly_name": "Aircraft model"
				},
				{
					"start": 2,
					"end": 3,
					"relation": "aviation.aviation_incident_aircraft_relationship.crew",
					"friendly_name": "Crew"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :aviation.aircraft_designer . \n?x1 :type.object.type :aviation.aircraft_model . \n?x2 :type.object.type :aviation.aviation_incident_aircraft_relationship . \nFILTER (?x3 > 16)\n?x1 :aviation.aircraft_model.designed_by ?x0 . \n?x2 :aviation.aviation_incident_aircraft_relationship.aircraft_model ?x1 . \n?x2 :aviation.aviation_incident_aircraft_relationship.crew ?x3 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 245000100,
		"question": "who designed an aircraft that needs more than 16 crew?",
		"answer": [
			"Joe Sutter",
			"Alan Mulally"
		],
		"function": ">",
		"commonness": -33.23829354806152,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "aviation.aircraft_designer",
					"class": "aviation.aircraft_designer",
					"friendly_name": "Aircraft designer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "aviation.aircraft_model",
					"class": "aviation.aircraft_model",
					"friendly_name": "Aircraft model",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "aviation.aviation_incident_aircraft_relationship",
					"class": "aviation.aviation_incident_aircraft_relationship",
					"friendly_name": "Aviation incident/aircraft relationship",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "literal",
					"id": "16^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "16",
					"question_node": 0,
					"function": ">"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "aviation.aircraft_model.designed_by",
					"friendly_name": "Designed by"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "aviation.aviation_incident_aircraft_relationship.aircraft_model",
					"friendly_name": "Aircraft model"
				},
				{
					"start": 2,
					"end": 3,
					"relation": "aviation.aviation_incident_aircraft_relationship.crew",
					"friendly_name": "Crew"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :aviation.aircraft_designer . \n?x1 :type.object.type :aviation.aircraft_model . \n?x2 :type.object.type :aviation.aviation_incident_aircraft_relationship . \nFILTER (?x3 > 16)\n?x1 :aviation.aircraft_model.designed_by ?x0 . \n?x2 :aviation.aviation_incident_aircraft_relationship.aircraft_model ?x1 . \n?x2 :aviation.aviation_incident_aircraft_relationship.crew ?x3 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 245000200,
		"question": "which aircraft designer is responsible for an aircraft needing more than 16 crew members?",
		"answer": [
			"Joe Sutter",
			"Alan Mulally"
		],
		"function": ">",
		"commonness": -33.23829354806152,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "aviation.aircraft_designer",
					"class": "aviation.aircraft_designer",
					"friendly_name": "Aircraft designer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "aviation.aircraft_model",
					"class": "aviation.aircraft_model",
					"friendly_name": "Aircraft model",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "aviation.aviation_incident_aircraft_relationship",
					"class": "aviation.aviation_incident_aircraft_relationship",
					"friendly_name": "Aviation incident/aircraft relationship",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "literal",
					"id": "16^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "16",
					"question_node": 0,
					"function": ">"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "aviation.aircraft_model.designed_by",
					"friendly_name": "Designed by"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "aviation.aviation_incident_aircraft_relationship.aircraft_model",
					"friendly_name": "Aircraft model"
				},
				{
					"start": 2,
					"end": 3,
					"relation": "aviation.aviation_incident_aircraft_relationship.crew",
					"friendly_name": "Crew"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :aviation.aircraft_designer . \n?x1 :type.object.type :aviation.aircraft_model . \n?x2 :type.object.type :aviation.aviation_incident_aircraft_relationship . \nFILTER (?x3 > 16)\n?x1 :aviation.aircraft_model.designed_by ?x0 . \n?x2 :aviation.aviation_incident_aircraft_relationship.aircraft_model ?x1 . \n?x2 :aviation.aviation_incident_aircraft_relationship.crew ?x3 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 245000300,
		"question": "an aircraft that needs more than 16 crew was designed by whom?",
		"answer": [
			"Alan Mulally",
			"Joe Sutter"
		],
		"function": ">",
		"commonness": -33.23829354806152,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "aviation.aircraft_designer",
					"class": "aviation.aircraft_designer",
					"friendly_name": "Aircraft designer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "aviation.aircraft_model",
					"class": "aviation.aircraft_model",
					"friendly_name": "Aircraft model",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "aviation.aviation_incident_aircraft_relationship",
					"class": "aviation.aviation_incident_aircraft_relationship",
					"friendly_name": "Aviation incident/aircraft relationship",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "literal",
					"id": "16^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "16",
					"question_node": 0,
					"function": ">"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "aviation.aircraft_model.designed_by",
					"friendly_name": "Designed by"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "aviation.aviation_incident_aircraft_relationship.aircraft_model",
					"friendly_name": "Aircraft model"
				},
				{
					"start": 2,
					"end": 3,
					"relation": "aviation.aviation_incident_aircraft_relationship.crew",
					"friendly_name": "Crew"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :aviation.aircraft_designer . \n?x1 :type.object.type :aviation.aircraft_model . \n?x2 :type.object.type :aviation.aviation_incident_aircraft_relationship . \nFILTER (?x3 > 16)\n?x1 :aviation.aircraft_model.designed_by ?x0 . \n?x2 :aviation.aviation_incident_aircraft_relationship.aircraft_model ?x1 . \n?x2 :aviation.aviation_incident_aircraft_relationship.crew ?x3 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 245000400,
		"question": "which designer of an aircraft designed one that needs more than a crew of 16?",
		"answer": [
			"Alan Mulally",
			"Joe Sutter"
		],
		"function": ">",
		"commonness": -33.23829354806152,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "aviation.aircraft_designer",
					"class": "aviation.aircraft_designer",
					"friendly_name": "Aircraft designer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "aviation.aircraft_model",
					"class": "aviation.aircraft_model",
					"friendly_name": "Aircraft model",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "aviation.aviation_incident_aircraft_relationship",
					"class": "aviation.aviation_incident_aircraft_relationship",
					"friendly_name": "Aviation incident/aircraft relationship",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "literal",
					"id": "16^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "16",
					"question_node": 0,
					"function": ">"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "aviation.aircraft_model.designed_by",
					"friendly_name": "Designed by"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "aviation.aviation_incident_aircraft_relationship.aircraft_model",
					"friendly_name": "Aircraft model"
				},
				{
					"start": 2,
					"end": 3,
					"relation": "aviation.aviation_incident_aircraft_relationship.crew",
					"friendly_name": "Crew"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :aviation.aircraft_designer . \n?x1 :type.object.type :aviation.aircraft_model . \n?x2 :type.object.type :aviation.aviation_incident_aircraft_relationship . \nFILTER (?x3 > 16)\n?x1 :aviation.aircraft_model.designed_by ?x0 . \n?x2 :aviation.aviation_incident_aircraft_relationship.aircraft_model ?x1 . \n?x2 :aviation.aviation_incident_aircraft_relationship.crew ?x3 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 246000000,
		"question": "feline infectious peritonitis and some disease caused by old age share which symptoms?",
		"answer": [
			"Weight loss",
			"Diarrhea",
			"Anorexia",
			"Fever",
			"Anemia",
			"Fatigue"
		],
		"function": "none",
		"commonness": -39.87995845215022,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pethealth.symptom",
					"class": "base.pethealth.symptom",
					"friendly_name": "Pet Disease Symptom",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.feline_infectious_peritonitis",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "Feline infectious peritonitis",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "base.pethealth.pet_disease_or_medical_condition",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "Pet disease or medical condition",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.middle_aged_dog",
					"class": "base.pethealth.pet_disease_risk_factor",
					"friendly_name": "Old age",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pethealth.pet_disease_or_medical_condition.symptoms",
					"friendly_name": "Symptoms"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "base.pethealth.pet_disease_or_medical_condition.symptoms",
					"friendly_name": "Symptoms"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor",
					"friendly_name": "Pet Diseases with this Risk Factor"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pethealth.symptom . \nVALUES ?x1 { :en.feline_infectious_peritonitis } \n?x2 :type.object.type :base.pethealth.pet_disease_or_medical_condition . \nVALUES ?x3 { :en.middle_aged_dog } \n?x1 :base.pethealth.pet_disease_or_medical_condition.symptoms ?x0 . \n?x2 :base.pethealth.pet_disease_or_medical_condition.symptoms ?x0 . \n?x3 :base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 246000001,
		"question": "feline infectious peritonitis and some disease caused by old share which symptoms?",
		"answer": [
			"Fever",
			"Diarrhea",
			"Anorexia",
			"Fatigue",
			"Weight loss",
			"Anemia"
		],
		"function": "none",
		"commonness": -39.87995845215022,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pethealth.symptom",
					"class": "base.pethealth.symptom",
					"friendly_name": "Pet Disease Symptom",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.feline_infectious_peritonitis",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "Feline infectious peritonitis",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "base.pethealth.pet_disease_or_medical_condition",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "Pet disease or medical condition",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.middle_aged_dog",
					"class": "base.pethealth.pet_disease_risk_factor",
					"friendly_name": "old",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pethealth.pet_disease_or_medical_condition.symptoms",
					"friendly_name": "Symptoms"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "base.pethealth.pet_disease_or_medical_condition.symptoms",
					"friendly_name": "Symptoms"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor",
					"friendly_name": "Pet Diseases with this Risk Factor"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pethealth.symptom . \nVALUES ?x1 { :en.feline_infectious_peritonitis } \n?x2 :type.object.type :base.pethealth.pet_disease_or_medical_condition . \nVALUES ?x3 { :en.middle_aged_dog } \n?x1 :base.pethealth.pet_disease_or_medical_condition.symptoms ?x0 . \n?x2 :base.pethealth.pet_disease_or_medical_condition.symptoms ?x0 . \n?x3 :base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 246000002,
		"question": "fip and some disease caused by old age share which symptoms?",
		"answer": [
			"Fatigue",
			"Weight loss",
			"Anemia",
			"Diarrhea",
			"Fever",
			"Anorexia"
		],
		"function": "none",
		"commonness": -39.87995845215022,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pethealth.symptom",
					"class": "base.pethealth.symptom",
					"friendly_name": "Pet Disease Symptom",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.feline_infectious_peritonitis",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "fip",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "base.pethealth.pet_disease_or_medical_condition",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "Pet disease or medical condition",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.middle_aged_dog",
					"class": "base.pethealth.pet_disease_risk_factor",
					"friendly_name": "Old age",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pethealth.pet_disease_or_medical_condition.symptoms",
					"friendly_name": "Symptoms"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "base.pethealth.pet_disease_or_medical_condition.symptoms",
					"friendly_name": "Symptoms"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor",
					"friendly_name": "Pet Diseases with this Risk Factor"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pethealth.symptom . \nVALUES ?x1 { :en.feline_infectious_peritonitis } \n?x2 :type.object.type :base.pethealth.pet_disease_or_medical_condition . \nVALUES ?x3 { :en.middle_aged_dog } \n?x1 :base.pethealth.pet_disease_or_medical_condition.symptoms ?x0 . \n?x2 :base.pethealth.pet_disease_or_medical_condition.symptoms ?x0 . \n?x3 :base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 246000100,
		"question": "what are the common symptoms of feline infectious peritonitis and some disease caused by old age?",
		"answer": [
			"Fatigue",
			"Weight loss",
			"Diarrhea",
			"Anorexia",
			"Anemia",
			"Fever"
		],
		"function": "none",
		"commonness": -39.87995845215022,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pethealth.symptom",
					"class": "base.pethealth.symptom",
					"friendly_name": "Pet Disease Symptom",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.feline_infectious_peritonitis",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "Feline infectious peritonitis",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "base.pethealth.pet_disease_or_medical_condition",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "Pet disease or medical condition",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.middle_aged_dog",
					"class": "base.pethealth.pet_disease_risk_factor",
					"friendly_name": "Old age",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pethealth.pet_disease_or_medical_condition.symptoms",
					"friendly_name": "Symptoms"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "base.pethealth.pet_disease_or_medical_condition.symptoms",
					"friendly_name": "Symptoms"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor",
					"friendly_name": "Pet Diseases with this Risk Factor"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pethealth.symptom . \nVALUES ?x1 { :en.feline_infectious_peritonitis } \n?x2 :type.object.type :base.pethealth.pet_disease_or_medical_condition . \nVALUES ?x3 { :en.middle_aged_dog } \n?x1 :base.pethealth.pet_disease_or_medical_condition.symptoms ?x0 . \n?x2 :base.pethealth.pet_disease_or_medical_condition.symptoms ?x0 . \n?x3 :base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 246000101,
		"question": "what are the common symptoms of feline infectious peritonitis and some disease caused by old?",
		"answer": [
			"Fatigue",
			"Diarrhea",
			"Weight loss",
			"Anemia",
			"Anorexia",
			"Fever"
		],
		"function": "none",
		"commonness": -39.87995845215022,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pethealth.symptom",
					"class": "base.pethealth.symptom",
					"friendly_name": "Pet Disease Symptom",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.feline_infectious_peritonitis",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "Feline infectious peritonitis",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "base.pethealth.pet_disease_or_medical_condition",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "Pet disease or medical condition",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.middle_aged_dog",
					"class": "base.pethealth.pet_disease_risk_factor",
					"friendly_name": "old",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pethealth.pet_disease_or_medical_condition.symptoms",
					"friendly_name": "Symptoms"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "base.pethealth.pet_disease_or_medical_condition.symptoms",
					"friendly_name": "Symptoms"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor",
					"friendly_name": "Pet Diseases with this Risk Factor"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pethealth.symptom . \nVALUES ?x1 { :en.feline_infectious_peritonitis } \n?x2 :type.object.type :base.pethealth.pet_disease_or_medical_condition . \nVALUES ?x3 { :en.middle_aged_dog } \n?x1 :base.pethealth.pet_disease_or_medical_condition.symptoms ?x0 . \n?x2 :base.pethealth.pet_disease_or_medical_condition.symptoms ?x0 . \n?x3 :base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	}
]