[
	{
		"qid": 186000402,
		"question": "which type of tea is produced in both people's republic of china and japan?",
		"answer": [
			"Matcha"
		],
		"function": "none",
		"commonness": -21.807589230994807,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.tea",
					"class": "food.tea",
					"friendly_name": "Tea",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.china",
					"class": "location.location",
					"friendly_name": "people's republic of china",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.japan",
					"class": "location.location",
					"friendly_name": "Japan",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "food.tea.regions_where_grown",
					"friendly_name": "Regions where grown"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "food.tea.regions_where_grown",
					"friendly_name": "Regions where grown"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.tea . \nVALUES ?x1 { :en.china } \nVALUES ?x2 { :en.japan } \n?x0 :food.tea.regions_where_grown ?x1 . \n?x0 :food.tea.regions_where_grown ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 186000500,
		"question": "what tea is grown in both china and japan?",
		"answer": [
			"Matcha"
		],
		"function": "none",
		"commonness": -21.807589230994807,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.tea",
					"class": "food.tea",
					"friendly_name": "Tea",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.china",
					"class": "location.location",
					"friendly_name": "China",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.japan",
					"class": "location.location",
					"friendly_name": "Japan",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "food.tea.regions_where_grown",
					"friendly_name": "Regions where grown"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "food.tea.regions_where_grown",
					"friendly_name": "Regions where grown"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.tea . \nVALUES ?x1 { :en.china } \nVALUES ?x2 { :en.japan } \n?x0 :food.tea.regions_where_grown ?x1 . \n?x0 :food.tea.regions_where_grown ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 186000501,
		"question": "what tea is grown in both china and jp?",
		"answer": [
			"Matcha"
		],
		"function": "none",
		"commonness": -21.807589230994807,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.tea",
					"class": "food.tea",
					"friendly_name": "Tea",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.china",
					"class": "location.location",
					"friendly_name": "China",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.japan",
					"class": "location.location",
					"friendly_name": "jp",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "food.tea.regions_where_grown",
					"friendly_name": "Regions where grown"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "food.tea.regions_where_grown",
					"friendly_name": "Regions where grown"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.tea . \nVALUES ?x1 { :en.china } \nVALUES ?x2 { :en.japan } \n?x0 :food.tea.regions_where_grown ?x1 . \n?x0 :food.tea.regions_where_grown ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 186000502,
		"question": "what tea is grown in both people's republic of china and japan?",
		"answer": [
			"Matcha"
		],
		"function": "none",
		"commonness": -21.807589230994807,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.tea",
					"class": "food.tea",
					"friendly_name": "Tea",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.china",
					"class": "location.location",
					"friendly_name": "people's republic of china",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.japan",
					"class": "location.location",
					"friendly_name": "Japan",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "food.tea.regions_where_grown",
					"friendly_name": "Regions where grown"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "food.tea.regions_where_grown",
					"friendly_name": "Regions where grown"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.tea . \nVALUES ?x1 { :en.china } \nVALUES ?x2 { :en.japan } \n?x0 :food.tea.regions_where_grown ?x1 . \n?x0 :food.tea.regions_where_grown ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 187000000,
		"question": "which law enforcement agency did vladimir putin work for?",
		"answer": [
			"KGB",
			"Federal Security Service"
		],
		"function": "none",
		"commonness": -16.83908150009119,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.crime.law_enforcement_authority",
					"class": "base.crime.law_enforcement_authority",
					"friendly_name": "Law enforcement agency",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "business.employment_tenure",
					"class": "business.employment_tenure",
					"friendly_name": "Employment tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.vladimir_putin",
					"class": "people.person",
					"friendly_name": "Vladimir Putin",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "business.employment_tenure.company",
					"friendly_name": "Employer"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "business.employment_tenure.person",
					"friendly_name": "Person"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.crime.law_enforcement_authority . \n?x1 :type.object.type :business.employment_tenure . \nVALUES ?x2 { :en.vladimir_putin } \n?x1 :business.employment_tenure.company ?x0 . \n?x1 :business.employment_tenure.person ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 187000001,
		"question": "which law enforcement agency did putin work for?",
		"answer": [
			"KGB",
			"Federal Security Service"
		],
		"function": "none",
		"commonness": -16.83908150009119,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.crime.law_enforcement_authority",
					"class": "base.crime.law_enforcement_authority",
					"friendly_name": "Law enforcement agency",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "business.employment_tenure",
					"class": "business.employment_tenure",
					"friendly_name": "Employment tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.vladimir_putin",
					"class": "people.person",
					"friendly_name": "putin",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "business.employment_tenure.company",
					"friendly_name": "Employer"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "business.employment_tenure.person",
					"friendly_name": "Person"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.crime.law_enforcement_authority . \n?x1 :type.object.type :business.employment_tenure . \nVALUES ?x2 { :en.vladimir_putin } \n?x1 :business.employment_tenure.company ?x0 . \n?x1 :business.employment_tenure.person ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 187000100,
		"question": "vladimir putin worked in which law enforcement agency when he was young?",
		"answer": [
			"KGB",
			"Federal Security Service"
		],
		"function": "none",
		"commonness": -16.83908150009119,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.crime.law_enforcement_authority",
					"class": "base.crime.law_enforcement_authority",
					"friendly_name": "Law enforcement agency",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "business.employment_tenure",
					"class": "business.employment_tenure",
					"friendly_name": "Employment tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.vladimir_putin",
					"class": "people.person",
					"friendly_name": "Vladimir Putin",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "business.employment_tenure.company",
					"friendly_name": "Employer"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "business.employment_tenure.person",
					"friendly_name": "Person"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.crime.law_enforcement_authority . \n?x1 :type.object.type :business.employment_tenure . \nVALUES ?x2 { :en.vladimir_putin } \n?x1 :business.employment_tenure.company ?x0 . \n?x1 :business.employment_tenure.person ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 187000101,
		"question": "putin worked in which law enforcement agency when he was young?",
		"answer": [
			"Federal Security Service",
			"KGB"
		],
		"function": "none",
		"commonness": -16.83908150009119,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.crime.law_enforcement_authority",
					"class": "base.crime.law_enforcement_authority",
					"friendly_name": "Law enforcement agency",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "business.employment_tenure",
					"class": "business.employment_tenure",
					"friendly_name": "Employment tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.vladimir_putin",
					"class": "people.person",
					"friendly_name": "putin",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "business.employment_tenure.company",
					"friendly_name": "Employer"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "business.employment_tenure.person",
					"friendly_name": "Person"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.crime.law_enforcement_authority . \n?x1 :type.object.type :business.employment_tenure . \nVALUES ?x2 { :en.vladimir_putin } \n?x1 :business.employment_tenure.company ?x0 . \n?x1 :business.employment_tenure.person ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 187000102,
		"question": "vladimir v. putin worked in which law enforcement agency when he was young?",
		"answer": [
			"Federal Security Service",
			"KGB"
		],
		"function": "none",
		"commonness": -16.83908150009119,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.crime.law_enforcement_authority",
					"class": "base.crime.law_enforcement_authority",
					"friendly_name": "Law enforcement agency",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "business.employment_tenure",
					"class": "business.employment_tenure",
					"friendly_name": "Employment tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.vladimir_putin",
					"class": "people.person",
					"friendly_name": "vladimir v. putin",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "business.employment_tenure.company",
					"friendly_name": "Employer"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "business.employment_tenure.person",
					"friendly_name": "Person"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.crime.law_enforcement_authority . \n?x1 :type.object.type :business.employment_tenure . \nVALUES ?x2 { :en.vladimir_putin } \n?x1 :business.employment_tenure.company ?x0 . \n?x1 :business.employment_tenure.person ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 187000200,
		"question": "vladimir putin was employed at which law enforcement agency?",
		"answer": [
			"KGB",
			"Federal Security Service"
		],
		"function": "none",
		"commonness": -16.83908150009119,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.crime.law_enforcement_authority",
					"class": "base.crime.law_enforcement_authority",
					"friendly_name": "Law enforcement agency",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "business.employment_tenure",
					"class": "business.employment_tenure",
					"friendly_name": "Employment tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.vladimir_putin",
					"class": "people.person",
					"friendly_name": "Vladimir Putin",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "business.employment_tenure.company",
					"friendly_name": "Employer"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "business.employment_tenure.person",
					"friendly_name": "Person"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.crime.law_enforcement_authority . \n?x1 :type.object.type :business.employment_tenure . \nVALUES ?x2 { :en.vladimir_putin } \n?x1 :business.employment_tenure.company ?x0 . \n?x1 :business.employment_tenure.person ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 187000201,
		"question": "putin was employed at which law enforcement agency?",
		"answer": [
			"KGB",
			"Federal Security Service"
		],
		"function": "none",
		"commonness": -16.83908150009119,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.crime.law_enforcement_authority",
					"class": "base.crime.law_enforcement_authority",
					"friendly_name": "Law enforcement agency",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "business.employment_tenure",
					"class": "business.employment_tenure",
					"friendly_name": "Employment tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.vladimir_putin",
					"class": "people.person",
					"friendly_name": "putin",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "business.employment_tenure.company",
					"friendly_name": "Employer"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "business.employment_tenure.person",
					"friendly_name": "Person"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.crime.law_enforcement_authority . \n?x1 :type.object.type :business.employment_tenure . \nVALUES ?x2 { :en.vladimir_putin } \n?x1 :business.employment_tenure.company ?x0 . \n?x1 :business.employment_tenure.person ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 187000202,
		"question": "vladimir v. putin was employed at which law enforcement agency?",
		"answer": [
			"Federal Security Service",
			"KGB"
		],
		"function": "none",
		"commonness": -16.83908150009119,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.crime.law_enforcement_authority",
					"class": "base.crime.law_enforcement_authority",
					"friendly_name": "Law enforcement agency",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "business.employment_tenure",
					"class": "business.employment_tenure",
					"friendly_name": "Employment tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.vladimir_putin",
					"class": "people.person",
					"friendly_name": "vladimir v. putin",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "business.employment_tenure.company",
					"friendly_name": "Employer"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "business.employment_tenure.person",
					"friendly_name": "Person"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.crime.law_enforcement_authority . \n?x1 :type.object.type :business.employment_tenure . \nVALUES ?x2 { :en.vladimir_putin } \n?x1 :business.employment_tenure.company ?x0 . \n?x1 :business.employment_tenure.person ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 187000300,
		"question": "vladimir putin used to work for which law enforcement agency?",
		"answer": [
			"Federal Security Service",
			"KGB"
		],
		"function": "none",
		"commonness": -16.83908150009119,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.crime.law_enforcement_authority",
					"class": "base.crime.law_enforcement_authority",
					"friendly_name": "Law enforcement agency",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "business.employment_tenure",
					"class": "business.employment_tenure",
					"friendly_name": "Employment tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.vladimir_putin",
					"class": "people.person",
					"friendly_name": "Vladimir Putin",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "business.employment_tenure.company",
					"friendly_name": "Employer"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "business.employment_tenure.person",
					"friendly_name": "Person"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.crime.law_enforcement_authority . \n?x1 :type.object.type :business.employment_tenure . \nVALUES ?x2 { :en.vladimir_putin } \n?x1 :business.employment_tenure.company ?x0 . \n?x1 :business.employment_tenure.person ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 187000301,
		"question": "putin used to work for which law enforcement agency?",
		"answer": [
			"Federal Security Service",
			"KGB"
		],
		"function": "none",
		"commonness": -16.83908150009119,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.crime.law_enforcement_authority",
					"class": "base.crime.law_enforcement_authority",
					"friendly_name": "Law enforcement agency",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "business.employment_tenure",
					"class": "business.employment_tenure",
					"friendly_name": "Employment tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.vladimir_putin",
					"class": "people.person",
					"friendly_name": "putin",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "business.employment_tenure.company",
					"friendly_name": "Employer"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "business.employment_tenure.person",
					"friendly_name": "Person"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.crime.law_enforcement_authority . \n?x1 :type.object.type :business.employment_tenure . \nVALUES ?x2 { :en.vladimir_putin } \n?x1 :business.employment_tenure.company ?x0 . \n?x1 :business.employment_tenure.person ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 187000302,
		"question": "vladimir v. putin used to work for which law enforcement agency?",
		"answer": [
			"Federal Security Service",
			"KGB"
		],
		"function": "none",
		"commonness": -16.83908150009119,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.crime.law_enforcement_authority",
					"class": "base.crime.law_enforcement_authority",
					"friendly_name": "Law enforcement agency",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "business.employment_tenure",
					"class": "business.employment_tenure",
					"friendly_name": "Employment tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.vladimir_putin",
					"class": "people.person",
					"friendly_name": "vladimir v. putin",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "business.employment_tenure.company",
					"friendly_name": "Employer"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "business.employment_tenure.person",
					"friendly_name": "Person"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.crime.law_enforcement_authority . \n?x1 :type.object.type :business.employment_tenure . \nVALUES ?x2 { :en.vladimir_putin } \n?x1 :business.employment_tenure.company ?x0 . \n?x1 :business.employment_tenure.person ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 187000400,
		"question": "which law enforcement agency hired vladimir putin?",
		"answer": [
			"KGB",
			"Federal Security Service"
		],
		"function": "none",
		"commonness": -16.83908150009119,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.crime.law_enforcement_authority",
					"class": "base.crime.law_enforcement_authority",
					"friendly_name": "Law enforcement agency",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "business.employment_tenure",
					"class": "business.employment_tenure",
					"friendly_name": "Employment tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.vladimir_putin",
					"class": "people.person",
					"friendly_name": "Vladimir Putin",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "business.employment_tenure.company",
					"friendly_name": "Employer"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "business.employment_tenure.person",
					"friendly_name": "Person"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.crime.law_enforcement_authority . \n?x1 :type.object.type :business.employment_tenure . \nVALUES ?x2 { :en.vladimir_putin } \n?x1 :business.employment_tenure.company ?x0 . \n?x1 :business.employment_tenure.person ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 187000401,
		"question": "which law enforcement agency hired putin?",
		"answer": [
			"KGB",
			"Federal Security Service"
		],
		"function": "none",
		"commonness": -16.83908150009119,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.crime.law_enforcement_authority",
					"class": "base.crime.law_enforcement_authority",
					"friendly_name": "Law enforcement agency",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "business.employment_tenure",
					"class": "business.employment_tenure",
					"friendly_name": "Employment tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.vladimir_putin",
					"class": "people.person",
					"friendly_name": "putin",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "business.employment_tenure.company",
					"friendly_name": "Employer"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "business.employment_tenure.person",
					"friendly_name": "Person"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.crime.law_enforcement_authority . \n?x1 :type.object.type :business.employment_tenure . \nVALUES ?x2 { :en.vladimir_putin } \n?x1 :business.employment_tenure.company ?x0 . \n?x1 :business.employment_tenure.person ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 187000402,
		"question": "which law enforcement agency hired vladimir v. putin?",
		"answer": [
			"Federal Security Service",
			"KGB"
		],
		"function": "none",
		"commonness": -16.83908150009119,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.crime.law_enforcement_authority",
					"class": "base.crime.law_enforcement_authority",
					"friendly_name": "Law enforcement agency",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "business.employment_tenure",
					"class": "business.employment_tenure",
					"friendly_name": "Employment tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.vladimir_putin",
					"class": "people.person",
					"friendly_name": "vladimir v. putin",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "business.employment_tenure.company",
					"friendly_name": "Employer"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "business.employment_tenure.person",
					"friendly_name": "Person"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.crime.law_enforcement_authority . \n?x1 :type.object.type :business.employment_tenure . \nVALUES ?x2 { :en.vladimir_putin } \n?x1 :business.employment_tenure.company ?x0 . \n?x1 :business.employment_tenure.person ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	}
]