[
	{
		"qid": 180000300,
		"question": "in the 2010 world cup which team had the player glen johnson?",
		"answer": [
			"England national football team"
		],
		"function": "none",
		"commonness": -21.452641541924372,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.x2010fifaworldcupsouthafrica.world_cup_squad",
					"class": "base.x2010fifaworldcupsouthafrica.world_cup_squad",
					"friendly_name": "2010 FIFA World Cup Team",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.x2010fifaworldcupsouthafrica.current_world_cup_squad",
					"class": "base.x2010fifaworldcupsouthafrica.current_world_cup_squad",
					"friendly_name": "World Cup Squad",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.glen_johnson",
					"class": "base.x2010fifaworldcupsouthafrica.world_cup_participant",
					"friendly_name": "Glen Johnson",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.x2010fifaworldcupsouthafrica.world_cup_squad.current_world_cup_squad",
					"friendly_name": "World Cup squad"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "base.x2010fifaworldcupsouthafrica.world_cup_participant.world_cup_team",
					"friendly_name": "World Cup Team"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.x2010fifaworldcupsouthafrica.world_cup_squad . \n?x1 :type.object.type :base.x2010fifaworldcupsouthafrica.current_world_cup_squad . \nVALUES ?x2 { :en.glen_johnson } \n?x0 :base.x2010fifaworldcupsouthafrica.world_cup_squad.current_world_cup_squad ?x1 . \n?x2 :base.x2010fifaworldcupsouthafrica.world_cup_participant.world_cup_team ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 180000301,
		"question": "in the 2010 world cup which team had the player glen mcleod cooper johnson?",
		"answer": [
			"England national football team"
		],
		"function": "none",
		"commonness": -21.452641541924372,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.x2010fifaworldcupsouthafrica.world_cup_squad",
					"class": "base.x2010fifaworldcupsouthafrica.world_cup_squad",
					"friendly_name": "2010 FIFA World Cup Team",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.x2010fifaworldcupsouthafrica.current_world_cup_squad",
					"class": "base.x2010fifaworldcupsouthafrica.current_world_cup_squad",
					"friendly_name": "World Cup Squad",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.glen_johnson",
					"class": "base.x2010fifaworldcupsouthafrica.world_cup_participant",
					"friendly_name": "glen mcleod cooper johnson",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.x2010fifaworldcupsouthafrica.world_cup_squad.current_world_cup_squad",
					"friendly_name": "World Cup squad"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "base.x2010fifaworldcupsouthafrica.world_cup_participant.world_cup_team",
					"friendly_name": "World Cup Team"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.x2010fifaworldcupsouthafrica.world_cup_squad . \n?x1 :type.object.type :base.x2010fifaworldcupsouthafrica.current_world_cup_squad . \nVALUES ?x2 { :en.glen_johnson } \n?x0 :base.x2010fifaworldcupsouthafrica.world_cup_squad.current_world_cup_squad ?x1 . \n?x2 :base.x2010fifaworldcupsouthafrica.world_cup_participant.world_cup_team ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 180000400,
		"question": "glen johnson was a member of which football team in the 2010 world cup?",
		"answer": [
			"England national football team"
		],
		"function": "none",
		"commonness": -21.452641541924372,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.x2010fifaworldcupsouthafrica.world_cup_squad",
					"class": "base.x2010fifaworldcupsouthafrica.world_cup_squad",
					"friendly_name": "2010 FIFA World Cup Team",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.x2010fifaworldcupsouthafrica.current_world_cup_squad",
					"class": "base.x2010fifaworldcupsouthafrica.current_world_cup_squad",
					"friendly_name": "World Cup Squad",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.glen_johnson",
					"class": "base.x2010fifaworldcupsouthafrica.world_cup_participant",
					"friendly_name": "Glen Johnson",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.x2010fifaworldcupsouthafrica.world_cup_squad.current_world_cup_squad",
					"friendly_name": "World Cup squad"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "base.x2010fifaworldcupsouthafrica.world_cup_participant.world_cup_team",
					"friendly_name": "World Cup Team"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.x2010fifaworldcupsouthafrica.world_cup_squad . \n?x1 :type.object.type :base.x2010fifaworldcupsouthafrica.current_world_cup_squad . \nVALUES ?x2 { :en.glen_johnson } \n?x0 :base.x2010fifaworldcupsouthafrica.world_cup_squad.current_world_cup_squad ?x1 . \n?x2 :base.x2010fifaworldcupsouthafrica.world_cup_participant.world_cup_team ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 180000401,
		"question": "glen mcleod cooper johnson was a member of which football team in the 2010 world cup?",
		"answer": [
			"England national football team"
		],
		"function": "none",
		"commonness": -21.452641541924372,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.x2010fifaworldcupsouthafrica.world_cup_squad",
					"class": "base.x2010fifaworldcupsouthafrica.world_cup_squad",
					"friendly_name": "2010 FIFA World Cup Team",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.x2010fifaworldcupsouthafrica.current_world_cup_squad",
					"class": "base.x2010fifaworldcupsouthafrica.current_world_cup_squad",
					"friendly_name": "World Cup Squad",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.glen_johnson",
					"class": "base.x2010fifaworldcupsouthafrica.world_cup_participant",
					"friendly_name": "glen mcleod cooper johnson",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.x2010fifaworldcupsouthafrica.world_cup_squad.current_world_cup_squad",
					"friendly_name": "World Cup squad"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "base.x2010fifaworldcupsouthafrica.world_cup_participant.world_cup_team",
					"friendly_name": "World Cup Team"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.x2010fifaworldcupsouthafrica.world_cup_squad . \n?x1 :type.object.type :base.x2010fifaworldcupsouthafrica.current_world_cup_squad . \nVALUES ?x2 { :en.glen_johnson } \n?x0 :base.x2010fifaworldcupsouthafrica.world_cup_squad.current_world_cup_squad ?x1 . \n?x2 :base.x2010fifaworldcupsouthafrica.world_cup_participant.world_cup_team ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 180000500,
		"question": "in 2010 world cup, which country was glen johnson playing for?",
		"answer": [
			"England national football team"
		],
		"function": "none",
		"commonness": -21.452641541924372,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.x2010fifaworldcupsouthafrica.world_cup_squad",
					"class": "base.x2010fifaworldcupsouthafrica.world_cup_squad",
					"friendly_name": "2010 FIFA World Cup Team",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.x2010fifaworldcupsouthafrica.current_world_cup_squad",
					"class": "base.x2010fifaworldcupsouthafrica.current_world_cup_squad",
					"friendly_name": "World Cup Squad",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.glen_johnson",
					"class": "base.x2010fifaworldcupsouthafrica.world_cup_participant",
					"friendly_name": "Glen Johnson",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.x2010fifaworldcupsouthafrica.world_cup_squad.current_world_cup_squad",
					"friendly_name": "World Cup squad"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "base.x2010fifaworldcupsouthafrica.world_cup_participant.world_cup_team",
					"friendly_name": "World Cup Team"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.x2010fifaworldcupsouthafrica.world_cup_squad . \n?x1 :type.object.type :base.x2010fifaworldcupsouthafrica.current_world_cup_squad . \nVALUES ?x2 { :en.glen_johnson } \n?x0 :base.x2010fifaworldcupsouthafrica.world_cup_squad.current_world_cup_squad ?x1 . \n?x2 :base.x2010fifaworldcupsouthafrica.world_cup_participant.world_cup_team ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 180000501,
		"question": "in 2010 world cup, which country was glen mcleod cooper johnson playing for?",
		"answer": [
			"England national football team"
		],
		"function": "none",
		"commonness": -21.452641541924372,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.x2010fifaworldcupsouthafrica.world_cup_squad",
					"class": "base.x2010fifaworldcupsouthafrica.world_cup_squad",
					"friendly_name": "2010 FIFA World Cup Team",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.x2010fifaworldcupsouthafrica.current_world_cup_squad",
					"class": "base.x2010fifaworldcupsouthafrica.current_world_cup_squad",
					"friendly_name": "World Cup Squad",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.glen_johnson",
					"class": "base.x2010fifaworldcupsouthafrica.world_cup_participant",
					"friendly_name": "glen mcleod cooper johnson",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.x2010fifaworldcupsouthafrica.world_cup_squad.current_world_cup_squad",
					"friendly_name": "World Cup squad"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "base.x2010fifaworldcupsouthafrica.world_cup_participant.world_cup_team",
					"friendly_name": "World Cup Team"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.x2010fifaworldcupsouthafrica.world_cup_squad . \n?x1 :type.object.type :base.x2010fifaworldcupsouthafrica.current_world_cup_squad . \nVALUES ?x2 { :en.glen_johnson } \n?x0 :base.x2010fifaworldcupsouthafrica.world_cup_squad.current_world_cup_squad ?x1 . \n?x2 :base.x2010fifaworldcupsouthafrica.world_cup_participant.world_cup_team ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 181000000,
		"question": "what was destroyed by someone from tatooine?",
		"answer": [
			"Death Star"
		],
		"function": "none",
		"commonness": -25.418938089867922,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.fictional_object",
					"class": "fictional_universe.fictional_object",
					"friendly_name": "Fictional Object",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "fictional_universe.fictional_object_destroyer",
					"class": "fictional_universe.fictional_object_destroyer",
					"friendly_name": "Fictional Object Destroyer",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.tatooine",
					"class": "fictional_universe.fictional_setting",
					"friendly_name": "Tatooine",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "fictional_universe.fictional_object.destroyer",
					"friendly_name": "Destroyer"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "fictional_universe.fictional_setting.characters_that_have_lived_here",
					"friendly_name": "Characters that have lived here"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.fictional_object . \n?x1 :type.object.type :fictional_universe.fictional_object_destroyer . \nVALUES ?x2 { :en.tatooine } \n?x0 :fictional_universe.fictional_object.destroyer ?x1 . \n?x2 :fictional_universe.fictional_setting.characters_that_have_lived_here ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 181000001,
		"question": "what was destroyed by someone from tattooine?",
		"answer": [
			"Death Star"
		],
		"function": "none",
		"commonness": -25.418938089867922,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.fictional_object",
					"class": "fictional_universe.fictional_object",
					"friendly_name": "Fictional Object",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "fictional_universe.fictional_object_destroyer",
					"class": "fictional_universe.fictional_object_destroyer",
					"friendly_name": "Fictional Object Destroyer",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.tatooine",
					"class": "fictional_universe.fictional_setting",
					"friendly_name": "tattooine",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "fictional_universe.fictional_object.destroyer",
					"friendly_name": "Destroyer"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "fictional_universe.fictional_setting.characters_that_have_lived_here",
					"friendly_name": "Characters that have lived here"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.fictional_object . \n?x1 :type.object.type :fictional_universe.fictional_object_destroyer . \nVALUES ?x2 { :en.tatooine } \n?x0 :fictional_universe.fictional_object.destroyer ?x1 . \n?x2 :fictional_universe.fictional_setting.characters_that_have_lived_here ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 181000100,
		"question": "what was notably destroyed by a lifelong resident of tatooine?",
		"answer": [
			"Death Star"
		],
		"function": "none",
		"commonness": -25.418938089867922,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.fictional_object",
					"class": "fictional_universe.fictional_object",
					"friendly_name": "Fictional Object",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "fictional_universe.fictional_object_destroyer",
					"class": "fictional_universe.fictional_object_destroyer",
					"friendly_name": "Fictional Object Destroyer",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.tatooine",
					"class": "fictional_universe.fictional_setting",
					"friendly_name": "Tatooine",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "fictional_universe.fictional_object.destroyer",
					"friendly_name": "Destroyer"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "fictional_universe.fictional_setting.characters_that_have_lived_here",
					"friendly_name": "Characters that have lived here"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.fictional_object . \n?x1 :type.object.type :fictional_universe.fictional_object_destroyer . \nVALUES ?x2 { :en.tatooine } \n?x0 :fictional_universe.fictional_object.destroyer ?x1 . \n?x2 :fictional_universe.fictional_setting.characters_that_have_lived_here ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 181000101,
		"question": "what was notably destroyed by a lifelong resident of tattooine?",
		"answer": [
			"Death Star"
		],
		"function": "none",
		"commonness": -25.418938089867922,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.fictional_object",
					"class": "fictional_universe.fictional_object",
					"friendly_name": "Fictional Object",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "fictional_universe.fictional_object_destroyer",
					"class": "fictional_universe.fictional_object_destroyer",
					"friendly_name": "Fictional Object Destroyer",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.tatooine",
					"class": "fictional_universe.fictional_setting",
					"friendly_name": "tattooine",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "fictional_universe.fictional_object.destroyer",
					"friendly_name": "Destroyer"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "fictional_universe.fictional_setting.characters_that_have_lived_here",
					"friendly_name": "Characters that have lived here"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.fictional_object . \n?x1 :type.object.type :fictional_universe.fictional_object_destroyer . \nVALUES ?x2 { :en.tatooine } \n?x0 :fictional_universe.fictional_object.destroyer ?x1 . \n?x2 :fictional_universe.fictional_setting.characters_that_have_lived_here ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 182000000,
		"question": "what can be found in the way of amenities at avi bikszer's restaurant?",
		"answer": [
			"Kid Friendly",
			"Take-out food"
		],
		"function": "none",
		"commonness": -39.363870110303736,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.services.restaurant_amenities",
					"class": "base.services.restaurant_amenities",
					"friendly_name": "Restaurant amenities",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.services.restaurant_additions",
					"class": "base.services.restaurant_additions",
					"friendly_name": "Restaurant",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "m.0dl9dd6",
					"class": "dining.chef",
					"friendly_name": "Avi Bikszer",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.services.restaurant_amenities.restaurants_with_amenity",
					"friendly_name": "Restaurants"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.services.restaurant_additions.chef",
					"friendly_name": "Chef"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.services.restaurant_amenities . \n?x1 :type.object.type :base.services.restaurant_additions . \nVALUES ?x2 { :m.0dl9dd6 } \n?x0 :base.services.restaurant_amenities.restaurants_with_amenity ?x1 . \n?x1 :base.services.restaurant_additions.chef ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 182000100,
		"question": "in the restaurant of avi bikszer, what facilities are available?",
		"answer": [
			"Take-out food",
			"Kid Friendly"
		],
		"function": "none",
		"commonness": -39.363870110303736,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.services.restaurant_amenities",
					"class": "base.services.restaurant_amenities",
					"friendly_name": "Restaurant amenities",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.services.restaurant_additions",
					"class": "base.services.restaurant_additions",
					"friendly_name": "Restaurant",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "m.0dl9dd6",
					"class": "dining.chef",
					"friendly_name": "Avi Bikszer",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.services.restaurant_amenities.restaurants_with_amenity",
					"friendly_name": "Restaurants"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.services.restaurant_additions.chef",
					"friendly_name": "Chef"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.services.restaurant_amenities . \n?x1 :type.object.type :base.services.restaurant_additions . \nVALUES ?x2 { :m.0dl9dd6 } \n?x0 :base.services.restaurant_amenities.restaurants_with_amenity ?x1 . \n?x1 :base.services.restaurant_additions.chef ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 182000200,
		"question": "what amenities are provided in the restaurant where avi bikszer works?",
		"answer": [
			"Take-out food",
			"Kid Friendly"
		],
		"function": "none",
		"commonness": -39.363870110303736,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.services.restaurant_amenities",
					"class": "base.services.restaurant_amenities",
					"friendly_name": "Restaurant amenities",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.services.restaurant_additions",
					"class": "base.services.restaurant_additions",
					"friendly_name": "Restaurant",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "m.0dl9dd6",
					"class": "dining.chef",
					"friendly_name": "Avi Bikszer",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.services.restaurant_amenities.restaurants_with_amenity",
					"friendly_name": "Restaurants"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.services.restaurant_additions.chef",
					"friendly_name": "Chef"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.services.restaurant_amenities . \n?x1 :type.object.type :base.services.restaurant_additions . \nVALUES ?x2 { :m.0dl9dd6 } \n?x0 :base.services.restaurant_amenities.restaurants_with_amenity ?x1 . \n?x1 :base.services.restaurant_additions.chef ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 182000300,
		"question": "the restaurant where avi bikszer works provides what amenities?",
		"answer": [
			"Kid Friendly",
			"Take-out food"
		],
		"function": "none",
		"commonness": -39.363870110303736,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.services.restaurant_amenities",
					"class": "base.services.restaurant_amenities",
					"friendly_name": "Restaurant amenities",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.services.restaurant_additions",
					"class": "base.services.restaurant_additions",
					"friendly_name": "Restaurant",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "m.0dl9dd6",
					"class": "dining.chef",
					"friendly_name": "Avi Bikszer",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.services.restaurant_amenities.restaurants_with_amenity",
					"friendly_name": "Restaurants"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.services.restaurant_additions.chef",
					"friendly_name": "Chef"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.services.restaurant_amenities . \n?x1 :type.object.type :base.services.restaurant_additions . \nVALUES ?x2 { :m.0dl9dd6 } \n?x0 :base.services.restaurant_amenities.restaurants_with_amenity ?x1 . \n?x1 :base.services.restaurant_additions.chef ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 182000400,
		"question": "what amenities does the restaurant that avi bikszer works in provide?",
		"answer": [
			"Kid Friendly",
			"Take-out food"
		],
		"function": "none",
		"commonness": -39.363870110303736,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.services.restaurant_amenities",
					"class": "base.services.restaurant_amenities",
					"friendly_name": "Restaurant amenities",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.services.restaurant_additions",
					"class": "base.services.restaurant_additions",
					"friendly_name": "Restaurant",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "m.0dl9dd6",
					"class": "dining.chef",
					"friendly_name": "Avi Bikszer",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.services.restaurant_amenities.restaurants_with_amenity",
					"friendly_name": "Restaurants"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.services.restaurant_additions.chef",
					"friendly_name": "Chef"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.services.restaurant_amenities . \n?x1 :type.object.type :base.services.restaurant_additions . \nVALUES ?x2 { :m.0dl9dd6 } \n?x0 :base.services.restaurant_amenities.restaurants_with_amenity ?x1 . \n?x1 :base.services.restaurant_additions.chef ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	}
]