[
	{
		"qid": 168000200,
		"question": "what drug brands sell sildenafil?",
		"answer": [
			"Viagra"
		],
		"function": "none",
		"commonness": -13.679433688410423,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.drug_brand",
					"class": "medicine.drug_brand",
					"friendly_name": "Drug brand",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.sildenafil",
					"class": "base.bioventurist.bv_therapeutic",
					"friendly_name": "Sildenafil",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "medicine.drug.canonical_brands",
					"friendly_name": "Canonical brands"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.drug_brand . \nVALUES ?x1 { :en.sildenafil } \n?x1 :medicine.drug.canonical_brands ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 168000201,
		"question": "what drug brands sell viagra?",
		"answer": [
			"Viagra"
		],
		"function": "none",
		"commonness": -13.679433688410423,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.drug_brand",
					"class": "medicine.drug_brand",
					"friendly_name": "Drug brand",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.sildenafil",
					"class": "base.bioventurist.bv_therapeutic",
					"friendly_name": "viagra",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "medicine.drug.canonical_brands",
					"friendly_name": "Canonical brands"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.drug_brand . \nVALUES ?x1 { :en.sildenafil } \n?x1 :medicine.drug.canonical_brands ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 168000202,
		"question": "what drug brands sell sildenafil citrate?",
		"answer": [
			"Viagra"
		],
		"function": "none",
		"commonness": -13.679433688410423,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.drug_brand",
					"class": "medicine.drug_brand",
					"friendly_name": "Drug brand",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.sildenafil",
					"class": "base.bioventurist.bv_therapeutic",
					"friendly_name": "sildenafil citrate",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "medicine.drug.canonical_brands",
					"friendly_name": "Canonical brands"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.drug_brand . \nVALUES ?x1 { :en.sildenafil } \n?x1 :medicine.drug.canonical_brands ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 168000300,
		"question": "sildenafil is sold by which drug brands?",
		"answer": [
			"Viagra"
		],
		"function": "none",
		"commonness": -13.679433688410423,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.drug_brand",
					"class": "medicine.drug_brand",
					"friendly_name": "Drug brand",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.sildenafil",
					"class": "base.bioventurist.bv_therapeutic",
					"friendly_name": "Sildenafil",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "medicine.drug.canonical_brands",
					"friendly_name": "Canonical brands"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.drug_brand . \nVALUES ?x1 { :en.sildenafil } \n?x1 :medicine.drug.canonical_brands ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 168000301,
		"question": "viagra is sold by which drug brands?",
		"answer": [
			"Viagra"
		],
		"function": "none",
		"commonness": -13.679433688410423,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.drug_brand",
					"class": "medicine.drug_brand",
					"friendly_name": "Drug brand",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.sildenafil",
					"class": "base.bioventurist.bv_therapeutic",
					"friendly_name": "viagra",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "medicine.drug.canonical_brands",
					"friendly_name": "Canonical brands"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.drug_brand . \nVALUES ?x1 { :en.sildenafil } \n?x1 :medicine.drug.canonical_brands ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 168000302,
		"question": "sildenafil citrate is sold by which drug brands?",
		"answer": [
			"Viagra"
		],
		"function": "none",
		"commonness": -13.679433688410423,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.drug_brand",
					"class": "medicine.drug_brand",
					"friendly_name": "Drug brand",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.sildenafil",
					"class": "base.bioventurist.bv_therapeutic",
					"friendly_name": "sildenafil citrate",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "medicine.drug.canonical_brands",
					"friendly_name": "Canonical brands"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.drug_brand . \nVALUES ?x1 { :en.sildenafil } \n?x1 :medicine.drug.canonical_brands ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 169000000,
		"question": "oxygen was discovered by how many people?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -15.228520790164248,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "chemistry.element_discoverer",
					"class": "chemistry.element_discoverer",
					"friendly_name": "Chemical Element Discoverer",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.oxygen",
					"class": "chemistry.chemical_element",
					"friendly_name": "Oxygen",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "chemistry.chemical_element.discoverer",
					"friendly_name": "Discoverer"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :chemistry.element_discoverer . \nVALUES ?x1 { :en.oxygen } \n?x1 :chemistry.chemical_element.discoverer ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 169000001,
		"question": "o was discovered by how many people?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -15.228520790164248,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "chemistry.element_discoverer",
					"class": "chemistry.element_discoverer",
					"friendly_name": "Chemical Element Discoverer",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.oxygen",
					"class": "chemistry.chemical_element",
					"friendly_name": "o",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "chemistry.chemical_element.discoverer",
					"friendly_name": "Discoverer"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :chemistry.element_discoverer . \nVALUES ?x1 { :en.oxygen } \n?x1 :chemistry.chemical_element.discoverer ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 169000100,
		"question": "how many people together made the discovery of oxygen?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -15.228520790164248,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "chemistry.element_discoverer",
					"class": "chemistry.element_discoverer",
					"friendly_name": "Chemical Element Discoverer",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.oxygen",
					"class": "chemistry.chemical_element",
					"friendly_name": "Oxygen",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "chemistry.chemical_element.discoverer",
					"friendly_name": "Discoverer"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :chemistry.element_discoverer . \nVALUES ?x1 { :en.oxygen } \n?x1 :chemistry.chemical_element.discoverer ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 169000101,
		"question": "how many people together made the discovery of o?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -15.228520790164248,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "chemistry.element_discoverer",
					"class": "chemistry.element_discoverer",
					"friendly_name": "Chemical Element Discoverer",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.oxygen",
					"class": "chemistry.chemical_element",
					"friendly_name": "o",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "chemistry.chemical_element.discoverer",
					"friendly_name": "Discoverer"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :chemistry.element_discoverer . \nVALUES ?x1 { :en.oxygen } \n?x1 :chemistry.chemical_element.discoverer ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 169000200,
		"question": "how many people found oxygen together?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -15.228520790164248,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "chemistry.element_discoverer",
					"class": "chemistry.element_discoverer",
					"friendly_name": "Chemical Element Discoverer",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.oxygen",
					"class": "chemistry.chemical_element",
					"friendly_name": "Oxygen",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "chemistry.chemical_element.discoverer",
					"friendly_name": "Discoverer"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :chemistry.element_discoverer . \nVALUES ?x1 { :en.oxygen } \n?x1 :chemistry.chemical_element.discoverer ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 169000201,
		"question": "how many people found o together?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -15.228520790164248,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "chemistry.element_discoverer",
					"class": "chemistry.element_discoverer",
					"friendly_name": "Chemical Element Discoverer",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.oxygen",
					"class": "chemistry.chemical_element",
					"friendly_name": "o",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "chemistry.chemical_element.discoverer",
					"friendly_name": "Discoverer"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :chemistry.element_discoverer . \nVALUES ?x1 { :en.oxygen } \n?x1 :chemistry.chemical_element.discoverer ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 169000300,
		"question": "the discovery of oxygen was made by how many people?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -15.228520790164248,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "chemistry.element_discoverer",
					"class": "chemistry.element_discoverer",
					"friendly_name": "Chemical Element Discoverer",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.oxygen",
					"class": "chemistry.chemical_element",
					"friendly_name": "Oxygen",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "chemistry.chemical_element.discoverer",
					"friendly_name": "Discoverer"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :chemistry.element_discoverer . \nVALUES ?x1 { :en.oxygen } \n?x1 :chemistry.chemical_element.discoverer ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 169000301,
		"question": "the discovery of o was made by how many people?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -15.228520790164248,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "chemistry.element_discoverer",
					"class": "chemistry.element_discoverer",
					"friendly_name": "Chemical Element Discoverer",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.oxygen",
					"class": "chemistry.chemical_element",
					"friendly_name": "o",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "chemistry.chemical_element.discoverer",
					"friendly_name": "Discoverer"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :chemistry.element_discoverer . \nVALUES ?x1 { :en.oxygen } \n?x1 :chemistry.chemical_element.discoverer ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 169000400,
		"question": "how many people were involved in the discovery of oxygen?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -15.228520790164248,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "chemistry.element_discoverer",
					"class": "chemistry.element_discoverer",
					"friendly_name": "Chemical Element Discoverer",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.oxygen",
					"class": "chemistry.chemical_element",
					"friendly_name": "Oxygen",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "chemistry.chemical_element.discoverer",
					"friendly_name": "Discoverer"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :chemistry.element_discoverer . \nVALUES ?x1 { :en.oxygen } \n?x1 :chemistry.chemical_element.discoverer ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 169000401,
		"question": "how many people were involved in the discovery of o?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -15.228520790164248,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "chemistry.element_discoverer",
					"class": "chemistry.element_discoverer",
					"friendly_name": "Chemical Element Discoverer",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.oxygen",
					"class": "chemistry.chemical_element",
					"friendly_name": "o",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "chemistry.chemical_element.discoverer",
					"friendly_name": "Discoverer"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :chemistry.element_discoverer . \nVALUES ?x1 { :en.oxygen } \n?x1 :chemistry.chemical_element.discoverer ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 169000500,
		"question": "how many people made the 1st discovery of oxygen?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -15.228520790164248,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "chemistry.element_discoverer",
					"class": "chemistry.element_discoverer",
					"friendly_name": "Chemical Element Discoverer",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.oxygen",
					"class": "chemistry.chemical_element",
					"friendly_name": "Oxygen",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "chemistry.chemical_element.discoverer",
					"friendly_name": "Discoverer"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :chemistry.element_discoverer . \nVALUES ?x1 { :en.oxygen } \n?x1 :chemistry.chemical_element.discoverer ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 169000501,
		"question": "how many people made the 1st discovery of o?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -15.228520790164248,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "chemistry.element_discoverer",
					"class": "chemistry.element_discoverer",
					"friendly_name": "Chemical Element Discoverer",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.oxygen",
					"class": "chemistry.chemical_element",
					"friendly_name": "o",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "chemistry.chemical_element.discoverer",
					"friendly_name": "Discoverer"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :chemistry.element_discoverer . \nVALUES ?x1 { :en.oxygen } \n?x1 :chemistry.chemical_element.discoverer ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 170000000,
		"question": "which musicians had a music career that was contained entirely within 1991?",
		"answer": [
			"V2",
			"Pokerlaget",
			"Corporate Art",
			"Crossfire",
			"Inner City Posse",
			"Millenium",
			"Ray & Porcell"
		],
		"function": "none",
		"commonness": -16.45200066384777,
		"num_node": 2,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.artist",
					"class": "music.artist",
					"friendly_name": "Musical Artist",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "1991^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "1991",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "music.artist.active_end",
					"friendly_name": "Active as Musical Artist (end)"
				},
				{
					"start": 0,
					"end": 1,
					"relation": "music.artist.active_start",
					"friendly_name": "Active as Musical Artist (start)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.artist . \nVALUES ?x1 { \"1991\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?x0 :music.artist.active_end ?x1 . \n?x0 :music.artist.active_start ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 170000100,
		"question": "in 1991, which musical artists both started and ended their music career?",
		"answer": [
			"V2",
			"Pokerlaget",
			"Ray & Porcell",
			"Millenium",
			"Inner City Posse",
			"Corporate Art",
			"Crossfire"
		],
		"function": "none",
		"commonness": -16.45200066384777,
		"num_node": 2,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.artist",
					"class": "music.artist",
					"friendly_name": "Musical Artist",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "1991^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "1991",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "music.artist.active_end",
					"friendly_name": "Active as Musical Artist (end)"
				},
				{
					"start": 0,
					"end": 1,
					"relation": "music.artist.active_start",
					"friendly_name": "Active as Musical Artist (start)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.artist . \nVALUES ?x1 { \"1991\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?x0 :music.artist.active_end ?x1 . \n?x0 :music.artist.active_start ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 170000200,
		"question": "in 1991 which musicians both started and ended their music career?",
		"answer": [
			"Millenium",
			"Ray & Porcell",
			"Pokerlaget",
			"V2",
			"Crossfire",
			"Corporate Art",
			"Inner City Posse"
		],
		"function": "none",
		"commonness": -16.45200066384777,
		"num_node": 2,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.artist",
					"class": "music.artist",
					"friendly_name": "Musical Artist",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "1991^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "1991",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "music.artist.active_end",
					"friendly_name": "Active as Musical Artist (end)"
				},
				{
					"start": 0,
					"end": 1,
					"relation": "music.artist.active_start",
					"friendly_name": "Active as Musical Artist (start)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.artist . \nVALUES ?x1 { \"1991\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?x0 :music.artist.active_end ?x1 . \n?x0 :music.artist.active_start ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 170000300,
		"question": "which musicians started and ended their music career both in 1991?",
		"answer": [
			"Corporate Art",
			"Crossfire",
			"Millenium",
			"Pokerlaget",
			"V2",
			"Ray & Porcell",
			"Inner City Posse"
		],
		"function": "none",
		"commonness": -16.45200066384777,
		"num_node": 2,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.artist",
					"class": "music.artist",
					"friendly_name": "Musical Artist",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "1991^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "1991",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "music.artist.active_end",
					"friendly_name": "Active as Musical Artist (end)"
				},
				{
					"start": 0,
					"end": 1,
					"relation": "music.artist.active_start",
					"friendly_name": "Active as Musical Artist (start)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.artist . \nVALUES ?x1 { \"1991\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?x0 :music.artist.active_end ?x1 . \n?x0 :music.artist.active_start ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 171000000,
		"question": "in 2000 which roller coaster was both opened and closed?",
		"answer": [
			"Tom y Jerry"
		],
		"function": "none",
		"commonness": -22.39014663901147,
		"num_node": 2,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "amusement_parks.roller_coaster",
					"class": "amusement_parks.roller_coaster",
					"friendly_name": "Roller Coaster",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "2000^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "2000",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "amusement_parks.ride.closed",
					"friendly_name": "Closed"
				},
				{
					"start": 0,
					"end": 1,
					"relation": "amusement_parks.ride.opened",
					"friendly_name": "Opened"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :amusement_parks.roller_coaster . \nVALUES ?x1 { \"2000\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?x0 :amusement_parks.ride.closed ?x1 . \n?x0 :amusement_parks.ride.opened ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 171000100,
		"question": "in 2000, what roller coaster began operations and then stopped all in the same year?",
		"answer": [
			"Tom y Jerry"
		],
		"function": "none",
		"commonness": -22.39014663901147,
		"num_node": 2,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "amusement_parks.roller_coaster",
					"class": "amusement_parks.roller_coaster",
					"friendly_name": "Roller Coaster",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "2000^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "2000",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "amusement_parks.ride.closed",
					"friendly_name": "Closed"
				},
				{
					"start": 0,
					"end": 1,
					"relation": "amusement_parks.ride.opened",
					"friendly_name": "Opened"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :amusement_parks.roller_coaster . \nVALUES ?x1 { \"2000\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?x0 :amusement_parks.ride.closed ?x1 . \n?x0 :amusement_parks.ride.opened ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]