[
	{
		"qid": 160000201,
		"question": "windows was developed by who?",
		"answer": [
			"Microsoft"
		],
		"function": "none",
		"commonness": -9.49162595443204,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.operating_system_developer",
					"class": "computer.operating_system_developer",
					"friendly_name": "Operating System Developer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.microsoft_windows",
					"class": "computer.operating_system",
					"friendly_name": "windows",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "computer.operating_system_developer.operating_systems_developed",
					"friendly_name": "Operating Systems Developed"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.operating_system_developer . \nVALUES ?x1 { :en.microsoft_windows } \n?x0 :computer.operating_system_developer.operating_systems_developed ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 160000202,
		"question": "ms windows was developed by who?",
		"answer": [
			"Microsoft"
		],
		"function": "none",
		"commonness": -9.49162595443204,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.operating_system_developer",
					"class": "computer.operating_system_developer",
					"friendly_name": "Operating System Developer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.microsoft_windows",
					"class": "computer.operating_system",
					"friendly_name": "ms windows",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "computer.operating_system_developer.operating_systems_developed",
					"friendly_name": "Operating Systems Developed"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.operating_system_developer . \nVALUES ?x1 { :en.microsoft_windows } \n?x0 :computer.operating_system_developer.operating_systems_developed ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 160000300,
		"question": "who developed the os microsoft windows?",
		"answer": [
			"Microsoft"
		],
		"function": "none",
		"commonness": -9.49162595443204,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.operating_system_developer",
					"class": "computer.operating_system_developer",
					"friendly_name": "Operating System Developer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.microsoft_windows",
					"class": "computer.operating_system",
					"friendly_name": "Microsoft Windows",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "computer.operating_system_developer.operating_systems_developed",
					"friendly_name": "Operating Systems Developed"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.operating_system_developer . \nVALUES ?x1 { :en.microsoft_windows } \n?x0 :computer.operating_system_developer.operating_systems_developed ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 160000301,
		"question": "who developed the os windows?",
		"answer": [
			"Microsoft"
		],
		"function": "none",
		"commonness": -9.49162595443204,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.operating_system_developer",
					"class": "computer.operating_system_developer",
					"friendly_name": "Operating System Developer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.microsoft_windows",
					"class": "computer.operating_system",
					"friendly_name": "windows",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "computer.operating_system_developer.operating_systems_developed",
					"friendly_name": "Operating Systems Developed"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.operating_system_developer . \nVALUES ?x1 { :en.microsoft_windows } \n?x0 :computer.operating_system_developer.operating_systems_developed ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 160000302,
		"question": "who developed the os ms windows?",
		"answer": [
			"Microsoft"
		],
		"function": "none",
		"commonness": -9.49162595443204,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.operating_system_developer",
					"class": "computer.operating_system_developer",
					"friendly_name": "Operating System Developer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.microsoft_windows",
					"class": "computer.operating_system",
					"friendly_name": "ms windows",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "computer.operating_system_developer.operating_systems_developed",
					"friendly_name": "Operating Systems Developed"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.operating_system_developer . \nVALUES ?x1 { :en.microsoft_windows } \n?x0 :computer.operating_system_developer.operating_systems_developed ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 161000000,
		"question": "which legal cases are handled by antonin scalia?",
		"answer": [
			"Dolan v. United States Postal Service"
		],
		"function": "none",
		"commonness": -15.566042557592123,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.legal_case",
					"class": "law.legal_case",
					"friendly_name": "Legal case",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.antonin_scalia",
					"class": "law.judge",
					"friendly_name": "Antonin Scalia",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.judge.cases",
					"friendly_name": "Cases"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.legal_case . \nVALUES ?x1 { :en.antonin_scalia } \n?x1 :law.judge.cases ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 161000001,
		"question": "which legal cases are handled by justice scalia?",
		"answer": [
			"Dolan v. United States Postal Service"
		],
		"function": "none",
		"commonness": -15.566042557592123,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.legal_case",
					"class": "law.legal_case",
					"friendly_name": "Legal case",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.antonin_scalia",
					"class": "law.judge",
					"friendly_name": "justice scalia",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.judge.cases",
					"friendly_name": "Cases"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.legal_case . \nVALUES ?x1 { :en.antonin_scalia } \n?x1 :law.judge.cases ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 161000002,
		"question": "which legal cases are handled by justice antonin scalia?",
		"answer": [
			"Dolan v. United States Postal Service"
		],
		"function": "none",
		"commonness": -15.566042557592123,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.legal_case",
					"class": "law.legal_case",
					"friendly_name": "Legal case",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.antonin_scalia",
					"class": "law.judge",
					"friendly_name": "justice antonin scalia",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.judge.cases",
					"friendly_name": "Cases"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.legal_case . \nVALUES ?x1 { :en.antonin_scalia } \n?x1 :law.judge.cases ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 161000100,
		"question": "what cases has antonin scalia sat on?",
		"answer": [
			"Dolan v. United States Postal Service"
		],
		"function": "none",
		"commonness": -15.566042557592123,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.legal_case",
					"class": "law.legal_case",
					"friendly_name": "Legal case",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.antonin_scalia",
					"class": "law.judge",
					"friendly_name": "Antonin Scalia",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.judge.cases",
					"friendly_name": "Cases"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.legal_case . \nVALUES ?x1 { :en.antonin_scalia } \n?x1 :law.judge.cases ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 161000101,
		"question": "what cases has justice scalia sat on?",
		"answer": [
			"Dolan v. United States Postal Service"
		],
		"function": "none",
		"commonness": -15.566042557592123,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.legal_case",
					"class": "law.legal_case",
					"friendly_name": "Legal case",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.antonin_scalia",
					"class": "law.judge",
					"friendly_name": "justice scalia",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.judge.cases",
					"friendly_name": "Cases"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.legal_case . \nVALUES ?x1 { :en.antonin_scalia } \n?x1 :law.judge.cases ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 161000102,
		"question": "what cases has justice antonin scalia sat on?",
		"answer": [
			"Dolan v. United States Postal Service"
		],
		"function": "none",
		"commonness": -15.566042557592123,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.legal_case",
					"class": "law.legal_case",
					"friendly_name": "Legal case",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.antonin_scalia",
					"class": "law.judge",
					"friendly_name": "justice antonin scalia",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.judge.cases",
					"friendly_name": "Cases"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.legal_case . \nVALUES ?x1 { :en.antonin_scalia } \n?x1 :law.judge.cases ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 161000200,
		"question": "which cases has antonin scalia presided over?",
		"answer": [
			"Dolan v. United States Postal Service"
		],
		"function": "none",
		"commonness": -15.566042557592123,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.legal_case",
					"class": "law.legal_case",
					"friendly_name": "Legal case",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.antonin_scalia",
					"class": "law.judge",
					"friendly_name": "Antonin Scalia",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.judge.cases",
					"friendly_name": "Cases"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.legal_case . \nVALUES ?x1 { :en.antonin_scalia } \n?x1 :law.judge.cases ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 161000201,
		"question": "which cases has justice scalia presided over?",
		"answer": [
			"Dolan v. United States Postal Service"
		],
		"function": "none",
		"commonness": -15.566042557592123,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.legal_case",
					"class": "law.legal_case",
					"friendly_name": "Legal case",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.antonin_scalia",
					"class": "law.judge",
					"friendly_name": "justice scalia",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.judge.cases",
					"friendly_name": "Cases"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.legal_case . \nVALUES ?x1 { :en.antonin_scalia } \n?x1 :law.judge.cases ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 162000000,
		"question": "how many people were involved in the founding of google?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -7.274886300832824,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "organization.organization_founder",
					"class": "organization.organization_founder",
					"friendly_name": "Organization founder",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.google",
					"class": "organization.organization",
					"friendly_name": "Google",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "organization.organization_founder.organizations_founded",
					"friendly_name": "Organizations founded"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :organization.organization_founder . \nVALUES ?x1 { :en.google } \n?x0 :organization.organization_founder.organizations_founded ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 162000001,
		"question": "how many people were involved in the founding of google inc?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -7.274886300832824,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "organization.organization_founder",
					"class": "organization.organization_founder",
					"friendly_name": "Organization founder",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.google",
					"class": "organization.organization",
					"friendly_name": "google inc",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "organization.organization_founder.organizations_founded",
					"friendly_name": "Organizations founded"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :organization.organization_founder . \nVALUES ?x1 { :en.google } \n?x0 :organization.organization_founder.organizations_founded ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 162000100,
		"question": "google was founded by how many people?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -7.274886300832824,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "organization.organization_founder",
					"class": "organization.organization_founder",
					"friendly_name": "Organization founder",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.google",
					"class": "organization.organization",
					"friendly_name": "Google",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "organization.organization_founder.organizations_founded",
					"friendly_name": "Organizations founded"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :organization.organization_founder . \nVALUES ?x1 { :en.google } \n?x0 :organization.organization_founder.organizations_founded ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 162000101,
		"question": "google inc was founded by how many people?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -7.274886300832824,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "organization.organization_founder",
					"class": "organization.organization_founder",
					"friendly_name": "Organization founder",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.google",
					"class": "organization.organization",
					"friendly_name": "google inc",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "organization.organization_founder.organizations_founded",
					"friendly_name": "Organizations founded"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :organization.organization_founder . \nVALUES ?x1 { :en.google } \n?x0 :organization.organization_founder.organizations_founded ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 162000200,
		"question": "how many founders does google have?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -7.274886300832824,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "organization.organization_founder",
					"class": "organization.organization_founder",
					"friendly_name": "Organization founder",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.google",
					"class": "organization.organization",
					"friendly_name": "Google",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "organization.organization_founder.organizations_founded",
					"friendly_name": "Organizations founded"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :organization.organization_founder . \nVALUES ?x1 { :en.google } \n?x0 :organization.organization_founder.organizations_founded ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 162000201,
		"question": "how many founders does google inc have?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -7.274886300832824,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "organization.organization_founder",
					"class": "organization.organization_founder",
					"friendly_name": "Organization founder",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.google",
					"class": "organization.organization",
					"friendly_name": "google inc",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "organization.organization_founder.organizations_founded",
					"friendly_name": "Organizations founded"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :organization.organization_founder . \nVALUES ?x1 { :en.google } \n?x0 :organization.organization_founder.organizations_founded ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 162000300,
		"question": "what is the number of founder of google?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -7.274886300832824,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "organization.organization_founder",
					"class": "organization.organization_founder",
					"friendly_name": "Organization founder",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.google",
					"class": "organization.organization",
					"friendly_name": "Google",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "organization.organization_founder.organizations_founded",
					"friendly_name": "Organizations founded"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :organization.organization_founder . \nVALUES ?x1 { :en.google } \n?x0 :organization.organization_founder.organizations_founded ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 162000301,
		"question": "what is the number of founder of google inc?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -7.274886300832824,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "organization.organization_founder",
					"class": "organization.organization_founder",
					"friendly_name": "Organization founder",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.google",
					"class": "organization.organization",
					"friendly_name": "google inc",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "organization.organization_founder.organizations_founded",
					"friendly_name": "Organizations founded"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :organization.organization_founder . \nVALUES ?x1 { :en.google } \n?x0 :organization.organization_founder.organizations_founded ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 162000400,
		"question": "how many people founded google?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -7.274886300832824,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "organization.organization_founder",
					"class": "organization.organization_founder",
					"friendly_name": "Organization founder",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.google",
					"class": "organization.organization",
					"friendly_name": "Google",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "organization.organization_founder.organizations_founded",
					"friendly_name": "Organizations founded"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :organization.organization_founder . \nVALUES ?x1 { :en.google } \n?x0 :organization.organization_founder.organizations_founded ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 162000401,
		"question": "how many people founded google inc?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -7.274886300832824,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "organization.organization_founder",
					"class": "organization.organization_founder",
					"friendly_name": "Organization founder",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.google",
					"class": "organization.organization",
					"friendly_name": "google inc",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "organization.organization_founder.organizations_founded",
					"friendly_name": "Organizations founded"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :organization.organization_founder . \nVALUES ?x1 { :en.google } \n?x0 :organization.organization_founder.organizations_founded ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 162000500,
		"question": "how many co-founders of google are there?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -7.274886300832824,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "organization.organization_founder",
					"class": "organization.organization_founder",
					"friendly_name": "Organization founder",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.google",
					"class": "organization.organization",
					"friendly_name": "Google",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "organization.organization_founder.organizations_founded",
					"friendly_name": "Organizations founded"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :organization.organization_founder . \nVALUES ?x1 { :en.google } \n?x0 :organization.organization_founder.organizations_founded ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]