[
	{
		"qid": 53000200,
		"question": "what ad targeting techniques are utilized by adsense?",
		"answer": [
			"Contextual advertising"
		],
		"function": "none",
		"commonness": -17.96881996053463,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.onlineadvertising.ad_targeting_method",
					"class": "base.onlineadvertising.ad_targeting_method",
					"friendly_name": "Ad Targeting Method",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.adsense",
					"class": "base.onlineadvertising.ad_network",
					"friendly_name": "AdSense",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.onlineadvertising.ad_network.targeting_method",
					"friendly_name": "Ad targeting method"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.onlineadvertising.ad_targeting_method . \nVALUES ?x1 { :en.adsense } \n?x1 :base.onlineadvertising.ad_network.targeting_method ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 53000201,
		"question": "what ad targeting techniques are utilized by google adsense?",
		"answer": [
			"Contextual advertising"
		],
		"function": "none",
		"commonness": -17.96881996053463,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.onlineadvertising.ad_targeting_method",
					"class": "base.onlineadvertising.ad_targeting_method",
					"friendly_name": "Ad Targeting Method",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.adsense",
					"class": "base.onlineadvertising.ad_network",
					"friendly_name": "google adsense",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.onlineadvertising.ad_network.targeting_method",
					"friendly_name": "Ad targeting method"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.onlineadvertising.ad_targeting_method . \nVALUES ?x1 { :en.adsense } \n?x1 :base.onlineadvertising.ad_network.targeting_method ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 53000202,
		"question": "what ad targeting techniques are utilized by google ads?",
		"answer": [
			"Contextual advertising"
		],
		"function": "none",
		"commonness": -17.96881996053463,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.onlineadvertising.ad_targeting_method",
					"class": "base.onlineadvertising.ad_targeting_method",
					"friendly_name": "Ad Targeting Method",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.adsense",
					"class": "base.onlineadvertising.ad_network",
					"friendly_name": "google ads",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.onlineadvertising.ad_network.targeting_method",
					"friendly_name": "Ad targeting method"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.onlineadvertising.ad_targeting_method . \nVALUES ?x1 { :en.adsense } \n?x1 :base.onlineadvertising.ad_network.targeting_method ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 53000300,
		"question": "how can one identify advertisement targets using adsense?",
		"answer": [
			"Contextual advertising"
		],
		"function": "none",
		"commonness": -17.96881996053463,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.onlineadvertising.ad_targeting_method",
					"class": "base.onlineadvertising.ad_targeting_method",
					"friendly_name": "Ad Targeting Method",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.adsense",
					"class": "base.onlineadvertising.ad_network",
					"friendly_name": "AdSense",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.onlineadvertising.ad_network.targeting_method",
					"friendly_name": "Ad targeting method"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.onlineadvertising.ad_targeting_method . \nVALUES ?x1 { :en.adsense } \n?x1 :base.onlineadvertising.ad_network.targeting_method ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 53000301,
		"question": "how can one identify advertisement targets using google adsense?",
		"answer": [
			"Contextual advertising"
		],
		"function": "none",
		"commonness": -17.96881996053463,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.onlineadvertising.ad_targeting_method",
					"class": "base.onlineadvertising.ad_targeting_method",
					"friendly_name": "Ad Targeting Method",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.adsense",
					"class": "base.onlineadvertising.ad_network",
					"friendly_name": "google adsense",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.onlineadvertising.ad_network.targeting_method",
					"friendly_name": "Ad targeting method"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.onlineadvertising.ad_targeting_method . \nVALUES ?x1 { :en.adsense } \n?x1 :base.onlineadvertising.ad_network.targeting_method ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 53000302,
		"question": "how can one identify advertisement targets using google ads?",
		"answer": [
			"Contextual advertising"
		],
		"function": "none",
		"commonness": -17.96881996053463,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.onlineadvertising.ad_targeting_method",
					"class": "base.onlineadvertising.ad_targeting_method",
					"friendly_name": "Ad Targeting Method",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.adsense",
					"class": "base.onlineadvertising.ad_network",
					"friendly_name": "google ads",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.onlineadvertising.ad_network.targeting_method",
					"friendly_name": "Ad targeting method"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.onlineadvertising.ad_targeting_method . \nVALUES ?x1 { :en.adsense } \n?x1 :base.onlineadvertising.ad_network.targeting_method ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 54000000,
		"question": "which materials were used to manufacture the morgan dollar?",
		"answer": [
			"Silver .900 silver .100 copper"
		],
		"function": "none",
		"commonness": -17.09280212420446,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.coinsdaily.composition",
					"class": "base.coinsdaily.composition",
					"friendly_name": "coin composition",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.morgan_dollar",
					"class": "base.coinsdaily.coin_type",
					"friendly_name": "Morgan dollar",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.coinsdaily.coin_type.composition",
					"friendly_name": "composition"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.coinsdaily.composition . \nVALUES ?x1 { :en.morgan_dollar } \n?x1 :base.coinsdaily.coin_type.composition ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 54000001,
		"question": "which materials were used to manufacture the morgan silver dollar?",
		"answer": [
			"Silver .900 silver .100 copper"
		],
		"function": "none",
		"commonness": -17.09280212420446,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.coinsdaily.composition",
					"class": "base.coinsdaily.composition",
					"friendly_name": "coin composition",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.morgan_dollar",
					"class": "base.coinsdaily.coin_type",
					"friendly_name": "morgan silver dollar",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.coinsdaily.coin_type.composition",
					"friendly_name": "composition"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.coinsdaily.composition . \nVALUES ?x1 { :en.morgan_dollar } \n?x1 :base.coinsdaily.coin_type.composition ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 54000100,
		"question": "what materials are used in the morgan dollar?",
		"answer": [
			"Silver .900 silver .100 copper"
		],
		"function": "none",
		"commonness": -17.09280212420446,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.coinsdaily.composition",
					"class": "base.coinsdaily.composition",
					"friendly_name": "coin composition",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.morgan_dollar",
					"class": "base.coinsdaily.coin_type",
					"friendly_name": "Morgan dollar",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.coinsdaily.coin_type.composition",
					"friendly_name": "composition"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.coinsdaily.composition . \nVALUES ?x1 { :en.morgan_dollar } \n?x1 :base.coinsdaily.coin_type.composition ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 54000101,
		"question": "what materials are used in the morgan silver dollar?",
		"answer": [
			"Silver .900 silver .100 copper"
		],
		"function": "none",
		"commonness": -17.09280212420446,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.coinsdaily.composition",
					"class": "base.coinsdaily.composition",
					"friendly_name": "coin composition",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.morgan_dollar",
					"class": "base.coinsdaily.coin_type",
					"friendly_name": "morgan silver dollar",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.coinsdaily.coin_type.composition",
					"friendly_name": "composition"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.coinsdaily.composition . \nVALUES ?x1 { :en.morgan_dollar } \n?x1 :base.coinsdaily.coin_type.composition ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 54000200,
		"question": "morgan dollar is made from what?",
		"answer": [
			"Silver .900 silver .100 copper"
		],
		"function": "none",
		"commonness": -17.09280212420446,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.coinsdaily.composition",
					"class": "base.coinsdaily.composition",
					"friendly_name": "coin composition",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.morgan_dollar",
					"class": "base.coinsdaily.coin_type",
					"friendly_name": "Morgan dollar",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.coinsdaily.coin_type.composition",
					"friendly_name": "composition"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.coinsdaily.composition . \nVALUES ?x1 { :en.morgan_dollar } \n?x1 :base.coinsdaily.coin_type.composition ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 54000201,
		"question": "morgan silver dollar is made from what?",
		"answer": [
			"Silver .900 silver .100 copper"
		],
		"function": "none",
		"commonness": -17.09280212420446,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.coinsdaily.composition",
					"class": "base.coinsdaily.composition",
					"friendly_name": "coin composition",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.morgan_dollar",
					"class": "base.coinsdaily.coin_type",
					"friendly_name": "morgan silver dollar",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.coinsdaily.coin_type.composition",
					"friendly_name": "composition"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.coinsdaily.composition . \nVALUES ?x1 { :en.morgan_dollar } \n?x1 :base.coinsdaily.coin_type.composition ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 54000300,
		"question": "what is the morgan dollar made of?",
		"answer": [
			"Silver .900 silver .100 copper"
		],
		"function": "none",
		"commonness": -17.09280212420446,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.coinsdaily.composition",
					"class": "base.coinsdaily.composition",
					"friendly_name": "coin composition",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.morgan_dollar",
					"class": "base.coinsdaily.coin_type",
					"friendly_name": "Morgan dollar",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.coinsdaily.coin_type.composition",
					"friendly_name": "composition"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.coinsdaily.composition . \nVALUES ?x1 { :en.morgan_dollar } \n?x1 :base.coinsdaily.coin_type.composition ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 54000301,
		"question": "what is the morgan silver dollar made of?",
		"answer": [
			"Silver .900 silver .100 copper"
		],
		"function": "none",
		"commonness": -17.09280212420446,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.coinsdaily.composition",
					"class": "base.coinsdaily.composition",
					"friendly_name": "coin composition",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.morgan_dollar",
					"class": "base.coinsdaily.coin_type",
					"friendly_name": "morgan silver dollar",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.coinsdaily.coin_type.composition",
					"friendly_name": "composition"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.coinsdaily.composition . \nVALUES ?x1 { :en.morgan_dollar } \n?x1 :base.coinsdaily.coin_type.composition ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 55000000,
		"question": "what classifications do lilium organisms derive from?",
		"answer": [
			"Liliaceae"
		],
		"function": "none",
		"commonness": -11.26736244928001,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.organism_classification",
					"class": "biology.organism_classification",
					"friendly_name": "Organism Classification",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.lilium",
					"class": "biology.organism_classification",
					"friendly_name": "Lilium",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.organism_classification.lower_classifications",
					"friendly_name": "Lower classifications"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.organism_classification . \nVALUES ?x1 { :en.lilium } \n?x0 :biology.organism_classification.lower_classifications ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 55000001,
		"question": "what classifications do lily organisms derive from?",
		"answer": [
			"Liliaceae"
		],
		"function": "none",
		"commonness": -11.26736244928001,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.organism_classification",
					"class": "biology.organism_classification",
					"friendly_name": "Organism Classification",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.lilium",
					"class": "biology.organism_classification",
					"friendly_name": "lily",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.organism_classification.lower_classifications",
					"friendly_name": "Lower classifications"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.organism_classification . \nVALUES ?x1 { :en.lilium } \n?x0 :biology.organism_classification.lower_classifications ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 55000002,
		"question": "what classifications do lilies organisms derive from?",
		"answer": [
			"Liliaceae"
		],
		"function": "none",
		"commonness": -11.26736244928001,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.organism_classification",
					"class": "biology.organism_classification",
					"friendly_name": "Organism Classification",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.lilium",
					"class": "biology.organism_classification",
					"friendly_name": "lilies",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.organism_classification.lower_classifications",
					"friendly_name": "Lower classifications"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.organism_classification . \nVALUES ?x1 { :en.lilium } \n?x0 :biology.organism_classification.lower_classifications ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 55000100,
		"question": "what organism classification is one level above lilium?",
		"answer": [
			"Liliaceae"
		],
		"function": "none",
		"commonness": -11.26736244928001,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.organism_classification",
					"class": "biology.organism_classification",
					"friendly_name": "Organism Classification",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.lilium",
					"class": "biology.organism_classification",
					"friendly_name": "Lilium",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.organism_classification.lower_classifications",
					"friendly_name": "Lower classifications"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.organism_classification . \nVALUES ?x1 { :en.lilium } \n?x0 :biology.organism_classification.lower_classifications ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 55000101,
		"question": "what organism classification is one level above lily?",
		"answer": [
			"Liliaceae"
		],
		"function": "none",
		"commonness": -11.26736244928001,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.organism_classification",
					"class": "biology.organism_classification",
					"friendly_name": "Organism Classification",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.lilium",
					"class": "biology.organism_classification",
					"friendly_name": "lily",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.organism_classification.lower_classifications",
					"friendly_name": "Lower classifications"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.organism_classification . \nVALUES ?x1 { :en.lilium } \n?x0 :biology.organism_classification.lower_classifications ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 55000102,
		"question": "what organism classification is one level above lilies?",
		"answer": [
			"Liliaceae"
		],
		"function": "none",
		"commonness": -11.26736244928001,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.organism_classification",
					"class": "biology.organism_classification",
					"friendly_name": "Organism Classification",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.lilium",
					"class": "biology.organism_classification",
					"friendly_name": "lilies",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.organism_classification.lower_classifications",
					"friendly_name": "Lower classifications"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.organism_classification . \nVALUES ?x1 { :en.lilium } \n?x0 :biology.organism_classification.lower_classifications ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 55000200,
		"question": "lilium has which parent classifications?",
		"answer": [
			"Liliaceae"
		],
		"function": "none",
		"commonness": -11.26736244928001,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.organism_classification",
					"class": "biology.organism_classification",
					"friendly_name": "Organism Classification",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.lilium",
					"class": "biology.organism_classification",
					"friendly_name": "Lilium",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.organism_classification.lower_classifications",
					"friendly_name": "Lower classifications"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.organism_classification . \nVALUES ?x1 { :en.lilium } \n?x0 :biology.organism_classification.lower_classifications ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 55000201,
		"question": "lily has which parent classifications?",
		"answer": [
			"Liliaceae"
		],
		"function": "none",
		"commonness": -11.26736244928001,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.organism_classification",
					"class": "biology.organism_classification",
					"friendly_name": "Organism Classification",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.lilium",
					"class": "biology.organism_classification",
					"friendly_name": "lily",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.organism_classification.lower_classifications",
					"friendly_name": "Lower classifications"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.organism_classification . \nVALUES ?x1 { :en.lilium } \n?x0 :biology.organism_classification.lower_classifications ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 55000202,
		"question": "lilies has which parent classifications?",
		"answer": [
			"Liliaceae"
		],
		"function": "none",
		"commonness": -11.26736244928001,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.organism_classification",
					"class": "biology.organism_classification",
					"friendly_name": "Organism Classification",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.lilium",
					"class": "biology.organism_classification",
					"friendly_name": "lilies",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.organism_classification.lower_classifications",
					"friendly_name": "Lower classifications"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.organism_classification . \nVALUES ?x1 { :en.lilium } \n?x0 :biology.organism_classification.lower_classifications ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 56000000,
		"question": "google has what organizational sectors?",
		"answer": [
			"Software",
			"Telecommunications equipment",
			"The Internet"
		],
		"function": "none",
		"commonness": -9.222912598266827,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "organization.organization_sector",
					"class": "organization.organization_sector",
					"friendly_name": "Organization sector",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.google",
					"class": "organization.organization",
					"friendly_name": "Google",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "organization.organization.sectors",
					"friendly_name": "Sectors"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :organization.organization_sector . \nVALUES ?x1 { :en.google } \n?x1 :organization.organization.sectors ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]