[
	{
		"qid": 137000000,
		"question": "what is the total of lyrics written by william shakespeare?",
		"answer": [
			"53"
		],
		"function": "count",
		"commonness": -11.676454221015156,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.composition",
					"class": "music.composition",
					"friendly_name": "Composition",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.william_shakespeare",
					"class": "music.lyricist",
					"friendly_name": "William Shakespeare",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "music.lyricist.lyrics_written",
					"friendly_name": "Lyrics Written"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.composition . \nVALUES ?x1 { :en.william_shakespeare } \n?x1 :music.lyricist.lyrics_written ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 137000001,
		"question": "what is the total of lyrics written by shakespeare?",
		"answer": [
			"53"
		],
		"function": "count",
		"commonness": -11.676454221015156,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.composition",
					"class": "music.composition",
					"friendly_name": "Composition",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.william_shakespeare",
					"class": "music.lyricist",
					"friendly_name": "shakespeare",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "music.lyricist.lyrics_written",
					"friendly_name": "Lyrics Written"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.composition . \nVALUES ?x1 { :en.william_shakespeare } \n?x1 :music.lyricist.lyrics_written ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 137000002,
		"question": "what is the total of lyrics written by shakspeare?",
		"answer": [
			"53"
		],
		"function": "count",
		"commonness": -11.676454221015156,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.composition",
					"class": "music.composition",
					"friendly_name": "Composition",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.william_shakespeare",
					"class": "music.lyricist",
					"friendly_name": "shakspeare",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "music.lyricist.lyrics_written",
					"friendly_name": "Lyrics Written"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.composition . \nVALUES ?x1 { :en.william_shakespeare } \n?x1 :music.lyricist.lyrics_written ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 137000100,
		"question": "how many works did william shakespeare write lyrics for?",
		"answer": [
			"53"
		],
		"function": "count",
		"commonness": -11.676454221015156,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.composition",
					"class": "music.composition",
					"friendly_name": "Composition",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.william_shakespeare",
					"class": "music.lyricist",
					"friendly_name": "William Shakespeare",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "music.lyricist.lyrics_written",
					"friendly_name": "Lyrics Written"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.composition . \nVALUES ?x1 { :en.william_shakespeare } \n?x1 :music.lyricist.lyrics_written ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 137000101,
		"question": "how many works did shakespeare write lyrics for?",
		"answer": [
			"53"
		],
		"function": "count",
		"commonness": -11.676454221015156,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.composition",
					"class": "music.composition",
					"friendly_name": "Composition",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.william_shakespeare",
					"class": "music.lyricist",
					"friendly_name": "shakespeare",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "music.lyricist.lyrics_written",
					"friendly_name": "Lyrics Written"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.composition . \nVALUES ?x1 { :en.william_shakespeare } \n?x1 :music.lyricist.lyrics_written ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 137000200,
		"question": "william shakespeare has written how many lyrics?",
		"answer": [
			"53"
		],
		"function": "count",
		"commonness": -11.676454221015156,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.composition",
					"class": "music.composition",
					"friendly_name": "Composition",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.william_shakespeare",
					"class": "music.lyricist",
					"friendly_name": "William Shakespeare",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "music.lyricist.lyrics_written",
					"friendly_name": "Lyrics Written"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.composition . \nVALUES ?x1 { :en.william_shakespeare } \n?x1 :music.lyricist.lyrics_written ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 137000201,
		"question": "shakespeare has written how many lyrics?",
		"answer": [
			"53"
		],
		"function": "count",
		"commonness": -11.676454221015156,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.composition",
					"class": "music.composition",
					"friendly_name": "Composition",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.william_shakespeare",
					"class": "music.lyricist",
					"friendly_name": "shakespeare",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "music.lyricist.lyrics_written",
					"friendly_name": "Lyrics Written"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.composition . \nVALUES ?x1 { :en.william_shakespeare } \n?x1 :music.lyricist.lyrics_written ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 137000202,
		"question": "shakspeare has written how many lyrics?",
		"answer": [
			"53"
		],
		"function": "count",
		"commonness": -11.676454221015156,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.composition",
					"class": "music.composition",
					"friendly_name": "Composition",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.william_shakespeare",
					"class": "music.lyricist",
					"friendly_name": "shakspeare",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "music.lyricist.lyrics_written",
					"friendly_name": "Lyrics Written"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.composition . \nVALUES ?x1 { :en.william_shakespeare } \n?x1 :music.lyricist.lyrics_written ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 137000300,
		"question": "how many lyrics are written by william shakespeare?",
		"answer": [
			"53"
		],
		"function": "count",
		"commonness": -11.676454221015156,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.composition",
					"class": "music.composition",
					"friendly_name": "Composition",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.william_shakespeare",
					"class": "music.lyricist",
					"friendly_name": "William Shakespeare",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "music.lyricist.lyrics_written",
					"friendly_name": "Lyrics Written"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.composition . \nVALUES ?x1 { :en.william_shakespeare } \n?x1 :music.lyricist.lyrics_written ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 137000301,
		"question": "how many lyrics are written by shakespeare?",
		"answer": [
			"53"
		],
		"function": "count",
		"commonness": -11.676454221015156,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.composition",
					"class": "music.composition",
					"friendly_name": "Composition",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.william_shakespeare",
					"class": "music.lyricist",
					"friendly_name": "shakespeare",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "music.lyricist.lyrics_written",
					"friendly_name": "Lyrics Written"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.composition . \nVALUES ?x1 { :en.william_shakespeare } \n?x1 :music.lyricist.lyrics_written ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 137000302,
		"question": "how many lyrics are written by shakspeare?",
		"answer": [
			"53"
		],
		"function": "count",
		"commonness": -11.676454221015156,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.composition",
					"class": "music.composition",
					"friendly_name": "Composition",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.william_shakespeare",
					"class": "music.lyricist",
					"friendly_name": "shakspeare",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "music.lyricist.lyrics_written",
					"friendly_name": "Lyrics Written"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.composition . \nVALUES ?x1 { :en.william_shakespeare } \n?x1 :music.lyricist.lyrics_written ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 137000400,
		"question": "how many musical works did william shakespeare write?",
		"answer": [
			"53"
		],
		"function": "count",
		"commonness": -11.676454221015156,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.composition",
					"class": "music.composition",
					"friendly_name": "Composition",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.william_shakespeare",
					"class": "music.lyricist",
					"friendly_name": "William Shakespeare",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "music.lyricist.lyrics_written",
					"friendly_name": "Lyrics Written"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.composition . \nVALUES ?x1 { :en.william_shakespeare } \n?x1 :music.lyricist.lyrics_written ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 137000401,
		"question": "how many musical works did shakespeare write?",
		"answer": [
			"53"
		],
		"function": "count",
		"commonness": -11.676454221015156,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.composition",
					"class": "music.composition",
					"friendly_name": "Composition",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.william_shakespeare",
					"class": "music.lyricist",
					"friendly_name": "shakespeare",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "music.lyricist.lyrics_written",
					"friendly_name": "Lyrics Written"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.composition . \nVALUES ?x1 { :en.william_shakespeare } \n?x1 :music.lyricist.lyrics_written ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 137000402,
		"question": "how many musical works did shakspeare write?",
		"answer": [
			"53"
		],
		"function": "count",
		"commonness": -11.676454221015156,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.composition",
					"class": "music.composition",
					"friendly_name": "Composition",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.william_shakespeare",
					"class": "music.lyricist",
					"friendly_name": "shakspeare",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "music.lyricist.lyrics_written",
					"friendly_name": "Lyrics Written"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.composition . \nVALUES ?x1 { :en.william_shakespeare } \n?x1 :music.lyricist.lyrics_written ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 138000000,
		"question": "find theaters that can only seat less than 300 people.",
		"answer": [
			"Brattle Theatre",
			"Acorn Theatre",
			"Phoenix Theatre",
			"Yvonne Arnaud Theatre",
			"Tricycle Theatre",
			"The Katharine Hepburn Cultural Arts Center",
			"Soho Theatre",
			"Hen and Chickens Theatre",
			"Oxford Playhouse",
			"Triad Theater",
			"Old Red Lion Theatre",
			"The Lion Theatre",
			"Grand Guignol",
			"Lucille Lortel Theatre",
			"Alchemical Theatre Laboratory",
			"Arcata Theatre",
			"York Theatre",
			"Laurie Beechman Theatre",
			"Mary G. Steiner Egyptian Theatre",
			"Donmar Warehouse",
			"Whitefire Theatre",
			"Watermill Theatre",
			"Esther's Follies",
			"Lantern Theatre",
			"Jefferson Theater",
			"Main Street Theater",
			"The Jane",
			"Live Theatre Company",
			"RADA Studios",
			"Main Street Theater",
			"Factory Theatre",
			"Tron Theatre"
		],
		"function": "<",
		"commonness": -14.382337255906844,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "theater.theater",
					"class": "theater.theater",
					"friendly_name": "Theater",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "300^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "300",
					"question_node": 0,
					"function": "<"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.venue.capacity",
					"friendly_name": "Seating capacity"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :theater.theater . \nFILTER (?x1 < 300)\n?x0 :architecture.venue.capacity ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 138000100,
		"question": "which theaters can hold less than 300 people?",
		"answer": [
			"The Jane",
			"The Katharine Hepburn Cultural Arts Center",
			"Laurie Beechman Theatre",
			"Yvonne Arnaud Theatre",
			"Triad Theater",
			"Oxford Playhouse",
			"Watermill Theatre",
			"Phoenix Theatre",
			"Tron Theatre",
			"Brattle Theatre",
			"Factory Theatre",
			"RADA Studios",
			"Soho Theatre",
			"Lantern Theatre",
			"Whitefire Theatre",
			"Live Theatre Company",
			"York Theatre",
			"Acorn Theatre",
			"Mary G. Steiner Egyptian Theatre",
			"Arcata Theatre",
			"Hen and Chickens Theatre",
			"Old Red Lion Theatre",
			"Main Street Theater",
			"Lucille Lortel Theatre",
			"Esther's Follies",
			"Donmar Warehouse",
			"Main Street Theater",
			"Jefferson Theater",
			"Grand Guignol",
			"Alchemical Theatre Laboratory",
			"The Lion Theatre",
			"Tricycle Theatre"
		],
		"function": "<",
		"commonness": -14.382337255906844,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "theater.theater",
					"class": "theater.theater",
					"friendly_name": "Theater",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "300^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "300",
					"question_node": 0,
					"function": "<"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.venue.capacity",
					"friendly_name": "Seating capacity"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :theater.theater . \nFILTER (?x1 < 300)\n?x0 :architecture.venue.capacity ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 138000200,
		"question": "what are the theaters that have a capacity smaller than 300?",
		"answer": [
			"Oxford Playhouse",
			"Laurie Beechman Theatre",
			"Brattle Theatre",
			"York Theatre",
			"Main Street Theater",
			"Live Theatre Company",
			"Lantern Theatre",
			"The Jane",
			"Watermill Theatre",
			"Donmar Warehouse",
			"RADA Studios",
			"The Katharine Hepburn Cultural Arts Center",
			"Alchemical Theatre Laboratory",
			"Triad Theater",
			"Main Street Theater",
			"Acorn Theatre",
			"Factory Theatre",
			"Arcata Theatre",
			"Mary G. Steiner Egyptian Theatre",
			"Esther's Follies",
			"Old Red Lion Theatre",
			"Whitefire Theatre",
			"Soho Theatre",
			"Tricycle Theatre",
			"Grand Guignol",
			"Tron Theatre",
			"Jefferson Theater",
			"Hen and Chickens Theatre",
			"Yvonne Arnaud Theatre",
			"Phoenix Theatre",
			"The Lion Theatre",
			"Lucille Lortel Theatre"
		],
		"function": "<",
		"commonness": -14.382337255906844,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "theater.theater",
					"class": "theater.theater",
					"friendly_name": "Theater",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "300^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "300",
					"question_node": 0,
					"function": "<"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.venue.capacity",
					"friendly_name": "Seating capacity"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :theater.theater . \nFILTER (?x1 < 300)\n?x0 :architecture.venue.capacity ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 139000000,
		"question": "how many stores does mall of america have?",
		"answer": [
			"327"
		],
		"function": "count",
		"commonness": -14.597041747608918,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "business.business_location",
					"class": "business.business_location",
					"friendly_name": "Organization Location",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mall_of_america",
					"class": "business.shopping_center",
					"friendly_name": "Mall of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "business.shopping_center.store",
					"friendly_name": "Stores"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :business.business_location . \nVALUES ?x1 { :en.mall_of_america } \n?x1 :business.shopping_center.store ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 139000001,
		"question": "how many stores does moa have?",
		"answer": [
			"327"
		],
		"function": "count",
		"commonness": -14.597041747608918,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "business.business_location",
					"class": "business.business_location",
					"friendly_name": "Organization Location",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mall_of_america",
					"class": "business.shopping_center",
					"friendly_name": "moa",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "business.shopping_center.store",
					"friendly_name": "Stores"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :business.business_location . \nVALUES ?x1 { :en.mall_of_america } \n?x1 :business.shopping_center.store ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 139000100,
		"question": "what is the number of locations where mall of america has a store?",
		"answer": [
			"327"
		],
		"function": "count",
		"commonness": -14.597041747608918,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "business.business_location",
					"class": "business.business_location",
					"friendly_name": "Organization Location",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mall_of_america",
					"class": "business.shopping_center",
					"friendly_name": "Mall of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "business.shopping_center.store",
					"friendly_name": "Stores"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :business.business_location . \nVALUES ?x1 { :en.mall_of_america } \n?x1 :business.shopping_center.store ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 139000101,
		"question": "what is the number of locations where moa has a store?",
		"answer": [
			"327"
		],
		"function": "count",
		"commonness": -14.597041747608918,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "business.business_location",
					"class": "business.business_location",
					"friendly_name": "Organization Location",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mall_of_america",
					"class": "business.shopping_center",
					"friendly_name": "moa",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "business.shopping_center.store",
					"friendly_name": "Stores"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :business.business_location . \nVALUES ?x1 { :en.mall_of_america } \n?x1 :business.shopping_center.store ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 139000200,
		"question": "the mall of america has how many stores?",
		"answer": [
			"327"
		],
		"function": "count",
		"commonness": -14.597041747608918,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "business.business_location",
					"class": "business.business_location",
					"friendly_name": "Organization Location",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mall_of_america",
					"class": "business.shopping_center",
					"friendly_name": "Mall of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "business.shopping_center.store",
					"friendly_name": "Stores"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :business.business_location . \nVALUES ?x1 { :en.mall_of_america } \n?x1 :business.shopping_center.store ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 139000201,
		"question": "the moa has how many stores?",
		"answer": [
			"327"
		],
		"function": "count",
		"commonness": -14.597041747608918,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "business.business_location",
					"class": "business.business_location",
					"friendly_name": "Organization Location",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mall_of_america",
					"class": "business.shopping_center",
					"friendly_name": "moa",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "business.shopping_center.store",
					"friendly_name": "Stores"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :business.business_location . \nVALUES ?x1 { :en.mall_of_america } \n?x1 :business.shopping_center.store ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 139000300,
		"question": "how many mall of america stores are there?",
		"answer": [
			"327"
		],
		"function": "count",
		"commonness": -14.597041747608918,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "business.business_location",
					"class": "business.business_location",
					"friendly_name": "Organization Location",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mall_of_america",
					"class": "business.shopping_center",
					"friendly_name": "Mall of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "business.shopping_center.store",
					"friendly_name": "Stores"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :business.business_location . \nVALUES ?x1 { :en.mall_of_america } \n?x1 :business.shopping_center.store ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]