[
	{
		"qid": 33000100,
		"question": "what is leghorn primarily used for?",
		"answer": [
			"Egg"
		],
		"function": "none",
		"commonness": -18.89437526231366,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.petbreeds.chicken_primary_use",
					"class": "base.petbreeds.chicken_primary_use",
					"friendly_name": "Chicken Primary Use",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.leghorn_chicken",
					"class": "base.petbreeds.chicken_breed",
					"friendly_name": "Leghorn",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.petbreeds.chicken_breed.primary_use",
					"friendly_name": "Primary Use"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.petbreeds.chicken_primary_use . \nVALUES ?x1 { :en.leghorn_chicken } \n?x1 :base.petbreeds.chicken_breed.primary_use ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 33000200,
		"question": "the leghorn chicken are commonly used for what?",
		"answer": [
			"Egg"
		],
		"function": "none",
		"commonness": -18.89437526231366,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.petbreeds.chicken_primary_use",
					"class": "base.petbreeds.chicken_primary_use",
					"friendly_name": "Chicken Primary Use",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.leghorn_chicken",
					"class": "base.petbreeds.chicken_breed",
					"friendly_name": "Leghorn",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.petbreeds.chicken_breed.primary_use",
					"friendly_name": "Primary Use"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.petbreeds.chicken_primary_use . \nVALUES ?x1 { :en.leghorn_chicken } \n?x1 :base.petbreeds.chicken_breed.primary_use ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 33000300,
		"question": "what is the primary use of chicken leghorn?",
		"answer": [
			"Egg"
		],
		"function": "none",
		"commonness": -18.89437526231366,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.petbreeds.chicken_primary_use",
					"class": "base.petbreeds.chicken_primary_use",
					"friendly_name": "Chicken Primary Use",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.leghorn_chicken",
					"class": "base.petbreeds.chicken_breed",
					"friendly_name": "Leghorn",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.petbreeds.chicken_breed.primary_use",
					"friendly_name": "Primary Use"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.petbreeds.chicken_primary_use . \nVALUES ?x1 { :en.leghorn_chicken } \n?x1 :base.petbreeds.chicken_breed.primary_use ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 34000000,
		"question": "duck and cover's sponsor?",
		"answer": [
			"Federal Civil Defense Administration"
		],
		"function": "none",
		"commonness": -16.871942714926558,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "business.sponsor",
					"class": "business.sponsor",
					"friendly_name": "Sponsor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.duck_and_cover_1951",
					"class": "base.educationalshortfilm.educational_short_film",
					"friendly_name": "Duck and Cover",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.educationalshortfilm.educational_short_film.sponsor",
					"friendly_name": "Sponsor"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :business.sponsor . \nVALUES ?x1 { :en.duck_and_cover_1951 } \n?x1 :base.educationalshortfilm.educational_short_film.sponsor ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 34000100,
		"question": "what group help support the film duck and cover?",
		"answer": [
			"Federal Civil Defense Administration"
		],
		"function": "none",
		"commonness": -16.871942714926558,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "business.sponsor",
					"class": "business.sponsor",
					"friendly_name": "Sponsor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.duck_and_cover_1951",
					"class": "base.educationalshortfilm.educational_short_film",
					"friendly_name": "Duck and Cover",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.educationalshortfilm.educational_short_film.sponsor",
					"friendly_name": "Sponsor"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :business.sponsor . \nVALUES ?x1 { :en.duck_and_cover_1951 } \n?x1 :base.educationalshortfilm.educational_short_film.sponsor ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 34000200,
		"question": "who is the sponsor of the duck and cover movie?",
		"answer": [
			"Federal Civil Defense Administration"
		],
		"function": "none",
		"commonness": -16.871942714926558,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "business.sponsor",
					"class": "business.sponsor",
					"friendly_name": "Sponsor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.duck_and_cover_1951",
					"class": "base.educationalshortfilm.educational_short_film",
					"friendly_name": "Duck and Cover",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.educationalshortfilm.educational_short_film.sponsor",
					"friendly_name": "Sponsor"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :business.sponsor . \nVALUES ?x1 { :en.duck_and_cover_1951 } \n?x1 :base.educationalshortfilm.educational_short_film.sponsor ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 34000300,
		"question": "by whom is duck and cover sponsored?",
		"answer": [
			"Federal Civil Defense Administration"
		],
		"function": "none",
		"commonness": -16.871942714926558,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "business.sponsor",
					"class": "business.sponsor",
					"friendly_name": "Sponsor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.duck_and_cover_1951",
					"class": "base.educationalshortfilm.educational_short_film",
					"friendly_name": "Duck and Cover",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.educationalshortfilm.educational_short_film.sponsor",
					"friendly_name": "Sponsor"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :business.sponsor . \nVALUES ?x1 { :en.duck_and_cover_1951 } \n?x1 :base.educationalshortfilm.educational_short_film.sponsor ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 34000400,
		"question": "what organization backed production of the film duck and cover?",
		"answer": [
			"Federal Civil Defense Administration"
		],
		"function": "none",
		"commonness": -16.871942714926558,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "business.sponsor",
					"class": "business.sponsor",
					"friendly_name": "Sponsor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.duck_and_cover_1951",
					"class": "base.educationalshortfilm.educational_short_film",
					"friendly_name": "Duck and Cover",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.educationalshortfilm.educational_short_film.sponsor",
					"friendly_name": "Sponsor"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :business.sponsor . \nVALUES ?x1 { :en.duck_and_cover_1951 } \n?x1 :base.educationalshortfilm.educational_short_film.sponsor ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 34000500,
		"question": "who sponsored duck and cover?",
		"answer": [
			"Federal Civil Defense Administration"
		],
		"function": "none",
		"commonness": -16.871942714926558,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "business.sponsor",
					"class": "business.sponsor",
					"friendly_name": "Sponsor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.duck_and_cover_1951",
					"class": "base.educationalshortfilm.educational_short_film",
					"friendly_name": "Duck and Cover",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.educationalshortfilm.educational_short_film.sponsor",
					"friendly_name": "Sponsor"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :business.sponsor . \nVALUES ?x1 { :en.duck_and_cover_1951 } \n?x1 :base.educationalshortfilm.educational_short_film.sponsor ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 35000000,
		"question": "which bloggers were born in the united states of america?",
		"answer": [
			"Jeffrey Zeldman",
			"Jessamyn West",
			"Charles M. Blow",
			"Roderick L. Evans",
			"Kathy Sierra"
		],
		"function": "none",
		"commonness": -8.328627535458333,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "internet.blogger",
					"class": "internet.blogger",
					"friendly_name": "Blogger",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.location",
					"friendly_name": "United States of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.place_of_birth",
					"friendly_name": "Place of birth"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :internet.blogger . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :people.person.place_of_birth ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 35000001,
		"question": "which bloggers were born in the us?",
		"answer": [
			"Roderick L. Evans",
			"Jeffrey Zeldman",
			"Charles M. Blow",
			"Jessamyn West",
			"Kathy Sierra"
		],
		"function": "none",
		"commonness": -8.328627535458333,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "internet.blogger",
					"class": "internet.blogger",
					"friendly_name": "Blogger",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.location",
					"friendly_name": "us",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.place_of_birth",
					"friendly_name": "Place of birth"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :internet.blogger . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :people.person.place_of_birth ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 35000002,
		"question": "which bloggers were born in the united states?",
		"answer": [
			"Roderick L. Evans",
			"Jeffrey Zeldman",
			"Jessamyn West",
			"Charles M. Blow",
			"Kathy Sierra"
		],
		"function": "none",
		"commonness": -8.328627535458333,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "internet.blogger",
					"class": "internet.blogger",
					"friendly_name": "Blogger",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.location",
					"friendly_name": "united states",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.place_of_birth",
					"friendly_name": "Place of birth"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :internet.blogger . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :people.person.place_of_birth ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 35000100,
		"question": "who are some bloggers born in united states of america?",
		"answer": [
			"Roderick L. Evans",
			"Jeffrey Zeldman",
			"Jessamyn West",
			"Kathy Sierra",
			"Charles M. Blow"
		],
		"function": "none",
		"commonness": -8.328627535458333,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "internet.blogger",
					"class": "internet.blogger",
					"friendly_name": "Blogger",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.location",
					"friendly_name": "United States of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.place_of_birth",
					"friendly_name": "Place of birth"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :internet.blogger . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :people.person.place_of_birth ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 35000101,
		"question": "who are some bloggers born in us?",
		"answer": [
			"Charles M. Blow",
			"Jeffrey Zeldman",
			"Kathy Sierra",
			"Jessamyn West",
			"Roderick L. Evans"
		],
		"function": "none",
		"commonness": -8.328627535458333,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "internet.blogger",
					"class": "internet.blogger",
					"friendly_name": "Blogger",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.location",
					"friendly_name": "us",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.place_of_birth",
					"friendly_name": "Place of birth"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :internet.blogger . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :people.person.place_of_birth ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 35000102,
		"question": "who are some bloggers born in united states?",
		"answer": [
			"Kathy Sierra",
			"Roderick L. Evans",
			"Jeffrey Zeldman",
			"Jessamyn West",
			"Charles M. Blow"
		],
		"function": "none",
		"commonness": -8.328627535458333,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "internet.blogger",
					"class": "internet.blogger",
					"friendly_name": "Blogger",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.location",
					"friendly_name": "united states",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.place_of_birth",
					"friendly_name": "Place of birth"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :internet.blogger . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :people.person.place_of_birth ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 35000200,
		"question": "which bloggers are from the united states of america?",
		"answer": [
			"Kathy Sierra",
			"Charles M. Blow",
			"Roderick L. Evans",
			"Jeffrey Zeldman",
			"Jessamyn West"
		],
		"function": "none",
		"commonness": -8.328627535458333,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "internet.blogger",
					"class": "internet.blogger",
					"friendly_name": "Blogger",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.location",
					"friendly_name": "United States of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.place_of_birth",
					"friendly_name": "Place of birth"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :internet.blogger . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :people.person.place_of_birth ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 35000201,
		"question": "which bloggers are from the us?",
		"answer": [
			"Kathy Sierra",
			"Jeffrey Zeldman",
			"Roderick L. Evans",
			"Charles M. Blow",
			"Jessamyn West"
		],
		"function": "none",
		"commonness": -8.328627535458333,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "internet.blogger",
					"class": "internet.blogger",
					"friendly_name": "Blogger",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.location",
					"friendly_name": "us",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.place_of_birth",
					"friendly_name": "Place of birth"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :internet.blogger . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :people.person.place_of_birth ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 35000202,
		"question": "which bloggers are from the united states?",
		"answer": [
			"Charles M. Blow",
			"Jessamyn West",
			"Roderick L. Evans",
			"Kathy Sierra",
			"Jeffrey Zeldman"
		],
		"function": "none",
		"commonness": -8.328627535458333,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "internet.blogger",
					"class": "internet.blogger",
					"friendly_name": "Blogger",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.location",
					"friendly_name": "united states",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.place_of_birth",
					"friendly_name": "Place of birth"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :internet.blogger . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :people.person.place_of_birth ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 35000400,
		"question": "name a blog writer who hails from the united states of america?",
		"answer": [
			"Jessamyn West",
			"Roderick L. Evans",
			"Charles M. Blow",
			"Jeffrey Zeldman",
			"Kathy Sierra"
		],
		"function": "none",
		"commonness": -8.328627535458333,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "internet.blogger",
					"class": "internet.blogger",
					"friendly_name": "Blogger",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.location",
					"friendly_name": "United States of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.place_of_birth",
					"friendly_name": "Place of birth"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :internet.blogger . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :people.person.place_of_birth ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 35000401,
		"question": "name a blog writer who hails from the us?",
		"answer": [
			"Kathy Sierra",
			"Roderick L. Evans",
			"Jessamyn West",
			"Jeffrey Zeldman",
			"Charles M. Blow"
		],
		"function": "none",
		"commonness": -8.328627535458333,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "internet.blogger",
					"class": "internet.blogger",
					"friendly_name": "Blogger",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.location",
					"friendly_name": "us",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.place_of_birth",
					"friendly_name": "Place of birth"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :internet.blogger . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :people.person.place_of_birth ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 35000402,
		"question": "name a blog writer who hails from the united states?",
		"answer": [
			"Jeffrey Zeldman",
			"Roderick L. Evans",
			"Charles M. Blow",
			"Jessamyn West",
			"Kathy Sierra"
		],
		"function": "none",
		"commonness": -8.328627535458333,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "internet.blogger",
					"class": "internet.blogger",
					"friendly_name": "Blogger",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.location",
					"friendly_name": "united states",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.place_of_birth",
					"friendly_name": "Place of birth"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :internet.blogger . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :people.person.place_of_birth ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 36000000,
		"question": "who made the source engine.",
		"answer": [
			"Valve Corporation"
		],
		"function": "none",
		"commonness": -16.53886073111844,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "cvg.computer_game_engine_developer",
					"class": "cvg.computer_game_engine_developer",
					"friendly_name": "Video Game Engine Developer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.source_engine",
					"class": "cvg.computer_game_engine",
					"friendly_name": "Source Engine",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "cvg.computer_game_engine_developer.computer_game_engines_developed",
					"friendly_name": "Computer game engines developed"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :cvg.computer_game_engine_developer . \nVALUES ?x1 { :en.source_engine } \n?x0 :cvg.computer_game_engine_developer.computer_game_engines_developed ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 36000100,
		"question": "the source engine was developed by which company?",
		"answer": [
			"Valve Corporation"
		],
		"function": "none",
		"commonness": -16.53886073111844,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "cvg.computer_game_engine_developer",
					"class": "cvg.computer_game_engine_developer",
					"friendly_name": "Video Game Engine Developer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.source_engine",
					"class": "cvg.computer_game_engine",
					"friendly_name": "Source Engine",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "cvg.computer_game_engine_developer.computer_game_engines_developed",
					"friendly_name": "Computer game engines developed"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :cvg.computer_game_engine_developer . \nVALUES ?x1 { :en.source_engine } \n?x0 :cvg.computer_game_engine_developer.computer_game_engines_developed ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 36000200,
		"question": "what is the name of the company that created the source engine?",
		"answer": [
			"Valve Corporation"
		],
		"function": "none",
		"commonness": -16.53886073111844,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "cvg.computer_game_engine_developer",
					"class": "cvg.computer_game_engine_developer",
					"friendly_name": "Video Game Engine Developer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.source_engine",
					"class": "cvg.computer_game_engine",
					"friendly_name": "Source Engine",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "cvg.computer_game_engine_developer.computer_game_engines_developed",
					"friendly_name": "Computer game engines developed"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :cvg.computer_game_engine_developer . \nVALUES ?x1 { :en.source_engine } \n?x0 :cvg.computer_game_engine_developer.computer_game_engines_developed ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]