[
	{
		"qid": 84000001,
		"question": "what type of exhibition is the international exhibition of modern art?",
		"answer": [
			"Art exhibition"
		],
		"function": "none",
		"commonness": -17.501557538578147,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "exhibitions.type_of_exhibition",
					"class": "exhibitions.type_of_exhibition",
					"friendly_name": "Type of Exhibition",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.armory_show",
					"class": "exhibitions.exhibition",
					"friendly_name": "international exhibition of modern art",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "exhibitions.exhibition.exhibition_types",
					"friendly_name": "Exhibition type(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :exhibitions.type_of_exhibition . \nVALUES ?x1 { :en.armory_show } \n?x1 :exhibitions.exhibition.exhibition_types ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 84000002,
		"question": "what type of exhibition is the armory art show?",
		"answer": [
			"Art exhibition"
		],
		"function": "none",
		"commonness": -17.501557538578147,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "exhibitions.type_of_exhibition",
					"class": "exhibitions.type_of_exhibition",
					"friendly_name": "Type of Exhibition",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.armory_show",
					"class": "exhibitions.exhibition",
					"friendly_name": "armory art show",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "exhibitions.exhibition.exhibition_types",
					"friendly_name": "Exhibition type(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :exhibitions.type_of_exhibition . \nVALUES ?x1 { :en.armory_show } \n?x1 :exhibitions.exhibition.exhibition_types ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 84000100,
		"question": "the armory show is what kind of exhibit?",
		"answer": [
			"Art exhibition"
		],
		"function": "none",
		"commonness": -17.501557538578147,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "exhibitions.type_of_exhibition",
					"class": "exhibitions.type_of_exhibition",
					"friendly_name": "Type of Exhibition",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.armory_show",
					"class": "exhibitions.exhibition",
					"friendly_name": "Armory Show",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "exhibitions.exhibition.exhibition_types",
					"friendly_name": "Exhibition type(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :exhibitions.type_of_exhibition . \nVALUES ?x1 { :en.armory_show } \n?x1 :exhibitions.exhibition.exhibition_types ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 84000101,
		"question": "the international exhibition of modern art is what kind of exhibit?",
		"answer": [
			"Art exhibition"
		],
		"function": "none",
		"commonness": -17.501557538578147,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "exhibitions.type_of_exhibition",
					"class": "exhibitions.type_of_exhibition",
					"friendly_name": "Type of Exhibition",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.armory_show",
					"class": "exhibitions.exhibition",
					"friendly_name": "international exhibition of modern art",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "exhibitions.exhibition.exhibition_types",
					"friendly_name": "Exhibition type(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :exhibitions.type_of_exhibition . \nVALUES ?x1 { :en.armory_show } \n?x1 :exhibitions.exhibition.exhibition_types ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 84000102,
		"question": "the armory art show is what kind of exhibit?",
		"answer": [
			"Art exhibition"
		],
		"function": "none",
		"commonness": -17.501557538578147,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "exhibitions.type_of_exhibition",
					"class": "exhibitions.type_of_exhibition",
					"friendly_name": "Type of Exhibition",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.armory_show",
					"class": "exhibitions.exhibition",
					"friendly_name": "armory art show",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "exhibitions.exhibition.exhibition_types",
					"friendly_name": "Exhibition type(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :exhibitions.type_of_exhibition . \nVALUES ?x1 { :en.armory_show } \n?x1 :exhibitions.exhibition.exhibition_types ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 84000200,
		"question": "what is the armory show classified as?",
		"answer": [
			"Art exhibition"
		],
		"function": "none",
		"commonness": -17.501557538578147,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "exhibitions.type_of_exhibition",
					"class": "exhibitions.type_of_exhibition",
					"friendly_name": "Type of Exhibition",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.armory_show",
					"class": "exhibitions.exhibition",
					"friendly_name": "Armory Show",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "exhibitions.exhibition.exhibition_types",
					"friendly_name": "Exhibition type(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :exhibitions.type_of_exhibition . \nVALUES ?x1 { :en.armory_show } \n?x1 :exhibitions.exhibition.exhibition_types ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 84000201,
		"question": "what is the international exhibition of modern art classified as?",
		"answer": [
			"Art exhibition"
		],
		"function": "none",
		"commonness": -17.501557538578147,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "exhibitions.type_of_exhibition",
					"class": "exhibitions.type_of_exhibition",
					"friendly_name": "Type of Exhibition",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.armory_show",
					"class": "exhibitions.exhibition",
					"friendly_name": "international exhibition of modern art",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "exhibitions.exhibition.exhibition_types",
					"friendly_name": "Exhibition type(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :exhibitions.type_of_exhibition . \nVALUES ?x1 { :en.armory_show } \n?x1 :exhibitions.exhibition.exhibition_types ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 84000202,
		"question": "what is the armory art show classified as?",
		"answer": [
			"Art exhibition"
		],
		"function": "none",
		"commonness": -17.501557538578147,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "exhibitions.type_of_exhibition",
					"class": "exhibitions.type_of_exhibition",
					"friendly_name": "Type of Exhibition",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.armory_show",
					"class": "exhibitions.exhibition",
					"friendly_name": "armory art show",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "exhibitions.exhibition.exhibition_types",
					"friendly_name": "Exhibition type(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :exhibitions.type_of_exhibition . \nVALUES ?x1 { :en.armory_show } \n?x1 :exhibitions.exhibition.exhibition_types ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 84000300,
		"question": "the armory show is what kind of exhibition?",
		"answer": [
			"Art exhibition"
		],
		"function": "none",
		"commonness": -17.501557538578147,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "exhibitions.type_of_exhibition",
					"class": "exhibitions.type_of_exhibition",
					"friendly_name": "Type of Exhibition",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.armory_show",
					"class": "exhibitions.exhibition",
					"friendly_name": "Armory Show",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "exhibitions.exhibition.exhibition_types",
					"friendly_name": "Exhibition type(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :exhibitions.type_of_exhibition . \nVALUES ?x1 { :en.armory_show } \n?x1 :exhibitions.exhibition.exhibition_types ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 84000301,
		"question": "the international exhibition of modern art is what kind of exhibition?",
		"answer": [
			"Art exhibition"
		],
		"function": "none",
		"commonness": -17.501557538578147,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "exhibitions.type_of_exhibition",
					"class": "exhibitions.type_of_exhibition",
					"friendly_name": "Type of Exhibition",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.armory_show",
					"class": "exhibitions.exhibition",
					"friendly_name": "international exhibition of modern art",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "exhibitions.exhibition.exhibition_types",
					"friendly_name": "Exhibition type(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :exhibitions.type_of_exhibition . \nVALUES ?x1 { :en.armory_show } \n?x1 :exhibitions.exhibition.exhibition_types ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 84000302,
		"question": "the armory art show is what kind of exhibition?",
		"answer": [
			"Art exhibition"
		],
		"function": "none",
		"commonness": -17.501557538578147,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "exhibitions.type_of_exhibition",
					"class": "exhibitions.type_of_exhibition",
					"friendly_name": "Type of Exhibition",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.armory_show",
					"class": "exhibitions.exhibition",
					"friendly_name": "armory art show",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "exhibitions.exhibition.exhibition_types",
					"friendly_name": "Exhibition type(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :exhibitions.type_of_exhibition . \nVALUES ?x1 { :en.armory_show } \n?x1 :exhibitions.exhibition.exhibition_types ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 85000000,
		"question": "what medical therapy do aids patients undergo?",
		"answer": [
			"Saquinavir",
			"Ritonavir",
			"Lamivudine",
			"Indinavir",
			"Zalcitabine",
			"Nelfinavir",
			"Zidovudine",
			"Lopinavir",
			"Nevirapine",
			"Amprenavir",
			"Delavirdine",
			"Management of HIV/AIDS",
			"Abacavir",
			"Post-exposure prophylaxis",
			"Efavirenz",
			"Protease inhibitor",
			"Tenofovir",
			"Emtricitabine/Tenofovir",
			"Stavudine",
			"Didanosine",
			"Enfuvirtide"
		],
		"function": "none",
		"commonness": -10.549659200536258,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.medical_treatment",
					"class": "medicine.medical_treatment",
					"friendly_name": "Medical Treatment",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.aids",
					"class": "medicine.disease",
					"friendly_name": "AIDS",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.medical_treatment.used_to_treat",
					"friendly_name": "Used To Treat"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.medical_treatment . \nVALUES ?x1 { :en.aids } \n?x0 :medicine.medical_treatment.used_to_treat ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 85000001,
		"question": "what medical therapy do hiv patients undergo?",
		"answer": [
			"Nevirapine",
			"Indinavir",
			"Tenofovir",
			"Stavudine",
			"Post-exposure prophylaxis",
			"Management of HIV/AIDS",
			"Nelfinavir",
			"Delavirdine",
			"Zalcitabine",
			"Saquinavir",
			"Abacavir",
			"Enfuvirtide",
			"Amprenavir",
			"Ritonavir",
			"Protease inhibitor",
			"Efavirenz",
			"Zidovudine",
			"Didanosine",
			"Lopinavir",
			"Emtricitabine/Tenofovir",
			"Lamivudine"
		],
		"function": "none",
		"commonness": -10.549659200536258,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.medical_treatment",
					"class": "medicine.medical_treatment",
					"friendly_name": "Medical Treatment",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.aids",
					"class": "medicine.disease",
					"friendly_name": "hiv",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.medical_treatment.used_to_treat",
					"friendly_name": "Used To Treat"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.medical_treatment . \nVALUES ?x1 { :en.aids } \n?x0 :medicine.medical_treatment.used_to_treat ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 85000002,
		"question": "what medical therapy do hiv infection patients undergo?",
		"answer": [
			"Nevirapine",
			"Stavudine",
			"Emtricitabine/Tenofovir",
			"Indinavir",
			"Efavirenz",
			"Saquinavir",
			"Enfuvirtide",
			"Delavirdine",
			"Tenofovir",
			"Protease inhibitor",
			"Amprenavir",
			"Nelfinavir",
			"Abacavir",
			"Lamivudine",
			"Management of HIV/AIDS",
			"Zidovudine",
			"Lopinavir",
			"Ritonavir",
			"Post-exposure prophylaxis",
			"Zalcitabine",
			"Didanosine"
		],
		"function": "none",
		"commonness": -10.549659200536258,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.medical_treatment",
					"class": "medicine.medical_treatment",
					"friendly_name": "Medical Treatment",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.aids",
					"class": "medicine.disease",
					"friendly_name": "hiv infection",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.medical_treatment.used_to_treat",
					"friendly_name": "Used To Treat"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.medical_treatment . \nVALUES ?x1 { :en.aids } \n?x0 :medicine.medical_treatment.used_to_treat ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 85000100,
		"question": "what is the medical treatment for aids?",
		"answer": [
			"Lamivudine",
			"Saquinavir",
			"Emtricitabine/Tenofovir",
			"Zalcitabine",
			"Lopinavir",
			"Zidovudine",
			"Management of HIV/AIDS",
			"Nelfinavir",
			"Post-exposure prophylaxis",
			"Nevirapine",
			"Amprenavir",
			"Didanosine",
			"Delavirdine",
			"Abacavir",
			"Efavirenz",
			"Ritonavir",
			"Enfuvirtide",
			"Indinavir",
			"Stavudine",
			"Protease inhibitor",
			"Tenofovir"
		],
		"function": "none",
		"commonness": -10.549659200536258,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.medical_treatment",
					"class": "medicine.medical_treatment",
					"friendly_name": "Medical Treatment",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.aids",
					"class": "medicine.disease",
					"friendly_name": "AIDS",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.medical_treatment.used_to_treat",
					"friendly_name": "Used To Treat"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.medical_treatment . \nVALUES ?x1 { :en.aids } \n?x0 :medicine.medical_treatment.used_to_treat ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 85000101,
		"question": "what is the medical treatment for hiv?",
		"answer": [
			"Abacavir",
			"Post-exposure prophylaxis",
			"Management of HIV/AIDS",
			"Nelfinavir",
			"Emtricitabine/Tenofovir",
			"Zidovudine",
			"Protease inhibitor",
			"Stavudine",
			"Didanosine",
			"Lamivudine",
			"Zalcitabine",
			"Efavirenz",
			"Nevirapine",
			"Saquinavir",
			"Amprenavir",
			"Tenofovir",
			"Delavirdine",
			"Lopinavir",
			"Enfuvirtide",
			"Ritonavir",
			"Indinavir"
		],
		"function": "none",
		"commonness": -10.549659200536258,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.medical_treatment",
					"class": "medicine.medical_treatment",
					"friendly_name": "Medical Treatment",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.aids",
					"class": "medicine.disease",
					"friendly_name": "hiv",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.medical_treatment.used_to_treat",
					"friendly_name": "Used To Treat"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.medical_treatment . \nVALUES ?x1 { :en.aids } \n?x0 :medicine.medical_treatment.used_to_treat ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 85000102,
		"question": "what is the medical treatment for hiv infection?",
		"answer": [
			"Tenofovir",
			"Didanosine",
			"Management of HIV/AIDS",
			"Zalcitabine",
			"Saquinavir",
			"Indinavir",
			"Amprenavir",
			"Lopinavir",
			"Nelfinavir",
			"Post-exposure prophylaxis",
			"Enfuvirtide",
			"Delavirdine",
			"Zidovudine",
			"Nevirapine",
			"Ritonavir",
			"Stavudine",
			"Efavirenz",
			"Lamivudine",
			"Abacavir",
			"Emtricitabine/Tenofovir",
			"Protease inhibitor"
		],
		"function": "none",
		"commonness": -10.549659200536258,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.medical_treatment",
					"class": "medicine.medical_treatment",
					"friendly_name": "Medical Treatment",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.aids",
					"class": "medicine.disease",
					"friendly_name": "hiv infection",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.medical_treatment.used_to_treat",
					"friendly_name": "Used To Treat"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.medical_treatment . \nVALUES ?x1 { :en.aids } \n?x0 :medicine.medical_treatment.used_to_treat ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 85000200,
		"question": "how is aids treated?",
		"answer": [
			"Indinavir",
			"Post-exposure prophylaxis",
			"Saquinavir",
			"Ritonavir",
			"Lamivudine",
			"Amprenavir",
			"Nelfinavir",
			"Abacavir",
			"Didanosine",
			"Enfuvirtide",
			"Management of HIV/AIDS",
			"Protease inhibitor",
			"Delavirdine",
			"Stavudine",
			"Efavirenz",
			"Zalcitabine",
			"Tenofovir",
			"Emtricitabine/Tenofovir",
			"Lopinavir",
			"Nevirapine",
			"Zidovudine"
		],
		"function": "none",
		"commonness": -10.549659200536258,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.medical_treatment",
					"class": "medicine.medical_treatment",
					"friendly_name": "Medical Treatment",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.aids",
					"class": "medicine.disease",
					"friendly_name": "AIDS",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.medical_treatment.used_to_treat",
					"friendly_name": "Used To Treat"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.medical_treatment . \nVALUES ?x1 { :en.aids } \n?x0 :medicine.medical_treatment.used_to_treat ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 85000202,
		"question": "how is hiv infection treated?",
		"answer": [
			"Enfuvirtide",
			"Post-exposure prophylaxis",
			"Lopinavir",
			"Efavirenz",
			"Abacavir",
			"Zalcitabine",
			"Nevirapine",
			"Delavirdine",
			"Tenofovir",
			"Management of HIV/AIDS",
			"Stavudine",
			"Nelfinavir",
			"Protease inhibitor",
			"Ritonavir",
			"Emtricitabine/Tenofovir",
			"Lamivudine",
			"Saquinavir",
			"Indinavir",
			"Didanosine",
			"Amprenavir",
			"Zidovudine"
		],
		"function": "none",
		"commonness": -10.549659200536258,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.medical_treatment",
					"class": "medicine.medical_treatment",
					"friendly_name": "Medical Treatment",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.aids",
					"class": "medicine.disease",
					"friendly_name": "hiv infection",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.medical_treatment.used_to_treat",
					"friendly_name": "Used To Treat"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.medical_treatment . \nVALUES ?x1 { :en.aids } \n?x0 :medicine.medical_treatment.used_to_treat ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 85000302,
		"question": "how to treat hiv infection?",
		"answer": [
			"Stavudine",
			"Saquinavir",
			"Lopinavir",
			"Enfuvirtide",
			"Ritonavir",
			"Emtricitabine/Tenofovir",
			"Post-exposure prophylaxis",
			"Zidovudine",
			"Tenofovir",
			"Lamivudine",
			"Amprenavir",
			"Management of HIV/AIDS",
			"Protease inhibitor",
			"Nevirapine",
			"Abacavir",
			"Nelfinavir",
			"Delavirdine",
			"Zalcitabine",
			"Didanosine",
			"Indinavir",
			"Efavirenz"
		],
		"function": "none",
		"commonness": -10.549659200536258,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.medical_treatment",
					"class": "medicine.medical_treatment",
					"friendly_name": "Medical Treatment",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.aids",
					"class": "medicine.disease",
					"friendly_name": "hiv infection",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.medical_treatment.used_to_treat",
					"friendly_name": "Used To Treat"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.medical_treatment . \nVALUES ?x1 { :en.aids } \n?x0 :medicine.medical_treatment.used_to_treat ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 85000400,
		"question": "what treatment is used for aids?",
		"answer": [
			"Indinavir",
			"Ritonavir",
			"Didanosine",
			"Post-exposure prophylaxis",
			"Efavirenz",
			"Abacavir",
			"Lopinavir",
			"Nelfinavir",
			"Nevirapine",
			"Amprenavir",
			"Delavirdine",
			"Saquinavir",
			"Emtricitabine/Tenofovir",
			"Protease inhibitor",
			"Stavudine",
			"Lamivudine",
			"Enfuvirtide",
			"Management of HIV/AIDS",
			"Zalcitabine",
			"Tenofovir",
			"Zidovudine"
		],
		"function": "none",
		"commonness": -10.549659200536258,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.medical_treatment",
					"class": "medicine.medical_treatment",
					"friendly_name": "Medical Treatment",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.aids",
					"class": "medicine.disease",
					"friendly_name": "AIDS",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.medical_treatment.used_to_treat",
					"friendly_name": "Used To Treat"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.medical_treatment . \nVALUES ?x1 { :en.aids } \n?x0 :medicine.medical_treatment.used_to_treat ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]