[
	{
		"qid": 238000100,
		"question": "what film actor is a real estate broker like their parents?",
		"answer": [
			"Sherry Boucher"
		],
		"function": "none",
		"commonness": -17.88979586669183,
		"num_node": 3,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.actor",
					"class": "film.actor",
					"friendly_name": "Film actor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.real_estate_broker",
					"class": "people.profession",
					"friendly_name": "Real estate broker",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "people.person",
					"class": "people.person",
					"friendly_name": "Person",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "people.profession.people_with_this_profession",
					"friendly_name": "People With This Profession"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "people.person.parents",
					"friendly_name": "Parents"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "people.person.profession",
					"friendly_name": "Profession"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.actor . \nVALUES ?x1 { :en.real_estate_broker } \n?x2 :type.object.type :people.person . \n?x1 :people.profession.people_with_this_profession ?x0 . \n?x0 :people.person.parents ?x2 . \n?x2 :people.person.profession ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 238000101,
		"question": "what film actor is a realtor like their parents?",
		"answer": [
			"Sherry Boucher"
		],
		"function": "none",
		"commonness": -17.88979586669183,
		"num_node": 3,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.actor",
					"class": "film.actor",
					"friendly_name": "Film actor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.real_estate_broker",
					"class": "people.profession",
					"friendly_name": "realtor",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "people.person",
					"class": "people.person",
					"friendly_name": "Person",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "people.profession.people_with_this_profession",
					"friendly_name": "People With This Profession"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "people.person.parents",
					"friendly_name": "Parents"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "people.person.profession",
					"friendly_name": "Profession"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.actor . \nVALUES ?x1 { :en.real_estate_broker } \n?x2 :type.object.type :people.person . \n?x1 :people.profession.people_with_this_profession ?x0 . \n?x0 :people.person.parents ?x2 . \n?x2 :people.person.profession ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 238000102,
		"question": "what film actor is a real estate salesperson like their parents?",
		"answer": [
			"Sherry Boucher"
		],
		"function": "none",
		"commonness": -17.88979586669183,
		"num_node": 3,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.actor",
					"class": "film.actor",
					"friendly_name": "Film actor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.real_estate_broker",
					"class": "people.profession",
					"friendly_name": "real estate salesperson",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "people.person",
					"class": "people.person",
					"friendly_name": "Person",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "people.profession.people_with_this_profession",
					"friendly_name": "People With This Profession"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "people.person.parents",
					"friendly_name": "Parents"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "people.person.profession",
					"friendly_name": "Profession"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.actor . \nVALUES ?x1 { :en.real_estate_broker } \n?x2 :type.object.type :people.person . \n?x1 :people.profession.people_with_this_profession ?x0 . \n?x0 :people.person.parents ?x2 . \n?x2 :people.person.profession ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 238000200,
		"question": "which movie actor followed in his/her parents footsteps and became a real estate broker?",
		"answer": [
			"Sherry Boucher"
		],
		"function": "none",
		"commonness": -17.88979586669183,
		"num_node": 3,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.actor",
					"class": "film.actor",
					"friendly_name": "Film actor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.real_estate_broker",
					"class": "people.profession",
					"friendly_name": "Real estate broker",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "people.person",
					"class": "people.person",
					"friendly_name": "Person",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "people.profession.people_with_this_profession",
					"friendly_name": "People With This Profession"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "people.person.parents",
					"friendly_name": "Parents"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "people.person.profession",
					"friendly_name": "Profession"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.actor . \nVALUES ?x1 { :en.real_estate_broker } \n?x2 :type.object.type :people.person . \n?x1 :people.profession.people_with_this_profession ?x0 . \n?x0 :people.person.parents ?x2 . \n?x2 :people.person.profession ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 238000202,
		"question": "which movie actor followed in his/her parents footsteps and became a real estate salesperson?",
		"answer": [
			"Sherry Boucher"
		],
		"function": "none",
		"commonness": -17.88979586669183,
		"num_node": 3,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.actor",
					"class": "film.actor",
					"friendly_name": "Film actor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.real_estate_broker",
					"class": "people.profession",
					"friendly_name": "real estate salesperson",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "people.person",
					"class": "people.person",
					"friendly_name": "Person",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "people.profession.people_with_this_profession",
					"friendly_name": "People With This Profession"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "people.person.parents",
					"friendly_name": "Parents"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "people.person.profession",
					"friendly_name": "Profession"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.actor . \nVALUES ?x1 { :en.real_estate_broker } \n?x2 :type.object.type :people.person . \n?x1 :people.profession.people_with_this_profession ?x0 . \n?x0 :people.person.parents ?x2 . \n?x2 :people.person.profession ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 238000300,
		"question": "which film actor is also a second-generation real estate broker?",
		"answer": [
			"Sherry Boucher"
		],
		"function": "none",
		"commonness": -17.88979586669183,
		"num_node": 3,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.actor",
					"class": "film.actor",
					"friendly_name": "Film actor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.real_estate_broker",
					"class": "people.profession",
					"friendly_name": "Real estate broker",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "people.person",
					"class": "people.person",
					"friendly_name": "Person",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "people.profession.people_with_this_profession",
					"friendly_name": "People With This Profession"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "people.person.parents",
					"friendly_name": "Parents"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "people.person.profession",
					"friendly_name": "Profession"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.actor . \nVALUES ?x1 { :en.real_estate_broker } \n?x2 :type.object.type :people.person . \n?x1 :people.profession.people_with_this_profession ?x0 . \n?x0 :people.person.parents ?x2 . \n?x2 :people.person.profession ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 238000301,
		"question": "which film actor is also a second-generation realtor?",
		"answer": [
			"Sherry Boucher"
		],
		"function": "none",
		"commonness": -17.88979586669183,
		"num_node": 3,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.actor",
					"class": "film.actor",
					"friendly_name": "Film actor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.real_estate_broker",
					"class": "people.profession",
					"friendly_name": "realtor",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "people.person",
					"class": "people.person",
					"friendly_name": "Person",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "people.profession.people_with_this_profession",
					"friendly_name": "People With This Profession"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "people.person.parents",
					"friendly_name": "Parents"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "people.person.profession",
					"friendly_name": "Profession"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.actor . \nVALUES ?x1 { :en.real_estate_broker } \n?x2 :type.object.type :people.person . \n?x1 :people.profession.people_with_this_profession ?x0 . \n?x0 :people.person.parents ?x2 . \n?x2 :people.person.profession ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 238000302,
		"question": "which film actor is also a second-generation real estate salesperson?",
		"answer": [
			"Sherry Boucher"
		],
		"function": "none",
		"commonness": -17.88979586669183,
		"num_node": 3,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.actor",
					"class": "film.actor",
					"friendly_name": "Film actor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.real_estate_broker",
					"class": "people.profession",
					"friendly_name": "real estate salesperson",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "people.person",
					"class": "people.person",
					"friendly_name": "Person",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "people.profession.people_with_this_profession",
					"friendly_name": "People With This Profession"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "people.person.parents",
					"friendly_name": "Parents"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "people.person.profession",
					"friendly_name": "Profession"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.actor . \nVALUES ?x1 { :en.real_estate_broker } \n?x2 :type.object.type :people.person . \n?x1 :people.profession.people_with_this_profession ?x0 . \n?x0 :people.person.parents ?x2 . \n?x2 :people.person.profession ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 239000000,
		"question": "for the religions share the same god with christianity, what are their beliefs?",
		"answer": [
			"Sola fide",
			"Equality between men and women",
			"World peace",
			"Omniscience",
			"Unitarian monotheism",
			"Universal auxiliary language",
			"Papal infallibility",
			"Infallibility of the Church",
			"Sola gratia",
			"Creation",
			"Incarnation",
			"Degrees of glory",
			"Transubstantiation",
			"Monotheism",
			"Elimination of extremes of wealth and poverty",
			"Unity of Religeon",
			"God in Mormonism",
			"Obedience to government and non-involvement in partisan politics",
			"Fall of man",
			"Omnipotence",
			"Tikkun olam",
			"Salvation",
			"Sola scriptura",
			"Trinity",
			"Marriage for Time and All Eternity",
			"Unity of Mankind",
			"Families Can Be Forever",
			"Elimination of all forms of prejudice",
			"Nontrinitarianism",
			"Unity of God",
			"Independent investigation of truth",
			"Original sin",
			"Solus Christus",
			"Premortality",
			"Divine simplicity",
			"Harmony of religion and science",
			"Resurrection appearances of Jesus",
			"Eastern Orthodox view of sin",
			"Soli Deo gloria",
			"Universal compulsory education",
			"Virgin birth of Jesus"
		],
		"function": "none",
		"commonness": -24.899294145777223,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "religion.belief",
					"class": "religion.belief",
					"friendly_name": "Belief",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "religion.religion",
					"class": "religion.religion",
					"friendly_name": "Religion",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "religion.deity",
					"class": "religion.deity",
					"friendly_name": "Deity",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.christianity",
					"class": "religion.religion",
					"friendly_name": "Christianity",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "religion.belief.belief_of",
					"friendly_name": "Belief Of"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "religion.deity.deity_of",
					"friendly_name": "Religion(s) That Worship This Deity"
				},
				{
					"start": 2,
					"end": 3,
					"relation": "religion.deity.deity_of",
					"friendly_name": "Religion(s) That Worship This Deity"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :religion.belief . \n?x1 :type.object.type :religion.religion . \n?x2 :type.object.type :religion.deity . \nVALUES ?x3 { :en.christianity } \n?x0 :religion.belief.belief_of ?x1 . \n?x2 :religion.deity.deity_of ?x1 . \n?x2 :religion.deity.deity_of ?x3 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 239000001,
		"question": "for the religions share the same god with christian faith, what are their beliefs?",
		"answer": [
			"Divine simplicity",
			"Salvation",
			"Harmony of religion and science",
			"Omniscience",
			"Resurrection appearances of Jesus",
			"Original sin",
			"Elimination of all forms of prejudice",
			"Solus Christus",
			"Universal auxiliary language",
			"Unity of Mankind",
			"Infallibility of the Church",
			"Nontrinitarianism",
			"Eastern Orthodox view of sin",
			"Unity of Religeon",
			"Independent investigation of truth",
			"Fall of man",
			"Creation",
			"Incarnation",
			"Premortality",
			"God in Mormonism",
			"Obedience to government and non-involvement in partisan politics",
			"World peace",
			"Universal compulsory education",
			"Elimination of extremes of wealth and poverty",
			"Sola gratia",
			"Soli Deo gloria",
			"Families Can Be Forever",
			"Transubstantiation",
			"Trinity",
			"Tikkun olam",
			"Sola fide",
			"Omnipotence",
			"Papal infallibility",
			"Degrees of glory",
			"Marriage for Time and All Eternity",
			"Unitarian monotheism",
			"Equality between men and women",
			"Unity of God",
			"Virgin birth of Jesus",
			"Sola scriptura",
			"Monotheism"
		],
		"function": "none",
		"commonness": -24.899294145777223,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "religion.belief",
					"class": "religion.belief",
					"friendly_name": "Belief",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "religion.religion",
					"class": "religion.religion",
					"friendly_name": "Religion",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "religion.deity",
					"class": "religion.deity",
					"friendly_name": "Deity",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.christianity",
					"class": "religion.religion",
					"friendly_name": "christian faith",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "religion.belief.belief_of",
					"friendly_name": "Belief Of"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "religion.deity.deity_of",
					"friendly_name": "Religion(s) That Worship This Deity"
				},
				{
					"start": 2,
					"end": 3,
					"relation": "religion.deity.deity_of",
					"friendly_name": "Religion(s) That Worship This Deity"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :religion.belief . \n?x1 :type.object.type :religion.religion . \n?x2 :type.object.type :religion.deity . \nVALUES ?x3 { :en.christianity } \n?x0 :religion.belief.belief_of ?x1 . \n?x2 :religion.deity.deity_of ?x1 . \n?x2 :religion.deity.deity_of ?x3 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 239000002,
		"question": "for the religions share the same god with christian religion, what are their beliefs?",
		"answer": [
			"Elimination of extremes of wealth and poverty",
			"Incarnation",
			"Harmony of religion and science",
			"Sola scriptura",
			"World peace",
			"Virgin birth of Jesus",
			"Sola gratia",
			"Soli Deo gloria",
			"Resurrection appearances of Jesus",
			"Creation",
			"Eastern Orthodox view of sin",
			"Independent investigation of truth",
			"Sola fide",
			"Marriage for Time and All Eternity",
			"Elimination of all forms of prejudice",
			"Unity of God",
			"Original sin",
			"Omnipotence",
			"Monotheism",
			"Unitarian monotheism",
			"Degrees of glory",
			"God in Mormonism",
			"Papal infallibility",
			"Omniscience",
			"Tikkun olam",
			"Families Can Be Forever",
			"Salvation",
			"Solus Christus",
			"Trinity",
			"Unity of Mankind",
			"Unity of Religeon",
			"Divine simplicity",
			"Universal compulsory education",
			"Universal auxiliary language",
			"Nontrinitarianism",
			"Obedience to government and non-involvement in partisan politics",
			"Infallibility of the Church",
			"Fall of man",
			"Transubstantiation",
			"Equality between men and women",
			"Premortality"
		],
		"function": "none",
		"commonness": -24.899294145777223,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "religion.belief",
					"class": "religion.belief",
					"friendly_name": "Belief",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "religion.religion",
					"class": "religion.religion",
					"friendly_name": "Religion",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "religion.deity",
					"class": "religion.deity",
					"friendly_name": "Deity",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.christianity",
					"class": "religion.religion",
					"friendly_name": "christian religion",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "religion.belief.belief_of",
					"friendly_name": "Belief Of"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "religion.deity.deity_of",
					"friendly_name": "Religion(s) That Worship This Deity"
				},
				{
					"start": 2,
					"end": 3,
					"relation": "religion.deity.deity_of",
					"friendly_name": "Religion(s) That Worship This Deity"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :religion.belief . \n?x1 :type.object.type :religion.religion . \n?x2 :type.object.type :religion.deity . \nVALUES ?x3 { :en.christianity } \n?x0 :religion.belief.belief_of ?x1 . \n?x2 :religion.deity.deity_of ?x1 . \n?x2 :religion.deity.deity_of ?x3 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 239000100,
		"question": "what do religions that share a common deity with christianity believe?",
		"answer": [
			"Elimination of all forms of prejudice",
			"Premortality",
			"Divine simplicity",
			"Unity of God",
			"Harmony of religion and science",
			"Trinity",
			"Sola fide",
			"Nontrinitarianism",
			"Equality between men and women",
			"Omniscience",
			"Families Can Be Forever",
			"Resurrection appearances of Jesus",
			"Papal infallibility",
			"Universal auxiliary language",
			"Salvation",
			"Marriage for Time and All Eternity",
			"Sola gratia",
			"Unitarian monotheism",
			"Virgin birth of Jesus",
			"God in Mormonism",
			"Fall of man",
			"Tikkun olam",
			"Eastern Orthodox view of sin",
			"Universal compulsory education",
			"Unity of Mankind",
			"Omnipotence",
			"Degrees of glory",
			"Independent investigation of truth",
			"Monotheism",
			"Infallibility of the Church",
			"Creation",
			"Elimination of extremes of wealth and poverty",
			"World peace",
			"Sola scriptura",
			"Obedience to government and non-involvement in partisan politics",
			"Unity of Religeon",
			"Solus Christus",
			"Transubstantiation",
			"Original sin",
			"Incarnation",
			"Soli Deo gloria"
		],
		"function": "none",
		"commonness": -24.899294145777223,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "religion.belief",
					"class": "religion.belief",
					"friendly_name": "Belief",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "religion.religion",
					"class": "religion.religion",
					"friendly_name": "Religion",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "religion.deity",
					"class": "religion.deity",
					"friendly_name": "Deity",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.christianity",
					"class": "religion.religion",
					"friendly_name": "Christianity",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "religion.belief.belief_of",
					"friendly_name": "Belief Of"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "religion.deity.deity_of",
					"friendly_name": "Religion(s) That Worship This Deity"
				},
				{
					"start": 2,
					"end": 3,
					"relation": "religion.deity.deity_of",
					"friendly_name": "Religion(s) That Worship This Deity"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :religion.belief . \n?x1 :type.object.type :religion.religion . \n?x2 :type.object.type :religion.deity . \nVALUES ?x3 { :en.christianity } \n?x0 :religion.belief.belief_of ?x1 . \n?x2 :religion.deity.deity_of ?x1 . \n?x2 :religion.deity.deity_of ?x3 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 239000101,
		"question": "what do religions that share a common deity with christian faith believe?",
		"answer": [
			"Eastern Orthodox view of sin",
			"Families Can Be Forever",
			"Salvation",
			"Solus Christus",
			"Fall of man",
			"Independent investigation of truth",
			"Universal compulsory education",
			"Unity of Mankind",
			"Monotheism",
			"Papal infallibility",
			"Marriage for Time and All Eternity",
			"Unity of Religeon",
			"Unity of God",
			"Nontrinitarianism",
			"Unitarian monotheism",
			"Equality between men and women",
			"Elimination of all forms of prejudice",
			"Sola fide",
			"Degrees of glory",
			"Transubstantiation",
			"Original sin",
			"Harmony of religion and science",
			"Sola gratia",
			"Sola scriptura",
			"Universal auxiliary language",
			"Infallibility of the Church",
			"Trinity",
			"Divine simplicity",
			"Resurrection appearances of Jesus",
			"Creation",
			"World peace",
			"Premortality",
			"Virgin birth of Jesus",
			"Omniscience",
			"Elimination of extremes of wealth and poverty",
			"God in Mormonism",
			"Tikkun olam",
			"Incarnation",
			"Obedience to government and non-involvement in partisan politics",
			"Omnipotence",
			"Soli Deo gloria"
		],
		"function": "none",
		"commonness": -24.899294145777223,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "religion.belief",
					"class": "religion.belief",
					"friendly_name": "Belief",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "religion.religion",
					"class": "religion.religion",
					"friendly_name": "Religion",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "religion.deity",
					"class": "religion.deity",
					"friendly_name": "Deity",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.christianity",
					"class": "religion.religion",
					"friendly_name": "christian faith",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "religion.belief.belief_of",
					"friendly_name": "Belief Of"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "religion.deity.deity_of",
					"friendly_name": "Religion(s) That Worship This Deity"
				},
				{
					"start": 2,
					"end": 3,
					"relation": "religion.deity.deity_of",
					"friendly_name": "Religion(s) That Worship This Deity"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :religion.belief . \n?x1 :type.object.type :religion.religion . \n?x2 :type.object.type :religion.deity . \nVALUES ?x3 { :en.christianity } \n?x0 :religion.belief.belief_of ?x1 . \n?x2 :religion.deity.deity_of ?x1 . \n?x2 :religion.deity.deity_of ?x3 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	}
]