[
	{
		"qid": 199000101,
		"question": "what other radio programs are similar to opry?",
		"answer": [
			"A Prairie Home Companion"
		],
		"function": "none",
		"commonness": -23.568853346576827,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "radio.radio_program",
					"class": "radio.radio_program",
					"friendly_name": "Radio program",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "broadcast.genre",
					"class": "broadcast.genre",
					"friendly_name": "Broadcast Genre",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.grand_ole_opry",
					"class": "broadcast.content",
					"friendly_name": "opry",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.content.genre",
					"friendly_name": "Genres"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "broadcast.content.genre",
					"friendly_name": "Genres"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :radio.radio_program . \n?x1 :type.object.type :broadcast.genre . \nVALUES ?x2 { :en.grand_ole_opry } \n?x0 :broadcast.content.genre ?x1 . \n?x2 :broadcast.content.genre ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 199000102,
		"question": "what other radio programs are similar to grand old opry?",
		"answer": [
			"A Prairie Home Companion"
		],
		"function": "none",
		"commonness": -23.568853346576827,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "radio.radio_program",
					"class": "radio.radio_program",
					"friendly_name": "Radio program",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "broadcast.genre",
					"class": "broadcast.genre",
					"friendly_name": "Broadcast Genre",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.grand_ole_opry",
					"class": "broadcast.content",
					"friendly_name": "grand old opry",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.content.genre",
					"friendly_name": "Genres"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "broadcast.content.genre",
					"friendly_name": "Genres"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :radio.radio_program . \n?x1 :type.object.type :broadcast.genre . \nVALUES ?x2 { :en.grand_ole_opry } \n?x0 :broadcast.content.genre ?x1 . \n?x2 :broadcast.content.genre ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 199000200,
		"question": "grand ole opry is in the same genre as which other radio programs?",
		"answer": [
			"A Prairie Home Companion"
		],
		"function": "none",
		"commonness": -23.568853346576827,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "radio.radio_program",
					"class": "radio.radio_program",
					"friendly_name": "Radio program",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "broadcast.genre",
					"class": "broadcast.genre",
					"friendly_name": "Broadcast Genre",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.grand_ole_opry",
					"class": "broadcast.content",
					"friendly_name": "Grand Ole Opry",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.content.genre",
					"friendly_name": "Genres"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "broadcast.content.genre",
					"friendly_name": "Genres"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :radio.radio_program . \n?x1 :type.object.type :broadcast.genre . \nVALUES ?x2 { :en.grand_ole_opry } \n?x0 :broadcast.content.genre ?x1 . \n?x2 :broadcast.content.genre ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 199000201,
		"question": "opry is in the same genre as which other radio programs?",
		"answer": [
			"A Prairie Home Companion"
		],
		"function": "none",
		"commonness": -23.568853346576827,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "radio.radio_program",
					"class": "radio.radio_program",
					"friendly_name": "Radio program",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "broadcast.genre",
					"class": "broadcast.genre",
					"friendly_name": "Broadcast Genre",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.grand_ole_opry",
					"class": "broadcast.content",
					"friendly_name": "opry",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.content.genre",
					"friendly_name": "Genres"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "broadcast.content.genre",
					"friendly_name": "Genres"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :radio.radio_program . \n?x1 :type.object.type :broadcast.genre . \nVALUES ?x2 { :en.grand_ole_opry } \n?x0 :broadcast.content.genre ?x1 . \n?x2 :broadcast.content.genre ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 199000202,
		"question": "grand old opry is in the same genre as which other radio programs?",
		"answer": [
			"A Prairie Home Companion"
		],
		"function": "none",
		"commonness": -23.568853346576827,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "radio.radio_program",
					"class": "radio.radio_program",
					"friendly_name": "Radio program",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "broadcast.genre",
					"class": "broadcast.genre",
					"friendly_name": "Broadcast Genre",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.grand_ole_opry",
					"class": "broadcast.content",
					"friendly_name": "grand old opry",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.content.genre",
					"friendly_name": "Genres"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "broadcast.content.genre",
					"friendly_name": "Genres"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :radio.radio_program . \n?x1 :type.object.type :broadcast.genre . \nVALUES ?x2 { :en.grand_ole_opry } \n?x0 :broadcast.content.genre ?x1 . \n?x2 :broadcast.content.genre ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 199000300,
		"question": "which radio programs can be found under the same genre with grand ole opry?",
		"answer": [
			"A Prairie Home Companion"
		],
		"function": "none",
		"commonness": -23.568853346576827,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "radio.radio_program",
					"class": "radio.radio_program",
					"friendly_name": "Radio program",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "broadcast.genre",
					"class": "broadcast.genre",
					"friendly_name": "Broadcast Genre",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.grand_ole_opry",
					"class": "broadcast.content",
					"friendly_name": "Grand Ole Opry",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.content.genre",
					"friendly_name": "Genres"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "broadcast.content.genre",
					"friendly_name": "Genres"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :radio.radio_program . \n?x1 :type.object.type :broadcast.genre . \nVALUES ?x2 { :en.grand_ole_opry } \n?x0 :broadcast.content.genre ?x1 . \n?x2 :broadcast.content.genre ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 199000301,
		"question": "which radio programs can be found under the same genre with opry?",
		"answer": [
			"A Prairie Home Companion"
		],
		"function": "none",
		"commonness": -23.568853346576827,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "radio.radio_program",
					"class": "radio.radio_program",
					"friendly_name": "Radio program",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "broadcast.genre",
					"class": "broadcast.genre",
					"friendly_name": "Broadcast Genre",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.grand_ole_opry",
					"class": "broadcast.content",
					"friendly_name": "opry",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.content.genre",
					"friendly_name": "Genres"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "broadcast.content.genre",
					"friendly_name": "Genres"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :radio.radio_program . \n?x1 :type.object.type :broadcast.genre . \nVALUES ?x2 { :en.grand_ole_opry } \n?x0 :broadcast.content.genre ?x1 . \n?x2 :broadcast.content.genre ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 199000302,
		"question": "which radio programs can be found under the same genre with grand old opry?",
		"answer": [
			"A Prairie Home Companion"
		],
		"function": "none",
		"commonness": -23.568853346576827,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "radio.radio_program",
					"class": "radio.radio_program",
					"friendly_name": "Radio program",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "broadcast.genre",
					"class": "broadcast.genre",
					"friendly_name": "Broadcast Genre",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.grand_ole_opry",
					"class": "broadcast.content",
					"friendly_name": "grand old opry",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.content.genre",
					"friendly_name": "Genres"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "broadcast.content.genre",
					"friendly_name": "Genres"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :radio.radio_program . \n?x1 :type.object.type :broadcast.genre . \nVALUES ?x2 { :en.grand_ole_opry } \n?x0 :broadcast.content.genre ?x1 . \n?x2 :broadcast.content.genre ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 199000400,
		"question": "what radio shows share the same genre that's attributed to grand ole opry?",
		"answer": [
			"A Prairie Home Companion"
		],
		"function": "none",
		"commonness": -23.568853346576827,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "radio.radio_program",
					"class": "radio.radio_program",
					"friendly_name": "Radio program",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "broadcast.genre",
					"class": "broadcast.genre",
					"friendly_name": "Broadcast Genre",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.grand_ole_opry",
					"class": "broadcast.content",
					"friendly_name": "Grand Ole Opry",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.content.genre",
					"friendly_name": "Genres"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "broadcast.content.genre",
					"friendly_name": "Genres"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :radio.radio_program . \n?x1 :type.object.type :broadcast.genre . \nVALUES ?x2 { :en.grand_ole_opry } \n?x0 :broadcast.content.genre ?x1 . \n?x2 :broadcast.content.genre ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 199000401,
		"question": "what radio shows share the same genre that's attributed to opry?",
		"answer": [
			"A Prairie Home Companion"
		],
		"function": "none",
		"commonness": -23.568853346576827,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "radio.radio_program",
					"class": "radio.radio_program",
					"friendly_name": "Radio program",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "broadcast.genre",
					"class": "broadcast.genre",
					"friendly_name": "Broadcast Genre",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.grand_ole_opry",
					"class": "broadcast.content",
					"friendly_name": "opry",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.content.genre",
					"friendly_name": "Genres"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "broadcast.content.genre",
					"friendly_name": "Genres"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :radio.radio_program . \n?x1 :type.object.type :broadcast.genre . \nVALUES ?x2 { :en.grand_ole_opry } \n?x0 :broadcast.content.genre ?x1 . \n?x2 :broadcast.content.genre ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 199000402,
		"question": "what radio shows share the same genre that's attributed to grand old opry?",
		"answer": [
			"A Prairie Home Companion"
		],
		"function": "none",
		"commonness": -23.568853346576827,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "radio.radio_program",
					"class": "radio.radio_program",
					"friendly_name": "Radio program",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "broadcast.genre",
					"class": "broadcast.genre",
					"friendly_name": "Broadcast Genre",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.grand_ole_opry",
					"class": "broadcast.content",
					"friendly_name": "grand old opry",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.content.genre",
					"friendly_name": "Genres"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "broadcast.content.genre",
					"friendly_name": "Genres"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :radio.radio_program . \n?x1 :type.object.type :broadcast.genre . \nVALUES ?x2 { :en.grand_ole_opry } \n?x0 :broadcast.content.genre ?x1 . \n?x2 :broadcast.content.genre ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 200000000,
		"question": "using the same method used to discover pluto, what celestial objects are discovered?",
		"answer": [
			"Neptune"
		],
		"function": "none",
		"commonness": -30.78749144639272,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.astronomical_discovery",
					"class": "astronomy.astronomical_discovery",
					"friendly_name": "Astronomical Discovery",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "astronomy.astronomical_discovery_technique",
					"class": "astronomy.astronomical_discovery_technique",
					"friendly_name": "Astronomical Discovery Technique",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.pluto",
					"class": "astronomy.astronomical_discovery",
					"friendly_name": "Pluto",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "astronomy.astronomical_discovery.discovery_technique",
					"friendly_name": "Discovery Technique"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "astronomy.astronomical_discovery_technique.astronomical_discoveries_by_this_method",
					"friendly_name": "Astronomical discoveries by this method"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.astronomical_discovery . \n?x1 :type.object.type :astronomy.astronomical_discovery_technique . \nVALUES ?x2 { :en.pluto } \n?x0 :astronomy.astronomical_discovery.discovery_technique ?x1 . \n?x1 :astronomy.astronomical_discovery_technique.astronomical_discoveries_by_this_method ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 200000100,
		"question": "the technique which led to the discovery of pluto has also been used to discover which other celestial bodies?",
		"answer": [
			"Neptune"
		],
		"function": "none",
		"commonness": -30.78749144639272,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.astronomical_discovery",
					"class": "astronomy.astronomical_discovery",
					"friendly_name": "Astronomical Discovery",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "astronomy.astronomical_discovery_technique",
					"class": "astronomy.astronomical_discovery_technique",
					"friendly_name": "Astronomical Discovery Technique",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.pluto",
					"class": "astronomy.astronomical_discovery",
					"friendly_name": "Pluto",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "astronomy.astronomical_discovery.discovery_technique",
					"friendly_name": "Discovery Technique"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "astronomy.astronomical_discovery_technique.astronomical_discoveries_by_this_method",
					"friendly_name": "Astronomical discoveries by this method"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.astronomical_discovery . \n?x1 :type.object.type :astronomy.astronomical_discovery_technique . \nVALUES ?x2 { :en.pluto } \n?x0 :astronomy.astronomical_discovery.discovery_technique ?x1 . \n?x1 :astronomy.astronomical_discovery_technique.astronomical_discoveries_by_this_method ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 200000200,
		"question": "the technique utilized to discover pluto has been applied to what other discoveries?",
		"answer": [
			"Neptune"
		],
		"function": "none",
		"commonness": -30.78749144639272,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.astronomical_discovery",
					"class": "astronomy.astronomical_discovery",
					"friendly_name": "Astronomical Discovery",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "astronomy.astronomical_discovery_technique",
					"class": "astronomy.astronomical_discovery_technique",
					"friendly_name": "Astronomical Discovery Technique",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.pluto",
					"class": "astronomy.astronomical_discovery",
					"friendly_name": "Pluto",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "astronomy.astronomical_discovery.discovery_technique",
					"friendly_name": "Discovery Technique"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "astronomy.astronomical_discovery_technique.astronomical_discoveries_by_this_method",
					"friendly_name": "Astronomical discoveries by this method"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.astronomical_discovery . \n?x1 :type.object.type :astronomy.astronomical_discovery_technique . \nVALUES ?x2 { :en.pluto } \n?x0 :astronomy.astronomical_discovery.discovery_technique ?x1 . \n?x1 :astronomy.astronomical_discovery_technique.astronomical_discoveries_by_this_method ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 200000300,
		"question": "which astronomical discovery was made using same techniques as for discovering pluto?",
		"answer": [
			"Neptune"
		],
		"function": "none",
		"commonness": -30.78749144639272,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.astronomical_discovery",
					"class": "astronomy.astronomical_discovery",
					"friendly_name": "Astronomical Discovery",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "astronomy.astronomical_discovery_technique",
					"class": "astronomy.astronomical_discovery_technique",
					"friendly_name": "Astronomical Discovery Technique",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.pluto",
					"class": "astronomy.astronomical_discovery",
					"friendly_name": "Pluto",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "astronomy.astronomical_discovery.discovery_technique",
					"friendly_name": "Discovery Technique"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "astronomy.astronomical_discovery_technique.astronomical_discoveries_by_this_method",
					"friendly_name": "Astronomical discoveries by this method"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.astronomical_discovery . \n?x1 :type.object.type :astronomy.astronomical_discovery_technique . \nVALUES ?x2 { :en.pluto } \n?x0 :astronomy.astronomical_discovery.discovery_technique ?x1 . \n?x1 :astronomy.astronomical_discovery_technique.astronomical_discoveries_by_this_method ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 200000400,
		"question": "which celestial objects are discovered using the same technique as in the discovery of pluto?",
		"answer": [
			"Neptune"
		],
		"function": "none",
		"commonness": -30.78749144639272,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.astronomical_discovery",
					"class": "astronomy.astronomical_discovery",
					"friendly_name": "Astronomical Discovery",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "astronomy.astronomical_discovery_technique",
					"class": "astronomy.astronomical_discovery_technique",
					"friendly_name": "Astronomical Discovery Technique",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.pluto",
					"class": "astronomy.astronomical_discovery",
					"friendly_name": "Pluto",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "astronomy.astronomical_discovery.discovery_technique",
					"friendly_name": "Discovery Technique"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "astronomy.astronomical_discovery_technique.astronomical_discoveries_by_this_method",
					"friendly_name": "Astronomical discoveries by this method"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.astronomical_discovery . \n?x1 :type.object.type :astronomy.astronomical_discovery_technique . \nVALUES ?x2 { :en.pluto } \n?x0 :astronomy.astronomical_discovery.discovery_technique ?x1 . \n?x1 :astronomy.astronomical_discovery_technique.astronomical_discoveries_by_this_method ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 201000000,
		"question": "how many chivalric positions have been held by elizabeth ii?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -28.127815254172205,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "royalty.chivalric_office",
					"class": "royalty.chivalric_office",
					"friendly_name": "Chivalric Office",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "royalty.chivalric_order_position_tenure",
					"class": "royalty.chivalric_order_position_tenure",
					"friendly_name": "Chivalric Order Officer Tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.elizabeth_ii_of_the_united_kingdom",
					"class": "royalty.chivalric_order_officer",
					"friendly_name": "Elizabeth II",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "royalty.chivalric_order_position_tenure.chivalric_office",
					"friendly_name": "Chivalric Position"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "royalty.chivalric_order_officer.offices_held",
					"friendly_name": "Offices Held"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :royalty.chivalric_office . \n?x1 :type.object.type :royalty.chivalric_order_position_tenure . \nVALUES ?x2 { :en.elizabeth_ii_of_the_united_kingdom } \n?x1 :royalty.chivalric_order_position_tenure.chivalric_office ?x0 . \n?x2 :royalty.chivalric_order_officer.offices_held ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	}
]