[
	{
		"qid": 174000100,
		"question": "which characters with the same rank as zuko are dead?",
		"answer": [
			"Troilus",
			"Vegeta"
		],
		"function": "none",
		"commonness": -23.94775446705927,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.fictionaluniverse.deceased_fictional_character",
					"class": "base.fictionaluniverse.deceased_fictional_character",
					"friendly_name": "Deceased Fictional Character",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "fictional_universe.character_rank",
					"class": "fictional_universe.character_rank",
					"friendly_name": "Character Rank",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.prince_zuko",
					"class": "fictional_universe.fictional_character",
					"friendly_name": "Zuko",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "fictional_universe.character_rank.characters_of_this_rank",
					"friendly_name": "Characters of This Rank"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "fictional_universe.fictional_character.rank",
					"friendly_name": "Rank"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.fictionaluniverse.deceased_fictional_character . \n?x1 :type.object.type :fictional_universe.character_rank . \nVALUES ?x2 { :en.prince_zuko } \n?x1 :fictional_universe.character_rank.characters_of_this_rank ?x0 . \n?x2 :fictional_universe.fictional_character.rank ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 174000101,
		"question": "which characters with the same rank as prince zuko are dead?",
		"answer": [
			"Troilus",
			"Vegeta"
		],
		"function": "none",
		"commonness": -23.94775446705927,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.fictionaluniverse.deceased_fictional_character",
					"class": "base.fictionaluniverse.deceased_fictional_character",
					"friendly_name": "Deceased Fictional Character",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "fictional_universe.character_rank",
					"class": "fictional_universe.character_rank",
					"friendly_name": "Character Rank",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.prince_zuko",
					"class": "fictional_universe.fictional_character",
					"friendly_name": "prince zuko",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "fictional_universe.character_rank.characters_of_this_rank",
					"friendly_name": "Characters of This Rank"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "fictional_universe.fictional_character.rank",
					"friendly_name": "Rank"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.fictionaluniverse.deceased_fictional_character . \n?x1 :type.object.type :fictional_universe.character_rank . \nVALUES ?x2 { :en.prince_zuko } \n?x1 :fictional_universe.character_rank.characters_of_this_rank ?x0 . \n?x2 :fictional_universe.fictional_character.rank ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 174000200,
		"question": "which characters that have died have the same rank with zuko?",
		"answer": [
			"Troilus",
			"Vegeta"
		],
		"function": "none",
		"commonness": -23.94775446705927,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.fictionaluniverse.deceased_fictional_character",
					"class": "base.fictionaluniverse.deceased_fictional_character",
					"friendly_name": "Deceased Fictional Character",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "fictional_universe.character_rank",
					"class": "fictional_universe.character_rank",
					"friendly_name": "Character Rank",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.prince_zuko",
					"class": "fictional_universe.fictional_character",
					"friendly_name": "Zuko",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "fictional_universe.character_rank.characters_of_this_rank",
					"friendly_name": "Characters of This Rank"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "fictional_universe.fictional_character.rank",
					"friendly_name": "Rank"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.fictionaluniverse.deceased_fictional_character . \n?x1 :type.object.type :fictional_universe.character_rank . \nVALUES ?x2 { :en.prince_zuko } \n?x1 :fictional_universe.character_rank.characters_of_this_rank ?x0 . \n?x2 :fictional_universe.fictional_character.rank ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 174000201,
		"question": "which characters that have died have the same rank with prince zuko?",
		"answer": [
			"Vegeta",
			"Troilus"
		],
		"function": "none",
		"commonness": -23.94775446705927,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.fictionaluniverse.deceased_fictional_character",
					"class": "base.fictionaluniverse.deceased_fictional_character",
					"friendly_name": "Deceased Fictional Character",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "fictional_universe.character_rank",
					"class": "fictional_universe.character_rank",
					"friendly_name": "Character Rank",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.prince_zuko",
					"class": "fictional_universe.fictional_character",
					"friendly_name": "prince zuko",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "fictional_universe.character_rank.characters_of_this_rank",
					"friendly_name": "Characters of This Rank"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "fictional_universe.fictional_character.rank",
					"friendly_name": "Rank"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.fictionaluniverse.deceased_fictional_character . \n?x1 :type.object.type :fictional_universe.character_rank . \nVALUES ?x2 { :en.prince_zuko } \n?x1 :fictional_universe.character_rank.characters_of_this_rank ?x0 . \n?x2 :fictional_universe.fictional_character.rank ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 174000300,
		"question": "which deceased characters have the same rank with zuko?",
		"answer": [
			"Vegeta",
			"Troilus"
		],
		"function": "none",
		"commonness": -23.94775446705927,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.fictionaluniverse.deceased_fictional_character",
					"class": "base.fictionaluniverse.deceased_fictional_character",
					"friendly_name": "Deceased Fictional Character",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "fictional_universe.character_rank",
					"class": "fictional_universe.character_rank",
					"friendly_name": "Character Rank",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.prince_zuko",
					"class": "fictional_universe.fictional_character",
					"friendly_name": "Zuko",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "fictional_universe.character_rank.characters_of_this_rank",
					"friendly_name": "Characters of This Rank"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "fictional_universe.fictional_character.rank",
					"friendly_name": "Rank"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.fictionaluniverse.deceased_fictional_character . \n?x1 :type.object.type :fictional_universe.character_rank . \nVALUES ?x2 { :en.prince_zuko } \n?x1 :fictional_universe.character_rank.characters_of_this_rank ?x0 . \n?x2 :fictional_universe.fictional_character.rank ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 174000301,
		"question": "which deceased characters have the same rank with prince zuko?",
		"answer": [
			"Vegeta",
			"Troilus"
		],
		"function": "none",
		"commonness": -23.94775446705927,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.fictionaluniverse.deceased_fictional_character",
					"class": "base.fictionaluniverse.deceased_fictional_character",
					"friendly_name": "Deceased Fictional Character",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "fictional_universe.character_rank",
					"class": "fictional_universe.character_rank",
					"friendly_name": "Character Rank",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.prince_zuko",
					"class": "fictional_universe.fictional_character",
					"friendly_name": "prince zuko",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "fictional_universe.character_rank.characters_of_this_rank",
					"friendly_name": "Characters of This Rank"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "fictional_universe.fictional_character.rank",
					"friendly_name": "Rank"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.fictionaluniverse.deceased_fictional_character . \n?x1 :type.object.type :fictional_universe.character_rank . \nVALUES ?x2 { :en.prince_zuko } \n?x1 :fictional_universe.character_rank.characters_of_this_rank ?x0 . \n?x2 :fictional_universe.fictional_character.rank ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 175000000,
		"question": "which flag is used by the united states of america?",
		"answer": [
			"Flag of the United States"
		],
		"function": "none",
		"commonness": -20.826569487157226,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "symbols.flag",
					"class": "symbols.flag",
					"friendly_name": "Flag",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "symbols.flag_use",
					"class": "symbols.flag_use",
					"friendly_name": "Flag use",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "symbols.flag_referent",
					"friendly_name": "United States of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "symbols.flag_use.flag",
					"friendly_name": "Flag"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "symbols.flag_use.flag_user",
					"friendly_name": "Flag user"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :symbols.flag . \n?x1 :type.object.type :symbols.flag_use . \nVALUES ?x2 { :en.united_states_of_america } \n?x1 :symbols.flag_use.flag ?x0 . \n?x1 :symbols.flag_use.flag_user ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 175000001,
		"question": "which flag is used by the us?",
		"answer": [
			"Flag of the United States"
		],
		"function": "none",
		"commonness": -20.826569487157226,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "symbols.flag",
					"class": "symbols.flag",
					"friendly_name": "Flag",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "symbols.flag_use",
					"class": "symbols.flag_use",
					"friendly_name": "Flag use",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "symbols.flag_referent",
					"friendly_name": "us",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "symbols.flag_use.flag",
					"friendly_name": "Flag"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "symbols.flag_use.flag_user",
					"friendly_name": "Flag user"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :symbols.flag . \n?x1 :type.object.type :symbols.flag_use . \nVALUES ?x2 { :en.united_states_of_america } \n?x1 :symbols.flag_use.flag ?x0 . \n?x1 :symbols.flag_use.flag_user ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 175000002,
		"question": "which flag is used by the united states?",
		"answer": [
			"Flag of the United States"
		],
		"function": "none",
		"commonness": -20.826569487157226,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "symbols.flag",
					"class": "symbols.flag",
					"friendly_name": "Flag",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "symbols.flag_use",
					"class": "symbols.flag_use",
					"friendly_name": "Flag use",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "symbols.flag_referent",
					"friendly_name": "united states",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "symbols.flag_use.flag",
					"friendly_name": "Flag"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "symbols.flag_use.flag_user",
					"friendly_name": "Flag user"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :symbols.flag . \n?x1 :type.object.type :symbols.flag_use . \nVALUES ?x2 { :en.united_states_of_america } \n?x1 :symbols.flag_use.flag ?x0 . \n?x1 :symbols.flag_use.flag_user ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 175000100,
		"question": "what is the official name of the flag representing the united states of america?",
		"answer": [
			"Flag of the United States"
		],
		"function": "none",
		"commonness": -20.826569487157226,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "symbols.flag",
					"class": "symbols.flag",
					"friendly_name": "Flag",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "symbols.flag_use",
					"class": "symbols.flag_use",
					"friendly_name": "Flag use",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "symbols.flag_referent",
					"friendly_name": "United States of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "symbols.flag_use.flag",
					"friendly_name": "Flag"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "symbols.flag_use.flag_user",
					"friendly_name": "Flag user"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :symbols.flag . \n?x1 :type.object.type :symbols.flag_use . \nVALUES ?x2 { :en.united_states_of_america } \n?x1 :symbols.flag_use.flag ?x0 . \n?x1 :symbols.flag_use.flag_user ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 175000101,
		"question": "what is the official name of the flag representing the us?",
		"answer": [
			"Flag of the United States"
		],
		"function": "none",
		"commonness": -20.826569487157226,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "symbols.flag",
					"class": "symbols.flag",
					"friendly_name": "Flag",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "symbols.flag_use",
					"class": "symbols.flag_use",
					"friendly_name": "Flag use",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "symbols.flag_referent",
					"friendly_name": "us",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "symbols.flag_use.flag",
					"friendly_name": "Flag"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "symbols.flag_use.flag_user",
					"friendly_name": "Flag user"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :symbols.flag . \n?x1 :type.object.type :symbols.flag_use . \nVALUES ?x2 { :en.united_states_of_america } \n?x1 :symbols.flag_use.flag ?x0 . \n?x1 :symbols.flag_use.flag_user ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 175000102,
		"question": "what is the official name of the flag representing the united states?",
		"answer": [
			"Flag of the United States"
		],
		"function": "none",
		"commonness": -20.826569487157226,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "symbols.flag",
					"class": "symbols.flag",
					"friendly_name": "Flag",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "symbols.flag_use",
					"class": "symbols.flag_use",
					"friendly_name": "Flag use",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "symbols.flag_referent",
					"friendly_name": "united states",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "symbols.flag_use.flag",
					"friendly_name": "Flag"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "symbols.flag_use.flag_user",
					"friendly_name": "Flag user"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :symbols.flag . \n?x1 :type.object.type :symbols.flag_use . \nVALUES ?x2 { :en.united_states_of_america } \n?x1 :symbols.flag_use.flag ?x0 . \n?x1 :symbols.flag_use.flag_user ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 175000200,
		"question": "what is the flag of the united states of america?",
		"answer": [
			"Flag of the United States"
		],
		"function": "none",
		"commonness": -20.826569487157226,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "symbols.flag",
					"class": "symbols.flag",
					"friendly_name": "Flag",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "symbols.flag_use",
					"class": "symbols.flag_use",
					"friendly_name": "Flag use",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "symbols.flag_referent",
					"friendly_name": "United States of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "symbols.flag_use.flag",
					"friendly_name": "Flag"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "symbols.flag_use.flag_user",
					"friendly_name": "Flag user"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :symbols.flag . \n?x1 :type.object.type :symbols.flag_use . \nVALUES ?x2 { :en.united_states_of_america } \n?x1 :symbols.flag_use.flag ?x0 . \n?x1 :symbols.flag_use.flag_user ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 175000201,
		"question": "what is the flag of the us?",
		"answer": [
			"Flag of the United States"
		],
		"function": "none",
		"commonness": -20.826569487157226,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "symbols.flag",
					"class": "symbols.flag",
					"friendly_name": "Flag",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "symbols.flag_use",
					"class": "symbols.flag_use",
					"friendly_name": "Flag use",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "symbols.flag_referent",
					"friendly_name": "us",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "symbols.flag_use.flag",
					"friendly_name": "Flag"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "symbols.flag_use.flag_user",
					"friendly_name": "Flag user"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :symbols.flag . \n?x1 :type.object.type :symbols.flag_use . \nVALUES ?x2 { :en.united_states_of_america } \n?x1 :symbols.flag_use.flag ?x0 . \n?x1 :symbols.flag_use.flag_user ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 175000202,
		"question": "what is the flag of the united states?",
		"answer": [
			"Flag of the United States"
		],
		"function": "none",
		"commonness": -20.826569487157226,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "symbols.flag",
					"class": "symbols.flag",
					"friendly_name": "Flag",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "symbols.flag_use",
					"class": "symbols.flag_use",
					"friendly_name": "Flag use",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "symbols.flag_referent",
					"friendly_name": "united states",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "symbols.flag_use.flag",
					"friendly_name": "Flag"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "symbols.flag_use.flag_user",
					"friendly_name": "Flag user"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :symbols.flag . \n?x1 :type.object.type :symbols.flag_use . \nVALUES ?x2 { :en.united_states_of_america } \n?x1 :symbols.flag_use.flag ?x0 . \n?x1 :symbols.flag_use.flag_user ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 175000300,
		"question": "the united states of america uses which flag?",
		"answer": [
			"Flag of the United States"
		],
		"function": "none",
		"commonness": -20.826569487157226,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "symbols.flag",
					"class": "symbols.flag",
					"friendly_name": "Flag",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "symbols.flag_use",
					"class": "symbols.flag_use",
					"friendly_name": "Flag use",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "symbols.flag_referent",
					"friendly_name": "United States of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "symbols.flag_use.flag",
					"friendly_name": "Flag"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "symbols.flag_use.flag_user",
					"friendly_name": "Flag user"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :symbols.flag . \n?x1 :type.object.type :symbols.flag_use . \nVALUES ?x2 { :en.united_states_of_america } \n?x1 :symbols.flag_use.flag ?x0 . \n?x1 :symbols.flag_use.flag_user ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 175000301,
		"question": "the us uses which flag?",
		"answer": [
			"Flag of the United States"
		],
		"function": "none",
		"commonness": -20.826569487157226,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "symbols.flag",
					"class": "symbols.flag",
					"friendly_name": "Flag",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "symbols.flag_use",
					"class": "symbols.flag_use",
					"friendly_name": "Flag use",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "symbols.flag_referent",
					"friendly_name": "us",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "symbols.flag_use.flag",
					"friendly_name": "Flag"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "symbols.flag_use.flag_user",
					"friendly_name": "Flag user"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :symbols.flag . \n?x1 :type.object.type :symbols.flag_use . \nVALUES ?x2 { :en.united_states_of_america } \n?x1 :symbols.flag_use.flag ?x0 . \n?x1 :symbols.flag_use.flag_user ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 175000302,
		"question": "the united states uses which flag?",
		"answer": [
			"Flag of the United States"
		],
		"function": "none",
		"commonness": -20.826569487157226,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "symbols.flag",
					"class": "symbols.flag",
					"friendly_name": "Flag",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "symbols.flag_use",
					"class": "symbols.flag_use",
					"friendly_name": "Flag use",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "symbols.flag_referent",
					"friendly_name": "united states",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "symbols.flag_use.flag",
					"friendly_name": "Flag"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "symbols.flag_use.flag_user",
					"friendly_name": "Flag user"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :symbols.flag . \n?x1 :type.object.type :symbols.flag_use . \nVALUES ?x2 { :en.united_states_of_america } \n?x1 :symbols.flag_use.flag ?x0 . \n?x1 :symbols.flag_use.flag_user ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	}
]