[
	{
		"qid": 188000000,
		"question": "what periodical formats has the new york times been published in?",
		"answer": [
			"Broadsheet"
		],
		"function": "none",
		"commonness": -22.36926920155485,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.periodical_format",
					"class": "book.periodical_format",
					"friendly_name": "Periodical Format",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "book.periodical_format_period",
					"class": "book.periodical_format_period",
					"friendly_name": "Periodical Format Period",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.the_new_york_times",
					"class": "book.periodical",
					"friendly_name": "The New York Times",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "book.periodical_format.periodicals_in_this_format",
					"friendly_name": "Periodicals in this format"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "book.periodical_format_period.periodical",
					"friendly_name": "Periodical"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.periodical_format . \n?x1 :type.object.type :book.periodical_format_period . \nVALUES ?x2 { :en.the_new_york_times } \n?x0 :book.periodical_format.periodicals_in_this_format ?x1 . \n?x1 :book.periodical_format_period.periodical ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 188000001,
		"question": "what periodical formats has new york times been published in?",
		"answer": [
			"Broadsheet"
		],
		"function": "none",
		"commonness": -22.36926920155485,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.periodical_format",
					"class": "book.periodical_format",
					"friendly_name": "Periodical Format",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "book.periodical_format_period",
					"class": "book.periodical_format_period",
					"friendly_name": "Periodical Format Period",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.the_new_york_times",
					"class": "book.periodical",
					"friendly_name": "new york times",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "book.periodical_format.periodicals_in_this_format",
					"friendly_name": "Periodicals in this format"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "book.periodical_format_period.periodical",
					"friendly_name": "Periodical"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.periodical_format . \n?x1 :type.object.type :book.periodical_format_period . \nVALUES ?x2 { :en.the_new_york_times } \n?x0 :book.periodical_format.periodicals_in_this_format ?x1 . \n?x1 :book.periodical_format_period.periodical ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 188000002,
		"question": "what periodical formats has nyt been published in?",
		"answer": [
			"Broadsheet"
		],
		"function": "none",
		"commonness": -22.36926920155485,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.periodical_format",
					"class": "book.periodical_format",
					"friendly_name": "Periodical Format",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "book.periodical_format_period",
					"class": "book.periodical_format_period",
					"friendly_name": "Periodical Format Period",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.the_new_york_times",
					"class": "book.periodical",
					"friendly_name": "nyt",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "book.periodical_format.periodicals_in_this_format",
					"friendly_name": "Periodicals in this format"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "book.periodical_format_period.periodical",
					"friendly_name": "Periodical"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.periodical_format . \n?x1 :type.object.type :book.periodical_format_period . \nVALUES ?x2 { :en.the_new_york_times } \n?x0 :book.periodical_format.periodicals_in_this_format ?x1 . \n?x1 :book.periodical_format_period.periodical ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 188000100,
		"question": "in what formats has the new york times been published?",
		"answer": [
			"Broadsheet"
		],
		"function": "none",
		"commonness": -22.36926920155485,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.periodical_format",
					"class": "book.periodical_format",
					"friendly_name": "Periodical Format",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "book.periodical_format_period",
					"class": "book.periodical_format_period",
					"friendly_name": "Periodical Format Period",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.the_new_york_times",
					"class": "book.periodical",
					"friendly_name": "The New York Times",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "book.periodical_format.periodicals_in_this_format",
					"friendly_name": "Periodicals in this format"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "book.periodical_format_period.periodical",
					"friendly_name": "Periodical"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.periodical_format . \n?x1 :type.object.type :book.periodical_format_period . \nVALUES ?x2 { :en.the_new_york_times } \n?x0 :book.periodical_format.periodicals_in_this_format ?x1 . \n?x1 :book.periodical_format_period.periodical ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 188000101,
		"question": "in what formats has new york times been published?",
		"answer": [
			"Broadsheet"
		],
		"function": "none",
		"commonness": -22.36926920155485,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.periodical_format",
					"class": "book.periodical_format",
					"friendly_name": "Periodical Format",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "book.periodical_format_period",
					"class": "book.periodical_format_period",
					"friendly_name": "Periodical Format Period",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.the_new_york_times",
					"class": "book.periodical",
					"friendly_name": "new york times",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "book.periodical_format.periodicals_in_this_format",
					"friendly_name": "Periodicals in this format"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "book.periodical_format_period.periodical",
					"friendly_name": "Periodical"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.periodical_format . \n?x1 :type.object.type :book.periodical_format_period . \nVALUES ?x2 { :en.the_new_york_times } \n?x0 :book.periodical_format.periodicals_in_this_format ?x1 . \n?x1 :book.periodical_format_period.periodical ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 188000102,
		"question": "in what formats has nyt been published?",
		"answer": [
			"Broadsheet"
		],
		"function": "none",
		"commonness": -22.36926920155485,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.periodical_format",
					"class": "book.periodical_format",
					"friendly_name": "Periodical Format",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "book.periodical_format_period",
					"class": "book.periodical_format_period",
					"friendly_name": "Periodical Format Period",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.the_new_york_times",
					"class": "book.periodical",
					"friendly_name": "nyt",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "book.periodical_format.periodicals_in_this_format",
					"friendly_name": "Periodicals in this format"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "book.periodical_format_period.periodical",
					"friendly_name": "Periodical"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.periodical_format . \n?x1 :type.object.type :book.periodical_format_period . \nVALUES ?x2 { :en.the_new_york_times } \n?x0 :book.periodical_format.periodicals_in_this_format ?x1 . \n?x1 :book.periodical_format_period.periodical ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 188000200,
		"question": "what formats have the new york times used?",
		"answer": [
			"Broadsheet"
		],
		"function": "none",
		"commonness": -22.36926920155485,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.periodical_format",
					"class": "book.periodical_format",
					"friendly_name": "Periodical Format",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "book.periodical_format_period",
					"class": "book.periodical_format_period",
					"friendly_name": "Periodical Format Period",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.the_new_york_times",
					"class": "book.periodical",
					"friendly_name": "The New York Times",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "book.periodical_format.periodicals_in_this_format",
					"friendly_name": "Periodicals in this format"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "book.periodical_format_period.periodical",
					"friendly_name": "Periodical"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.periodical_format . \n?x1 :type.object.type :book.periodical_format_period . \nVALUES ?x2 { :en.the_new_york_times } \n?x0 :book.periodical_format.periodicals_in_this_format ?x1 . \n?x1 :book.periodical_format_period.periodical ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 188000201,
		"question": "what formats have new york times used?",
		"answer": [
			"Broadsheet"
		],
		"function": "none",
		"commonness": -22.36926920155485,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.periodical_format",
					"class": "book.periodical_format",
					"friendly_name": "Periodical Format",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "book.periodical_format_period",
					"class": "book.periodical_format_period",
					"friendly_name": "Periodical Format Period",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.the_new_york_times",
					"class": "book.periodical",
					"friendly_name": "new york times",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "book.periodical_format.periodicals_in_this_format",
					"friendly_name": "Periodicals in this format"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "book.periodical_format_period.periodical",
					"friendly_name": "Periodical"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.periodical_format . \n?x1 :type.object.type :book.periodical_format_period . \nVALUES ?x2 { :en.the_new_york_times } \n?x0 :book.periodical_format.periodicals_in_this_format ?x1 . \n?x1 :book.periodical_format_period.periodical ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 188000202,
		"question": "what formats have nyt used?",
		"answer": [
			"Broadsheet"
		],
		"function": "none",
		"commonness": -22.36926920155485,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.periodical_format",
					"class": "book.periodical_format",
					"friendly_name": "Periodical Format",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "book.periodical_format_period",
					"class": "book.periodical_format_period",
					"friendly_name": "Periodical Format Period",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.the_new_york_times",
					"class": "book.periodical",
					"friendly_name": "nyt",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "book.periodical_format.periodicals_in_this_format",
					"friendly_name": "Periodicals in this format"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "book.periodical_format_period.periodical",
					"friendly_name": "Periodical"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.periodical_format . \n?x1 :type.object.type :book.periodical_format_period . \nVALUES ?x2 { :en.the_new_york_times } \n?x0 :book.periodical_format.periodicals_in_this_format ?x1 . \n?x1 :book.periodical_format_period.periodical ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 188000300,
		"question": "which different formats have been used in the new york times?",
		"answer": [
			"Broadsheet"
		],
		"function": "none",
		"commonness": -22.36926920155485,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.periodical_format",
					"class": "book.periodical_format",
					"friendly_name": "Periodical Format",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "book.periodical_format_period",
					"class": "book.periodical_format_period",
					"friendly_name": "Periodical Format Period",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.the_new_york_times",
					"class": "book.periodical",
					"friendly_name": "The New York Times",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "book.periodical_format.periodicals_in_this_format",
					"friendly_name": "Periodicals in this format"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "book.periodical_format_period.periodical",
					"friendly_name": "Periodical"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.periodical_format . \n?x1 :type.object.type :book.periodical_format_period . \nVALUES ?x2 { :en.the_new_york_times } \n?x0 :book.periodical_format.periodicals_in_this_format ?x1 . \n?x1 :book.periodical_format_period.periodical ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 188000301,
		"question": "which different formats have been used in new york times?",
		"answer": [
			"Broadsheet"
		],
		"function": "none",
		"commonness": -22.36926920155485,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.periodical_format",
					"class": "book.periodical_format",
					"friendly_name": "Periodical Format",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "book.periodical_format_period",
					"class": "book.periodical_format_period",
					"friendly_name": "Periodical Format Period",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.the_new_york_times",
					"class": "book.periodical",
					"friendly_name": "new york times",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "book.periodical_format.periodicals_in_this_format",
					"friendly_name": "Periodicals in this format"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "book.periodical_format_period.periodical",
					"friendly_name": "Periodical"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.periodical_format . \n?x1 :type.object.type :book.periodical_format_period . \nVALUES ?x2 { :en.the_new_york_times } \n?x0 :book.periodical_format.periodicals_in_this_format ?x1 . \n?x1 :book.periodical_format_period.periodical ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 188000302,
		"question": "which different formats have been used in nyt?",
		"answer": [
			"Broadsheet"
		],
		"function": "none",
		"commonness": -22.36926920155485,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.periodical_format",
					"class": "book.periodical_format",
					"friendly_name": "Periodical Format",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "book.periodical_format_period",
					"class": "book.periodical_format_period",
					"friendly_name": "Periodical Format Period",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.the_new_york_times",
					"class": "book.periodical",
					"friendly_name": "nyt",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "book.periodical_format.periodicals_in_this_format",
					"friendly_name": "Periodicals in this format"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "book.periodical_format_period.periodical",
					"friendly_name": "Periodical"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.periodical_format . \n?x1 :type.object.type :book.periodical_format_period . \nVALUES ?x2 { :en.the_new_york_times } \n?x0 :book.periodical_format.periodicals_in_this_format ?x1 . \n?x1 :book.periodical_format_period.periodical ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 189000000,
		"question": "who owns the pet dog bo?",
		"answer": [
			"Michelle Obama",
			"Barack Obama"
		],
		"function": "none",
		"commonness": -23.04507801907431,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.animal_owner",
					"class": "biology.animal_owner",
					"friendly_name": "Animal owner",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "biology.animal_ownership",
					"class": "biology.animal_ownership",
					"friendly_name": "Animal ownership",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "m.05t073s",
					"class": "biology.owned_animal",
					"friendly_name": "Bo",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "biology.animal_ownership.owners",
					"friendly_name": "Owners"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "biology.owned_animal.owners",
					"friendly_name": "Owners"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.animal_owner . \n?x1 :type.object.type :biology.animal_ownership . \nVALUES ?x2 { :m.05t073s } \n?x1 :biology.animal_ownership.owners ?x0 . \n?x2 :biology.owned_animal.owners ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 189000001,
		"question": "who owns the pet dog bo obama?",
		"answer": [
			"Michelle Obama",
			"Barack Obama"
		],
		"function": "none",
		"commonness": -23.04507801907431,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.animal_owner",
					"class": "biology.animal_owner",
					"friendly_name": "Animal owner",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "biology.animal_ownership",
					"class": "biology.animal_ownership",
					"friendly_name": "Animal ownership",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "m.05t073s",
					"class": "biology.owned_animal",
					"friendly_name": "bo obama",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "biology.animal_ownership.owners",
					"friendly_name": "Owners"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "biology.owned_animal.owners",
					"friendly_name": "Owners"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.animal_owner . \n?x1 :type.object.type :biology.animal_ownership . \nVALUES ?x2 { :m.05t073s } \n?x1 :biology.animal_ownership.owners ?x0 . \n?x2 :biology.owned_animal.owners ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 189000002,
		"question": "who owns the pet dog obama dog?",
		"answer": [
			"Michelle Obama",
			"Barack Obama"
		],
		"function": "none",
		"commonness": -23.04507801907431,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.animal_owner",
					"class": "biology.animal_owner",
					"friendly_name": "Animal owner",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "biology.animal_ownership",
					"class": "biology.animal_ownership",
					"friendly_name": "Animal ownership",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "m.05t073s",
					"class": "biology.owned_animal",
					"friendly_name": "obama dog",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "biology.animal_ownership.owners",
					"friendly_name": "Owners"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "biology.owned_animal.owners",
					"friendly_name": "Owners"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.animal_owner . \n?x1 :type.object.type :biology.animal_ownership . \nVALUES ?x2 { :m.05t073s } \n?x1 :biology.animal_ownership.owners ?x0 . \n?x2 :biology.owned_animal.owners ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 189000100,
		"question": "who owns bo the dog?",
		"answer": [
			"Michelle Obama",
			"Barack Obama"
		],
		"function": "none",
		"commonness": -23.04507801907431,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.animal_owner",
					"class": "biology.animal_owner",
					"friendly_name": "Animal owner",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "biology.animal_ownership",
					"class": "biology.animal_ownership",
					"friendly_name": "Animal ownership",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "m.05t073s",
					"class": "biology.owned_animal",
					"friendly_name": "Bo",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "biology.animal_ownership.owners",
					"friendly_name": "Owners"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "biology.owned_animal.owners",
					"friendly_name": "Owners"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.animal_owner . \n?x1 :type.object.type :biology.animal_ownership . \nVALUES ?x2 { :m.05t073s } \n?x1 :biology.animal_ownership.owners ?x0 . \n?x2 :biology.owned_animal.owners ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 189000101,
		"question": "who owns bo obama the dog?",
		"answer": [
			"Michelle Obama",
			"Barack Obama"
		],
		"function": "none",
		"commonness": -23.04507801907431,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.animal_owner",
					"class": "biology.animal_owner",
					"friendly_name": "Animal owner",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "biology.animal_ownership",
					"class": "biology.animal_ownership",
					"friendly_name": "Animal ownership",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "m.05t073s",
					"class": "biology.owned_animal",
					"friendly_name": "bo obama",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "biology.animal_ownership.owners",
					"friendly_name": "Owners"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "biology.owned_animal.owners",
					"friendly_name": "Owners"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.animal_owner . \n?x1 :type.object.type :biology.animal_ownership . \nVALUES ?x2 { :m.05t073s } \n?x1 :biology.animal_ownership.owners ?x0 . \n?x2 :biology.owned_animal.owners ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 189000102,
		"question": "who owns obama dog the dog?",
		"answer": [
			"Barack Obama",
			"Michelle Obama"
		],
		"function": "none",
		"commonness": -23.04507801907431,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.animal_owner",
					"class": "biology.animal_owner",
					"friendly_name": "Animal owner",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "biology.animal_ownership",
					"class": "biology.animal_ownership",
					"friendly_name": "Animal ownership",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "m.05t073s",
					"class": "biology.owned_animal",
					"friendly_name": "obama dog",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "biology.animal_ownership.owners",
					"friendly_name": "Owners"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "biology.owned_animal.owners",
					"friendly_name": "Owners"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.animal_owner . \n?x1 :type.object.type :biology.animal_ownership . \nVALUES ?x2 { :m.05t073s } \n?x1 :biology.animal_ownership.owners ?x0 . \n?x2 :biology.owned_animal.owners ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	}
]