[
	{
		"qid": 43000100,
		"question": "which military radio program episodes focus on the united states army?",
		"answer": [
			"Mental Anguish and the Military"
		],
		"function": "none",
		"commonness": -18.730993072803155,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "radio.radio_program_episode",
					"class": "radio.radio_program_episode",
					"friendly_name": "Radio program episode",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.u_army",
					"class": "radio.radio_subject",
					"friendly_name": "United States Army",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "radio.radio_subject.episodes_with_this_subject",
					"friendly_name": "Episodes with this subject"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :radio.radio_program_episode . \nVALUES ?x1 { :en.u_army } \n?x1 :radio.radio_subject.episodes_with_this_subject ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 43000101,
		"question": "which military radio program episodes focus on the army?",
		"answer": [
			"Mental Anguish and the Military"
		],
		"function": "none",
		"commonness": -18.730993072803155,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "radio.radio_program_episode",
					"class": "radio.radio_program_episode",
					"friendly_name": "Radio program episode",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.u_army",
					"class": "radio.radio_subject",
					"friendly_name": "army",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "radio.radio_subject.episodes_with_this_subject",
					"friendly_name": "Episodes with this subject"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :radio.radio_program_episode . \nVALUES ?x1 { :en.u_army } \n?x1 :radio.radio_subject.episodes_with_this_subject ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 43000102,
		"question": "which military radio program episodes focus on the us army?",
		"answer": [
			"Mental Anguish and the Military"
		],
		"function": "none",
		"commonness": -18.730993072803155,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "radio.radio_program_episode",
					"class": "radio.radio_program_episode",
					"friendly_name": "Radio program episode",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.u_army",
					"class": "radio.radio_subject",
					"friendly_name": "us army",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "radio.radio_subject.episodes_with_this_subject",
					"friendly_name": "Episodes with this subject"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :radio.radio_program_episode . \nVALUES ?x1 { :en.u_army } \n?x1 :radio.radio_subject.episodes_with_this_subject ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 43000300,
		"question": "which radio program episodes have united states army as the subject?",
		"answer": [
			"Mental Anguish and the Military"
		],
		"function": "none",
		"commonness": -18.730993072803155,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "radio.radio_program_episode",
					"class": "radio.radio_program_episode",
					"friendly_name": "Radio program episode",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.u_army",
					"class": "radio.radio_subject",
					"friendly_name": "United States Army",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "radio.radio_subject.episodes_with_this_subject",
					"friendly_name": "Episodes with this subject"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :radio.radio_program_episode . \nVALUES ?x1 { :en.u_army } \n?x1 :radio.radio_subject.episodes_with_this_subject ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 43000301,
		"question": "which radio program episodes have army as the subject?",
		"answer": [
			"Mental Anguish and the Military"
		],
		"function": "none",
		"commonness": -18.730993072803155,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "radio.radio_program_episode",
					"class": "radio.radio_program_episode",
					"friendly_name": "Radio program episode",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.u_army",
					"class": "radio.radio_subject",
					"friendly_name": "army",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "radio.radio_subject.episodes_with_this_subject",
					"friendly_name": "Episodes with this subject"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :radio.radio_program_episode . \nVALUES ?x1 { :en.u_army } \n?x1 :radio.radio_subject.episodes_with_this_subject ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 43000302,
		"question": "which radio program episodes have us army as the subject?",
		"answer": [
			"Mental Anguish and the Military"
		],
		"function": "none",
		"commonness": -18.730993072803155,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "radio.radio_program_episode",
					"class": "radio.radio_program_episode",
					"friendly_name": "Radio program episode",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.u_army",
					"class": "radio.radio_subject",
					"friendly_name": "us army",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "radio.radio_subject.episodes_with_this_subject",
					"friendly_name": "Episodes with this subject"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :radio.radio_program_episode . \nVALUES ?x1 { :en.u_army } \n?x1 :radio.radio_subject.episodes_with_this_subject ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 43000400,
		"question": "what are some radio program episodes revolving around the united states army?",
		"answer": [
			"Mental Anguish and the Military"
		],
		"function": "none",
		"commonness": -18.730993072803155,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "radio.radio_program_episode",
					"class": "radio.radio_program_episode",
					"friendly_name": "Radio program episode",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.u_army",
					"class": "radio.radio_subject",
					"friendly_name": "United States Army",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "radio.radio_subject.episodes_with_this_subject",
					"friendly_name": "Episodes with this subject"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :radio.radio_program_episode . \nVALUES ?x1 { :en.u_army } \n?x1 :radio.radio_subject.episodes_with_this_subject ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 43000401,
		"question": "what are some radio program episodes revolving around the army?",
		"answer": [
			"Mental Anguish and the Military"
		],
		"function": "none",
		"commonness": -18.730993072803155,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "radio.radio_program_episode",
					"class": "radio.radio_program_episode",
					"friendly_name": "Radio program episode",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.u_army",
					"class": "radio.radio_subject",
					"friendly_name": "army",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "radio.radio_subject.episodes_with_this_subject",
					"friendly_name": "Episodes with this subject"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :radio.radio_program_episode . \nVALUES ?x1 { :en.u_army } \n?x1 :radio.radio_subject.episodes_with_this_subject ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 43000402,
		"question": "what are some radio program episodes revolving around the us army?",
		"answer": [
			"Mental Anguish and the Military"
		],
		"function": "none",
		"commonness": -18.730993072803155,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "radio.radio_program_episode",
					"class": "radio.radio_program_episode",
					"friendly_name": "Radio program episode",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.u_army",
					"class": "radio.radio_subject",
					"friendly_name": "us army",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "radio.radio_subject.episodes_with_this_subject",
					"friendly_name": "Episodes with this subject"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :radio.radio_program_episode . \nVALUES ?x1 { :en.u_army } \n?x1 :radio.radio_subject.episodes_with_this_subject ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 44000000,
		"question": "what's the classification of the bmw m10 engine?",
		"answer": [
			"Straight-4"
		],
		"function": "none",
		"commonness": -17.380666736546644,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "automotive.engine_type",
					"class": "automotive.engine_type",
					"friendly_name": "Engine Type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.bmw_m10",
					"class": "automotive.engine",
					"friendly_name": "BMW M10",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "automotive.engine_type.used_in",
					"friendly_name": "Used In"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :automotive.engine_type . \nVALUES ?x1 { :en.bmw_m10 } \n?x0 :automotive.engine_type.used_in ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 44000001,
		"question": "what's the classification of the m10 engine?",
		"answer": [
			"Straight-4"
		],
		"function": "none",
		"commonness": -17.380666736546644,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "automotive.engine_type",
					"class": "automotive.engine_type",
					"friendly_name": "Engine Type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.bmw_m10",
					"class": "automotive.engine",
					"friendly_name": "m10",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "automotive.engine_type.used_in",
					"friendly_name": "Used In"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :automotive.engine_type . \nVALUES ?x1 { :en.bmw_m10 } \n?x0 :automotive.engine_type.used_in ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 44000100,
		"question": "the bmw m10 is which kind of engine?",
		"answer": [
			"Straight-4"
		],
		"function": "none",
		"commonness": -17.380666736546644,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "automotive.engine_type",
					"class": "automotive.engine_type",
					"friendly_name": "Engine Type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.bmw_m10",
					"class": "automotive.engine",
					"friendly_name": "BMW M10",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "automotive.engine_type.used_in",
					"friendly_name": "Used In"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :automotive.engine_type . \nVALUES ?x1 { :en.bmw_m10 } \n?x0 :automotive.engine_type.used_in ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 44000200,
		"question": "what type of engine is the bmw m10?",
		"answer": [
			"Straight-4"
		],
		"function": "none",
		"commonness": -17.380666736546644,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "automotive.engine_type",
					"class": "automotive.engine_type",
					"friendly_name": "Engine Type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.bmw_m10",
					"class": "automotive.engine",
					"friendly_name": "BMW M10",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "automotive.engine_type.used_in",
					"friendly_name": "Used In"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :automotive.engine_type . \nVALUES ?x1 { :en.bmw_m10 } \n?x0 :automotive.engine_type.used_in ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 44000201,
		"question": "what type of engine is the m10?",
		"answer": [
			"Straight-4"
		],
		"function": "none",
		"commonness": -17.380666736546644,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "automotive.engine_type",
					"class": "automotive.engine_type",
					"friendly_name": "Engine Type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.bmw_m10",
					"class": "automotive.engine",
					"friendly_name": "m10",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "automotive.engine_type.used_in",
					"friendly_name": "Used In"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :automotive.engine_type . \nVALUES ?x1 { :en.bmw_m10 } \n?x0 :automotive.engine_type.used_in ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 45000000,
		"question": "who was the founder of the comedy group io?",
		"answer": [
			"Del Close",
			"Charna Halpern"
		],
		"function": "none",
		"commonness": -18.425815926699165,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.comedy_group_founder",
					"class": "base.americancomedy.comedy_group_founder",
					"friendly_name": "Comedy group founder",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.09b9mx",
					"class": "base.americancomedy.comedy_group",
					"friendly_name": "iO",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.americancomedy.comedy_group.founders",
					"friendly_name": "Founders"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.comedy_group_founder . \nVALUES ?x1 { :m.09b9mx } \n?x1 :base.americancomedy.comedy_group.founders ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 45000001,
		"question": "who was the founder of the comedy group improvolympic?",
		"answer": [
			"Del Close",
			"Charna Halpern"
		],
		"function": "none",
		"commonness": -18.425815926699165,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.comedy_group_founder",
					"class": "base.americancomedy.comedy_group_founder",
					"friendly_name": "Comedy group founder",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.09b9mx",
					"class": "base.americancomedy.comedy_group",
					"friendly_name": "improvolympic",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.americancomedy.comedy_group.founders",
					"friendly_name": "Founders"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.comedy_group_founder . \nVALUES ?x1 { :m.09b9mx } \n?x1 :base.americancomedy.comedy_group.founders ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 45000100,
		"question": "who founded the comedy group io?",
		"answer": [
			"Charna Halpern",
			"Del Close"
		],
		"function": "none",
		"commonness": -18.425815926699165,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.comedy_group_founder",
					"class": "base.americancomedy.comedy_group_founder",
					"friendly_name": "Comedy group founder",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.09b9mx",
					"class": "base.americancomedy.comedy_group",
					"friendly_name": "iO",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.americancomedy.comedy_group.founders",
					"friendly_name": "Founders"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.comedy_group_founder . \nVALUES ?x1 { :m.09b9mx } \n?x1 :base.americancomedy.comedy_group.founders ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 45000101,
		"question": "who founded the comedy group improvolympic?",
		"answer": [
			"Charna Halpern",
			"Del Close"
		],
		"function": "none",
		"commonness": -18.425815926699165,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.comedy_group_founder",
					"class": "base.americancomedy.comedy_group_founder",
					"friendly_name": "Comedy group founder",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.09b9mx",
					"class": "base.americancomedy.comedy_group",
					"friendly_name": "improvolympic",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.americancomedy.comedy_group.founders",
					"friendly_name": "Founders"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.comedy_group_founder . \nVALUES ?x1 { :m.09b9mx } \n?x1 :base.americancomedy.comedy_group.founders ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 45000200,
		"question": "the comedy group io was founded by whom?",
		"answer": [
			"Charna Halpern",
			"Del Close"
		],
		"function": "none",
		"commonness": -18.425815926699165,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.comedy_group_founder",
					"class": "base.americancomedy.comedy_group_founder",
					"friendly_name": "Comedy group founder",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.09b9mx",
					"class": "base.americancomedy.comedy_group",
					"friendly_name": "iO",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.americancomedy.comedy_group.founders",
					"friendly_name": "Founders"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.comedy_group_founder . \nVALUES ?x1 { :m.09b9mx } \n?x1 :base.americancomedy.comedy_group.founders ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 45000201,
		"question": "the comedy group improvolympic was founded by whom?",
		"answer": [
			"Del Close",
			"Charna Halpern"
		],
		"function": "none",
		"commonness": -18.425815926699165,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.comedy_group_founder",
					"class": "base.americancomedy.comedy_group_founder",
					"friendly_name": "Comedy group founder",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.09b9mx",
					"class": "base.americancomedy.comedy_group",
					"friendly_name": "improvolympic",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.americancomedy.comedy_group.founders",
					"friendly_name": "Founders"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.comedy_group_founder . \nVALUES ?x1 { :m.09b9mx } \n?x1 :base.americancomedy.comedy_group.founders ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 46000000,
		"question": "which order of chivalry category is the knights templar in?",
		"answer": [
			"Military order"
		],
		"function": "none",
		"commonness": -18.558266965194978,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "royalty.order_of_chivalry_category",
					"class": "royalty.order_of_chivalry_category",
					"friendly_name": "Order of Chivalry Category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.knights_templar",
					"class": "royalty.order_of_chivalry",
					"friendly_name": "Knights Templar",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "royalty.order_of_chivalry.category",
					"friendly_name": "Category"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :royalty.order_of_chivalry_category . \nVALUES ?x1 { :en.knights_templar } \n?x1 :royalty.order_of_chivalry.category ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 46000001,
		"question": "which order of chivalry category is the templars in?",
		"answer": [
			"Military order"
		],
		"function": "none",
		"commonness": -18.558266965194978,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "royalty.order_of_chivalry_category",
					"class": "royalty.order_of_chivalry_category",
					"friendly_name": "Order of Chivalry Category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.knights_templar",
					"class": "royalty.order_of_chivalry",
					"friendly_name": "templars",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "royalty.order_of_chivalry.category",
					"friendly_name": "Category"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :royalty.order_of_chivalry_category . \nVALUES ?x1 { :en.knights_templar } \n?x1 :royalty.order_of_chivalry.category ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 46000002,
		"question": "which order of chivalry category is the templar in?",
		"answer": [
			"Military order"
		],
		"function": "none",
		"commonness": -18.558266965194978,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "royalty.order_of_chivalry_category",
					"class": "royalty.order_of_chivalry_category",
					"friendly_name": "Order of Chivalry Category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.knights_templar",
					"class": "royalty.order_of_chivalry",
					"friendly_name": "templar",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "royalty.order_of_chivalry.category",
					"friendly_name": "Category"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :royalty.order_of_chivalry_category . \nVALUES ?x1 { :en.knights_templar } \n?x1 :royalty.order_of_chivalry.category ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 46000100,
		"question": "what kind of order is knights templar?",
		"answer": [
			"Military order"
		],
		"function": "none",
		"commonness": -18.558266965194978,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "royalty.order_of_chivalry_category",
					"class": "royalty.order_of_chivalry_category",
					"friendly_name": "Order of Chivalry Category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.knights_templar",
					"class": "royalty.order_of_chivalry",
					"friendly_name": "Knights Templar",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "royalty.order_of_chivalry.category",
					"friendly_name": "Category"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :royalty.order_of_chivalry_category . \nVALUES ?x1 { :en.knights_templar } \n?x1 :royalty.order_of_chivalry.category ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]