[
	{
		"qid": 201000002,
		"question": "how many chivalric positions have been held by queen elizabeth?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -28.127815254172205,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "royalty.chivalric_office",
					"class": "royalty.chivalric_office",
					"friendly_name": "Chivalric Office",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "royalty.chivalric_order_position_tenure",
					"class": "royalty.chivalric_order_position_tenure",
					"friendly_name": "Chivalric Order Officer Tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.elizabeth_ii_of_the_united_kingdom",
					"class": "royalty.chivalric_order_officer",
					"friendly_name": "queen elizabeth",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "royalty.chivalric_order_position_tenure.chivalric_office",
					"friendly_name": "Chivalric Position"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "royalty.chivalric_order_officer.offices_held",
					"friendly_name": "Offices Held"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :royalty.chivalric_office . \n?x1 :type.object.type :royalty.chivalric_order_position_tenure . \nVALUES ?x2 { :en.elizabeth_ii_of_the_united_kingdom } \n?x1 :royalty.chivalric_order_position_tenure.chivalric_office ?x0 . \n?x2 :royalty.chivalric_order_officer.offices_held ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 201000101,
		"question": "queen has held how many chivalrous positions?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -28.127815254172205,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "royalty.chivalric_office",
					"class": "royalty.chivalric_office",
					"friendly_name": "Chivalric Office",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "royalty.chivalric_order_position_tenure",
					"class": "royalty.chivalric_order_position_tenure",
					"friendly_name": "Chivalric Order Officer Tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.elizabeth_ii_of_the_united_kingdom",
					"class": "royalty.chivalric_order_officer",
					"friendly_name": "queen",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "royalty.chivalric_order_position_tenure.chivalric_office",
					"friendly_name": "Chivalric Position"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "royalty.chivalric_order_officer.offices_held",
					"friendly_name": "Offices Held"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :royalty.chivalric_office . \n?x1 :type.object.type :royalty.chivalric_order_position_tenure . \nVALUES ?x2 { :en.elizabeth_ii_of_the_united_kingdom } \n?x1 :royalty.chivalric_order_position_tenure.chivalric_office ?x0 . \n?x2 :royalty.chivalric_order_officer.offices_held ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 201000102,
		"question": "queen elizabeth has held how many chivalrous positions?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -28.127815254172205,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "royalty.chivalric_office",
					"class": "royalty.chivalric_office",
					"friendly_name": "Chivalric Office",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "royalty.chivalric_order_position_tenure",
					"class": "royalty.chivalric_order_position_tenure",
					"friendly_name": "Chivalric Order Officer Tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.elizabeth_ii_of_the_united_kingdom",
					"class": "royalty.chivalric_order_officer",
					"friendly_name": "queen elizabeth",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "royalty.chivalric_order_position_tenure.chivalric_office",
					"friendly_name": "Chivalric Position"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "royalty.chivalric_order_officer.offices_held",
					"friendly_name": "Offices Held"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :royalty.chivalric_office . \n?x1 :type.object.type :royalty.chivalric_order_position_tenure . \nVALUES ?x2 { :en.elizabeth_ii_of_the_united_kingdom } \n?x1 :royalty.chivalric_order_position_tenure.chivalric_office ?x0 . \n?x2 :royalty.chivalric_order_officer.offices_held ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 201000200,
		"question": "find the count of different chivalric positions held by elizabeth ii ?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -28.127815254172205,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "royalty.chivalric_office",
					"class": "royalty.chivalric_office",
					"friendly_name": "Chivalric Office",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "royalty.chivalric_order_position_tenure",
					"class": "royalty.chivalric_order_position_tenure",
					"friendly_name": "Chivalric Order Officer Tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.elizabeth_ii_of_the_united_kingdom",
					"class": "royalty.chivalric_order_officer",
					"friendly_name": "Elizabeth II",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "royalty.chivalric_order_position_tenure.chivalric_office",
					"friendly_name": "Chivalric Position"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "royalty.chivalric_order_officer.offices_held",
					"friendly_name": "Offices Held"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :royalty.chivalric_office . \n?x1 :type.object.type :royalty.chivalric_order_position_tenure . \nVALUES ?x2 { :en.elizabeth_ii_of_the_united_kingdom } \n?x1 :royalty.chivalric_order_position_tenure.chivalric_office ?x0 . \n?x2 :royalty.chivalric_order_officer.offices_held ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 201000201,
		"question": "find the count of different chivalric positions held by queen ?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -28.127815254172205,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "royalty.chivalric_office",
					"class": "royalty.chivalric_office",
					"friendly_name": "Chivalric Office",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "royalty.chivalric_order_position_tenure",
					"class": "royalty.chivalric_order_position_tenure",
					"friendly_name": "Chivalric Order Officer Tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.elizabeth_ii_of_the_united_kingdom",
					"class": "royalty.chivalric_order_officer",
					"friendly_name": "queen",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "royalty.chivalric_order_position_tenure.chivalric_office",
					"friendly_name": "Chivalric Position"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "royalty.chivalric_order_officer.offices_held",
					"friendly_name": "Offices Held"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :royalty.chivalric_office . \n?x1 :type.object.type :royalty.chivalric_order_position_tenure . \nVALUES ?x2 { :en.elizabeth_ii_of_the_united_kingdom } \n?x1 :royalty.chivalric_order_position_tenure.chivalric_office ?x0 . \n?x2 :royalty.chivalric_order_officer.offices_held ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 201000202,
		"question": "find the count of different chivalric positions held by queen elizabeth ?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -28.127815254172205,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "royalty.chivalric_office",
					"class": "royalty.chivalric_office",
					"friendly_name": "Chivalric Office",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "royalty.chivalric_order_position_tenure",
					"class": "royalty.chivalric_order_position_tenure",
					"friendly_name": "Chivalric Order Officer Tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.elizabeth_ii_of_the_united_kingdom",
					"class": "royalty.chivalric_order_officer",
					"friendly_name": "queen elizabeth",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "royalty.chivalric_order_position_tenure.chivalric_office",
					"friendly_name": "Chivalric Position"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "royalty.chivalric_order_officer.offices_held",
					"friendly_name": "Offices Held"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :royalty.chivalric_office . \n?x1 :type.object.type :royalty.chivalric_order_position_tenure . \nVALUES ?x2 { :en.elizabeth_ii_of_the_united_kingdom } \n?x1 :royalty.chivalric_order_position_tenure.chivalric_office ?x0 . \n?x2 :royalty.chivalric_order_officer.offices_held ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 201000300,
		"question": "how many different chivalric positions has elizabeth ii held?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -28.127815254172205,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "royalty.chivalric_office",
					"class": "royalty.chivalric_office",
					"friendly_name": "Chivalric Office",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "royalty.chivalric_order_position_tenure",
					"class": "royalty.chivalric_order_position_tenure",
					"friendly_name": "Chivalric Order Officer Tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.elizabeth_ii_of_the_united_kingdom",
					"class": "royalty.chivalric_order_officer",
					"friendly_name": "Elizabeth II",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "royalty.chivalric_order_position_tenure.chivalric_office",
					"friendly_name": "Chivalric Position"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "royalty.chivalric_order_officer.offices_held",
					"friendly_name": "Offices Held"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :royalty.chivalric_office . \n?x1 :type.object.type :royalty.chivalric_order_position_tenure . \nVALUES ?x2 { :en.elizabeth_ii_of_the_united_kingdom } \n?x1 :royalty.chivalric_order_position_tenure.chivalric_office ?x0 . \n?x2 :royalty.chivalric_order_officer.offices_held ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 201000301,
		"question": "how many different chivalric positions has queen held?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -28.127815254172205,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "royalty.chivalric_office",
					"class": "royalty.chivalric_office",
					"friendly_name": "Chivalric Office",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "royalty.chivalric_order_position_tenure",
					"class": "royalty.chivalric_order_position_tenure",
					"friendly_name": "Chivalric Order Officer Tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.elizabeth_ii_of_the_united_kingdom",
					"class": "royalty.chivalric_order_officer",
					"friendly_name": "queen",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "royalty.chivalric_order_position_tenure.chivalric_office",
					"friendly_name": "Chivalric Position"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "royalty.chivalric_order_officer.offices_held",
					"friendly_name": "Offices Held"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :royalty.chivalric_office . \n?x1 :type.object.type :royalty.chivalric_order_position_tenure . \nVALUES ?x2 { :en.elizabeth_ii_of_the_united_kingdom } \n?x1 :royalty.chivalric_order_position_tenure.chivalric_office ?x0 . \n?x2 :royalty.chivalric_order_officer.offices_held ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 202000000,
		"question": "formulations containing carbon dioxide are present in which categories?",
		"answer": [
			"Medical gas"
		],
		"function": "none",
		"commonness": -26.393829675067117,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.drug_formulation_category",
					"class": "medicine.drug_formulation_category",
					"friendly_name": "Drug formulation category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "medicine.drug_formulation",
					"class": "medicine.drug_formulation",
					"friendly_name": "Drug formulation",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.carbon_dioxide",
					"class": "medicine.drug",
					"friendly_name": "Carbon dioxide",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.drug_formulation_category.drug_formulations",
					"friendly_name": "Drug formulations in this category"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "medicine.drug.marketed_formulations",
					"friendly_name": "Marketed formulations"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.drug_formulation_category . \n?x1 :type.object.type :medicine.drug_formulation . \nVALUES ?x2 { :en.carbon_dioxide } \n?x0 :medicine.drug_formulation_category.drug_formulations ?x1 . \n?x2 :medicine.drug.marketed_formulations ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 202000001,
		"question": "formulations containing co2 are present in which categories?",
		"answer": [
			"Medical gas"
		],
		"function": "none",
		"commonness": -26.393829675067117,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.drug_formulation_category",
					"class": "medicine.drug_formulation_category",
					"friendly_name": "Drug formulation category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "medicine.drug_formulation",
					"class": "medicine.drug_formulation",
					"friendly_name": "Drug formulation",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.carbon_dioxide",
					"class": "medicine.drug",
					"friendly_name": "co2",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.drug_formulation_category.drug_formulations",
					"friendly_name": "Drug formulations in this category"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "medicine.drug.marketed_formulations",
					"friendly_name": "Marketed formulations"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.drug_formulation_category . \n?x1 :type.object.type :medicine.drug_formulation . \nVALUES ?x2 { :en.carbon_dioxide } \n?x0 :medicine.drug_formulation_category.drug_formulations ?x1 . \n?x2 :medicine.drug.marketed_formulations ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 202000002,
		"question": "formulations containing carbonic gas are present in which categories?",
		"answer": [
			"Medical gas"
		],
		"function": "none",
		"commonness": -26.393829675067117,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.drug_formulation_category",
					"class": "medicine.drug_formulation_category",
					"friendly_name": "Drug formulation category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "medicine.drug_formulation",
					"class": "medicine.drug_formulation",
					"friendly_name": "Drug formulation",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.carbon_dioxide",
					"class": "medicine.drug",
					"friendly_name": "carbonic gas",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.drug_formulation_category.drug_formulations",
					"friendly_name": "Drug formulations in this category"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "medicine.drug.marketed_formulations",
					"friendly_name": "Marketed formulations"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.drug_formulation_category . \n?x1 :type.object.type :medicine.drug_formulation . \nVALUES ?x2 { :en.carbon_dioxide } \n?x0 :medicine.drug_formulation_category.drug_formulations ?x1 . \n?x2 :medicine.drug.marketed_formulations ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 202000101,
		"question": "in what categories there are formulations containing co2?",
		"answer": [
			"Medical gas"
		],
		"function": "none",
		"commonness": -26.393829675067117,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.drug_formulation_category",
					"class": "medicine.drug_formulation_category",
					"friendly_name": "Drug formulation category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "medicine.drug_formulation",
					"class": "medicine.drug_formulation",
					"friendly_name": "Drug formulation",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.carbon_dioxide",
					"class": "medicine.drug",
					"friendly_name": "co2",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.drug_formulation_category.drug_formulations",
					"friendly_name": "Drug formulations in this category"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "medicine.drug.marketed_formulations",
					"friendly_name": "Marketed formulations"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.drug_formulation_category . \n?x1 :type.object.type :medicine.drug_formulation . \nVALUES ?x2 { :en.carbon_dioxide } \n?x0 :medicine.drug_formulation_category.drug_formulations ?x1 . \n?x2 :medicine.drug.marketed_formulations ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 202000102,
		"question": "in what categories there are formulations containing carbonic gas?",
		"answer": [
			"Medical gas"
		],
		"function": "none",
		"commonness": -26.393829675067117,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.drug_formulation_category",
					"class": "medicine.drug_formulation_category",
					"friendly_name": "Drug formulation category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "medicine.drug_formulation",
					"class": "medicine.drug_formulation",
					"friendly_name": "Drug formulation",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.carbon_dioxide",
					"class": "medicine.drug",
					"friendly_name": "carbonic gas",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.drug_formulation_category.drug_formulations",
					"friendly_name": "Drug formulations in this category"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "medicine.drug.marketed_formulations",
					"friendly_name": "Marketed formulations"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.drug_formulation_category . \n?x1 :type.object.type :medicine.drug_formulation . \nVALUES ?x2 { :en.carbon_dioxide } \n?x0 :medicine.drug_formulation_category.drug_formulations ?x1 . \n?x2 :medicine.drug.marketed_formulations ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 202000200,
		"question": "which category includes formulations containing carbon dioxide?",
		"answer": [
			"Medical gas"
		],
		"function": "none",
		"commonness": -26.393829675067117,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.drug_formulation_category",
					"class": "medicine.drug_formulation_category",
					"friendly_name": "Drug formulation category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "medicine.drug_formulation",
					"class": "medicine.drug_formulation",
					"friendly_name": "Drug formulation",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.carbon_dioxide",
					"class": "medicine.drug",
					"friendly_name": "Carbon dioxide",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.drug_formulation_category.drug_formulations",
					"friendly_name": "Drug formulations in this category"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "medicine.drug.marketed_formulations",
					"friendly_name": "Marketed formulations"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.drug_formulation_category . \n?x1 :type.object.type :medicine.drug_formulation . \nVALUES ?x2 { :en.carbon_dioxide } \n?x0 :medicine.drug_formulation_category.drug_formulations ?x1 . \n?x2 :medicine.drug.marketed_formulations ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 202000201,
		"question": "which category includes formulations containing co2?",
		"answer": [
			"Medical gas"
		],
		"function": "none",
		"commonness": -26.393829675067117,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.drug_formulation_category",
					"class": "medicine.drug_formulation_category",
					"friendly_name": "Drug formulation category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "medicine.drug_formulation",
					"class": "medicine.drug_formulation",
					"friendly_name": "Drug formulation",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.carbon_dioxide",
					"class": "medicine.drug",
					"friendly_name": "co2",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.drug_formulation_category.drug_formulations",
					"friendly_name": "Drug formulations in this category"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "medicine.drug.marketed_formulations",
					"friendly_name": "Marketed formulations"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.drug_formulation_category . \n?x1 :type.object.type :medicine.drug_formulation . \nVALUES ?x2 { :en.carbon_dioxide } \n?x0 :medicine.drug_formulation_category.drug_formulations ?x1 . \n?x2 :medicine.drug.marketed_formulations ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 202000202,
		"question": "which category includes formulations containing carbonic gas?",
		"answer": [
			"Medical gas"
		],
		"function": "none",
		"commonness": -26.393829675067117,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.drug_formulation_category",
					"class": "medicine.drug_formulation_category",
					"friendly_name": "Drug formulation category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "medicine.drug_formulation",
					"class": "medicine.drug_formulation",
					"friendly_name": "Drug formulation",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.carbon_dioxide",
					"class": "medicine.drug",
					"friendly_name": "carbonic gas",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.drug_formulation_category.drug_formulations",
					"friendly_name": "Drug formulations in this category"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "medicine.drug.marketed_formulations",
					"friendly_name": "Marketed formulations"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.drug_formulation_category . \n?x1 :type.object.type :medicine.drug_formulation . \nVALUES ?x2 { :en.carbon_dioxide } \n?x0 :medicine.drug_formulation_category.drug_formulations ?x1 . \n?x2 :medicine.drug.marketed_formulations ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	}
]