[
	{
		"qid": 96000200,
		"question": "which venue has the largest capacity?",
		"answer": [
			"Daytona International Speedway"
		],
		"function": "argmax",
		"commonness": -13.143543406313972,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.venue",
					"class": "architecture.venue",
					"friendly_name": "Venue",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "1417^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "1417",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.venue.capacity",
					"friendly_name": "Seating capacity"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.venue . \n{\nSELECT (MAX(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :architecture.venue . \n?y0 :architecture.venue.capacity ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :architecture.venue.capacity ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 96000300,
		"question": "what is the largest venue by capacity?",
		"answer": [
			"Daytona International Speedway"
		],
		"function": "argmax",
		"commonness": -13.143543406313972,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.venue",
					"class": "architecture.venue",
					"friendly_name": "Venue",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "1417^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "1417",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.venue.capacity",
					"friendly_name": "Seating capacity"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.venue . \n{\nSELECT (MAX(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :architecture.venue . \n?y0 :architecture.venue.capacity ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :architecture.venue.capacity ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 96000600,
		"question": "what venue has the largest crowd capacity?",
		"answer": [
			"Daytona International Speedway"
		],
		"function": "argmax",
		"commonness": -13.143543406313972,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.venue",
					"class": "architecture.venue",
					"friendly_name": "Venue",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "1417^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "1417",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.venue.capacity",
					"friendly_name": "Seating capacity"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.venue . \n{\nSELECT (MAX(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :architecture.venue . \n?y0 :architecture.venue.capacity ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :architecture.venue.capacity ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 97000000,
		"question": "how many computing platforms support portable document format?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -10.277873450647292,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.computing_platform",
					"class": "computer.computing_platform",
					"friendly_name": "Computing Platform",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.portable_document_format",
					"class": "computer.file_format",
					"friendly_name": "Portable Document Format",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "computer.file_format.used_on",
					"friendly_name": "Used On"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.computing_platform . \nVALUES ?x1 { :en.portable_document_format } \n?x1 :computer.file_format.used_on ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 97000001,
		"question": "how many computing platforms support pdf?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -10.277873450647292,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.computing_platform",
					"class": "computer.computing_platform",
					"friendly_name": "Computing Platform",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.portable_document_format",
					"class": "computer.file_format",
					"friendly_name": "pdf",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "computer.file_format.used_on",
					"friendly_name": "Used On"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.computing_platform . \nVALUES ?x1 { :en.portable_document_format } \n?x1 :computer.file_format.used_on ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 97000002,
		"question": "how many computing platforms support adobe pdf?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -10.277873450647292,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.computing_platform",
					"class": "computer.computing_platform",
					"friendly_name": "Computing Platform",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.portable_document_format",
					"class": "computer.file_format",
					"friendly_name": "adobe pdf",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "computer.file_format.used_on",
					"friendly_name": "Used On"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.computing_platform . \nVALUES ?x1 { :en.portable_document_format } \n?x1 :computer.file_format.used_on ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 97000100,
		"question": "portable document format supports how many computing platforms?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -10.277873450647292,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.computing_platform",
					"class": "computer.computing_platform",
					"friendly_name": "Computing Platform",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.portable_document_format",
					"class": "computer.file_format",
					"friendly_name": "Portable Document Format",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "computer.file_format.used_on",
					"friendly_name": "Used On"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.computing_platform . \nVALUES ?x1 { :en.portable_document_format } \n?x1 :computer.file_format.used_on ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 97000101,
		"question": "pdf supports how many computing platforms?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -10.277873450647292,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.computing_platform",
					"class": "computer.computing_platform",
					"friendly_name": "Computing Platform",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.portable_document_format",
					"class": "computer.file_format",
					"friendly_name": "pdf",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "computer.file_format.used_on",
					"friendly_name": "Used On"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.computing_platform . \nVALUES ?x1 { :en.portable_document_format } \n?x1 :computer.file_format.used_on ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 97000102,
		"question": "adobe pdf supports how many computing platforms?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -10.277873450647292,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.computing_platform",
					"class": "computer.computing_platform",
					"friendly_name": "Computing Platform",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.portable_document_format",
					"class": "computer.file_format",
					"friendly_name": "adobe pdf",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "computer.file_format.used_on",
					"friendly_name": "Used On"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.computing_platform . \nVALUES ?x1 { :en.portable_document_format } \n?x1 :computer.file_format.used_on ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 97000200,
		"question": "what is the number of platforms that portable document format is being used?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -10.277873450647292,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.computing_platform",
					"class": "computer.computing_platform",
					"friendly_name": "Computing Platform",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.portable_document_format",
					"class": "computer.file_format",
					"friendly_name": "Portable Document Format",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "computer.file_format.used_on",
					"friendly_name": "Used On"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.computing_platform . \nVALUES ?x1 { :en.portable_document_format } \n?x1 :computer.file_format.used_on ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 97000201,
		"question": "what is the number of platforms that pdf is being used?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -10.277873450647292,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.computing_platform",
					"class": "computer.computing_platform",
					"friendly_name": "Computing Platform",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.portable_document_format",
					"class": "computer.file_format",
					"friendly_name": "pdf",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "computer.file_format.used_on",
					"friendly_name": "Used On"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.computing_platform . \nVALUES ?x1 { :en.portable_document_format } \n?x1 :computer.file_format.used_on ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 97000202,
		"question": "what is the number of platforms that adobe pdf is being used?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -10.277873450647292,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.computing_platform",
					"class": "computer.computing_platform",
					"friendly_name": "Computing Platform",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.portable_document_format",
					"class": "computer.file_format",
					"friendly_name": "adobe pdf",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "computer.file_format.used_on",
					"friendly_name": "Used On"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.computing_platform . \nVALUES ?x1 { :en.portable_document_format } \n?x1 :computer.file_format.used_on ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 97000300,
		"question": "how many computing platforms portable document format can be used on?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -10.277873450647292,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.computing_platform",
					"class": "computer.computing_platform",
					"friendly_name": "Computing Platform",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.portable_document_format",
					"class": "computer.file_format",
					"friendly_name": "Portable Document Format",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "computer.file_format.used_on",
					"friendly_name": "Used On"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.computing_platform . \nVALUES ?x1 { :en.portable_document_format } \n?x1 :computer.file_format.used_on ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 97000301,
		"question": "how many computing platforms pdf can be used on?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -10.277873450647292,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.computing_platform",
					"class": "computer.computing_platform",
					"friendly_name": "Computing Platform",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.portable_document_format",
					"class": "computer.file_format",
					"friendly_name": "pdf",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "computer.file_format.used_on",
					"friendly_name": "Used On"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.computing_platform . \nVALUES ?x1 { :en.portable_document_format } \n?x1 :computer.file_format.used_on ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 97000302,
		"question": "how many computing platforms adobe pdf can be used on?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -10.277873450647292,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.computing_platform",
					"class": "computer.computing_platform",
					"friendly_name": "Computing Platform",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.portable_document_format",
					"class": "computer.file_format",
					"friendly_name": "adobe pdf",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "computer.file_format.used_on",
					"friendly_name": "Used On"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.computing_platform . \nVALUES ?x1 { :en.portable_document_format } \n?x1 :computer.file_format.used_on ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 97000400,
		"question": "portable document format is supported by how many computing platforms?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -10.277873450647292,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.computing_platform",
					"class": "computer.computing_platform",
					"friendly_name": "Computing Platform",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.portable_document_format",
					"class": "computer.file_format",
					"friendly_name": "Portable Document Format",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "computer.file_format.used_on",
					"friendly_name": "Used On"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.computing_platform . \nVALUES ?x1 { :en.portable_document_format } \n?x1 :computer.file_format.used_on ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 97000401,
		"question": "pdf is supported by how many computing platforms?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -10.277873450647292,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.computing_platform",
					"class": "computer.computing_platform",
					"friendly_name": "Computing Platform",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.portable_document_format",
					"class": "computer.file_format",
					"friendly_name": "pdf",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "computer.file_format.used_on",
					"friendly_name": "Used On"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.computing_platform . \nVALUES ?x1 { :en.portable_document_format } \n?x1 :computer.file_format.used_on ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 97000402,
		"question": "adobe pdf is supported by how many computing platforms?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -10.277873450647292,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.computing_platform",
					"class": "computer.computing_platform",
					"friendly_name": "Computing Platform",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.portable_document_format",
					"class": "computer.file_format",
					"friendly_name": "adobe pdf",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "computer.file_format.used_on",
					"friendly_name": "Used On"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.computing_platform . \nVALUES ?x1 { :en.portable_document_format } \n?x1 :computer.file_format.used_on ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 97000500,
		"question": "what is the number of the computing platforms that are compatible to portable document format?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -10.277873450647292,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.computing_platform",
					"class": "computer.computing_platform",
					"friendly_name": "Computing Platform",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.portable_document_format",
					"class": "computer.file_format",
					"friendly_name": "Portable Document Format",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "computer.file_format.used_on",
					"friendly_name": "Used On"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.computing_platform . \nVALUES ?x1 { :en.portable_document_format } \n?x1 :computer.file_format.used_on ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 97000501,
		"question": "what is the number of the computing platforms that are compatible to pdf?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -10.277873450647292,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.computing_platform",
					"class": "computer.computing_platform",
					"friendly_name": "Computing Platform",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.portable_document_format",
					"class": "computer.file_format",
					"friendly_name": "pdf",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "computer.file_format.used_on",
					"friendly_name": "Used On"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.computing_platform . \nVALUES ?x1 { :en.portable_document_format } \n?x1 :computer.file_format.used_on ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 97000502,
		"question": "what is the number of the computing platforms that are compatible to adobe pdf?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -10.277873450647292,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.computing_platform",
					"class": "computer.computing_platform",
					"friendly_name": "Computing Platform",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.portable_document_format",
					"class": "computer.file_format",
					"friendly_name": "adobe pdf",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "computer.file_format.used_on",
					"friendly_name": "Used On"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.computing_platform . \nVALUES ?x1 { :en.portable_document_format } \n?x1 :computer.file_format.used_on ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 98000000,
		"question": "in the category martial arts, how many martial arts can be found?",
		"answer": [
			"7"
		],
		"function": "count",
		"commonness": -15.070323464425178,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "martial_arts.martial_art",
					"class": "martial_arts.martial_art",
					"friendly_name": "Martial Art",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.04xsv",
					"class": "martial_arts.martial_art_category",
					"friendly_name": "Martial arts",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "martial_arts.martial_art_category.martial_arts",
					"friendly_name": "Martial arts"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :martial_arts.martial_art . \nVALUES ?x1 { :m.04xsv } \n?x1 :martial_arts.martial_art_category.martial_arts ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 98000001,
		"question": "in the category martial art, how many martial arts can be found?",
		"answer": [
			"7"
		],
		"function": "count",
		"commonness": -15.070323464425178,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "martial_arts.martial_art",
					"class": "martial_arts.martial_art",
					"friendly_name": "Martial Art",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.04xsv",
					"class": "martial_arts.martial_art_category",
					"friendly_name": "martial art",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "martial_arts.martial_art_category.martial_arts",
					"friendly_name": "Martial arts"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :martial_arts.martial_art . \nVALUES ?x1 { :m.04xsv } \n?x1 :martial_arts.martial_art_category.martial_arts ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 98000100,
		"question": "how many different forms of martial arts are there in martial arts?",
		"answer": [
			"7"
		],
		"function": "count",
		"commonness": -15.070323464425178,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "martial_arts.martial_art",
					"class": "martial_arts.martial_art",
					"friendly_name": "Martial Art",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.04xsv",
					"class": "martial_arts.martial_art_category",
					"friendly_name": "Martial arts",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "martial_arts.martial_art_category.martial_arts",
					"friendly_name": "Martial arts"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :martial_arts.martial_art . \nVALUES ?x1 { :m.04xsv } \n?x1 :martial_arts.martial_art_category.martial_arts ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]