[
	{
		"qid": 203000000,
		"question": "what category of game do fair division and rock-paper-scissors both fall into?",
		"answer": [
			"Zero–sum game"
		],
		"function": "none",
		"commonness": -35.35909748042912,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gametheory.class_of_game",
					"class": "base.gametheory.class_of_game",
					"friendly_name": "Class of game",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.fair_division",
					"class": "base.gametheory.game_theory_game",
					"friendly_name": "Fair division",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.rock_paper_scissors",
					"class": "base.gametheory.game_theory_game",
					"friendly_name": "Rock-paper-scissors",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.gametheory.game_theory_game.class_of_game",
					"friendly_name": "Class of game"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.gametheory.class_of_game.games_of_this_type",
					"friendly_name": "Games of this type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gametheory.class_of_game . \nVALUES ?x1 { :en.fair_division } \nVALUES ?x2 { :en.rock_paper_scissors } \n?x1 :base.gametheory.game_theory_game.class_of_game ?x0 . \n?x0 :base.gametheory.class_of_game.games_of_this_type ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 203000002,
		"question": "what category of game do fair division and rps both fall into?",
		"answer": [
			"Zero–sum game"
		],
		"function": "none",
		"commonness": -35.35909748042912,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gametheory.class_of_game",
					"class": "base.gametheory.class_of_game",
					"friendly_name": "Class of game",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.fair_division",
					"class": "base.gametheory.game_theory_game",
					"friendly_name": "Fair division",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.rock_paper_scissors",
					"class": "base.gametheory.game_theory_game",
					"friendly_name": "rps",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.gametheory.game_theory_game.class_of_game",
					"friendly_name": "Class of game"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.gametheory.class_of_game.games_of_this_type",
					"friendly_name": "Games of this type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gametheory.class_of_game . \nVALUES ?x1 { :en.fair_division } \nVALUES ?x2 { :en.rock_paper_scissors } \n?x1 :base.gametheory.game_theory_game.class_of_game ?x0 . \n?x0 :base.gametheory.class_of_game.games_of_this_type ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 203000100,
		"question": "what type of games are fair division and rock-paper-scissors?",
		"answer": [
			"Zero–sum game"
		],
		"function": "none",
		"commonness": -35.35909748042912,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gametheory.class_of_game",
					"class": "base.gametheory.class_of_game",
					"friendly_name": "Class of game",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.fair_division",
					"class": "base.gametheory.game_theory_game",
					"friendly_name": "Fair division",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.rock_paper_scissors",
					"class": "base.gametheory.game_theory_game",
					"friendly_name": "Rock-paper-scissors",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.gametheory.game_theory_game.class_of_game",
					"friendly_name": "Class of game"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.gametheory.class_of_game.games_of_this_type",
					"friendly_name": "Games of this type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gametheory.class_of_game . \nVALUES ?x1 { :en.fair_division } \nVALUES ?x2 { :en.rock_paper_scissors } \n?x1 :base.gametheory.game_theory_game.class_of_game ?x0 . \n?x0 :base.gametheory.class_of_game.games_of_this_type ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 203000102,
		"question": "what type of games are fair division and rps?",
		"answer": [
			"Zero–sum game"
		],
		"function": "none",
		"commonness": -35.35909748042912,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gametheory.class_of_game",
					"class": "base.gametheory.class_of_game",
					"friendly_name": "Class of game",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.fair_division",
					"class": "base.gametheory.game_theory_game",
					"friendly_name": "Fair division",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.rock_paper_scissors",
					"class": "base.gametheory.game_theory_game",
					"friendly_name": "rps",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.gametheory.game_theory_game.class_of_game",
					"friendly_name": "Class of game"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.gametheory.class_of_game.games_of_this_type",
					"friendly_name": "Games of this type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gametheory.class_of_game . \nVALUES ?x1 { :en.fair_division } \nVALUES ?x2 { :en.rock_paper_scissors } \n?x1 :base.gametheory.game_theory_game.class_of_game ?x0 . \n?x0 :base.gametheory.class_of_game.games_of_this_type ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 203000200,
		"question": "what would you call the games fair division and rock-paper-scissors?",
		"answer": [
			"Zero–sum game"
		],
		"function": "none",
		"commonness": -35.35909748042912,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gametheory.class_of_game",
					"class": "base.gametheory.class_of_game",
					"friendly_name": "Class of game",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.fair_division",
					"class": "base.gametheory.game_theory_game",
					"friendly_name": "Fair division",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.rock_paper_scissors",
					"class": "base.gametheory.game_theory_game",
					"friendly_name": "Rock-paper-scissors",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.gametheory.game_theory_game.class_of_game",
					"friendly_name": "Class of game"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.gametheory.class_of_game.games_of_this_type",
					"friendly_name": "Games of this type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gametheory.class_of_game . \nVALUES ?x1 { :en.fair_division } \nVALUES ?x2 { :en.rock_paper_scissors } \n?x1 :base.gametheory.game_theory_game.class_of_game ?x0 . \n?x0 :base.gametheory.class_of_game.games_of_this_type ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 203000202,
		"question": "what would you call the games fair division and rps?",
		"answer": [
			"Zero–sum game"
		],
		"function": "none",
		"commonness": -35.35909748042912,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gametheory.class_of_game",
					"class": "base.gametheory.class_of_game",
					"friendly_name": "Class of game",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.fair_division",
					"class": "base.gametheory.game_theory_game",
					"friendly_name": "Fair division",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.rock_paper_scissors",
					"class": "base.gametheory.game_theory_game",
					"friendly_name": "rps",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.gametheory.game_theory_game.class_of_game",
					"friendly_name": "Class of game"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.gametheory.class_of_game.games_of_this_type",
					"friendly_name": "Games of this type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gametheory.class_of_game . \nVALUES ?x1 { :en.fair_division } \nVALUES ?x2 { :en.rock_paper_scissors } \n?x1 :base.gametheory.game_theory_game.class_of_game ?x0 . \n?x0 :base.gametheory.class_of_game.games_of_this_type ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 203000300,
		"question": "what kind of game are fair division and rock-paper-scissors?",
		"answer": [
			"Zero–sum game"
		],
		"function": "none",
		"commonness": -35.35909748042912,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gametheory.class_of_game",
					"class": "base.gametheory.class_of_game",
					"friendly_name": "Class of game",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.fair_division",
					"class": "base.gametheory.game_theory_game",
					"friendly_name": "Fair division",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.rock_paper_scissors",
					"class": "base.gametheory.game_theory_game",
					"friendly_name": "Rock-paper-scissors",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.gametheory.game_theory_game.class_of_game",
					"friendly_name": "Class of game"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.gametheory.class_of_game.games_of_this_type",
					"friendly_name": "Games of this type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gametheory.class_of_game . \nVALUES ?x1 { :en.fair_division } \nVALUES ?x2 { :en.rock_paper_scissors } \n?x1 :base.gametheory.game_theory_game.class_of_game ?x0 . \n?x0 :base.gametheory.class_of_game.games_of_this_type ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 203000302,
		"question": "what kind of game are fair division and rps?",
		"answer": [
			"Zero–sum game"
		],
		"function": "none",
		"commonness": -35.35909748042912,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gametheory.class_of_game",
					"class": "base.gametheory.class_of_game",
					"friendly_name": "Class of game",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.fair_division",
					"class": "base.gametheory.game_theory_game",
					"friendly_name": "Fair division",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.rock_paper_scissors",
					"class": "base.gametheory.game_theory_game",
					"friendly_name": "rps",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.gametheory.game_theory_game.class_of_game",
					"friendly_name": "Class of game"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.gametheory.class_of_game.games_of_this_type",
					"friendly_name": "Games of this type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gametheory.class_of_game . \nVALUES ?x1 { :en.fair_division } \nVALUES ?x2 { :en.rock_paper_scissors } \n?x1 :base.gametheory.game_theory_game.class_of_game ?x0 . \n?x0 :base.gametheory.class_of_game.games_of_this_type ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 203000400,
		"question": "fair division and rock-paper-scissors are what sort of games?",
		"answer": [
			"Zero–sum game"
		],
		"function": "none",
		"commonness": -35.35909748042912,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gametheory.class_of_game",
					"class": "base.gametheory.class_of_game",
					"friendly_name": "Class of game",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.fair_division",
					"class": "base.gametheory.game_theory_game",
					"friendly_name": "Fair division",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.rock_paper_scissors",
					"class": "base.gametheory.game_theory_game",
					"friendly_name": "Rock-paper-scissors",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.gametheory.game_theory_game.class_of_game",
					"friendly_name": "Class of game"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.gametheory.class_of_game.games_of_this_type",
					"friendly_name": "Games of this type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gametheory.class_of_game . \nVALUES ?x1 { :en.fair_division } \nVALUES ?x2 { :en.rock_paper_scissors } \n?x1 :base.gametheory.game_theory_game.class_of_game ?x0 . \n?x0 :base.gametheory.class_of_game.games_of_this_type ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 203000402,
		"question": "fair division and rps are what sort of games?",
		"answer": [
			"Zero–sum game"
		],
		"function": "none",
		"commonness": -35.35909748042912,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gametheory.class_of_game",
					"class": "base.gametheory.class_of_game",
					"friendly_name": "Class of game",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.fair_division",
					"class": "base.gametheory.game_theory_game",
					"friendly_name": "Fair division",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.rock_paper_scissors",
					"class": "base.gametheory.game_theory_game",
					"friendly_name": "rps",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.gametheory.game_theory_game.class_of_game",
					"friendly_name": "Class of game"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.gametheory.class_of_game.games_of_this_type",
					"friendly_name": "Games of this type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gametheory.class_of_game . \nVALUES ?x1 { :en.fair_division } \nVALUES ?x2 { :en.rock_paper_scissors } \n?x1 :base.gametheory.game_theory_game.class_of_game ?x0 . \n?x0 :base.gametheory.class_of_game.games_of_this_type ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 203000500,
		"question": "how would you classify the games of fair division and rock-paper-scissors?",
		"answer": [
			"Zero–sum game"
		],
		"function": "none",
		"commonness": -35.35909748042912,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gametheory.class_of_game",
					"class": "base.gametheory.class_of_game",
					"friendly_name": "Class of game",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.fair_division",
					"class": "base.gametheory.game_theory_game",
					"friendly_name": "Fair division",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.rock_paper_scissors",
					"class": "base.gametheory.game_theory_game",
					"friendly_name": "Rock-paper-scissors",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.gametheory.game_theory_game.class_of_game",
					"friendly_name": "Class of game"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.gametheory.class_of_game.games_of_this_type",
					"friendly_name": "Games of this type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gametheory.class_of_game . \nVALUES ?x1 { :en.fair_division } \nVALUES ?x2 { :en.rock_paper_scissors } \n?x1 :base.gametheory.game_theory_game.class_of_game ?x0 . \n?x0 :base.gametheory.class_of_game.games_of_this_type ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 203000502,
		"question": "how would you classify the games of fair division and rps?",
		"answer": [
			"Zero–sum game"
		],
		"function": "none",
		"commonness": -35.35909748042912,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gametheory.class_of_game",
					"class": "base.gametheory.class_of_game",
					"friendly_name": "Class of game",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.fair_division",
					"class": "base.gametheory.game_theory_game",
					"friendly_name": "Fair division",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.rock_paper_scissors",
					"class": "base.gametheory.game_theory_game",
					"friendly_name": "rps",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.gametheory.game_theory_game.class_of_game",
					"friendly_name": "Class of game"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.gametheory.class_of_game.games_of_this_type",
					"friendly_name": "Games of this type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gametheory.class_of_game . \nVALUES ?x1 { :en.fair_division } \nVALUES ?x2 { :en.rock_paper_scissors } \n?x1 :base.gametheory.game_theory_game.class_of_game ?x0 . \n?x0 :base.gametheory.class_of_game.games_of_this_type ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 204000000,
		"question": "which countries are using a top level domain sponsored by the holy see?",
		"answer": [
			"Vatican City"
		],
		"function": "none",
		"commonness": -21.702477186213052,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "location.country",
					"class": "location.country",
					"friendly_name": "Country",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "internet.top_level_domain",
					"class": "internet.top_level_domain",
					"friendly_name": "Top Level Domain",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.holy_see",
					"class": "internet.top_level_domain_sponsor",
					"friendly_name": "Holy See",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "location.country.internet_tld",
					"friendly_name": "Internet TLD"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "internet.top_level_domain.sponsor",
					"friendly_name": "Sponsor"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :location.country . \n?x1 :type.object.type :internet.top_level_domain . \nVALUES ?x2 { :en.holy_see } \n?x0 :location.country.internet_tld ?x1 . \n?x1 :internet.top_level_domain.sponsor ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 204000001,
		"question": "which countries are using a top level domain sponsored by the vatican?",
		"answer": [
			"Vatican City"
		],
		"function": "none",
		"commonness": -21.702477186213052,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "location.country",
					"class": "location.country",
					"friendly_name": "Country",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "internet.top_level_domain",
					"class": "internet.top_level_domain",
					"friendly_name": "Top Level Domain",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.holy_see",
					"class": "internet.top_level_domain_sponsor",
					"friendly_name": "vatican",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "location.country.internet_tld",
					"friendly_name": "Internet TLD"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "internet.top_level_domain.sponsor",
					"friendly_name": "Sponsor"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :location.country . \n?x1 :type.object.type :internet.top_level_domain . \nVALUES ?x2 { :en.holy_see } \n?x0 :location.country.internet_tld ?x1 . \n?x1 :internet.top_level_domain.sponsor ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 204000002,
		"question": "which countries are using a top level domain sponsored by the roman see?",
		"answer": [
			"Vatican City"
		],
		"function": "none",
		"commonness": -21.702477186213052,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "location.country",
					"class": "location.country",
					"friendly_name": "Country",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "internet.top_level_domain",
					"class": "internet.top_level_domain",
					"friendly_name": "Top Level Domain",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.holy_see",
					"class": "internet.top_level_domain_sponsor",
					"friendly_name": "roman see",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "location.country.internet_tld",
					"friendly_name": "Internet TLD"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "internet.top_level_domain.sponsor",
					"friendly_name": "Sponsor"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :location.country . \n?x1 :type.object.type :internet.top_level_domain . \nVALUES ?x2 { :en.holy_see } \n?x0 :location.country.internet_tld ?x1 . \n?x1 :internet.top_level_domain.sponsor ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 204000100,
		"question": "which are the countries using top level domain sponsored by the holy see?",
		"answer": [
			"Vatican City"
		],
		"function": "none",
		"commonness": -21.702477186213052,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "location.country",
					"class": "location.country",
					"friendly_name": "Country",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "internet.top_level_domain",
					"class": "internet.top_level_domain",
					"friendly_name": "Top Level Domain",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.holy_see",
					"class": "internet.top_level_domain_sponsor",
					"friendly_name": "Holy See",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "location.country.internet_tld",
					"friendly_name": "Internet TLD"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "internet.top_level_domain.sponsor",
					"friendly_name": "Sponsor"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :location.country . \n?x1 :type.object.type :internet.top_level_domain . \nVALUES ?x2 { :en.holy_see } \n?x0 :location.country.internet_tld ?x1 . \n?x1 :internet.top_level_domain.sponsor ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 204000101,
		"question": "which are the countries using top level domain sponsored by the vatican?",
		"answer": [
			"Vatican City"
		],
		"function": "none",
		"commonness": -21.702477186213052,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "location.country",
					"class": "location.country",
					"friendly_name": "Country",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "internet.top_level_domain",
					"class": "internet.top_level_domain",
					"friendly_name": "Top Level Domain",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.holy_see",
					"class": "internet.top_level_domain_sponsor",
					"friendly_name": "vatican",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "location.country.internet_tld",
					"friendly_name": "Internet TLD"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "internet.top_level_domain.sponsor",
					"friendly_name": "Sponsor"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :location.country . \n?x1 :type.object.type :internet.top_level_domain . \nVALUES ?x2 { :en.holy_see } \n?x0 :location.country.internet_tld ?x1 . \n?x1 :internet.top_level_domain.sponsor ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	}
]