[
	{
		"qid": 50000000,
		"question": "what's the chivalric rank of the title lady companion of the garter?",
		"answer": [
			"Lady Companion"
		],
		"function": "none",
		"commonness": -20.158811374247886,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "royalty.chivalric_rank",
					"class": "royalty.chivalric_rank",
					"friendly_name": "Chivalric Rank",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.lady_companion_of_the_garter",
					"class": "royalty.chivalric_title",
					"friendly_name": "Lady Companion of the Garter",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "royalty.chivalric_title.rank",
					"friendly_name": "Rank"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :royalty.chivalric_rank . \nVALUES ?x1 { :en.lady_companion_of_the_garter } \n?x1 :royalty.chivalric_title.rank ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 50000001,
		"question": "what's the chivalric rank of the title lady of the garter?",
		"answer": [
			"Lady Companion"
		],
		"function": "none",
		"commonness": -20.158811374247886,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "royalty.chivalric_rank",
					"class": "royalty.chivalric_rank",
					"friendly_name": "Chivalric Rank",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.lady_companion_of_the_garter",
					"class": "royalty.chivalric_title",
					"friendly_name": "lady of the garter",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "royalty.chivalric_title.rank",
					"friendly_name": "Rank"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :royalty.chivalric_rank . \nVALUES ?x1 { :en.lady_companion_of_the_garter } \n?x1 :royalty.chivalric_title.rank ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 51000000,
		"question": "what diagnostic tests are for feline infectious peritonitis?",
		"answer": [
			"Blood test",
			"Polymerase chain reaction",
			"ELISA",
			"Indirect immunofluorescence antibody test"
		],
		"function": "none",
		"commonness": -16.600327420677367,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pethealth.diagnosis",
					"class": "base.pethealth.diagnosis",
					"friendly_name": "Pet Diagnostic Test",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.feline_infectious_peritonitis",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "Feline infectious peritonitis",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pethealth.pet_disease_or_medical_condition.diagnosis",
					"friendly_name": "Diagnostic Tests"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pethealth.diagnosis . \nVALUES ?x1 { :en.feline_infectious_peritonitis } \n?x1 :base.pethealth.pet_disease_or_medical_condition.diagnosis ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 51000001,
		"question": "what diagnostic tests are for fip?",
		"answer": [
			"Blood test",
			"Indirect immunofluorescence antibody test",
			"Polymerase chain reaction",
			"ELISA"
		],
		"function": "none",
		"commonness": -16.600327420677367,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pethealth.diagnosis",
					"class": "base.pethealth.diagnosis",
					"friendly_name": "Pet Diagnostic Test",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.feline_infectious_peritonitis",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "fip",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pethealth.pet_disease_or_medical_condition.diagnosis",
					"friendly_name": "Diagnostic Tests"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pethealth.diagnosis . \nVALUES ?x1 { :en.feline_infectious_peritonitis } \n?x1 :base.pethealth.pet_disease_or_medical_condition.diagnosis ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 51000100,
		"question": "what kind of test are used to diagnose feline infectious peritonitis?",
		"answer": [
			"ELISA",
			"Indirect immunofluorescence antibody test",
			"Blood test",
			"Polymerase chain reaction"
		],
		"function": "none",
		"commonness": -16.600327420677367,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pethealth.diagnosis",
					"class": "base.pethealth.diagnosis",
					"friendly_name": "Pet Diagnostic Test",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.feline_infectious_peritonitis",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "Feline infectious peritonitis",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pethealth.pet_disease_or_medical_condition.diagnosis",
					"friendly_name": "Diagnostic Tests"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pethealth.diagnosis . \nVALUES ?x1 { :en.feline_infectious_peritonitis } \n?x1 :base.pethealth.pet_disease_or_medical_condition.diagnosis ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 51000101,
		"question": "what kind of test are used to diagnose fip?",
		"answer": [
			"Indirect immunofluorescence antibody test",
			"Polymerase chain reaction",
			"ELISA",
			"Blood test"
		],
		"function": "none",
		"commonness": -16.600327420677367,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pethealth.diagnosis",
					"class": "base.pethealth.diagnosis",
					"friendly_name": "Pet Diagnostic Test",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.feline_infectious_peritonitis",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "fip",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pethealth.pet_disease_or_medical_condition.diagnosis",
					"friendly_name": "Diagnostic Tests"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pethealth.diagnosis . \nVALUES ?x1 { :en.feline_infectious_peritonitis } \n?x1 :base.pethealth.pet_disease_or_medical_condition.diagnosis ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 51000200,
		"question": "what is the procedure for determining a case of feline infectious peritonitis?",
		"answer": [
			"Polymerase chain reaction",
			"Blood test",
			"ELISA",
			"Indirect immunofluorescence antibody test"
		],
		"function": "none",
		"commonness": -16.600327420677367,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pethealth.diagnosis",
					"class": "base.pethealth.diagnosis",
					"friendly_name": "Pet Diagnostic Test",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.feline_infectious_peritonitis",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "Feline infectious peritonitis",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pethealth.pet_disease_or_medical_condition.diagnosis",
					"friendly_name": "Diagnostic Tests"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pethealth.diagnosis . \nVALUES ?x1 { :en.feline_infectious_peritonitis } \n?x1 :base.pethealth.pet_disease_or_medical_condition.diagnosis ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 51000201,
		"question": "what is the procedure for determining a case of fip?",
		"answer": [
			"Polymerase chain reaction",
			"Blood test",
			"Indirect immunofluorescence antibody test",
			"ELISA"
		],
		"function": "none",
		"commonness": -16.600327420677367,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pethealth.diagnosis",
					"class": "base.pethealth.diagnosis",
					"friendly_name": "Pet Diagnostic Test",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.feline_infectious_peritonitis",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "fip",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pethealth.pet_disease_or_medical_condition.diagnosis",
					"friendly_name": "Diagnostic Tests"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pethealth.diagnosis . \nVALUES ?x1 { :en.feline_infectious_peritonitis } \n?x1 :base.pethealth.pet_disease_or_medical_condition.diagnosis ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 51000300,
		"question": "how to diagnose feline infectious peritonitis?",
		"answer": [
			"Blood test",
			"ELISA",
			"Polymerase chain reaction",
			"Indirect immunofluorescence antibody test"
		],
		"function": "none",
		"commonness": -16.600327420677367,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pethealth.diagnosis",
					"class": "base.pethealth.diagnosis",
					"friendly_name": "Pet Diagnostic Test",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.feline_infectious_peritonitis",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "Feline infectious peritonitis",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pethealth.pet_disease_or_medical_condition.diagnosis",
					"friendly_name": "Diagnostic Tests"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pethealth.diagnosis . \nVALUES ?x1 { :en.feline_infectious_peritonitis } \n?x1 :base.pethealth.pet_disease_or_medical_condition.diagnosis ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 51000301,
		"question": "how to diagnose fip?",
		"answer": [
			"Indirect immunofluorescence antibody test",
			"ELISA",
			"Polymerase chain reaction",
			"Blood test"
		],
		"function": "none",
		"commonness": -16.600327420677367,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pethealth.diagnosis",
					"class": "base.pethealth.diagnosis",
					"friendly_name": "Pet Diagnostic Test",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.feline_infectious_peritonitis",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "fip",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pethealth.pet_disease_or_medical_condition.diagnosis",
					"friendly_name": "Diagnostic Tests"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pethealth.diagnosis . \nVALUES ?x1 { :en.feline_infectious_peritonitis } \n?x1 :base.pethealth.pet_disease_or_medical_condition.diagnosis ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 51000400,
		"question": "how is feline infectious peritonitis diagnosed?",
		"answer": [
			"Polymerase chain reaction",
			"Indirect immunofluorescence antibody test",
			"Blood test",
			"ELISA"
		],
		"function": "none",
		"commonness": -16.600327420677367,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pethealth.diagnosis",
					"class": "base.pethealth.diagnosis",
					"friendly_name": "Pet Diagnostic Test",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.feline_infectious_peritonitis",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "Feline infectious peritonitis",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pethealth.pet_disease_or_medical_condition.diagnosis",
					"friendly_name": "Diagnostic Tests"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pethealth.diagnosis . \nVALUES ?x1 { :en.feline_infectious_peritonitis } \n?x1 :base.pethealth.pet_disease_or_medical_condition.diagnosis ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 51000401,
		"question": "how is fip diagnosed?",
		"answer": [
			"Polymerase chain reaction",
			"Blood test",
			"Indirect immunofluorescence antibody test",
			"ELISA"
		],
		"function": "none",
		"commonness": -16.600327420677367,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pethealth.diagnosis",
					"class": "base.pethealth.diagnosis",
					"friendly_name": "Pet Diagnostic Test",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.feline_infectious_peritonitis",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "fip",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pethealth.pet_disease_or_medical_condition.diagnosis",
					"friendly_name": "Diagnostic Tests"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pethealth.diagnosis . \nVALUES ?x1 { :en.feline_infectious_peritonitis } \n?x1 :base.pethealth.pet_disease_or_medical_condition.diagnosis ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 52000000,
		"question": "tv pg is part of what tv rating system?",
		"answer": [
			"TV Parental Guidelines"
		],
		"function": "none",
		"commonness": -22.218174098448266,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "tv.tv_rating_system",
					"class": "tv.tv_rating_system",
					"friendly_name": "TV Rating System",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.tv_pg",
					"class": "tv.tv_rating",
					"friendly_name": "TV PG",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "tv.tv_rating.tv_rating_system",
					"friendly_name": "TV Rating System"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :tv.tv_rating_system . \nVALUES ?x1 { :en.tv_pg } \n?x1 :tv.tv_rating.tv_rating_system ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 52000100,
		"question": "which tv rating systems include the rating tv pg?",
		"answer": [
			"TV Parental Guidelines"
		],
		"function": "none",
		"commonness": -22.218174098448266,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "tv.tv_rating_system",
					"class": "tv.tv_rating_system",
					"friendly_name": "TV Rating System",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.tv_pg",
					"class": "tv.tv_rating",
					"friendly_name": "TV PG",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "tv.tv_rating.tv_rating_system",
					"friendly_name": "TV Rating System"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :tv.tv_rating_system . \nVALUES ?x1 { :en.tv_pg } \n?x1 :tv.tv_rating.tv_rating_system ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 52000300,
		"question": "tv pg belongs to which tv rating system?",
		"answer": [
			"TV Parental Guidelines"
		],
		"function": "none",
		"commonness": -22.218174098448266,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "tv.tv_rating_system",
					"class": "tv.tv_rating_system",
					"friendly_name": "TV Rating System",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.tv_pg",
					"class": "tv.tv_rating",
					"friendly_name": "TV PG",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "tv.tv_rating.tv_rating_system",
					"friendly_name": "TV Rating System"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :tv.tv_rating_system . \nVALUES ?x1 { :en.tv_pg } \n?x1 :tv.tv_rating.tv_rating_system ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 52000400,
		"question": "tv pg is a rating used by which tv rating systems?",
		"answer": [
			"TV Parental Guidelines"
		],
		"function": "none",
		"commonness": -22.218174098448266,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "tv.tv_rating_system",
					"class": "tv.tv_rating_system",
					"friendly_name": "TV Rating System",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.tv_pg",
					"class": "tv.tv_rating",
					"friendly_name": "TV PG",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "tv.tv_rating.tv_rating_system",
					"friendly_name": "TV Rating System"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :tv.tv_rating_system . \nVALUES ?x1 { :en.tv_pg } \n?x1 :tv.tv_rating.tv_rating_system ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 52000500,
		"question": "what is the rating system that tv pg is a part of ?",
		"answer": [
			"TV Parental Guidelines"
		],
		"function": "none",
		"commonness": -22.218174098448266,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "tv.tv_rating_system",
					"class": "tv.tv_rating_system",
					"friendly_name": "TV Rating System",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.tv_pg",
					"class": "tv.tv_rating",
					"friendly_name": "TV PG",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "tv.tv_rating.tv_rating_system",
					"friendly_name": "TV Rating System"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :tv.tv_rating_system . \nVALUES ?x1 { :en.tv_pg } \n?x1 :tv.tv_rating.tv_rating_system ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 53000000,
		"question": "what ad targeting methods are available on adsense?",
		"answer": [
			"Contextual advertising"
		],
		"function": "none",
		"commonness": -17.96881996053463,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.onlineadvertising.ad_targeting_method",
					"class": "base.onlineadvertising.ad_targeting_method",
					"friendly_name": "Ad Targeting Method",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.adsense",
					"class": "base.onlineadvertising.ad_network",
					"friendly_name": "AdSense",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.onlineadvertising.ad_network.targeting_method",
					"friendly_name": "Ad targeting method"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.onlineadvertising.ad_targeting_method . \nVALUES ?x1 { :en.adsense } \n?x1 :base.onlineadvertising.ad_network.targeting_method ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 53000001,
		"question": "what ad targeting methods are available on google adsense?",
		"answer": [
			"Contextual advertising"
		],
		"function": "none",
		"commonness": -17.96881996053463,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.onlineadvertising.ad_targeting_method",
					"class": "base.onlineadvertising.ad_targeting_method",
					"friendly_name": "Ad Targeting Method",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.adsense",
					"class": "base.onlineadvertising.ad_network",
					"friendly_name": "google adsense",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.onlineadvertising.ad_network.targeting_method",
					"friendly_name": "Ad targeting method"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.onlineadvertising.ad_targeting_method . \nVALUES ?x1 { :en.adsense } \n?x1 :base.onlineadvertising.ad_network.targeting_method ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 53000002,
		"question": "what ad targeting methods are available on google ads?",
		"answer": [
			"Contextual advertising"
		],
		"function": "none",
		"commonness": -17.96881996053463,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.onlineadvertising.ad_targeting_method",
					"class": "base.onlineadvertising.ad_targeting_method",
					"friendly_name": "Ad Targeting Method",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.adsense",
					"class": "base.onlineadvertising.ad_network",
					"friendly_name": "google ads",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.onlineadvertising.ad_network.targeting_method",
					"friendly_name": "Ad targeting method"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.onlineadvertising.ad_targeting_method . \nVALUES ?x1 { :en.adsense } \n?x1 :base.onlineadvertising.ad_network.targeting_method ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 53000100,
		"question": "what ad targeting methods does adsense use?",
		"answer": [
			"Contextual advertising"
		],
		"function": "none",
		"commonness": -17.96881996053463,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.onlineadvertising.ad_targeting_method",
					"class": "base.onlineadvertising.ad_targeting_method",
					"friendly_name": "Ad Targeting Method",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.adsense",
					"class": "base.onlineadvertising.ad_network",
					"friendly_name": "AdSense",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.onlineadvertising.ad_network.targeting_method",
					"friendly_name": "Ad targeting method"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.onlineadvertising.ad_targeting_method . \nVALUES ?x1 { :en.adsense } \n?x1 :base.onlineadvertising.ad_network.targeting_method ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 53000101,
		"question": "what ad targeting methods does google adsense use?",
		"answer": [
			"Contextual advertising"
		],
		"function": "none",
		"commonness": -17.96881996053463,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.onlineadvertising.ad_targeting_method",
					"class": "base.onlineadvertising.ad_targeting_method",
					"friendly_name": "Ad Targeting Method",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.adsense",
					"class": "base.onlineadvertising.ad_network",
					"friendly_name": "google adsense",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.onlineadvertising.ad_network.targeting_method",
					"friendly_name": "Ad targeting method"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.onlineadvertising.ad_targeting_method . \nVALUES ?x1 { :en.adsense } \n?x1 :base.onlineadvertising.ad_network.targeting_method ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 53000102,
		"question": "what ad targeting methods does google ads use?",
		"answer": [
			"Contextual advertising"
		],
		"function": "none",
		"commonness": -17.96881996053463,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.onlineadvertising.ad_targeting_method",
					"class": "base.onlineadvertising.ad_targeting_method",
					"friendly_name": "Ad Targeting Method",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.adsense",
					"class": "base.onlineadvertising.ad_network",
					"friendly_name": "google ads",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.onlineadvertising.ad_network.targeting_method",
					"friendly_name": "Ad targeting method"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.onlineadvertising.ad_targeting_method . \nVALUES ?x1 { :en.adsense } \n?x1 :base.onlineadvertising.ad_network.targeting_method ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]