[
	{
		"qid": 9000102,
		"question": "tyson uses which stance?",
		"answer": [
			"Orthodox stance"
		],
		"function": "none",
		"commonness": -19.263772083515807,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.boxing_stance",
					"class": "sports.boxing_stance",
					"friendly_name": "Boxing Stance",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mike_tyson",
					"class": "sports.boxer",
					"friendly_name": "tyson",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.boxing_stance.boxers_with_this_stance",
					"friendly_name": "Boxers with this stance"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.boxing_stance . \nVALUES ?x1 { :en.mike_tyson } \n?x0 :sports.boxing_stance.boxers_with_this_stance ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 9000200,
		"question": "what stance does mike tyson use?",
		"answer": [
			"Orthodox stance"
		],
		"function": "none",
		"commonness": -19.263772083515807,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.boxing_stance",
					"class": "sports.boxing_stance",
					"friendly_name": "Boxing Stance",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mike_tyson",
					"class": "sports.boxer",
					"friendly_name": "Mike Tyson",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.boxing_stance.boxers_with_this_stance",
					"friendly_name": "Boxers with this stance"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.boxing_stance . \nVALUES ?x1 { :en.mike_tyson } \n?x0 :sports.boxing_stance.boxers_with_this_stance ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 9000201,
		"question": "what stance does michael tyson use?",
		"answer": [
			"Orthodox stance"
		],
		"function": "none",
		"commonness": -19.263772083515807,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.boxing_stance",
					"class": "sports.boxing_stance",
					"friendly_name": "Boxing Stance",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mike_tyson",
					"class": "sports.boxer",
					"friendly_name": "michael tyson",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.boxing_stance.boxers_with_this_stance",
					"friendly_name": "Boxers with this stance"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.boxing_stance . \nVALUES ?x1 { :en.mike_tyson } \n?x0 :sports.boxing_stance.boxers_with_this_stance ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 9000202,
		"question": "what stance does tyson use?",
		"answer": [
			"Orthodox stance"
		],
		"function": "none",
		"commonness": -19.263772083515807,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.boxing_stance",
					"class": "sports.boxing_stance",
					"friendly_name": "Boxing Stance",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mike_tyson",
					"class": "sports.boxer",
					"friendly_name": "tyson",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.boxing_stance.boxers_with_this_stance",
					"friendly_name": "Boxers with this stance"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.boxing_stance . \nVALUES ?x1 { :en.mike_tyson } \n?x0 :sports.boxing_stance.boxers_with_this_stance ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 9000301,
		"question": "which boxing stance is used by michael tyson?",
		"answer": [
			"Orthodox stance"
		],
		"function": "none",
		"commonness": -19.263772083515807,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.boxing_stance",
					"class": "sports.boxing_stance",
					"friendly_name": "Boxing Stance",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mike_tyson",
					"class": "sports.boxer",
					"friendly_name": "michael tyson",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.boxing_stance.boxers_with_this_stance",
					"friendly_name": "Boxers with this stance"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.boxing_stance . \nVALUES ?x1 { :en.mike_tyson } \n?x0 :sports.boxing_stance.boxers_with_this_stance ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 9000302,
		"question": "which boxing stance is used by tyson?",
		"answer": [
			"Orthodox stance"
		],
		"function": "none",
		"commonness": -19.263772083515807,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.boxing_stance",
					"class": "sports.boxing_stance",
					"friendly_name": "Boxing Stance",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mike_tyson",
					"class": "sports.boxer",
					"friendly_name": "tyson",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.boxing_stance.boxers_with_this_stance",
					"friendly_name": "Boxers with this stance"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.boxing_stance . \nVALUES ?x1 { :en.mike_tyson } \n?x0 :sports.boxing_stance.boxers_with_this_stance ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 9000400,
		"question": "which boxing stance is utilized by mike tyson?",
		"answer": [
			"Orthodox stance"
		],
		"function": "none",
		"commonness": -19.263772083515807,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.boxing_stance",
					"class": "sports.boxing_stance",
					"friendly_name": "Boxing Stance",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mike_tyson",
					"class": "sports.boxer",
					"friendly_name": "Mike Tyson",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.boxing_stance.boxers_with_this_stance",
					"friendly_name": "Boxers with this stance"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.boxing_stance . \nVALUES ?x1 { :en.mike_tyson } \n?x0 :sports.boxing_stance.boxers_with_this_stance ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 9000401,
		"question": "which boxing stance is utilized by michael tyson?",
		"answer": [
			"Orthodox stance"
		],
		"function": "none",
		"commonness": -19.263772083515807,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.boxing_stance",
					"class": "sports.boxing_stance",
					"friendly_name": "Boxing Stance",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mike_tyson",
					"class": "sports.boxer",
					"friendly_name": "michael tyson",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.boxing_stance.boxers_with_this_stance",
					"friendly_name": "Boxers with this stance"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.boxing_stance . \nVALUES ?x1 { :en.mike_tyson } \n?x0 :sports.boxing_stance.boxers_with_this_stance ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 9000402,
		"question": "which boxing stance is utilized by tyson?",
		"answer": [
			"Orthodox stance"
		],
		"function": "none",
		"commonness": -19.263772083515807,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.boxing_stance",
					"class": "sports.boxing_stance",
					"friendly_name": "Boxing Stance",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mike_tyson",
					"class": "sports.boxer",
					"friendly_name": "tyson",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.boxing_stance.boxers_with_this_stance",
					"friendly_name": "Boxers with this stance"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.boxing_stance . \nVALUES ?x1 { :en.mike_tyson } \n?x0 :sports.boxing_stance.boxers_with_this_stance ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 10000000,
		"question": "what hair color does kate moss have?",
		"answer": [
			"Brown"
		],
		"function": "none",
		"commonness": -15.40509679123399,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.fashionmodels.hair_color",
					"class": "base.fashionmodels.hair_color",
					"friendly_name": "Hair color",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.kate_moss",
					"class": "base.fashionmodels.fashion_model",
					"friendly_name": "Kate Moss",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.fashionmodels.fashion_model.hair_color",
					"friendly_name": "Hair color"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.fashionmodels.hair_color . \nVALUES ?x1 { :en.kate_moss } \n?x1 :base.fashionmodels.fashion_model.hair_color ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 10000001,
		"question": "what hair color does katherine ann moss have?",
		"answer": [
			"Brown"
		],
		"function": "none",
		"commonness": -15.40509679123399,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.fashionmodels.hair_color",
					"class": "base.fashionmodels.hair_color",
					"friendly_name": "Hair color",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.kate_moss",
					"class": "base.fashionmodels.fashion_model",
					"friendly_name": "katherine ann moss",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.fashionmodels.fashion_model.hair_color",
					"friendly_name": "Hair color"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.fashionmodels.hair_color . \nVALUES ?x1 { :en.kate_moss } \n?x1 :base.fashionmodels.fashion_model.hair_color ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 10000100,
		"question": "what is the hair color of kate moss?",
		"answer": [
			"Brown"
		],
		"function": "none",
		"commonness": -15.40509679123399,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.fashionmodels.hair_color",
					"class": "base.fashionmodels.hair_color",
					"friendly_name": "Hair color",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.kate_moss",
					"class": "base.fashionmodels.fashion_model",
					"friendly_name": "Kate Moss",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.fashionmodels.fashion_model.hair_color",
					"friendly_name": "Hair color"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.fashionmodels.hair_color . \nVALUES ?x1 { :en.kate_moss } \n?x1 :base.fashionmodels.fashion_model.hair_color ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 10000101,
		"question": "what is the hair color of katherine ann moss?",
		"answer": [
			"Brown"
		],
		"function": "none",
		"commonness": -15.40509679123399,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.fashionmodels.hair_color",
					"class": "base.fashionmodels.hair_color",
					"friendly_name": "Hair color",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.kate_moss",
					"class": "base.fashionmodels.fashion_model",
					"friendly_name": "katherine ann moss",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.fashionmodels.fashion_model.hair_color",
					"friendly_name": "Hair color"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.fashionmodels.hair_color . \nVALUES ?x1 { :en.kate_moss } \n?x1 :base.fashionmodels.fashion_model.hair_color ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 10000200,
		"question": "what color is kate moss's hair?",
		"answer": [
			"Brown"
		],
		"function": "none",
		"commonness": -15.40509679123399,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.fashionmodels.hair_color",
					"class": "base.fashionmodels.hair_color",
					"friendly_name": "Hair color",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.kate_moss",
					"class": "base.fashionmodels.fashion_model",
					"friendly_name": "Kate Moss",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.fashionmodels.fashion_model.hair_color",
					"friendly_name": "Hair color"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.fashionmodels.hair_color . \nVALUES ?x1 { :en.kate_moss } \n?x1 :base.fashionmodels.fashion_model.hair_color ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 10000201,
		"question": "what color is katherine ann moss's hair?",
		"answer": [
			"Brown"
		],
		"function": "none",
		"commonness": -15.40509679123399,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.fashionmodels.hair_color",
					"class": "base.fashionmodels.hair_color",
					"friendly_name": "Hair color",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.kate_moss",
					"class": "base.fashionmodels.fashion_model",
					"friendly_name": "katherine ann moss",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.fashionmodels.fashion_model.hair_color",
					"friendly_name": "Hair color"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.fashionmodels.hair_color . \nVALUES ?x1 { :en.kate_moss } \n?x1 :base.fashionmodels.fashion_model.hair_color ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 10000300,
		"question": "name the shade of hair of model kate moss?",
		"answer": [
			"Brown"
		],
		"function": "none",
		"commonness": -15.40509679123399,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.fashionmodels.hair_color",
					"class": "base.fashionmodels.hair_color",
					"friendly_name": "Hair color",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.kate_moss",
					"class": "base.fashionmodels.fashion_model",
					"friendly_name": "Kate Moss",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.fashionmodels.fashion_model.hair_color",
					"friendly_name": "Hair color"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.fashionmodels.hair_color . \nVALUES ?x1 { :en.kate_moss } \n?x1 :base.fashionmodels.fashion_model.hair_color ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 10000301,
		"question": "name the shade of hair of model katherine ann moss?",
		"answer": [
			"Brown"
		],
		"function": "none",
		"commonness": -15.40509679123399,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.fashionmodels.hair_color",
					"class": "base.fashionmodels.hair_color",
					"friendly_name": "Hair color",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.kate_moss",
					"class": "base.fashionmodels.fashion_model",
					"friendly_name": "katherine ann moss",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.fashionmodels.fashion_model.hair_color",
					"friendly_name": "Hair color"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.fashionmodels.hair_color . \nVALUES ?x1 { :en.kate_moss } \n?x1 :base.fashionmodels.fashion_model.hair_color ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 11000000,
		"question": "the nikon d300 includes a sensor, who made this sensor?",
		"answer": [
			"Nikon Corporation"
		],
		"function": "none",
		"commonness": -15.008139899197342,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "digicams.camera_sensor_manufacturer",
					"class": "digicams.camera_sensor_manufacturer",
					"friendly_name": "Camera Sensor Manufacturer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nikon_d300",
					"class": "digicams.digital_camera",
					"friendly_name": "Nikon D300",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "digicams.camera_sensor_manufacturer.cameras",
					"friendly_name": "Cameras"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :digicams.camera_sensor_manufacturer . \nVALUES ?x1 { :en.nikon_d300 } \n?x0 :digicams.camera_sensor_manufacturer.cameras ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 11000001,
		"question": "the d300 includes a sensor, who made this sensor?",
		"answer": [
			"Nikon Corporation"
		],
		"function": "none",
		"commonness": -15.008139899197342,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "digicams.camera_sensor_manufacturer",
					"class": "digicams.camera_sensor_manufacturer",
					"friendly_name": "Camera Sensor Manufacturer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nikon_d300",
					"class": "digicams.digital_camera",
					"friendly_name": "d300",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "digicams.camera_sensor_manufacturer.cameras",
					"friendly_name": "Cameras"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :digicams.camera_sensor_manufacturer . \nVALUES ?x1 { :en.nikon_d300 } \n?x0 :digicams.camera_sensor_manufacturer.cameras ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 11000100,
		"question": "who made the sensor of nikon d300?",
		"answer": [
			"Nikon Corporation"
		],
		"function": "none",
		"commonness": -15.008139899197342,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "digicams.camera_sensor_manufacturer",
					"class": "digicams.camera_sensor_manufacturer",
					"friendly_name": "Camera Sensor Manufacturer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nikon_d300",
					"class": "digicams.digital_camera",
					"friendly_name": "Nikon D300",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "digicams.camera_sensor_manufacturer.cameras",
					"friendly_name": "Cameras"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :digicams.camera_sensor_manufacturer . \nVALUES ?x1 { :en.nikon_d300 } \n?x0 :digicams.camera_sensor_manufacturer.cameras ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 11000101,
		"question": "who made the sensor of d300?",
		"answer": [
			"Nikon Corporation"
		],
		"function": "none",
		"commonness": -15.008139899197342,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "digicams.camera_sensor_manufacturer",
					"class": "digicams.camera_sensor_manufacturer",
					"friendly_name": "Camera Sensor Manufacturer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nikon_d300",
					"class": "digicams.digital_camera",
					"friendly_name": "d300",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "digicams.camera_sensor_manufacturer.cameras",
					"friendly_name": "Cameras"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :digicams.camera_sensor_manufacturer . \nVALUES ?x1 { :en.nikon_d300 } \n?x0 :digicams.camera_sensor_manufacturer.cameras ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 11000200,
		"question": "what company made the sensor of nikon d300?",
		"answer": [
			"Nikon Corporation"
		],
		"function": "none",
		"commonness": -15.008139899197342,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "digicams.camera_sensor_manufacturer",
					"class": "digicams.camera_sensor_manufacturer",
					"friendly_name": "Camera Sensor Manufacturer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nikon_d300",
					"class": "digicams.digital_camera",
					"friendly_name": "Nikon D300",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "digicams.camera_sensor_manufacturer.cameras",
					"friendly_name": "Cameras"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :digicams.camera_sensor_manufacturer . \nVALUES ?x1 { :en.nikon_d300 } \n?x0 :digicams.camera_sensor_manufacturer.cameras ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 11000201,
		"question": "what company made the sensor of d300?",
		"answer": [
			"Nikon Corporation"
		],
		"function": "none",
		"commonness": -15.008139899197342,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "digicams.camera_sensor_manufacturer",
					"class": "digicams.camera_sensor_manufacturer",
					"friendly_name": "Camera Sensor Manufacturer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nikon_d300",
					"class": "digicams.digital_camera",
					"friendly_name": "d300",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "digicams.camera_sensor_manufacturer.cameras",
					"friendly_name": "Cameras"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :digicams.camera_sensor_manufacturer . \nVALUES ?x1 { :en.nikon_d300 } \n?x0 :digicams.camera_sensor_manufacturer.cameras ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 11000300,
		"question": "what is the name of the company that produces the sensor of nikon d300?",
		"answer": [
			"Nikon Corporation"
		],
		"function": "none",
		"commonness": -15.008139899197342,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "digicams.camera_sensor_manufacturer",
					"class": "digicams.camera_sensor_manufacturer",
					"friendly_name": "Camera Sensor Manufacturer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nikon_d300",
					"class": "digicams.digital_camera",
					"friendly_name": "Nikon D300",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "digicams.camera_sensor_manufacturer.cameras",
					"friendly_name": "Cameras"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :digicams.camera_sensor_manufacturer . \nVALUES ?x1 { :en.nikon_d300 } \n?x0 :digicams.camera_sensor_manufacturer.cameras ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 11000301,
		"question": "what is the name of the company that produces the sensor of d300?",
		"answer": [
			"Nikon Corporation"
		],
		"function": "none",
		"commonness": -15.008139899197342,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "digicams.camera_sensor_manufacturer",
					"class": "digicams.camera_sensor_manufacturer",
					"friendly_name": "Camera Sensor Manufacturer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nikon_d300",
					"class": "digicams.digital_camera",
					"friendly_name": "d300",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "digicams.camera_sensor_manufacturer.cameras",
					"friendly_name": "Cameras"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :digicams.camera_sensor_manufacturer . \nVALUES ?x1 { :en.nikon_d300 } \n?x0 :digicams.camera_sensor_manufacturer.cameras ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]