[
	{
		"qid": 229000501,
		"question": "who was the publisher of the comics books of alan oswald moore?",
		"answer": [
			"WildStorm",
			"DC Comics",
			"Dark Horse Comics",
			"Top Shelf Productions",
			"Vertigo",
			"Avatar Press"
		],
		"function": "none",
		"commonness": -22.0274509335855,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_publisher",
					"class": "comic_books.comic_book_publisher",
					"friendly_name": "Comic Book Publisher",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "comic_books.comic_book_series",
					"class": "comic_books.comic_book_series",
					"friendly_name": "Comic Book Series",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.alan_moore",
					"class": "comic_books.comic_book_creator",
					"friendly_name": "alan oswald moore",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "comic_books.comic_book_publisher.comic_book_series_published",
					"friendly_name": "Comic Book Series Published"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "comic_books.comic_book_creator.series_created",
					"friendly_name": "Series Created"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_publisher . \n?x1 :type.object.type :comic_books.comic_book_series . \nVALUES ?x2 { :en.alan_moore } \n?x0 :comic_books.comic_book_publisher.comic_book_series_published ?x1 . \n?x2 :comic_books.comic_book_creator.series_created ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 230000001,
		"question": "what kind of vehicle is used in the bart?",
		"answer": [
			"Electric locomotive"
		],
		"function": "none",
		"commonness": -25.917564818467802,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "metropolitan_transit.transit_vehicle",
					"class": "metropolitan_transit.transit_vehicle",
					"friendly_name": "Transit Vehicle Type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "metropolitan_transit.transit_line",
					"class": "metropolitan_transit.transit_line",
					"friendly_name": "Transit Line",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.bay_area_rapid_transit",
					"class": "metropolitan_transit.transit_system",
					"friendly_name": "bart",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "metropolitan_transit.transit_line.vehicle_types",
					"friendly_name": "Vehicle Categories"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "metropolitan_transit.transit_system.transit_lines",
					"friendly_name": "Transit Lines"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :metropolitan_transit.transit_vehicle . \n?x1 :type.object.type :metropolitan_transit.transit_line . \nVALUES ?x2 { :en.bay_area_rapid_transit } \n?x1 :metropolitan_transit.transit_line.vehicle_types ?x0 . \n?x2 :metropolitan_transit.transit_system.transit_lines ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 230000100,
		"question": "in the bay area rapid transit what kind of trains are used?",
		"answer": [
			"Electric locomotive"
		],
		"function": "none",
		"commonness": -25.917564818467802,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "metropolitan_transit.transit_vehicle",
					"class": "metropolitan_transit.transit_vehicle",
					"friendly_name": "Transit Vehicle Type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "metropolitan_transit.transit_line",
					"class": "metropolitan_transit.transit_line",
					"friendly_name": "Transit Line",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.bay_area_rapid_transit",
					"class": "metropolitan_transit.transit_system",
					"friendly_name": "Bay Area Rapid Transit",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "metropolitan_transit.transit_line.vehicle_types",
					"friendly_name": "Vehicle Categories"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "metropolitan_transit.transit_system.transit_lines",
					"friendly_name": "Transit Lines"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :metropolitan_transit.transit_vehicle . \n?x1 :type.object.type :metropolitan_transit.transit_line . \nVALUES ?x2 { :en.bay_area_rapid_transit } \n?x1 :metropolitan_transit.transit_line.vehicle_types ?x0 . \n?x2 :metropolitan_transit.transit_system.transit_lines ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 230000200,
		"question": "the bay area rapid transit uses what type of vehicle?",
		"answer": [
			"Electric locomotive"
		],
		"function": "none",
		"commonness": -25.917564818467802,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "metropolitan_transit.transit_vehicle",
					"class": "metropolitan_transit.transit_vehicle",
					"friendly_name": "Transit Vehicle Type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "metropolitan_transit.transit_line",
					"class": "metropolitan_transit.transit_line",
					"friendly_name": "Transit Line",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.bay_area_rapid_transit",
					"class": "metropolitan_transit.transit_system",
					"friendly_name": "Bay Area Rapid Transit",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "metropolitan_transit.transit_line.vehicle_types",
					"friendly_name": "Vehicle Categories"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "metropolitan_transit.transit_system.transit_lines",
					"friendly_name": "Transit Lines"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :metropolitan_transit.transit_vehicle . \n?x1 :type.object.type :metropolitan_transit.transit_line . \nVALUES ?x2 { :en.bay_area_rapid_transit } \n?x1 :metropolitan_transit.transit_line.vehicle_types ?x0 . \n?x2 :metropolitan_transit.transit_system.transit_lines ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 230000201,
		"question": "the bart uses what type of vehicle?",
		"answer": [
			"Electric locomotive"
		],
		"function": "none",
		"commonness": -25.917564818467802,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "metropolitan_transit.transit_vehicle",
					"class": "metropolitan_transit.transit_vehicle",
					"friendly_name": "Transit Vehicle Type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "metropolitan_transit.transit_line",
					"class": "metropolitan_transit.transit_line",
					"friendly_name": "Transit Line",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.bay_area_rapid_transit",
					"class": "metropolitan_transit.transit_system",
					"friendly_name": "bart",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "metropolitan_transit.transit_line.vehicle_types",
					"friendly_name": "Vehicle Categories"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "metropolitan_transit.transit_system.transit_lines",
					"friendly_name": "Transit Lines"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :metropolitan_transit.transit_vehicle . \n?x1 :type.object.type :metropolitan_transit.transit_line . \nVALUES ?x2 { :en.bay_area_rapid_transit } \n?x1 :metropolitan_transit.transit_line.vehicle_types ?x0 . \n?x2 :metropolitan_transit.transit_system.transit_lines ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 231000000,
		"question": "which pet diseases brought on by infection can be found with electrocardiography?",
		"answer": [
			"Congestive Heart Failure in Dogs"
		],
		"function": "none",
		"commonness": -29.219105976291093,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pethealth.pet_disease_or_medical_condition",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "Pet disease or medical condition",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.infection",
					"class": "base.pethealth.pet_disease_risk_factor",
					"friendly_name": "Infection",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.electrocardiogram",
					"class": "base.pethealth.diagnosis",
					"friendly_name": "Electrocardiography",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor",
					"friendly_name": "Pet Diseases with this Risk Factor"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.pethealth.pet_disease_or_medical_condition.diagnosis",
					"friendly_name": "Diagnostic Tests"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pethealth.pet_disease_or_medical_condition . \nVALUES ?x1 { :en.infection } \nVALUES ?x2 { :en.electrocardiogram } \n?x1 :base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor ?x0 . \n?x0 :base.pethealth.pet_disease_or_medical_condition.diagnosis ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 231000001,
		"question": "which pet diseases brought on by infection can be found with ecg?",
		"answer": [
			"Congestive Heart Failure in Dogs"
		],
		"function": "none",
		"commonness": -29.219105976291093,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pethealth.pet_disease_or_medical_condition",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "Pet disease or medical condition",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.infection",
					"class": "base.pethealth.pet_disease_risk_factor",
					"friendly_name": "Infection",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.electrocardiogram",
					"class": "base.pethealth.diagnosis",
					"friendly_name": "ecg",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor",
					"friendly_name": "Pet Diseases with this Risk Factor"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.pethealth.pet_disease_or_medical_condition.diagnosis",
					"friendly_name": "Diagnostic Tests"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pethealth.pet_disease_or_medical_condition . \nVALUES ?x1 { :en.infection } \nVALUES ?x2 { :en.electrocardiogram } \n?x1 :base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor ?x0 . \n?x0 :base.pethealth.pet_disease_or_medical_condition.diagnosis ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 231000002,
		"question": "which pet diseases brought on by infection can be found with ekg?",
		"answer": [
			"Congestive Heart Failure in Dogs"
		],
		"function": "none",
		"commonness": -29.219105976291093,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pethealth.pet_disease_or_medical_condition",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "Pet disease or medical condition",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.infection",
					"class": "base.pethealth.pet_disease_risk_factor",
					"friendly_name": "Infection",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.electrocardiogram",
					"class": "base.pethealth.diagnosis",
					"friendly_name": "ekg",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor",
					"friendly_name": "Pet Diseases with this Risk Factor"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.pethealth.pet_disease_or_medical_condition.diagnosis",
					"friendly_name": "Diagnostic Tests"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pethealth.pet_disease_or_medical_condition . \nVALUES ?x1 { :en.infection } \nVALUES ?x2 { :en.electrocardiogram } \n?x1 :base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor ?x0 . \n?x0 :base.pethealth.pet_disease_or_medical_condition.diagnosis ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 231000100,
		"question": "which pet diseases, which may be caused by infection, can utilize electrocardiography in their diagnosis?",
		"answer": [
			"Congestive Heart Failure in Dogs"
		],
		"function": "none",
		"commonness": -29.219105976291093,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pethealth.pet_disease_or_medical_condition",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "Pet disease or medical condition",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.infection",
					"class": "base.pethealth.pet_disease_risk_factor",
					"friendly_name": "Infection",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.electrocardiogram",
					"class": "base.pethealth.diagnosis",
					"friendly_name": "Electrocardiography",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor",
					"friendly_name": "Pet Diseases with this Risk Factor"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.pethealth.pet_disease_or_medical_condition.diagnosis",
					"friendly_name": "Diagnostic Tests"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pethealth.pet_disease_or_medical_condition . \nVALUES ?x1 { :en.infection } \nVALUES ?x2 { :en.electrocardiogram } \n?x1 :base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor ?x0 . \n?x0 :base.pethealth.pet_disease_or_medical_condition.diagnosis ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 231000101,
		"question": "which pet diseases, which may be caused by infection, can utilize ecg in their diagnosis?",
		"answer": [
			"Congestive Heart Failure in Dogs"
		],
		"function": "none",
		"commonness": -29.219105976291093,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pethealth.pet_disease_or_medical_condition",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "Pet disease or medical condition",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.infection",
					"class": "base.pethealth.pet_disease_risk_factor",
					"friendly_name": "Infection",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.electrocardiogram",
					"class": "base.pethealth.diagnosis",
					"friendly_name": "ecg",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor",
					"friendly_name": "Pet Diseases with this Risk Factor"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.pethealth.pet_disease_or_medical_condition.diagnosis",
					"friendly_name": "Diagnostic Tests"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pethealth.pet_disease_or_medical_condition . \nVALUES ?x1 { :en.infection } \nVALUES ?x2 { :en.electrocardiogram } \n?x1 :base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor ?x0 . \n?x0 :base.pethealth.pet_disease_or_medical_condition.diagnosis ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 231000102,
		"question": "which pet diseases, which may be caused by infection, can utilize ekg in their diagnosis?",
		"answer": [
			"Congestive Heart Failure in Dogs"
		],
		"function": "none",
		"commonness": -29.219105976291093,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pethealth.pet_disease_or_medical_condition",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "Pet disease or medical condition",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.infection",
					"class": "base.pethealth.pet_disease_risk_factor",
					"friendly_name": "Infection",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.electrocardiogram",
					"class": "base.pethealth.diagnosis",
					"friendly_name": "ekg",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor",
					"friendly_name": "Pet Diseases with this Risk Factor"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.pethealth.pet_disease_or_medical_condition.diagnosis",
					"friendly_name": "Diagnostic Tests"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pethealth.pet_disease_or_medical_condition . \nVALUES ?x1 { :en.infection } \nVALUES ?x2 { :en.electrocardiogram } \n?x1 :base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor ?x0 . \n?x0 :base.pethealth.pet_disease_or_medical_condition.diagnosis ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 231000200,
		"question": "electrocardiography can be utilized to diagnose what pet diseases that may be caused by infection?",
		"answer": [
			"Congestive Heart Failure in Dogs"
		],
		"function": "none",
		"commonness": -29.219105976291093,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pethealth.pet_disease_or_medical_condition",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "Pet disease or medical condition",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.infection",
					"class": "base.pethealth.pet_disease_risk_factor",
					"friendly_name": "Infection",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.electrocardiogram",
					"class": "base.pethealth.diagnosis",
					"friendly_name": "Electrocardiography",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor",
					"friendly_name": "Pet Diseases with this Risk Factor"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.pethealth.pet_disease_or_medical_condition.diagnosis",
					"friendly_name": "Diagnostic Tests"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pethealth.pet_disease_or_medical_condition . \nVALUES ?x1 { :en.infection } \nVALUES ?x2 { :en.electrocardiogram } \n?x1 :base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor ?x0 . \n?x0 :base.pethealth.pet_disease_or_medical_condition.diagnosis ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 231000300,
		"question": "which pet diseases caused by infection can be diagnosed using electrocardiography?",
		"answer": [
			"Congestive Heart Failure in Dogs"
		],
		"function": "none",
		"commonness": -29.219105976291093,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pethealth.pet_disease_or_medical_condition",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "Pet disease or medical condition",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.infection",
					"class": "base.pethealth.pet_disease_risk_factor",
					"friendly_name": "Infection",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.electrocardiogram",
					"class": "base.pethealth.diagnosis",
					"friendly_name": "Electrocardiography",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor",
					"friendly_name": "Pet Diseases with this Risk Factor"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.pethealth.pet_disease_or_medical_condition.diagnosis",
					"friendly_name": "Diagnostic Tests"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pethealth.pet_disease_or_medical_condition . \nVALUES ?x1 { :en.infection } \nVALUES ?x2 { :en.electrocardiogram } \n?x1 :base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor ?x0 . \n?x0 :base.pethealth.pet_disease_or_medical_condition.diagnosis ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 231000301,
		"question": "which pet diseases caused by infection can be diagnosed using ecg?",
		"answer": [
			"Congestive Heart Failure in Dogs"
		],
		"function": "none",
		"commonness": -29.219105976291093,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pethealth.pet_disease_or_medical_condition",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "Pet disease or medical condition",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.infection",
					"class": "base.pethealth.pet_disease_risk_factor",
					"friendly_name": "Infection",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.electrocardiogram",
					"class": "base.pethealth.diagnosis",
					"friendly_name": "ecg",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor",
					"friendly_name": "Pet Diseases with this Risk Factor"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.pethealth.pet_disease_or_medical_condition.diagnosis",
					"friendly_name": "Diagnostic Tests"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pethealth.pet_disease_or_medical_condition . \nVALUES ?x1 { :en.infection } \nVALUES ?x2 { :en.electrocardiogram } \n?x1 :base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor ?x0 . \n?x0 :base.pethealth.pet_disease_or_medical_condition.diagnosis ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 231000400,
		"question": "which pet diseases that result from an infection can be detected through electrocardiography?",
		"answer": [
			"Congestive Heart Failure in Dogs"
		],
		"function": "none",
		"commonness": -29.219105976291093,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pethealth.pet_disease_or_medical_condition",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "Pet disease or medical condition",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.infection",
					"class": "base.pethealth.pet_disease_risk_factor",
					"friendly_name": "Infection",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.electrocardiogram",
					"class": "base.pethealth.diagnosis",
					"friendly_name": "Electrocardiography",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor",
					"friendly_name": "Pet Diseases with this Risk Factor"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.pethealth.pet_disease_or_medical_condition.diagnosis",
					"friendly_name": "Diagnostic Tests"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pethealth.pet_disease_or_medical_condition . \nVALUES ?x1 { :en.infection } \nVALUES ?x2 { :en.electrocardiogram } \n?x1 :base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor ?x0 . \n?x0 :base.pethealth.pet_disease_or_medical_condition.diagnosis ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 231000401,
		"question": "which pet diseases that result from an infection can be detected through ecg?",
		"answer": [
			"Congestive Heart Failure in Dogs"
		],
		"function": "none",
		"commonness": -29.219105976291093,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pethealth.pet_disease_or_medical_condition",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "Pet disease or medical condition",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.infection",
					"class": "base.pethealth.pet_disease_risk_factor",
					"friendly_name": "Infection",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.electrocardiogram",
					"class": "base.pethealth.diagnosis",
					"friendly_name": "ecg",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor",
					"friendly_name": "Pet Diseases with this Risk Factor"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.pethealth.pet_disease_or_medical_condition.diagnosis",
					"friendly_name": "Diagnostic Tests"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pethealth.pet_disease_or_medical_condition . \nVALUES ?x1 { :en.infection } \nVALUES ?x2 { :en.electrocardiogram } \n?x1 :base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor ?x0 . \n?x0 :base.pethealth.pet_disease_or_medical_condition.diagnosis ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	}
]