[
	{
		"qid": 68000400,
		"question": "how are tropical cyclones categorized by the australian bureau of meteorology?",
		"answer": [
			"Category 2 Tropical Cyclone (BOM)",
			"Category 3 Severe Tropical Cyclone (BOM)",
			"Category 5 Severe Tropical Cyclone (BOM)",
			"Category 1 Tropical Cyclone (BOM)",
			"Category 4 Severe Tropical Cyclone (BOM)",
			"Tropical Low (BOM)"
		],
		"function": "none",
		"commonness": -17.939991743423864,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "meteorology.tropical_cyclone_category",
					"class": "meteorology.tropical_cyclone_category",
					"friendly_name": "Tropical cyclone category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.bureau_of_meteorology",
					"class": "meteorology.meteorological_service",
					"friendly_name": "Australian Bureau of Meteorology",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "meteorology.meteorological_service.tropical_cyclone_categories",
					"friendly_name": "Tropical Cyclone Categories"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :meteorology.tropical_cyclone_category . \nVALUES ?x1 { :en.bureau_of_meteorology } \n?x1 :meteorology.meteorological_service.tropical_cyclone_categories ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 68000402,
		"question": "how are tropical cyclones categorized by the bureau of meteorology?",
		"answer": [
			"Category 1 Tropical Cyclone (BOM)",
			"Category 5 Severe Tropical Cyclone (BOM)",
			"Tropical Low (BOM)",
			"Category 4 Severe Tropical Cyclone (BOM)",
			"Category 2 Tropical Cyclone (BOM)",
			"Category 3 Severe Tropical Cyclone (BOM)"
		],
		"function": "none",
		"commonness": -17.939991743423864,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "meteorology.tropical_cyclone_category",
					"class": "meteorology.tropical_cyclone_category",
					"friendly_name": "Tropical cyclone category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.bureau_of_meteorology",
					"class": "meteorology.meteorological_service",
					"friendly_name": "bureau of meteorology",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "meteorology.meteorological_service.tropical_cyclone_categories",
					"friendly_name": "Tropical Cyclone Categories"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :meteorology.tropical_cyclone_category . \nVALUES ?x1 { :en.bureau_of_meteorology } \n?x1 :meteorology.meteorological_service.tropical_cyclone_categories ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 68000500,
		"question": "what are the different categories for tropical cyclones that the australian bureau of meteorology uses?",
		"answer": [
			"Category 5 Severe Tropical Cyclone (BOM)",
			"Category 1 Tropical Cyclone (BOM)",
			"Tropical Low (BOM)",
			"Category 4 Severe Tropical Cyclone (BOM)",
			"Category 2 Tropical Cyclone (BOM)",
			"Category 3 Severe Tropical Cyclone (BOM)"
		],
		"function": "none",
		"commonness": -17.939991743423864,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "meteorology.tropical_cyclone_category",
					"class": "meteorology.tropical_cyclone_category",
					"friendly_name": "Tropical cyclone category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.bureau_of_meteorology",
					"class": "meteorology.meteorological_service",
					"friendly_name": "Australian Bureau of Meteorology",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "meteorology.meteorological_service.tropical_cyclone_categories",
					"friendly_name": "Tropical Cyclone Categories"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :meteorology.tropical_cyclone_category . \nVALUES ?x1 { :en.bureau_of_meteorology } \n?x1 :meteorology.meteorological_service.tropical_cyclone_categories ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 68000501,
		"question": "what are the different categories for tropical cyclones that the bom uses?",
		"answer": [
			"Category 1 Tropical Cyclone (BOM)",
			"Tropical Low (BOM)",
			"Category 3 Severe Tropical Cyclone (BOM)",
			"Category 4 Severe Tropical Cyclone (BOM)",
			"Category 2 Tropical Cyclone (BOM)",
			"Category 5 Severe Tropical Cyclone (BOM)"
		],
		"function": "none",
		"commonness": -17.939991743423864,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "meteorology.tropical_cyclone_category",
					"class": "meteorology.tropical_cyclone_category",
					"friendly_name": "Tropical cyclone category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.bureau_of_meteorology",
					"class": "meteorology.meteorological_service",
					"friendly_name": "bom",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "meteorology.meteorological_service.tropical_cyclone_categories",
					"friendly_name": "Tropical Cyclone Categories"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :meteorology.tropical_cyclone_category . \nVALUES ?x1 { :en.bureau_of_meteorology } \n?x1 :meteorology.meteorological_service.tropical_cyclone_categories ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 68000502,
		"question": "what are the different categories for tropical cyclones that the bureau of meteorology uses?",
		"answer": [
			"Category 2 Tropical Cyclone (BOM)",
			"Category 5 Severe Tropical Cyclone (BOM)",
			"Category 3 Severe Tropical Cyclone (BOM)",
			"Category 4 Severe Tropical Cyclone (BOM)",
			"Category 1 Tropical Cyclone (BOM)",
			"Tropical Low (BOM)"
		],
		"function": "none",
		"commonness": -17.939991743423864,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "meteorology.tropical_cyclone_category",
					"class": "meteorology.tropical_cyclone_category",
					"friendly_name": "Tropical cyclone category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.bureau_of_meteorology",
					"class": "meteorology.meteorological_service",
					"friendly_name": "bureau of meteorology",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "meteorology.meteorological_service.tropical_cyclone_categories",
					"friendly_name": "Tropical Cyclone Categories"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :meteorology.tropical_cyclone_category . \nVALUES ?x1 { :en.bureau_of_meteorology } \n?x1 :meteorology.meteorological_service.tropical_cyclone_categories ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 69000000,
		"question": "the hplhs solstice carol songbook contains what christmas carols?",
		"answer": [
			"Carol of the Old Ones"
		],
		"function": "none",
		"commonness": -21.291252265270323,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.christmas.christmas_carol",
					"class": "base.christmas.christmas_carol",
					"friendly_name": "Christmas carol",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.hplhs_solstice_carol_songbook",
					"class": "music.composition",
					"friendly_name": "HPLHS Solstice Carol Songbook",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "music.composition.part_of",
					"friendly_name": "Part of"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.christmas.christmas_carol . \nVALUES ?x1 { :en.hplhs_solstice_carol_songbook } \n?x0 :music.composition.part_of ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 69000100,
		"question": "what christmas carols are incorporated in the hplhs solstice carol songbook?",
		"answer": [
			"Carol of the Old Ones"
		],
		"function": "none",
		"commonness": -21.291252265270323,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.christmas.christmas_carol",
					"class": "base.christmas.christmas_carol",
					"friendly_name": "Christmas carol",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.hplhs_solstice_carol_songbook",
					"class": "music.composition",
					"friendly_name": "HPLHS Solstice Carol Songbook",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "music.composition.part_of",
					"friendly_name": "Part of"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.christmas.christmas_carol . \nVALUES ?x1 { :en.hplhs_solstice_carol_songbook } \n?x0 :music.composition.part_of ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 69000200,
		"question": "what christmas songs are included in the hplhs solstice carol songbook?",
		"answer": [
			"Carol of the Old Ones"
		],
		"function": "none",
		"commonness": -21.291252265270323,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.christmas.christmas_carol",
					"class": "base.christmas.christmas_carol",
					"friendly_name": "Christmas carol",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.hplhs_solstice_carol_songbook",
					"class": "music.composition",
					"friendly_name": "HPLHS Solstice Carol Songbook",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "music.composition.part_of",
					"friendly_name": "Part of"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.christmas.christmas_carol . \nVALUES ?x1 { :en.hplhs_solstice_carol_songbook } \n?x0 :music.composition.part_of ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 69000300,
		"question": "which christmas carols are a part of the hplhs solstice carol songbook?",
		"answer": [
			"Carol of the Old Ones"
		],
		"function": "none",
		"commonness": -21.291252265270323,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.christmas.christmas_carol",
					"class": "base.christmas.christmas_carol",
					"friendly_name": "Christmas carol",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.hplhs_solstice_carol_songbook",
					"class": "music.composition",
					"friendly_name": "HPLHS Solstice Carol Songbook",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "music.composition.part_of",
					"friendly_name": "Part of"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.christmas.christmas_carol . \nVALUES ?x1 { :en.hplhs_solstice_carol_songbook } \n?x0 :music.composition.part_of ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 70000000,
		"question": "of the four types of tea, which is darjeeling tea?",
		"answer": [
			"Oolong",
			"Black tea"
		],
		"function": "none",
		"commonness": -16.935525465954417,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.tea_type",
					"class": "food.tea_type",
					"friendly_name": "Tea type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.darjeeling_tea",
					"class": "food.tea",
					"friendly_name": "Darjeeling tea",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "food.tea.tea_type",
					"friendly_name": "Type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.tea_type . \nVALUES ?x1 { :en.darjeeling_tea } \n?x1 :food.tea.tea_type ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 70000001,
		"question": "of the four types of tea, which is darjeeling?",
		"answer": [
			"Oolong",
			"Black tea"
		],
		"function": "none",
		"commonness": -16.935525465954417,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.tea_type",
					"class": "food.tea_type",
					"friendly_name": "Tea type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.darjeeling_tea",
					"class": "food.tea",
					"friendly_name": "darjeeling",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "food.tea.tea_type",
					"friendly_name": "Type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.tea_type . \nVALUES ?x1 { :en.darjeeling_tea } \n?x1 :food.tea.tea_type ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 70000100,
		"question": "what the darjeeling tea is classified as?",
		"answer": [
			"Black tea",
			"Oolong"
		],
		"function": "none",
		"commonness": -16.935525465954417,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.tea_type",
					"class": "food.tea_type",
					"friendly_name": "Tea type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.darjeeling_tea",
					"class": "food.tea",
					"friendly_name": "Darjeeling tea",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "food.tea.tea_type",
					"friendly_name": "Type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.tea_type . \nVALUES ?x1 { :en.darjeeling_tea } \n?x1 :food.tea.tea_type ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 70000101,
		"question": "what the darjeeling is classified as?",
		"answer": [
			"Oolong",
			"Black tea"
		],
		"function": "none",
		"commonness": -16.935525465954417,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.tea_type",
					"class": "food.tea_type",
					"friendly_name": "Tea type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.darjeeling_tea",
					"class": "food.tea",
					"friendly_name": "darjeeling",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "food.tea.tea_type",
					"friendly_name": "Type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.tea_type . \nVALUES ?x1 { :en.darjeeling_tea } \n?x1 :food.tea.tea_type ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 70000200,
		"question": "what is the type of the darjeeling tea?",
		"answer": [
			"Oolong",
			"Black tea"
		],
		"function": "none",
		"commonness": -16.935525465954417,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.tea_type",
					"class": "food.tea_type",
					"friendly_name": "Tea type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.darjeeling_tea",
					"class": "food.tea",
					"friendly_name": "Darjeeling tea",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "food.tea.tea_type",
					"friendly_name": "Type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.tea_type . \nVALUES ?x1 { :en.darjeeling_tea } \n?x1 :food.tea.tea_type ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 70000201,
		"question": "what is the type of the darjeeling?",
		"answer": [
			"Black tea",
			"Oolong"
		],
		"function": "none",
		"commonness": -16.935525465954417,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.tea_type",
					"class": "food.tea_type",
					"friendly_name": "Tea type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.darjeeling_tea",
					"class": "food.tea",
					"friendly_name": "darjeeling",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "food.tea.tea_type",
					"friendly_name": "Type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.tea_type . \nVALUES ?x1 { :en.darjeeling_tea } \n?x1 :food.tea.tea_type ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 70000300,
		"question": "darjeeling tea is what type of tea?",
		"answer": [
			"Black tea",
			"Oolong"
		],
		"function": "none",
		"commonness": -16.935525465954417,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.tea_type",
					"class": "food.tea_type",
					"friendly_name": "Tea type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.darjeeling_tea",
					"class": "food.tea",
					"friendly_name": "Darjeeling tea",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "food.tea.tea_type",
					"friendly_name": "Type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.tea_type . \nVALUES ?x1 { :en.darjeeling_tea } \n?x1 :food.tea.tea_type ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 70000301,
		"question": "darjeeling is what type of tea?",
		"answer": [
			"Black tea",
			"Oolong"
		],
		"function": "none",
		"commonness": -16.935525465954417,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.tea_type",
					"class": "food.tea_type",
					"friendly_name": "Tea type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.darjeeling_tea",
					"class": "food.tea",
					"friendly_name": "darjeeling",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "food.tea.tea_type",
					"friendly_name": "Type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.tea_type . \nVALUES ?x1 { :en.darjeeling_tea } \n?x1 :food.tea.tea_type ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 70000400,
		"question": "what kind of tea is the darjeeling tea?",
		"answer": [
			"Black tea",
			"Oolong"
		],
		"function": "none",
		"commonness": -16.935525465954417,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.tea_type",
					"class": "food.tea_type",
					"friendly_name": "Tea type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.darjeeling_tea",
					"class": "food.tea",
					"friendly_name": "Darjeeling tea",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "food.tea.tea_type",
					"friendly_name": "Type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.tea_type . \nVALUES ?x1 { :en.darjeeling_tea } \n?x1 :food.tea.tea_type ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 70000401,
		"question": "what kind of tea is the darjeeling?",
		"answer": [
			"Oolong",
			"Black tea"
		],
		"function": "none",
		"commonness": -16.935525465954417,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.tea_type",
					"class": "food.tea_type",
					"friendly_name": "Tea type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.darjeeling_tea",
					"class": "food.tea",
					"friendly_name": "darjeeling",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "food.tea.tea_type",
					"friendly_name": "Type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.tea_type . \nVALUES ?x1 { :en.darjeeling_tea } \n?x1 :food.tea.tea_type ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 71000000,
		"question": "what entrepreneur was also an olympic torchbearer?",
		"answer": [
			"Will.i.am"
		],
		"function": "none",
		"commonness": -13.63068675256131,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "olympics.olympic_torchbearer",
					"class": "olympics.olympic_torchbearer",
					"friendly_name": "Olympic Torchbearer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.entrepreneur",
					"class": "people.profession",
					"friendly_name": "Entrepreneur",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "people.profession.people_with_this_profession",
					"friendly_name": "People With This Profession"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :olympics.olympic_torchbearer . \nVALUES ?x1 { :en.entrepreneur } \n?x1 :people.profession.people_with_this_profession ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 71000100,
		"question": "which olympic torchbearers were entrepreneurs?",
		"answer": [
			"Will.i.am"
		],
		"function": "none",
		"commonness": -13.63068675256131,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "olympics.olympic_torchbearer",
					"class": "olympics.olympic_torchbearer",
					"friendly_name": "Olympic Torchbearer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.entrepreneur",
					"class": "people.profession",
					"friendly_name": "Entrepreneur",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "people.profession.people_with_this_profession",
					"friendly_name": "People With This Profession"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :olympics.olympic_torchbearer . \nVALUES ?x1 { :en.entrepreneur } \n?x1 :people.profession.people_with_this_profession ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 71000200,
		"question": "which entrepreneurs carried the olympic torch before?",
		"answer": [
			"Will.i.am"
		],
		"function": "none",
		"commonness": -13.63068675256131,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "olympics.olympic_torchbearer",
					"class": "olympics.olympic_torchbearer",
					"friendly_name": "Olympic Torchbearer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.entrepreneur",
					"class": "people.profession",
					"friendly_name": "Entrepreneur",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "people.profession.people_with_this_profession",
					"friendly_name": "People With This Profession"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :olympics.olympic_torchbearer . \nVALUES ?x1 { :en.entrepreneur } \n?x1 :people.profession.people_with_this_profession ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 72000000,
		"question": "who manufactured the saturn v?",
		"answer": [
			"North American Aviation",
			"Boeing",
			"Douglas Aircraft Company"
		],
		"function": "none",
		"commonness": -15.279118137692226,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_manufacturer",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "Rocket Manufacturer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.saturn_v",
					"class": "spaceflight.rocket",
					"friendly_name": "Saturn V",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_manufacturer . \nVALUES ?x1 { :en.saturn_v } \n?x0 :spaceflight.rocket_manufacturer.rockets_manufactured ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 72000001,
		"question": "who manufactured the saturn 5?",
		"answer": [
			"Boeing",
			"North American Aviation",
			"Douglas Aircraft Company"
		],
		"function": "none",
		"commonness": -15.279118137692226,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_manufacturer",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "Rocket Manufacturer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.saturn_v",
					"class": "spaceflight.rocket",
					"friendly_name": "saturn 5",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_manufacturer . \nVALUES ?x1 { :en.saturn_v } \n?x0 :spaceflight.rocket_manufacturer.rockets_manufactured ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]