[
	{
		"qid": 247000200,
		"question": "who is the tallest athlete that can speak the same language as the carol entitled silent night?",
		"answer": [
			"Dwight Howard"
		],
		"function": "argmax",
		"commonness": -30.49627091141824,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.pro_athlete",
					"class": "sports.pro_athlete",
					"friendly_name": "Athlete",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "language.human_language",
					"class": "language.human_language",
					"friendly_name": "Human Language",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "0",
					"class": "type.float",
					"friendly_name": "0",
					"question_node": 0,
					"function": "argmax"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.silent_night",
					"class": "base.christmas.christmas_carol",
					"friendly_name": "Silent Night",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.languages",
					"friendly_name": "Languages"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "people.person.height_meters",
					"friendly_name": "Height"
				},
				{
					"start": 3,
					"end": 1,
					"relation": "base.christmas.christmas_carol.language",
					"friendly_name": "Language"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.pro_athlete . \n?x1 :type.object.type :language.human_language . \n{\nSELECT (MAX(?y2) AS ?x2)  WHERE { \n?y0 :type.object.type :sports.pro_athlete . \n?y1 :type.object.type :language.human_language . \nVALUES ?y3 { :en.silent_night } \n?y0 :people.person.languages ?y1 . \n?y0 :people.person.height_meters ?y2 . \n?y3 :base.christmas.christmas_carol.language ?y1 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y0 != ?y3 && ?y1 != ?y2 && ?y1 != ?y3 && ?y2 != ?y3  )\n}\n}\nVALUES ?x3 { :en.silent_night } \n?x0 :people.person.languages ?x1 . \n?x0 :people.person.height_meters ?x2 . \n?x3 :base.christmas.christmas_carol.language ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 247000201,
		"question": "who is the tallest athlete that can speak the same language as the carol entitled silent night, holy night?",
		"answer": [
			"Dwight Howard"
		],
		"function": "argmax",
		"commonness": -30.49627091141824,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.pro_athlete",
					"class": "sports.pro_athlete",
					"friendly_name": "Athlete",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "language.human_language",
					"class": "language.human_language",
					"friendly_name": "Human Language",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "0",
					"class": "type.float",
					"friendly_name": "0",
					"question_node": 0,
					"function": "argmax"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.silent_night",
					"class": "base.christmas.christmas_carol",
					"friendly_name": "silent night, holy night",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.languages",
					"friendly_name": "Languages"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "people.person.height_meters",
					"friendly_name": "Height"
				},
				{
					"start": 3,
					"end": 1,
					"relation": "base.christmas.christmas_carol.language",
					"friendly_name": "Language"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.pro_athlete . \n?x1 :type.object.type :language.human_language . \n{\nSELECT (MAX(?y2) AS ?x2)  WHERE { \n?y0 :type.object.type :sports.pro_athlete . \n?y1 :type.object.type :language.human_language . \nVALUES ?y3 { :en.silent_night } \n?y0 :people.person.languages ?y1 . \n?y0 :people.person.height_meters ?y2 . \n?y3 :base.christmas.christmas_carol.language ?y1 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y0 != ?y3 && ?y1 != ?y2 && ?y1 != ?y3 && ?y2 != ?y3  )\n}\n}\nVALUES ?x3 { :en.silent_night } \n?x0 :people.person.languages ?x1 . \n?x0 :people.person.height_meters ?x2 . \n?x3 :base.christmas.christmas_carol.language ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 247000300,
		"question": "which is the tallest athlete who has fluency in the silent night carol's language?",
		"answer": [
			"Dwight Howard"
		],
		"function": "argmax",
		"commonness": -30.49627091141824,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.pro_athlete",
					"class": "sports.pro_athlete",
					"friendly_name": "Athlete",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "language.human_language",
					"class": "language.human_language",
					"friendly_name": "Human Language",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "0",
					"class": "type.float",
					"friendly_name": "0",
					"question_node": 0,
					"function": "argmax"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.silent_night",
					"class": "base.christmas.christmas_carol",
					"friendly_name": "Silent Night",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.languages",
					"friendly_name": "Languages"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "people.person.height_meters",
					"friendly_name": "Height"
				},
				{
					"start": 3,
					"end": 1,
					"relation": "base.christmas.christmas_carol.language",
					"friendly_name": "Language"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.pro_athlete . \n?x1 :type.object.type :language.human_language . \n{\nSELECT (MAX(?y2) AS ?x2)  WHERE { \n?y0 :type.object.type :sports.pro_athlete . \n?y1 :type.object.type :language.human_language . \nVALUES ?y3 { :en.silent_night } \n?y0 :people.person.languages ?y1 . \n?y0 :people.person.height_meters ?y2 . \n?y3 :base.christmas.christmas_carol.language ?y1 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y0 != ?y3 && ?y1 != ?y2 && ?y1 != ?y3 && ?y2 != ?y3  )\n}\n}\nVALUES ?x3 { :en.silent_night } \n?x0 :people.person.languages ?x1 . \n?x0 :people.person.height_meters ?x2 . \n?x3 :base.christmas.christmas_carol.language ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 247000301,
		"question": "which is the tallest athlete who has fluency in the silent night, holy night carol's language?",
		"answer": [
			"Dwight Howard"
		],
		"function": "argmax",
		"commonness": -30.49627091141824,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.pro_athlete",
					"class": "sports.pro_athlete",
					"friendly_name": "Athlete",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "language.human_language",
					"class": "language.human_language",
					"friendly_name": "Human Language",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "0",
					"class": "type.float",
					"friendly_name": "0",
					"question_node": 0,
					"function": "argmax"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.silent_night",
					"class": "base.christmas.christmas_carol",
					"friendly_name": "silent night, holy night",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.languages",
					"friendly_name": "Languages"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "people.person.height_meters",
					"friendly_name": "Height"
				},
				{
					"start": 3,
					"end": 1,
					"relation": "base.christmas.christmas_carol.language",
					"friendly_name": "Language"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.pro_athlete . \n?x1 :type.object.type :language.human_language . \n{\nSELECT (MAX(?y2) AS ?x2)  WHERE { \n?y0 :type.object.type :sports.pro_athlete . \n?y1 :type.object.type :language.human_language . \nVALUES ?y3 { :en.silent_night } \n?y0 :people.person.languages ?y1 . \n?y0 :people.person.height_meters ?y2 . \n?y3 :base.christmas.christmas_carol.language ?y1 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y0 != ?y3 && ?y1 != ?y2 && ?y1 != ?y3 && ?y2 != ?y3  )\n}\n}\nVALUES ?x3 { :en.silent_night } \n?x0 :people.person.languages ?x1 . \n?x0 :people.person.height_meters ?x2 . \n?x3 :base.christmas.christmas_carol.language ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 248000000,
		"question": "which baseball player has the highest number of grand slams along with a record number of hits 1240?",
		"answer": [
			"Carlos Guillén"
		],
		"function": "argmax",
		"commonness": -33.69580588607683,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "baseball.baseball_player",
					"class": "baseball.baseball_player",
					"friendly_name": "Baseball Player",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "baseball.lifetime_batting_statistics",
					"class": "baseball.lifetime_batting_statistics",
					"friendly_name": "Lifetime Batting Statistics",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "1240^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "1240",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "literal",
					"id": "0",
					"class": "type.int",
					"friendly_name": "0",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "baseball.baseball_player.lifetime_batting_statistics",
					"friendly_name": "Lifetime Batting Statistics"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "baseball.lifetime_batting_statistics.hits",
					"friendly_name": "Hits"
				},
				{
					"start": 1,
					"end": 3,
					"relation": "baseball.lifetime_batting_statistics.grand_slams",
					"friendly_name": "Grand Slams"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :baseball.baseball_player . \n?x1 :type.object.type :baseball.lifetime_batting_statistics . \nVALUES ?x2 { \"1240\"^^<http://www.w3.org/2001/XMLSchema#int> \"1240\"^^<http://www.w3.org/2001/XMLSchema#integer> \"1240\"^^<http://www.w3.org/2001/XMLSchema#double> } \n{\nSELECT (MAX(?y3) AS ?x3)  WHERE { \n?y0 :type.object.type :baseball.baseball_player . \n?y1 :type.object.type :baseball.lifetime_batting_statistics . \nVALUES ?y2 { \"1240\"^^<http://www.w3.org/2001/XMLSchema#int> \"1240\"^^<http://www.w3.org/2001/XMLSchema#integer> \"1240\"^^<http://www.w3.org/2001/XMLSchema#double> } \n?y0 :baseball.baseball_player.lifetime_batting_statistics ?y1 . \n?y1 :baseball.lifetime_batting_statistics.hits ?y2 . \n?y1 :baseball.lifetime_batting_statistics.grand_slams ?y3 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y0 != ?y3 && ?y1 != ?y2 && ?y1 != ?y3 && ?y2 != ?y3  )\n}\n}\n?x0 :baseball.baseball_player.lifetime_batting_statistics ?x1 . \n?x1 :baseball.lifetime_batting_statistics.hits ?x2 . \n?x1 :baseball.lifetime_batting_statistics.grand_slams ?x3 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 248000100,
		"question": "who has the most grand slams among baseball players whose lifetime hits is 1240?",
		"answer": [
			"Carlos Guillén"
		],
		"function": "argmax",
		"commonness": -33.69580588607683,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "baseball.baseball_player",
					"class": "baseball.baseball_player",
					"friendly_name": "Baseball Player",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "baseball.lifetime_batting_statistics",
					"class": "baseball.lifetime_batting_statistics",
					"friendly_name": "Lifetime Batting Statistics",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "1240^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "1240",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "literal",
					"id": "0",
					"class": "type.int",
					"friendly_name": "0",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "baseball.baseball_player.lifetime_batting_statistics",
					"friendly_name": "Lifetime Batting Statistics"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "baseball.lifetime_batting_statistics.hits",
					"friendly_name": "Hits"
				},
				{
					"start": 1,
					"end": 3,
					"relation": "baseball.lifetime_batting_statistics.grand_slams",
					"friendly_name": "Grand Slams"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :baseball.baseball_player . \n?x1 :type.object.type :baseball.lifetime_batting_statistics . \nVALUES ?x2 { \"1240\"^^<http://www.w3.org/2001/XMLSchema#int> \"1240\"^^<http://www.w3.org/2001/XMLSchema#integer> \"1240\"^^<http://www.w3.org/2001/XMLSchema#double> } \n{\nSELECT (MAX(?y3) AS ?x3)  WHERE { \n?y0 :type.object.type :baseball.baseball_player . \n?y1 :type.object.type :baseball.lifetime_batting_statistics . \nVALUES ?y2 { \"1240\"^^<http://www.w3.org/2001/XMLSchema#int> \"1240\"^^<http://www.w3.org/2001/XMLSchema#integer> \"1240\"^^<http://www.w3.org/2001/XMLSchema#double> } \n?y0 :baseball.baseball_player.lifetime_batting_statistics ?y1 . \n?y1 :baseball.lifetime_batting_statistics.hits ?y2 . \n?y1 :baseball.lifetime_batting_statistics.grand_slams ?y3 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y0 != ?y3 && ?y1 != ?y2 && ?y1 != ?y3 && ?y2 != ?y3  )\n}\n}\n?x0 :baseball.baseball_player.lifetime_batting_statistics ?x1 . \n?x1 :baseball.lifetime_batting_statistics.hits ?x2 . \n?x1 :baseball.lifetime_batting_statistics.grand_slams ?x3 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 248000200,
		"question": "among the baseball players whose lifetime number of hits is 1240, who has the most grand slams?",
		"answer": [
			"Carlos Guillén"
		],
		"function": "argmax",
		"commonness": -33.69580588607683,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "baseball.baseball_player",
					"class": "baseball.baseball_player",
					"friendly_name": "Baseball Player",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "baseball.lifetime_batting_statistics",
					"class": "baseball.lifetime_batting_statistics",
					"friendly_name": "Lifetime Batting Statistics",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "1240^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "1240",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "literal",
					"id": "0",
					"class": "type.int",
					"friendly_name": "0",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "baseball.baseball_player.lifetime_batting_statistics",
					"friendly_name": "Lifetime Batting Statistics"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "baseball.lifetime_batting_statistics.hits",
					"friendly_name": "Hits"
				},
				{
					"start": 1,
					"end": 3,
					"relation": "baseball.lifetime_batting_statistics.grand_slams",
					"friendly_name": "Grand Slams"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :baseball.baseball_player . \n?x1 :type.object.type :baseball.lifetime_batting_statistics . \nVALUES ?x2 { \"1240\"^^<http://www.w3.org/2001/XMLSchema#int> \"1240\"^^<http://www.w3.org/2001/XMLSchema#integer> \"1240\"^^<http://www.w3.org/2001/XMLSchema#double> } \n{\nSELECT (MAX(?y3) AS ?x3)  WHERE { \n?y0 :type.object.type :baseball.baseball_player . \n?y1 :type.object.type :baseball.lifetime_batting_statistics . \nVALUES ?y2 { \"1240\"^^<http://www.w3.org/2001/XMLSchema#int> \"1240\"^^<http://www.w3.org/2001/XMLSchema#integer> \"1240\"^^<http://www.w3.org/2001/XMLSchema#double> } \n?y0 :baseball.baseball_player.lifetime_batting_statistics ?y1 . \n?y1 :baseball.lifetime_batting_statistics.hits ?y2 . \n?y1 :baseball.lifetime_batting_statistics.grand_slams ?y3 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y0 != ?y3 && ?y1 != ?y2 && ?y1 != ?y3 && ?y2 != ?y3  )\n}\n}\n?x0 :baseball.baseball_player.lifetime_batting_statistics ?x1 . \n?x1 :baseball.lifetime_batting_statistics.hits ?x2 . \n?x1 :baseball.lifetime_batting_statistics.grand_slams ?x3 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 248000300,
		"question": "for players with 1240 hits who has the most grand slams?",
		"answer": [
			"Carlos Guillén"
		],
		"function": "argmax",
		"commonness": -33.69580588607683,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "baseball.baseball_player",
					"class": "baseball.baseball_player",
					"friendly_name": "Baseball Player",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "baseball.lifetime_batting_statistics",
					"class": "baseball.lifetime_batting_statistics",
					"friendly_name": "Lifetime Batting Statistics",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "1240^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "1240",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "literal",
					"id": "0",
					"class": "type.int",
					"friendly_name": "0",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "baseball.baseball_player.lifetime_batting_statistics",
					"friendly_name": "Lifetime Batting Statistics"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "baseball.lifetime_batting_statistics.hits",
					"friendly_name": "Hits"
				},
				{
					"start": 1,
					"end": 3,
					"relation": "baseball.lifetime_batting_statistics.grand_slams",
					"friendly_name": "Grand Slams"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :baseball.baseball_player . \n?x1 :type.object.type :baseball.lifetime_batting_statistics . \nVALUES ?x2 { \"1240\"^^<http://www.w3.org/2001/XMLSchema#int> \"1240\"^^<http://www.w3.org/2001/XMLSchema#integer> \"1240\"^^<http://www.w3.org/2001/XMLSchema#double> } \n{\nSELECT (MAX(?y3) AS ?x3)  WHERE { \n?y0 :type.object.type :baseball.baseball_player . \n?y1 :type.object.type :baseball.lifetime_batting_statistics . \nVALUES ?y2 { \"1240\"^^<http://www.w3.org/2001/XMLSchema#int> \"1240\"^^<http://www.w3.org/2001/XMLSchema#integer> \"1240\"^^<http://www.w3.org/2001/XMLSchema#double> } \n?y0 :baseball.baseball_player.lifetime_batting_statistics ?y1 . \n?y1 :baseball.lifetime_batting_statistics.hits ?y2 . \n?y1 :baseball.lifetime_batting_statistics.grand_slams ?y3 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y0 != ?y3 && ?y1 != ?y2 && ?y1 != ?y3 && ?y2 != ?y3  )\n}\n}\n?x0 :baseball.baseball_player.lifetime_batting_statistics ?x1 . \n?x1 :baseball.lifetime_batting_statistics.hits ?x2 . \n?x1 :baseball.lifetime_batting_statistics.grand_slams ?x3 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 248000400,
		"question": "out of the baseball players whose lifetime number of hits is 1240, which has the most grand slams?",
		"answer": [
			"Carlos Guillén"
		],
		"function": "argmax",
		"commonness": -33.69580588607683,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "baseball.baseball_player",
					"class": "baseball.baseball_player",
					"friendly_name": "Baseball Player",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "baseball.lifetime_batting_statistics",
					"class": "baseball.lifetime_batting_statistics",
					"friendly_name": "Lifetime Batting Statistics",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "1240^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "1240",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "literal",
					"id": "0",
					"class": "type.int",
					"friendly_name": "0",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "baseball.baseball_player.lifetime_batting_statistics",
					"friendly_name": "Lifetime Batting Statistics"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "baseball.lifetime_batting_statistics.hits",
					"friendly_name": "Hits"
				},
				{
					"start": 1,
					"end": 3,
					"relation": "baseball.lifetime_batting_statistics.grand_slams",
					"friendly_name": "Grand Slams"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :baseball.baseball_player . \n?x1 :type.object.type :baseball.lifetime_batting_statistics . \nVALUES ?x2 { \"1240\"^^<http://www.w3.org/2001/XMLSchema#int> \"1240\"^^<http://www.w3.org/2001/XMLSchema#integer> \"1240\"^^<http://www.w3.org/2001/XMLSchema#double> } \n{\nSELECT (MAX(?y3) AS ?x3)  WHERE { \n?y0 :type.object.type :baseball.baseball_player . \n?y1 :type.object.type :baseball.lifetime_batting_statistics . \nVALUES ?y2 { \"1240\"^^<http://www.w3.org/2001/XMLSchema#int> \"1240\"^^<http://www.w3.org/2001/XMLSchema#integer> \"1240\"^^<http://www.w3.org/2001/XMLSchema#double> } \n?y0 :baseball.baseball_player.lifetime_batting_statistics ?y1 . \n?y1 :baseball.lifetime_batting_statistics.hits ?y2 . \n?y1 :baseball.lifetime_batting_statistics.grand_slams ?y3 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y0 != ?y3 && ?y1 != ?y2 && ?y1 != ?y3 && ?y2 != ?y3  )\n}\n}\n?x0 :baseball.baseball_player.lifetime_batting_statistics ?x1 . \n?x1 :baseball.lifetime_batting_statistics.hits ?x2 . \n?x1 :baseball.lifetime_batting_statistics.grand_slams ?x3 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 249000000,
		"question": "which of jack nicklaus's 2003 golf courses has the highest number of par?",
		"answer": [
			"Bull Golf Course",
			"The Sagamore Golf Course",
			"Longview Golf Course"
		],
		"function": "argmax",
		"commonness": -36.10002195245568,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.golf_course",
					"class": "sports.golf_course",
					"friendly_name": "Golf Course",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.jack_nicklaus",
					"class": "sports.golf_course_designer",
					"friendly_name": "Jack Nicklaus",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "2003^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "2003",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "literal",
					"id": "0",
					"class": "type.int",
					"friendly_name": "0",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "sports.golf_course_designer.golf_courses",
					"friendly_name": "Golf Courses Designed"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "sports.golf_course.year_built",
					"friendly_name": "Year Built"
				},
				{
					"start": 0,
					"end": 3,
					"relation": "sports.golf_course.par",
					"friendly_name": "Par"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.golf_course . \nVALUES ?x1 { :en.jack_nicklaus } \nVALUES ?x2 { \"2003\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n{\nSELECT (MAX(?y3) AS ?x3)  WHERE { \n?y0 :type.object.type :sports.golf_course . \nVALUES ?y1 { :en.jack_nicklaus } \nVALUES ?y2 { \"2003\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?y1 :sports.golf_course_designer.golf_courses ?y0 . \n?y0 :sports.golf_course.year_built ?y2 . \n?y0 :sports.golf_course.par ?y3 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y0 != ?y3 && ?y1 != ?y2 && ?y1 != ?y3 && ?y2 != ?y3  )\n}\n}\n?x1 :sports.golf_course_designer.golf_courses ?x0 . \n?x0 :sports.golf_course.year_built ?x2 . \n?x0 :sports.golf_course.par ?x3 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 249000001,
		"question": "which of nicklaus's 2003 golf courses has the highest number of par?",
		"answer": [
			"Bull Golf Course",
			"The Sagamore Golf Course",
			"Longview Golf Course"
		],
		"function": "argmax",
		"commonness": -36.10002195245568,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.golf_course",
					"class": "sports.golf_course",
					"friendly_name": "Golf Course",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.jack_nicklaus",
					"class": "sports.golf_course_designer",
					"friendly_name": "nicklaus",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "2003^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "2003",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "literal",
					"id": "0",
					"class": "type.int",
					"friendly_name": "0",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "sports.golf_course_designer.golf_courses",
					"friendly_name": "Golf Courses Designed"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "sports.golf_course.year_built",
					"friendly_name": "Year Built"
				},
				{
					"start": 0,
					"end": 3,
					"relation": "sports.golf_course.par",
					"friendly_name": "Par"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.golf_course . \nVALUES ?x1 { :en.jack_nicklaus } \nVALUES ?x2 { \"2003\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n{\nSELECT (MAX(?y3) AS ?x3)  WHERE { \n?y0 :type.object.type :sports.golf_course . \nVALUES ?y1 { :en.jack_nicklaus } \nVALUES ?y2 { \"2003\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?y1 :sports.golf_course_designer.golf_courses ?y0 . \n?y0 :sports.golf_course.year_built ?y2 . \n?y0 :sports.golf_course.par ?y3 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y0 != ?y3 && ?y1 != ?y2 && ?y1 != ?y3 && ?y2 != ?y3  )\n}\n}\n?x1 :sports.golf_course_designer.golf_courses ?x0 . \n?x0 :sports.golf_course.year_built ?x2 . \n?x0 :sports.golf_course.par ?x3 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	}
]