[
	{
		"qid": 219000600,
		"question": "what's the birth place of the dam of the racehorse secretariat?",
		"answer": [
			"United States of America"
		],
		"function": "none",
		"commonness": -23.988373848532063,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.thoroughbredracing.thoroughbred_racehorse_origin",
					"class": "base.thoroughbredracing.thoroughbred_racehorse_origin",
					"friendly_name": "Thoroughbred racehorse origin",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.thoroughbredracing.thoroughbred_racehorse",
					"class": "base.thoroughbredracing.thoroughbred_racehorse",
					"friendly_name": "Thoroughbred racehorse",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.secretariat",
					"class": "base.thoroughbredracing.thoroughbred_racehorse",
					"friendly_name": "Secretariat",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.thoroughbredracing.thoroughbred_racehorse_origin.horses_from_this_location",
					"friendly_name": "Horses from this location"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.thoroughbredracing.thoroughbred_racehorse.foal_if_this_horse_is_dam",
					"friendly_name": "Foal (if this horse is Dam)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.thoroughbredracing.thoroughbred_racehorse_origin . \n?x1 :type.object.type :base.thoroughbredracing.thoroughbred_racehorse . \nVALUES ?x2 { :en.secretariat } \n?x0 :base.thoroughbredracing.thoroughbred_racehorse_origin.horses_from_this_location ?x1 . \n?x1 :base.thoroughbredracing.thoroughbred_racehorse.foal_if_this_horse_is_dam ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 220000000,
		"question": "which titles within boxing has muhammad ali held during his career?",
		"answer": [
			"WBA World Champion"
		],
		"function": "none",
		"commonness": -34.99607422545811,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "boxing.boxing_title",
					"class": "boxing.boxing_title",
					"friendly_name": "Boxing title",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "boxing.boxing_title_tenure",
					"class": "boxing.boxing_title_tenure",
					"friendly_name": "Boxing title tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.muhammad_ali",
					"class": "sports.boxer",
					"friendly_name": "Muhammad Ali",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "boxing.boxing_title.champions",
					"friendly_name": "Champions"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "sports.boxer.titles",
					"friendly_name": "Titles"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :boxing.boxing_title . \n?x1 :type.object.type :boxing.boxing_title_tenure . \nVALUES ?x2 { :en.muhammad_ali } \n?x0 :boxing.boxing_title.champions ?x1 . \n?x2 :sports.boxer.titles ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 220000001,
		"question": "which titles within boxing has ali held during his career?",
		"answer": [
			"WBA World Champion"
		],
		"function": "none",
		"commonness": -34.99607422545811,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "boxing.boxing_title",
					"class": "boxing.boxing_title",
					"friendly_name": "Boxing title",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "boxing.boxing_title_tenure",
					"class": "boxing.boxing_title_tenure",
					"friendly_name": "Boxing title tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.muhammad_ali",
					"class": "sports.boxer",
					"friendly_name": "ali",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "boxing.boxing_title.champions",
					"friendly_name": "Champions"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "sports.boxer.titles",
					"friendly_name": "Titles"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :boxing.boxing_title . \n?x1 :type.object.type :boxing.boxing_title_tenure . \nVALUES ?x2 { :en.muhammad_ali } \n?x0 :boxing.boxing_title.champions ?x1 . \n?x2 :sports.boxer.titles ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 220000002,
		"question": "which titles within boxing has muhammed ali held during his career?",
		"answer": [
			"WBA World Champion"
		],
		"function": "none",
		"commonness": -34.99607422545811,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "boxing.boxing_title",
					"class": "boxing.boxing_title",
					"friendly_name": "Boxing title",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "boxing.boxing_title_tenure",
					"class": "boxing.boxing_title_tenure",
					"friendly_name": "Boxing title tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.muhammad_ali",
					"class": "sports.boxer",
					"friendly_name": "muhammed ali",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "boxing.boxing_title.champions",
					"friendly_name": "Champions"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "sports.boxer.titles",
					"friendly_name": "Titles"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :boxing.boxing_title . \n?x1 :type.object.type :boxing.boxing_title_tenure . \nVALUES ?x2 { :en.muhammad_ali } \n?x0 :boxing.boxing_title.champions ?x1 . \n?x2 :sports.boxer.titles ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 220000100,
		"question": "muhammad ali has held which boxing titles?",
		"answer": [
			"WBA World Champion"
		],
		"function": "none",
		"commonness": -34.99607422545811,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "boxing.boxing_title",
					"class": "boxing.boxing_title",
					"friendly_name": "Boxing title",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "boxing.boxing_title_tenure",
					"class": "boxing.boxing_title_tenure",
					"friendly_name": "Boxing title tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.muhammad_ali",
					"class": "sports.boxer",
					"friendly_name": "Muhammad Ali",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "boxing.boxing_title.champions",
					"friendly_name": "Champions"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "sports.boxer.titles",
					"friendly_name": "Titles"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :boxing.boxing_title . \n?x1 :type.object.type :boxing.boxing_title_tenure . \nVALUES ?x2 { :en.muhammad_ali } \n?x0 :boxing.boxing_title.champions ?x1 . \n?x2 :sports.boxer.titles ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 220000101,
		"question": "ali has held which boxing titles?",
		"answer": [
			"WBA World Champion"
		],
		"function": "none",
		"commonness": -34.99607422545811,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "boxing.boxing_title",
					"class": "boxing.boxing_title",
					"friendly_name": "Boxing title",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "boxing.boxing_title_tenure",
					"class": "boxing.boxing_title_tenure",
					"friendly_name": "Boxing title tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.muhammad_ali",
					"class": "sports.boxer",
					"friendly_name": "ali",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "boxing.boxing_title.champions",
					"friendly_name": "Champions"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "sports.boxer.titles",
					"friendly_name": "Titles"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :boxing.boxing_title . \n?x1 :type.object.type :boxing.boxing_title_tenure . \nVALUES ?x2 { :en.muhammad_ali } \n?x0 :boxing.boxing_title.champions ?x1 . \n?x2 :sports.boxer.titles ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 220000102,
		"question": "muhammed ali has held which boxing titles?",
		"answer": [
			"WBA World Champion"
		],
		"function": "none",
		"commonness": -34.99607422545811,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "boxing.boxing_title",
					"class": "boxing.boxing_title",
					"friendly_name": "Boxing title",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "boxing.boxing_title_tenure",
					"class": "boxing.boxing_title_tenure",
					"friendly_name": "Boxing title tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.muhammad_ali",
					"class": "sports.boxer",
					"friendly_name": "muhammed ali",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "boxing.boxing_title.champions",
					"friendly_name": "Champions"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "sports.boxer.titles",
					"friendly_name": "Titles"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :boxing.boxing_title . \n?x1 :type.object.type :boxing.boxing_title_tenure . \nVALUES ?x2 { :en.muhammad_ali } \n?x0 :boxing.boxing_title.champions ?x1 . \n?x2 :sports.boxer.titles ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 220000200,
		"question": "what boxing titles has muhammad ali had in the past?",
		"answer": [
			"WBA World Champion"
		],
		"function": "none",
		"commonness": -34.99607422545811,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "boxing.boxing_title",
					"class": "boxing.boxing_title",
					"friendly_name": "Boxing title",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "boxing.boxing_title_tenure",
					"class": "boxing.boxing_title_tenure",
					"friendly_name": "Boxing title tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.muhammad_ali",
					"class": "sports.boxer",
					"friendly_name": "Muhammad Ali",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "boxing.boxing_title.champions",
					"friendly_name": "Champions"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "sports.boxer.titles",
					"friendly_name": "Titles"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :boxing.boxing_title . \n?x1 :type.object.type :boxing.boxing_title_tenure . \nVALUES ?x2 { :en.muhammad_ali } \n?x0 :boxing.boxing_title.champions ?x1 . \n?x2 :sports.boxer.titles ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 220000201,
		"question": "what boxing titles has ali had in the past?",
		"answer": [
			"WBA World Champion"
		],
		"function": "none",
		"commonness": -34.99607422545811,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "boxing.boxing_title",
					"class": "boxing.boxing_title",
					"friendly_name": "Boxing title",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "boxing.boxing_title_tenure",
					"class": "boxing.boxing_title_tenure",
					"friendly_name": "Boxing title tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.muhammad_ali",
					"class": "sports.boxer",
					"friendly_name": "ali",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "boxing.boxing_title.champions",
					"friendly_name": "Champions"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "sports.boxer.titles",
					"friendly_name": "Titles"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :boxing.boxing_title . \n?x1 :type.object.type :boxing.boxing_title_tenure . \nVALUES ?x2 { :en.muhammad_ali } \n?x0 :boxing.boxing_title.champions ?x1 . \n?x2 :sports.boxer.titles ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 220000202,
		"question": "what boxing titles has muhammed ali had in the past?",
		"answer": [
			"WBA World Champion"
		],
		"function": "none",
		"commonness": -34.99607422545811,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "boxing.boxing_title",
					"class": "boxing.boxing_title",
					"friendly_name": "Boxing title",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "boxing.boxing_title_tenure",
					"class": "boxing.boxing_title_tenure",
					"friendly_name": "Boxing title tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.muhammad_ali",
					"class": "sports.boxer",
					"friendly_name": "muhammed ali",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "boxing.boxing_title.champions",
					"friendly_name": "Champions"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "sports.boxer.titles",
					"friendly_name": "Titles"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :boxing.boxing_title . \n?x1 :type.object.type :boxing.boxing_title_tenure . \nVALUES ?x2 { :en.muhammad_ali } \n?x0 :boxing.boxing_title.champions ?x1 . \n?x2 :sports.boxer.titles ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 220000300,
		"question": "what boxing titles has muhammad ali held?",
		"answer": [
			"WBA World Champion"
		],
		"function": "none",
		"commonness": -34.99607422545811,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "boxing.boxing_title",
					"class": "boxing.boxing_title",
					"friendly_name": "Boxing title",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "boxing.boxing_title_tenure",
					"class": "boxing.boxing_title_tenure",
					"friendly_name": "Boxing title tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.muhammad_ali",
					"class": "sports.boxer",
					"friendly_name": "Muhammad Ali",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "boxing.boxing_title.champions",
					"friendly_name": "Champions"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "sports.boxer.titles",
					"friendly_name": "Titles"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :boxing.boxing_title . \n?x1 :type.object.type :boxing.boxing_title_tenure . \nVALUES ?x2 { :en.muhammad_ali } \n?x0 :boxing.boxing_title.champions ?x1 . \n?x2 :sports.boxer.titles ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 220000301,
		"question": "what boxing titles has ali held?",
		"answer": [
			"WBA World Champion"
		],
		"function": "none",
		"commonness": -34.99607422545811,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "boxing.boxing_title",
					"class": "boxing.boxing_title",
					"friendly_name": "Boxing title",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "boxing.boxing_title_tenure",
					"class": "boxing.boxing_title_tenure",
					"friendly_name": "Boxing title tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.muhammad_ali",
					"class": "sports.boxer",
					"friendly_name": "ali",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "boxing.boxing_title.champions",
					"friendly_name": "Champions"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "sports.boxer.titles",
					"friendly_name": "Titles"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :boxing.boxing_title . \n?x1 :type.object.type :boxing.boxing_title_tenure . \nVALUES ?x2 { :en.muhammad_ali } \n?x0 :boxing.boxing_title.champions ?x1 . \n?x2 :sports.boxer.titles ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 220000302,
		"question": "what boxing titles has muhammed ali held?",
		"answer": [
			"WBA World Champion"
		],
		"function": "none",
		"commonness": -34.99607422545811,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "boxing.boxing_title",
					"class": "boxing.boxing_title",
					"friendly_name": "Boxing title",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "boxing.boxing_title_tenure",
					"class": "boxing.boxing_title_tenure",
					"friendly_name": "Boxing title tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.muhammad_ali",
					"class": "sports.boxer",
					"friendly_name": "muhammed ali",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "boxing.boxing_title.champions",
					"friendly_name": "Champions"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "sports.boxer.titles",
					"friendly_name": "Titles"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :boxing.boxing_title . \n?x1 :type.object.type :boxing.boxing_title_tenure . \nVALUES ?x2 { :en.muhammad_ali } \n?x0 :boxing.boxing_title.champions ?x1 . \n?x2 :sports.boxer.titles ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 220000400,
		"question": "what are the boxing titles that muhammad ali had?",
		"answer": [
			"WBA World Champion"
		],
		"function": "none",
		"commonness": -34.99607422545811,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "boxing.boxing_title",
					"class": "boxing.boxing_title",
					"friendly_name": "Boxing title",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "boxing.boxing_title_tenure",
					"class": "boxing.boxing_title_tenure",
					"friendly_name": "Boxing title tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.muhammad_ali",
					"class": "sports.boxer",
					"friendly_name": "Muhammad Ali",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "boxing.boxing_title.champions",
					"friendly_name": "Champions"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "sports.boxer.titles",
					"friendly_name": "Titles"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :boxing.boxing_title . \n?x1 :type.object.type :boxing.boxing_title_tenure . \nVALUES ?x2 { :en.muhammad_ali } \n?x0 :boxing.boxing_title.champions ?x1 . \n?x2 :sports.boxer.titles ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 220000401,
		"question": "what are the boxing titles that ali had?",
		"answer": [
			"WBA World Champion"
		],
		"function": "none",
		"commonness": -34.99607422545811,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "boxing.boxing_title",
					"class": "boxing.boxing_title",
					"friendly_name": "Boxing title",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "boxing.boxing_title_tenure",
					"class": "boxing.boxing_title_tenure",
					"friendly_name": "Boxing title tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.muhammad_ali",
					"class": "sports.boxer",
					"friendly_name": "ali",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "boxing.boxing_title.champions",
					"friendly_name": "Champions"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "sports.boxer.titles",
					"friendly_name": "Titles"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :boxing.boxing_title . \n?x1 :type.object.type :boxing.boxing_title_tenure . \nVALUES ?x2 { :en.muhammad_ali } \n?x0 :boxing.boxing_title.champions ?x1 . \n?x2 :sports.boxer.titles ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 220000402,
		"question": "what are the boxing titles that muhammed ali had?",
		"answer": [
			"WBA World Champion"
		],
		"function": "none",
		"commonness": -34.99607422545811,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "boxing.boxing_title",
					"class": "boxing.boxing_title",
					"friendly_name": "Boxing title",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "boxing.boxing_title_tenure",
					"class": "boxing.boxing_title_tenure",
					"friendly_name": "Boxing title tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.muhammad_ali",
					"class": "sports.boxer",
					"friendly_name": "muhammed ali",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "boxing.boxing_title.champions",
					"friendly_name": "Champions"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "sports.boxer.titles",
					"friendly_name": "Titles"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :boxing.boxing_title . \n?x1 :type.object.type :boxing.boxing_title_tenure . \nVALUES ?x2 { :en.muhammad_ali } \n?x0 :boxing.boxing_title.champions ?x1 . \n?x2 :sports.boxer.titles ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 220000500,
		"question": "which boxing titles has muhammad ali gotten?",
		"answer": [
			"WBA World Champion"
		],
		"function": "none",
		"commonness": -34.99607422545811,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "boxing.boxing_title",
					"class": "boxing.boxing_title",
					"friendly_name": "Boxing title",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "boxing.boxing_title_tenure",
					"class": "boxing.boxing_title_tenure",
					"friendly_name": "Boxing title tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.muhammad_ali",
					"class": "sports.boxer",
					"friendly_name": "Muhammad Ali",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "boxing.boxing_title.champions",
					"friendly_name": "Champions"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "sports.boxer.titles",
					"friendly_name": "Titles"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :boxing.boxing_title . \n?x1 :type.object.type :boxing.boxing_title_tenure . \nVALUES ?x2 { :en.muhammad_ali } \n?x0 :boxing.boxing_title.champions ?x1 . \n?x2 :sports.boxer.titles ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 220000501,
		"question": "which boxing titles has ali gotten?",
		"answer": [
			"WBA World Champion"
		],
		"function": "none",
		"commonness": -34.99607422545811,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "boxing.boxing_title",
					"class": "boxing.boxing_title",
					"friendly_name": "Boxing title",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "boxing.boxing_title_tenure",
					"class": "boxing.boxing_title_tenure",
					"friendly_name": "Boxing title tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.muhammad_ali",
					"class": "sports.boxer",
					"friendly_name": "ali",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "boxing.boxing_title.champions",
					"friendly_name": "Champions"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "sports.boxer.titles",
					"friendly_name": "Titles"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :boxing.boxing_title . \n?x1 :type.object.type :boxing.boxing_title_tenure . \nVALUES ?x2 { :en.muhammad_ali } \n?x0 :boxing.boxing_title.champions ?x1 . \n?x2 :sports.boxer.titles ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	}
]