[
	{
		"qid": 81000300,
		"question": "what does the exit glacier terminate in?",
		"answer": [
			"River",
			"Moraine"
		],
		"function": "none",
		"commonness": -19.63884055832049,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "geography.glacier_terminus",
					"class": "geography.glacier_terminus",
					"friendly_name": "Glacier terminus",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.exit_glacier",
					"class": "geography.glacier",
					"friendly_name": "Exit Glacier",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "geography.glacier.terminus",
					"friendly_name": "Terminus"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :geography.glacier_terminus . \nVALUES ?x1 { :en.exit_glacier } \n?x1 :geography.glacier.terminus ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 81000400,
		"question": "what type of terrain does the exit glacier terminate in or flow into?",
		"answer": [
			"Moraine",
			"River"
		],
		"function": "none",
		"commonness": -19.63884055832049,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "geography.glacier_terminus",
					"class": "geography.glacier_terminus",
					"friendly_name": "Glacier terminus",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.exit_glacier",
					"class": "geography.glacier",
					"friendly_name": "Exit Glacier",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "geography.glacier.terminus",
					"friendly_name": "Terminus"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :geography.glacier_terminus . \nVALUES ?x1 { :en.exit_glacier } \n?x1 :geography.glacier.terminus ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 82000000,
		"question": "what genre is the play annie classified in?",
		"answer": [
			"Musical theatre"
		],
		"function": "none",
		"commonness": -13.912675189238175,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "theater.theater_genre",
					"class": "theater.theater_genre",
					"friendly_name": "Theater Genre",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.annie",
					"class": "theater.play",
					"friendly_name": "Annie",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "theater.play.genre",
					"friendly_name": "Genre"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :theater.theater_genre . \nVALUES ?x1 { :en.annie } \n?x1 :theater.play.genre ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 82000200,
		"question": "what is the genre of annie?",
		"answer": [
			"Musical theatre"
		],
		"function": "none",
		"commonness": -13.912675189238175,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "theater.theater_genre",
					"class": "theater.theater_genre",
					"friendly_name": "Theater Genre",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.annie",
					"class": "theater.play",
					"friendly_name": "Annie",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "theater.play.genre",
					"friendly_name": "Genre"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :theater.theater_genre . \nVALUES ?x1 { :en.annie } \n?x1 :theater.play.genre ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 82000300,
		"question": "which type of theater genre does the play annie represent?",
		"answer": [
			"Musical theatre"
		],
		"function": "none",
		"commonness": -13.912675189238175,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "theater.theater_genre",
					"class": "theater.theater_genre",
					"friendly_name": "Theater Genre",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.annie",
					"class": "theater.play",
					"friendly_name": "Annie",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "theater.play.genre",
					"friendly_name": "Genre"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :theater.theater_genre . \nVALUES ?x1 { :en.annie } \n?x1 :theater.play.genre ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 82000400,
		"question": "what kind of play is annie?",
		"answer": [
			"Musical theatre"
		],
		"function": "none",
		"commonness": -13.912675189238175,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "theater.theater_genre",
					"class": "theater.theater_genre",
					"friendly_name": "Theater Genre",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.annie",
					"class": "theater.play",
					"friendly_name": "Annie",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "theater.play.genre",
					"friendly_name": "Genre"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :theater.theater_genre . \nVALUES ?x1 { :en.annie } \n?x1 :theater.play.genre ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 83000000,
		"question": "who are impersonated by will ferrell?",
		"answer": [
			"Neil Diamond",
			"James Lipton",
			"Janet Reno",
			"Jesse Ventura",
			"George Bush",
			"Ted Kaczynski",
			"Robert Goulet",
			"Harry Caray",
			"Ted Kennedy",
			"Alex Trebek"
		],
		"function": "none",
		"commonness": -13.473996990538954,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.impersonated_celebrity",
					"class": "base.americancomedy.impersonated_celebrity",
					"friendly_name": "Impersonated celebrity",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.will_ferrell",
					"class": "base.americancomedy.celebrity_impressionist",
					"friendly_name": "Will Ferrell",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.americancomedy.impersonated_celebrity.impersonated_by",
					"friendly_name": "Impersonated by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.impersonated_celebrity . \nVALUES ?x1 { :en.will_ferrell } \n?x0 :base.americancomedy.impersonated_celebrity.impersonated_by ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 83000001,
		"question": "who are impersonated by ferrell?",
		"answer": [
			"Neil Diamond",
			"Harry Caray",
			"Janet Reno",
			"James Lipton",
			"George Bush",
			"Ted Kennedy",
			"Ted Kaczynski",
			"Robert Goulet",
			"Alex Trebek",
			"Jesse Ventura"
		],
		"function": "none",
		"commonness": -13.473996990538954,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.impersonated_celebrity",
					"class": "base.americancomedy.impersonated_celebrity",
					"friendly_name": "Impersonated celebrity",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.will_ferrell",
					"class": "base.americancomedy.celebrity_impressionist",
					"friendly_name": "ferrell",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.americancomedy.impersonated_celebrity.impersonated_by",
					"friendly_name": "Impersonated by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.impersonated_celebrity . \nVALUES ?x1 { :en.will_ferrell } \n?x0 :base.americancomedy.impersonated_celebrity.impersonated_by ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 83000002,
		"question": "who are impersonated by will farrell?",
		"answer": [
			"Neil Diamond",
			"Janet Reno",
			"Jesse Ventura",
			"Harry Caray",
			"Ted Kaczynski",
			"Ted Kennedy",
			"James Lipton",
			"Robert Goulet",
			"Alex Trebek",
			"George Bush"
		],
		"function": "none",
		"commonness": -13.473996990538954,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.impersonated_celebrity",
					"class": "base.americancomedy.impersonated_celebrity",
					"friendly_name": "Impersonated celebrity",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.will_ferrell",
					"class": "base.americancomedy.celebrity_impressionist",
					"friendly_name": "will farrell",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.americancomedy.impersonated_celebrity.impersonated_by",
					"friendly_name": "Impersonated by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.impersonated_celebrity . \nVALUES ?x1 { :en.will_ferrell } \n?x0 :base.americancomedy.impersonated_celebrity.impersonated_by ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 83000100,
		"question": "who does will ferrell do impersonations of?",
		"answer": [
			"Ted Kennedy",
			"Ted Kaczynski",
			"Robert Goulet",
			"Neil Diamond",
			"Harry Caray",
			"Jesse Ventura",
			"Janet Reno",
			"George Bush",
			"James Lipton",
			"Alex Trebek"
		],
		"function": "none",
		"commonness": -13.473996990538954,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.impersonated_celebrity",
					"class": "base.americancomedy.impersonated_celebrity",
					"friendly_name": "Impersonated celebrity",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.will_ferrell",
					"class": "base.americancomedy.celebrity_impressionist",
					"friendly_name": "Will Ferrell",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.americancomedy.impersonated_celebrity.impersonated_by",
					"friendly_name": "Impersonated by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.impersonated_celebrity . \nVALUES ?x1 { :en.will_ferrell } \n?x0 :base.americancomedy.impersonated_celebrity.impersonated_by ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 83000101,
		"question": "who does ferrell do impersonations of?",
		"answer": [
			"Janet Reno",
			"James Lipton",
			"Ted Kaczynski",
			"Jesse Ventura",
			"George Bush",
			"Alex Trebek",
			"Robert Goulet",
			"Ted Kennedy",
			"Neil Diamond",
			"Harry Caray"
		],
		"function": "none",
		"commonness": -13.473996990538954,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.impersonated_celebrity",
					"class": "base.americancomedy.impersonated_celebrity",
					"friendly_name": "Impersonated celebrity",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.will_ferrell",
					"class": "base.americancomedy.celebrity_impressionist",
					"friendly_name": "ferrell",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.americancomedy.impersonated_celebrity.impersonated_by",
					"friendly_name": "Impersonated by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.impersonated_celebrity . \nVALUES ?x1 { :en.will_ferrell } \n?x0 :base.americancomedy.impersonated_celebrity.impersonated_by ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 83000102,
		"question": "who does will farrell do impersonations of?",
		"answer": [
			"Ted Kennedy",
			"James Lipton",
			"Neil Diamond",
			"George Bush",
			"Alex Trebek",
			"Ted Kaczynski",
			"Jesse Ventura",
			"Robert Goulet",
			"Harry Caray",
			"Janet Reno"
		],
		"function": "none",
		"commonness": -13.473996990538954,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.impersonated_celebrity",
					"class": "base.americancomedy.impersonated_celebrity",
					"friendly_name": "Impersonated celebrity",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.will_ferrell",
					"class": "base.americancomedy.celebrity_impressionist",
					"friendly_name": "will farrell",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.americancomedy.impersonated_celebrity.impersonated_by",
					"friendly_name": "Impersonated by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.impersonated_celebrity . \nVALUES ?x1 { :en.will_ferrell } \n?x0 :base.americancomedy.impersonated_celebrity.impersonated_by ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 83000200,
		"question": "what celebrities are imitated by will ferrell?",
		"answer": [
			"Ted Kennedy",
			"George Bush",
			"James Lipton",
			"Neil Diamond",
			"Harry Caray",
			"Ted Kaczynski",
			"Alex Trebek",
			"Robert Goulet",
			"Janet Reno",
			"Jesse Ventura"
		],
		"function": "none",
		"commonness": -13.473996990538954,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.impersonated_celebrity",
					"class": "base.americancomedy.impersonated_celebrity",
					"friendly_name": "Impersonated celebrity",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.will_ferrell",
					"class": "base.americancomedy.celebrity_impressionist",
					"friendly_name": "Will Ferrell",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.americancomedy.impersonated_celebrity.impersonated_by",
					"friendly_name": "Impersonated by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.impersonated_celebrity . \nVALUES ?x1 { :en.will_ferrell } \n?x0 :base.americancomedy.impersonated_celebrity.impersonated_by ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 83000201,
		"question": "what celebrities are imitated by ferrell?",
		"answer": [
			"Harry Caray",
			"Janet Reno",
			"Ted Kaczynski",
			"Robert Goulet",
			"Alex Trebek",
			"Neil Diamond",
			"George Bush",
			"Ted Kennedy",
			"Jesse Ventura",
			"James Lipton"
		],
		"function": "none",
		"commonness": -13.473996990538954,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.impersonated_celebrity",
					"class": "base.americancomedy.impersonated_celebrity",
					"friendly_name": "Impersonated celebrity",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.will_ferrell",
					"class": "base.americancomedy.celebrity_impressionist",
					"friendly_name": "ferrell",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.americancomedy.impersonated_celebrity.impersonated_by",
					"friendly_name": "Impersonated by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.impersonated_celebrity . \nVALUES ?x1 { :en.will_ferrell } \n?x0 :base.americancomedy.impersonated_celebrity.impersonated_by ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 83000202,
		"question": "what celebrities are imitated by will farrell?",
		"answer": [
			"Ted Kaczynski",
			"Janet Reno",
			"Alex Trebek",
			"Neil Diamond",
			"James Lipton",
			"Ted Kennedy",
			"George Bush",
			"Harry Caray",
			"Robert Goulet",
			"Jesse Ventura"
		],
		"function": "none",
		"commonness": -13.473996990538954,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.impersonated_celebrity",
					"class": "base.americancomedy.impersonated_celebrity",
					"friendly_name": "Impersonated celebrity",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.will_ferrell",
					"class": "base.americancomedy.celebrity_impressionist",
					"friendly_name": "will farrell",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.americancomedy.impersonated_celebrity.impersonated_by",
					"friendly_name": "Impersonated by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.impersonated_celebrity . \nVALUES ?x1 { :en.will_ferrell } \n?x0 :base.americancomedy.impersonated_celebrity.impersonated_by ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 83000300,
		"question": "who did will ferrell impersonate?",
		"answer": [
			"James Lipton",
			"Neil Diamond",
			"Robert Goulet",
			"Ted Kennedy",
			"Alex Trebek",
			"Harry Caray",
			"Jesse Ventura",
			"Ted Kaczynski",
			"Janet Reno",
			"George Bush"
		],
		"function": "none",
		"commonness": -13.473996990538954,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.impersonated_celebrity",
					"class": "base.americancomedy.impersonated_celebrity",
					"friendly_name": "Impersonated celebrity",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.will_ferrell",
					"class": "base.americancomedy.celebrity_impressionist",
					"friendly_name": "Will Ferrell",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.americancomedy.impersonated_celebrity.impersonated_by",
					"friendly_name": "Impersonated by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.impersonated_celebrity . \nVALUES ?x1 { :en.will_ferrell } \n?x0 :base.americancomedy.impersonated_celebrity.impersonated_by ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 83000301,
		"question": "who did ferrell impersonate?",
		"answer": [
			"Robert Goulet",
			"Harry Caray",
			"James Lipton",
			"Ted Kennedy",
			"Alex Trebek",
			"Neil Diamond",
			"George Bush",
			"Janet Reno",
			"Ted Kaczynski",
			"Jesse Ventura"
		],
		"function": "none",
		"commonness": -13.473996990538954,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.impersonated_celebrity",
					"class": "base.americancomedy.impersonated_celebrity",
					"friendly_name": "Impersonated celebrity",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.will_ferrell",
					"class": "base.americancomedy.celebrity_impressionist",
					"friendly_name": "ferrell",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.americancomedy.impersonated_celebrity.impersonated_by",
					"friendly_name": "Impersonated by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.impersonated_celebrity . \nVALUES ?x1 { :en.will_ferrell } \n?x0 :base.americancomedy.impersonated_celebrity.impersonated_by ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 83000302,
		"question": "who did will farrell impersonate?",
		"answer": [
			"Janet Reno",
			"Ted Kaczynski",
			"George Bush",
			"Jesse Ventura",
			"Neil Diamond",
			"Harry Caray",
			"Ted Kennedy",
			"James Lipton",
			"Alex Trebek",
			"Robert Goulet"
		],
		"function": "none",
		"commonness": -13.473996990538954,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.impersonated_celebrity",
					"class": "base.americancomedy.impersonated_celebrity",
					"friendly_name": "Impersonated celebrity",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.will_ferrell",
					"class": "base.americancomedy.celebrity_impressionist",
					"friendly_name": "will farrell",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.americancomedy.impersonated_celebrity.impersonated_by",
					"friendly_name": "Impersonated by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.impersonated_celebrity . \nVALUES ?x1 { :en.will_ferrell } \n?x0 :base.americancomedy.impersonated_celebrity.impersonated_by ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 83000400,
		"question": "what famous people does comic will ferrell do impressions of?",
		"answer": [
			"George Bush",
			"Neil Diamond",
			"Robert Goulet",
			"Ted Kaczynski",
			"Janet Reno",
			"Jesse Ventura",
			"Harry Caray",
			"James Lipton",
			"Alex Trebek",
			"Ted Kennedy"
		],
		"function": "none",
		"commonness": -13.473996990538954,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.impersonated_celebrity",
					"class": "base.americancomedy.impersonated_celebrity",
					"friendly_name": "Impersonated celebrity",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.will_ferrell",
					"class": "base.americancomedy.celebrity_impressionist",
					"friendly_name": "Will Ferrell",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.americancomedy.impersonated_celebrity.impersonated_by",
					"friendly_name": "Impersonated by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.impersonated_celebrity . \nVALUES ?x1 { :en.will_ferrell } \n?x0 :base.americancomedy.impersonated_celebrity.impersonated_by ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 83000401,
		"question": "what famous people does comic ferrell do impressions of?",
		"answer": [
			"Neil Diamond",
			"James Lipton",
			"Jesse Ventura",
			"Robert Goulet",
			"Harry Caray",
			"Alex Trebek",
			"Ted Kennedy",
			"Janet Reno",
			"George Bush",
			"Ted Kaczynski"
		],
		"function": "none",
		"commonness": -13.473996990538954,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.impersonated_celebrity",
					"class": "base.americancomedy.impersonated_celebrity",
					"friendly_name": "Impersonated celebrity",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.will_ferrell",
					"class": "base.americancomedy.celebrity_impressionist",
					"friendly_name": "ferrell",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.americancomedy.impersonated_celebrity.impersonated_by",
					"friendly_name": "Impersonated by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.impersonated_celebrity . \nVALUES ?x1 { :en.will_ferrell } \n?x0 :base.americancomedy.impersonated_celebrity.impersonated_by ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 83000402,
		"question": "what famous people does comic will farrell do impressions of?",
		"answer": [
			"Jesse Ventura",
			"George Bush",
			"Harry Caray",
			"Janet Reno",
			"James Lipton",
			"Neil Diamond",
			"Ted Kennedy",
			"Alex Trebek",
			"Ted Kaczynski",
			"Robert Goulet"
		],
		"function": "none",
		"commonness": -13.473996990538954,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.impersonated_celebrity",
					"class": "base.americancomedy.impersonated_celebrity",
					"friendly_name": "Impersonated celebrity",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.will_ferrell",
					"class": "base.americancomedy.celebrity_impressionist",
					"friendly_name": "will farrell",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.americancomedy.impersonated_celebrity.impersonated_by",
					"friendly_name": "Impersonated by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.impersonated_celebrity . \nVALUES ?x1 { :en.will_ferrell } \n?x0 :base.americancomedy.impersonated_celebrity.impersonated_by ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 84000000,
		"question": "what type of exhibition is the armory show?",
		"answer": [
			"Art exhibition"
		],
		"function": "none",
		"commonness": -17.501557538578147,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "exhibitions.type_of_exhibition",
					"class": "exhibitions.type_of_exhibition",
					"friendly_name": "Type of Exhibition",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.armory_show",
					"class": "exhibitions.exhibition",
					"friendly_name": "Armory Show",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "exhibitions.exhibition.exhibition_types",
					"friendly_name": "Exhibition type(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :exhibitions.type_of_exhibition . \nVALUES ?x1 { :en.armory_show } \n?x1 :exhibitions.exhibition.exhibition_types ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]