[
	{
		"qid": 193000301,
		"question": "what kind of cpu is in computers that support wiimote?",
		"answer": [
			"PowerPC"
		],
		"function": "none",
		"commonness": -22.67361534912766,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.computer_processor",
					"class": "computer.computer_processor",
					"friendly_name": "Computer Processor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "computer.computer",
					"class": "computer.computer",
					"friendly_name": "Computer",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.wii_remote",
					"class": "computer.computer_peripheral",
					"friendly_name": "wiimote",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "computer.computer.processor",
					"friendly_name": "Processor"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "computer.computer.peripherals",
					"friendly_name": "Peripherals"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.computer_processor . \n?x1 :type.object.type :computer.computer . \nVALUES ?x2 { :en.wii_remote } \n?x1 :computer.computer.processor ?x0 . \n?x1 :computer.computer.peripherals ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 193000302,
		"question": "what kind of cpu is in computers that support wii?",
		"answer": [
			"PowerPC"
		],
		"function": "none",
		"commonness": -22.67361534912766,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.computer_processor",
					"class": "computer.computer_processor",
					"friendly_name": "Computer Processor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "computer.computer",
					"class": "computer.computer",
					"friendly_name": "Computer",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.wii_remote",
					"class": "computer.computer_peripheral",
					"friendly_name": "wii",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "computer.computer.processor",
					"friendly_name": "Processor"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "computer.computer.peripherals",
					"friendly_name": "Peripherals"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.computer_processor . \n?x1 :type.object.type :computer.computer . \nVALUES ?x2 { :en.wii_remote } \n?x1 :computer.computer.processor ?x0 . \n?x1 :computer.computer.peripherals ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 193000400,
		"question": "computers running wii remote use what type of cpu?",
		"answer": [
			"PowerPC"
		],
		"function": "none",
		"commonness": -22.67361534912766,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.computer_processor",
					"class": "computer.computer_processor",
					"friendly_name": "Computer Processor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "computer.computer",
					"class": "computer.computer",
					"friendly_name": "Computer",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.wii_remote",
					"class": "computer.computer_peripheral",
					"friendly_name": "Wii Remote",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "computer.computer.processor",
					"friendly_name": "Processor"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "computer.computer.peripherals",
					"friendly_name": "Peripherals"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.computer_processor . \n?x1 :type.object.type :computer.computer . \nVALUES ?x2 { :en.wii_remote } \n?x1 :computer.computer.processor ?x0 . \n?x1 :computer.computer.peripherals ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 193000401,
		"question": "computers running wiimote use what type of cpu?",
		"answer": [
			"PowerPC"
		],
		"function": "none",
		"commonness": -22.67361534912766,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.computer_processor",
					"class": "computer.computer_processor",
					"friendly_name": "Computer Processor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "computer.computer",
					"class": "computer.computer",
					"friendly_name": "Computer",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.wii_remote",
					"class": "computer.computer_peripheral",
					"friendly_name": "wiimote",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "computer.computer.processor",
					"friendly_name": "Processor"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "computer.computer.peripherals",
					"friendly_name": "Peripherals"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.computer_processor . \n?x1 :type.object.type :computer.computer . \nVALUES ?x2 { :en.wii_remote } \n?x1 :computer.computer.processor ?x0 . \n?x1 :computer.computer.peripherals ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 193000402,
		"question": "computers running wii use what type of cpu?",
		"answer": [
			"PowerPC"
		],
		"function": "none",
		"commonness": -22.67361534912766,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.computer_processor",
					"class": "computer.computer_processor",
					"friendly_name": "Computer Processor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "computer.computer",
					"class": "computer.computer",
					"friendly_name": "Computer",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.wii_remote",
					"class": "computer.computer_peripheral",
					"friendly_name": "wii",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "computer.computer.processor",
					"friendly_name": "Processor"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "computer.computer.peripherals",
					"friendly_name": "Peripherals"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.computer_processor . \n?x1 :type.object.type :computer.computer . \nVALUES ?x2 { :en.wii_remote } \n?x1 :computer.computer.processor ?x0 . \n?x1 :computer.computer.peripherals ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 193000500,
		"question": "what kind of cpu is used in computers supporting wii remote?",
		"answer": [
			"PowerPC"
		],
		"function": "none",
		"commonness": -22.67361534912766,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.computer_processor",
					"class": "computer.computer_processor",
					"friendly_name": "Computer Processor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "computer.computer",
					"class": "computer.computer",
					"friendly_name": "Computer",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.wii_remote",
					"class": "computer.computer_peripheral",
					"friendly_name": "Wii Remote",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "computer.computer.processor",
					"friendly_name": "Processor"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "computer.computer.peripherals",
					"friendly_name": "Peripherals"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.computer_processor . \n?x1 :type.object.type :computer.computer . \nVALUES ?x2 { :en.wii_remote } \n?x1 :computer.computer.processor ?x0 . \n?x1 :computer.computer.peripherals ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 193000501,
		"question": "what kind of cpu is used in computers supporting wiimote?",
		"answer": [
			"PowerPC"
		],
		"function": "none",
		"commonness": -22.67361534912766,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.computer_processor",
					"class": "computer.computer_processor",
					"friendly_name": "Computer Processor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "computer.computer",
					"class": "computer.computer",
					"friendly_name": "Computer",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.wii_remote",
					"class": "computer.computer_peripheral",
					"friendly_name": "wiimote",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "computer.computer.processor",
					"friendly_name": "Processor"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "computer.computer.peripherals",
					"friendly_name": "Peripherals"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.computer_processor . \n?x1 :type.object.type :computer.computer . \nVALUES ?x2 { :en.wii_remote } \n?x1 :computer.computer.processor ?x0 . \n?x1 :computer.computer.peripherals ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 193000502,
		"question": "what kind of cpu is used in computers supporting wii?",
		"answer": [
			"PowerPC"
		],
		"function": "none",
		"commonness": -22.67361534912766,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.computer_processor",
					"class": "computer.computer_processor",
					"friendly_name": "Computer Processor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "computer.computer",
					"class": "computer.computer",
					"friendly_name": "Computer",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.wii_remote",
					"class": "computer.computer_peripheral",
					"friendly_name": "wii",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "computer.computer.processor",
					"friendly_name": "Processor"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "computer.computer.peripherals",
					"friendly_name": "Peripherals"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.computer_processor . \n?x1 :type.object.type :computer.computer . \nVALUES ?x2 { :en.wii_remote } \n?x1 :computer.computer.processor ?x0 . \n?x1 :computer.computer.peripherals ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 194000000,
		"question": "what collectable items were released in 1984 for star wars?",
		"answer": [
			"1984 Lumat action figure"
		],
		"function": "none",
		"commonness": -25.053423614903828,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "interests.collectable_item",
					"class": "interests.collectable_item",
					"friendly_name": "Collectable item",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.star_wars",
					"class": "interests.collection_category",
					"friendly_name": "Star Wars",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "1984^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "1984",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "interests.collectable_item.collection_category",
					"friendly_name": "Collection category"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "interests.collectable_item.release_date",
					"friendly_name": "Release date"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :interests.collectable_item . \nVALUES ?x1 { :en.star_wars } \nVALUES ?x2 { \"1984\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?x0 :interests.collectable_item.collection_category ?x1 . \n?x0 :interests.collectable_item.release_date ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 194000002,
		"question": "what collectable items were released in 1984 for star war?",
		"answer": [
			"1984 Lumat action figure"
		],
		"function": "none",
		"commonness": -25.053423614903828,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "interests.collectable_item",
					"class": "interests.collectable_item",
					"friendly_name": "Collectable item",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.star_wars",
					"class": "interests.collection_category",
					"friendly_name": "star war",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "1984^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "1984",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "interests.collectable_item.collection_category",
					"friendly_name": "Collection category"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "interests.collectable_item.release_date",
					"friendly_name": "Release date"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :interests.collectable_item . \nVALUES ?x1 { :en.star_wars } \nVALUES ?x2 { \"1984\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?x0 :interests.collectable_item.collection_category ?x1 . \n?x0 :interests.collectable_item.release_date ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 194000200,
		"question": "which star wars collectable items were released in 1984?",
		"answer": [
			"1984 Lumat action figure"
		],
		"function": "none",
		"commonness": -25.053423614903828,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "interests.collectable_item",
					"class": "interests.collectable_item",
					"friendly_name": "Collectable item",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.star_wars",
					"class": "interests.collection_category",
					"friendly_name": "Star Wars",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "1984^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "1984",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "interests.collectable_item.collection_category",
					"friendly_name": "Collection category"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "interests.collectable_item.release_date",
					"friendly_name": "Release date"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :interests.collectable_item . \nVALUES ?x1 { :en.star_wars } \nVALUES ?x2 { \"1984\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?x0 :interests.collectable_item.collection_category ?x1 . \n?x0 :interests.collectable_item.release_date ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 194000202,
		"question": "which star war collectable items were released in 1984?",
		"answer": [
			"1984 Lumat action figure"
		],
		"function": "none",
		"commonness": -25.053423614903828,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "interests.collectable_item",
					"class": "interests.collectable_item",
					"friendly_name": "Collectable item",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.star_wars",
					"class": "interests.collection_category",
					"friendly_name": "star war",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "1984^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "1984",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "interests.collectable_item.collection_category",
					"friendly_name": "Collection category"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "interests.collectable_item.release_date",
					"friendly_name": "Release date"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :interests.collectable_item . \nVALUES ?x1 { :en.star_wars } \nVALUES ?x2 { \"1984\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?x0 :interests.collectable_item.collection_category ?x1 . \n?x0 :interests.collectable_item.release_date ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 194000300,
		"question": "what star wars collectables can i find that were released in 1984?",
		"answer": [
			"1984 Lumat action figure"
		],
		"function": "none",
		"commonness": -25.053423614903828,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "interests.collectable_item",
					"class": "interests.collectable_item",
					"friendly_name": "Collectable item",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.star_wars",
					"class": "interests.collection_category",
					"friendly_name": "Star Wars",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "1984^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "1984",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "interests.collectable_item.collection_category",
					"friendly_name": "Collection category"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "interests.collectable_item.release_date",
					"friendly_name": "Release date"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :interests.collectable_item . \nVALUES ?x1 { :en.star_wars } \nVALUES ?x2 { \"1984\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?x0 :interests.collectable_item.collection_category ?x1 . \n?x0 :interests.collectable_item.release_date ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 194000302,
		"question": "what star war collectables can i find that were released in 1984?",
		"answer": [
			"1984 Lumat action figure"
		],
		"function": "none",
		"commonness": -25.053423614903828,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "interests.collectable_item",
					"class": "interests.collectable_item",
					"friendly_name": "Collectable item",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.star_wars",
					"class": "interests.collection_category",
					"friendly_name": "star war",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "1984^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "1984",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "interests.collectable_item.collection_category",
					"friendly_name": "Collection category"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "interests.collectable_item.release_date",
					"friendly_name": "Release date"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :interests.collectable_item . \nVALUES ?x1 { :en.star_wars } \nVALUES ?x2 { \"1984\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?x0 :interests.collectable_item.collection_category ?x1 . \n?x0 :interests.collectable_item.release_date ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 194000500,
		"question": "which star wars collectables were released in 1984?",
		"answer": [
			"1984 Lumat action figure"
		],
		"function": "none",
		"commonness": -25.053423614903828,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "interests.collectable_item",
					"class": "interests.collectable_item",
					"friendly_name": "Collectable item",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.star_wars",
					"class": "interests.collection_category",
					"friendly_name": "Star Wars",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "1984^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "1984",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "interests.collectable_item.collection_category",
					"friendly_name": "Collection category"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "interests.collectable_item.release_date",
					"friendly_name": "Release date"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :interests.collectable_item . \nVALUES ?x1 { :en.star_wars } \nVALUES ?x2 { \"1984\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?x0 :interests.collectable_item.collection_category ?x1 . \n?x0 :interests.collectable_item.release_date ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 194000502,
		"question": "which star war collectables were released in 1984?",
		"answer": [
			"1984 Lumat action figure"
		],
		"function": "none",
		"commonness": -25.053423614903828,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "interests.collectable_item",
					"class": "interests.collectable_item",
					"friendly_name": "Collectable item",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.star_wars",
					"class": "interests.collection_category",
					"friendly_name": "star war",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "1984^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "1984",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "interests.collectable_item.collection_category",
					"friendly_name": "Collection category"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "interests.collectable_item.release_date",
					"friendly_name": "Release date"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :interests.collectable_item . \nVALUES ?x1 { :en.star_wars } \nVALUES ?x2 { \"1984\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?x0 :interests.collectable_item.collection_category ?x1 . \n?x0 :interests.collectable_item.release_date ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 194000600,
		"question": "what collectable items were released in 1984 and part of the star wars collection?",
		"answer": [
			"1984 Lumat action figure"
		],
		"function": "none",
		"commonness": -25.053423614903828,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "interests.collectable_item",
					"class": "interests.collectable_item",
					"friendly_name": "Collectable item",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.star_wars",
					"class": "interests.collection_category",
					"friendly_name": "Star Wars",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "1984^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "1984",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "interests.collectable_item.collection_category",
					"friendly_name": "Collection category"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "interests.collectable_item.release_date",
					"friendly_name": "Release date"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :interests.collectable_item . \nVALUES ?x1 { :en.star_wars } \nVALUES ?x2 { \"1984\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?x0 :interests.collectable_item.collection_category ?x1 . \n?x0 :interests.collectable_item.release_date ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	}
]