[
	{
		"qid": 127000000,
		"question": "which tropical cyclone seasons have less than 12 major storms?",
		"answer": [
			"1879 Atlantic hurricane season",
			"1903 Atlantic hurricane season",
			"1910 Atlantic hurricane season",
			"1912 Atlantic hurricane season",
			"1957 Atlantic hurricane season",
			"1877 Atlantic hurricane season",
			"1876 Atlantic hurricane season",
			"1899 Atlantic hurricane season",
			"1908 Atlantic hurricane season",
			"1905 Atlantic hurricane season",
			"1934 Atlantic hurricane season",
			"1958 Atlantic hurricane season",
			"1992 Atlantic hurricane season",
			"1935 Atlantic hurricane season",
			"1896 Atlantic hurricane season",
			"1875 Atlantic hurricane season",
			"1891 Atlantic hurricane season",
			"2005 Atlantic hurricane season"
		],
		"function": "<",
		"commonness": -18.461893577025045,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "meteorology.tropical_cyclone_season",
					"class": "meteorology.tropical_cyclone_season",
					"friendly_name": "Tropical cyclone season",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "12^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "12",
					"question_node": 0,
					"function": "<"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "meteorology.tropical_cyclone_season.major_storms",
					"friendly_name": "Major storms (cat. 3 or higher)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :meteorology.tropical_cyclone_season . \nFILTER (?x1 < 12)\n?x0 :meteorology.tropical_cyclone_season.major_storms ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 127000100,
		"question": "in which seasons of tropical cyclone are there less than 12 major storms?",
		"answer": [
			"1958 Atlantic hurricane season",
			"1934 Atlantic hurricane season",
			"1903 Atlantic hurricane season",
			"1908 Atlantic hurricane season",
			"1992 Atlantic hurricane season",
			"1877 Atlantic hurricane season",
			"2005 Atlantic hurricane season",
			"1876 Atlantic hurricane season",
			"1935 Atlantic hurricane season",
			"1910 Atlantic hurricane season",
			"1891 Atlantic hurricane season",
			"1912 Atlantic hurricane season",
			"1899 Atlantic hurricane season",
			"1905 Atlantic hurricane season",
			"1957 Atlantic hurricane season",
			"1879 Atlantic hurricane season",
			"1896 Atlantic hurricane season",
			"1875 Atlantic hurricane season"
		],
		"function": "<",
		"commonness": -18.461893577025045,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "meteorology.tropical_cyclone_season",
					"class": "meteorology.tropical_cyclone_season",
					"friendly_name": "Tropical cyclone season",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "12^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "12",
					"question_node": 0,
					"function": "<"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "meteorology.tropical_cyclone_season.major_storms",
					"friendly_name": "Major storms (cat. 3 or higher)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :meteorology.tropical_cyclone_season . \nFILTER (?x1 < 12)\n?x0 :meteorology.tropical_cyclone_season.major_storms ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 127000200,
		"question": "what are the tropical cyclone seasons that have less than 12 major storms?",
		"answer": [
			"1891 Atlantic hurricane season",
			"1958 Atlantic hurricane season",
			"1905 Atlantic hurricane season",
			"1903 Atlantic hurricane season",
			"1957 Atlantic hurricane season",
			"1899 Atlantic hurricane season",
			"1912 Atlantic hurricane season",
			"1910 Atlantic hurricane season",
			"1875 Atlantic hurricane season",
			"1877 Atlantic hurricane season",
			"1896 Atlantic hurricane season",
			"1879 Atlantic hurricane season",
			"1908 Atlantic hurricane season",
			"2005 Atlantic hurricane season",
			"1935 Atlantic hurricane season",
			"1934 Atlantic hurricane season",
			"1876 Atlantic hurricane season",
			"1992 Atlantic hurricane season"
		],
		"function": "<",
		"commonness": -18.461893577025045,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "meteorology.tropical_cyclone_season",
					"class": "meteorology.tropical_cyclone_season",
					"friendly_name": "Tropical cyclone season",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "12^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "12",
					"question_node": 0,
					"function": "<"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "meteorology.tropical_cyclone_season.major_storms",
					"friendly_name": "Major storms (cat. 3 or higher)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :meteorology.tropical_cyclone_season . \nFILTER (?x1 < 12)\n?x0 :meteorology.tropical_cyclone_season.major_storms ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 127000300,
		"question": "which seasons of tropical cyclones have fewer than 12 major storms?",
		"answer": [
			"1891 Atlantic hurricane season",
			"1899 Atlantic hurricane season",
			"1957 Atlantic hurricane season",
			"1908 Atlantic hurricane season",
			"1896 Atlantic hurricane season",
			"1958 Atlantic hurricane season",
			"1879 Atlantic hurricane season",
			"1935 Atlantic hurricane season",
			"2005 Atlantic hurricane season",
			"1910 Atlantic hurricane season",
			"1912 Atlantic hurricane season",
			"1877 Atlantic hurricane season",
			"1934 Atlantic hurricane season",
			"1905 Atlantic hurricane season",
			"1876 Atlantic hurricane season",
			"1903 Atlantic hurricane season",
			"1875 Atlantic hurricane season",
			"1992 Atlantic hurricane season"
		],
		"function": "<",
		"commonness": -18.461893577025045,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "meteorology.tropical_cyclone_season",
					"class": "meteorology.tropical_cyclone_season",
					"friendly_name": "Tropical cyclone season",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "12^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "12",
					"question_node": 0,
					"function": "<"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "meteorology.tropical_cyclone_season.major_storms",
					"friendly_name": "Major storms (cat. 3 or higher)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :meteorology.tropical_cyclone_season . \nFILTER (?x1 < 12)\n?x0 :meteorology.tropical_cyclone_season.major_storms ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 127000400,
		"question": "less than 12 major storms occurred in which tropical cyclone seasons?",
		"answer": [
			"1891 Atlantic hurricane season",
			"1903 Atlantic hurricane season",
			"1899 Atlantic hurricane season",
			"1992 Atlantic hurricane season",
			"1958 Atlantic hurricane season",
			"1935 Atlantic hurricane season",
			"2005 Atlantic hurricane season",
			"1877 Atlantic hurricane season",
			"1876 Atlantic hurricane season",
			"1879 Atlantic hurricane season",
			"1910 Atlantic hurricane season",
			"1905 Atlantic hurricane season",
			"1934 Atlantic hurricane season",
			"1957 Atlantic hurricane season",
			"1908 Atlantic hurricane season",
			"1875 Atlantic hurricane season",
			"1896 Atlantic hurricane season",
			"1912 Atlantic hurricane season"
		],
		"function": "<",
		"commonness": -18.461893577025045,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "meteorology.tropical_cyclone_season",
					"class": "meteorology.tropical_cyclone_season",
					"friendly_name": "Tropical cyclone season",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "12^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "12",
					"question_node": 0,
					"function": "<"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "meteorology.tropical_cyclone_season.major_storms",
					"friendly_name": "Major storms (cat. 3 or higher)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :meteorology.tropical_cyclone_season . \nFILTER (?x1 < 12)\n?x0 :meteorology.tropical_cyclone_season.major_storms ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 129000000,
		"question": "find biopropellant rocket engines with a diameter no larger than 1.85 m.",
		"answer": [
			"RD-101",
			"RD-214U",
			"RD-250M",
			"RD-214F",
			"RD-253F",
			"RD-103",
			"RD-503",
			"RD-222",
			"RD-200",
			"RD-250P",
			"S5.19",
			"RD-253",
			"RD-103M",
			"RD-213 (D-13)",
			"RD-161P",
			"RD-134",
			"RD-210",
			"RD-109",
			"RD-268",
			"S5.92",
			"RD-512",
			"RD-1",
			"RD-106",
			"RD-114",
			"RD-110",
			"RD-105",
			"RD-107A",
			"RD-2",
			"RD-119",
			"RD-117",
			"RD-301",
			"RD-280",
			"RD-211",
			"RD-303",
			"RD-263",
			"RD-220",
			"RD-161",
			"RD-212 (D-41)",
			"RD-273",
			"RD-511",
			"RD-250",
			"RD-510",
			"RD-214",
			"RD-302",
			"Rocketdyne RS-27A",
			"RD-169",
			"RL10",
			"RD-120K",
			"RD-502",
			"RD-100",
			"RD-112",
			"RD-191",
			"RD-133",
			"RD-1KhZ",
			"RD-182",
			"RD-350",
			"RD-275",
			"RD-107",
			"RD-118"
		],
		"function": "<=",
		"commonness": -17.64384904839814,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.bipropellant_rocket_engine",
					"class": "spaceflight.bipropellant_rocket_engine",
					"friendly_name": "Bipropellant rocket engine",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "1.85^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "1.85",
					"question_node": 0,
					"function": "<="
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket_engine.diameter",
					"friendly_name": "Diameter"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.bipropellant_rocket_engine . \nFILTER (?x1 <= 1.85)\n?x0 :spaceflight.rocket_engine.diameter ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 129000100,
		"question": "which biopropellant rocket engines have a diameter no larger than 1.85 m?",
		"answer": [
			"RD-512",
			"RD-118",
			"RL10",
			"RD-1KhZ",
			"RD-214U",
			"RD-301",
			"RD-114",
			"RD-107A",
			"RD-250",
			"RD-213 (D-13)",
			"RD-105",
			"RD-182",
			"RD-120K",
			"RD-253F",
			"S5.92",
			"RD-214F",
			"RD-280",
			"RD-303",
			"RD-214",
			"S5.19",
			"RD-211",
			"RD-222",
			"RD-133",
			"RD-169",
			"RD-161",
			"RD-268",
			"RD-275",
			"RD-103",
			"RD-510",
			"RD-220",
			"RD-110",
			"RD-2",
			"RD-134",
			"RD-511",
			"RD-106",
			"RD-101",
			"RD-103M",
			"RD-1",
			"RD-503",
			"RD-109",
			"RD-263",
			"RD-502",
			"RD-350",
			"RD-250P",
			"RD-212 (D-41)",
			"RD-253",
			"RD-200",
			"RD-210",
			"RD-100",
			"RD-302",
			"RD-273",
			"RD-191",
			"Rocketdyne RS-27A",
			"RD-250M",
			"RD-112",
			"RD-117",
			"RD-107",
			"RD-119",
			"RD-161P"
		],
		"function": "<=",
		"commonness": -17.64384904839814,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.bipropellant_rocket_engine",
					"class": "spaceflight.bipropellant_rocket_engine",
					"friendly_name": "Bipropellant rocket engine",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "1.85^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "1.85",
					"question_node": 0,
					"function": "<="
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket_engine.diameter",
					"friendly_name": "Diameter"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.bipropellant_rocket_engine . \nFILTER (?x1 <= 1.85)\n?x0 :spaceflight.rocket_engine.diameter ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 129000200,
		"question": "which biopropellance rocket engines have a diameter of 1.85 meters or less?",
		"answer": [
			"RD-107",
			"RD-350",
			"RD-107A",
			"RD-211",
			"RD-212 (D-41)",
			"RD-301",
			"RD-120K",
			"S5.19",
			"RD-114",
			"RD-191",
			"RD-106",
			"RD-268",
			"RD-214F",
			"RD-511",
			"RD-119",
			"RD-263",
			"RD-253F",
			"RD-169",
			"RD-250P",
			"RD-1KhZ",
			"RD-222",
			"RD-275",
			"RD-105",
			"RD-250M",
			"Rocketdyne RS-27A",
			"RD-510",
			"RD-503",
			"RD-134",
			"RD-200",
			"RD-133",
			"RD-161P",
			"RD-302",
			"RD-213 (D-13)",
			"RD-214",
			"RD-101",
			"RD-118",
			"RD-214U",
			"RD-109",
			"RD-103M",
			"RL10",
			"RD-112",
			"RD-502",
			"RD-280",
			"RD-512",
			"RD-110",
			"RD-250",
			"RD-2",
			"RD-103",
			"RD-161",
			"RD-210",
			"RD-182",
			"RD-303",
			"RD-253",
			"RD-117",
			"RD-220",
			"RD-273",
			"S5.92",
			"RD-100",
			"RD-1"
		],
		"function": "<=",
		"commonness": -17.64384904839814,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.bipropellant_rocket_engine",
					"class": "spaceflight.bipropellant_rocket_engine",
					"friendly_name": "Bipropellant rocket engine",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "1.85^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "1.85",
					"question_node": 0,
					"function": "<="
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket_engine.diameter",
					"friendly_name": "Diameter"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.bipropellant_rocket_engine . \nFILTER (?x1 <= 1.85)\n?x0 :spaceflight.rocket_engine.diameter ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 129000300,
		"question": "what engines for biopropellant rockets are no longer than 1.85 m?",
		"answer": [
			"RD-110",
			"RD-301",
			"RD-280",
			"RD-212 (D-41)",
			"RD-118",
			"RD-1",
			"RD-161P",
			"RD-105",
			"RD-2",
			"RD-503",
			"RD-211",
			"RD-109",
			"RD-250",
			"RD-273",
			"RD-200",
			"RD-103",
			"RD-253F",
			"RD-250M",
			"RD-268",
			"RD-275",
			"Rocketdyne RS-27A",
			"S5.92",
			"RD-119",
			"RD-106",
			"RD-213 (D-13)",
			"RD-120K",
			"RD-214F",
			"RD-100",
			"RD-103M",
			"RD-222",
			"RD-107",
			"RD-169",
			"RD-512",
			"RD-133",
			"RD-182",
			"RD-303",
			"RD-220",
			"RD-101",
			"RD-107A",
			"RD-210",
			"S5.19",
			"RD-510",
			"RD-112",
			"RD-161",
			"RD-253",
			"RD-134",
			"RD-214",
			"RD-114",
			"RD-511",
			"RD-302",
			"RD-117",
			"RD-263",
			"RL10",
			"RD-350",
			"RD-1KhZ",
			"RD-502",
			"RD-250P",
			"RD-214U",
			"RD-191"
		],
		"function": "<=",
		"commonness": -17.64384904839814,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.bipropellant_rocket_engine",
					"class": "spaceflight.bipropellant_rocket_engine",
					"friendly_name": "Bipropellant rocket engine",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "1.85^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "1.85",
					"question_node": 0,
					"function": "<="
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket_engine.diameter",
					"friendly_name": "Diameter"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.bipropellant_rocket_engine . \nFILTER (?x1 <= 1.85)\n?x0 :spaceflight.rocket_engine.diameter ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 130000000,
		"question": "bat acts as a disease vector for how many diseases?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -15.511404288060435,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.infectious_disease",
					"class": "medicine.infectious_disease",
					"friendly_name": "Infectious Disease",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.bat",
					"class": "medicine.vector_of_disease",
					"friendly_name": "Bat",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "medicine.vector_of_disease.disease",
					"friendly_name": "Disease(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.infectious_disease . \nVALUES ?x1 { :en.bat } \n?x1 :medicine.vector_of_disease.disease ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 130000001,
		"question": "bats acts as a disease vector for how many diseases?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -15.511404288060435,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.infectious_disease",
					"class": "medicine.infectious_disease",
					"friendly_name": "Infectious Disease",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.bat",
					"class": "medicine.vector_of_disease",
					"friendly_name": "bats",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "medicine.vector_of_disease.disease",
					"friendly_name": "Disease(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.infectious_disease . \nVALUES ?x1 { :en.bat } \n?x1 :medicine.vector_of_disease.disease ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 130000100,
		"question": "how many diseases are spread via bats?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -15.511404288060435,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.infectious_disease",
					"class": "medicine.infectious_disease",
					"friendly_name": "Infectious Disease",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.bat",
					"class": "medicine.vector_of_disease",
					"friendly_name": "Bat",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "medicine.vector_of_disease.disease",
					"friendly_name": "Disease(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.infectious_disease . \nVALUES ?x1 { :en.bat } \n?x1 :medicine.vector_of_disease.disease ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 130000101,
		"question": "how many diseases are spread via batss?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -15.511404288060435,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.infectious_disease",
					"class": "medicine.infectious_disease",
					"friendly_name": "Infectious Disease",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.bat",
					"class": "medicine.vector_of_disease",
					"friendly_name": "bats",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "medicine.vector_of_disease.disease",
					"friendly_name": "Disease(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.infectious_disease . \nVALUES ?x1 { :en.bat } \n?x1 :medicine.vector_of_disease.disease ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 130000102,
		"question": "how many diseases are spread via chiropteras?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -15.511404288060435,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.infectious_disease",
					"class": "medicine.infectious_disease",
					"friendly_name": "Infectious Disease",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.bat",
					"class": "medicine.vector_of_disease",
					"friendly_name": "chiroptera",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "medicine.vector_of_disease.disease",
					"friendly_name": "Disease(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.infectious_disease . \nVALUES ?x1 { :en.bat } \n?x1 :medicine.vector_of_disease.disease ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 130000200,
		"question": "bats can spread how many diseases?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -15.511404288060435,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.infectious_disease",
					"class": "medicine.infectious_disease",
					"friendly_name": "Infectious Disease",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.bat",
					"class": "medicine.vector_of_disease",
					"friendly_name": "Bat",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "medicine.vector_of_disease.disease",
					"friendly_name": "Disease(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.infectious_disease . \nVALUES ?x1 { :en.bat } \n?x1 :medicine.vector_of_disease.disease ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 130000201,
		"question": "batss can spread how many diseases?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -15.511404288060435,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.infectious_disease",
					"class": "medicine.infectious_disease",
					"friendly_name": "Infectious Disease",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.bat",
					"class": "medicine.vector_of_disease",
					"friendly_name": "bats",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "medicine.vector_of_disease.disease",
					"friendly_name": "Disease(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.infectious_disease . \nVALUES ?x1 { :en.bat } \n?x1 :medicine.vector_of_disease.disease ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 130000202,
		"question": "chiropteras can spread how many diseases?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -15.511404288060435,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.infectious_disease",
					"class": "medicine.infectious_disease",
					"friendly_name": "Infectious Disease",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.bat",
					"class": "medicine.vector_of_disease",
					"friendly_name": "chiroptera",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "medicine.vector_of_disease.disease",
					"friendly_name": "Disease(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.infectious_disease . \nVALUES ?x1 { :en.bat } \n?x1 :medicine.vector_of_disease.disease ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 130000300,
		"question": "how many infectious diseases are carried by bat?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -15.511404288060435,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.infectious_disease",
					"class": "medicine.infectious_disease",
					"friendly_name": "Infectious Disease",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.bat",
					"class": "medicine.vector_of_disease",
					"friendly_name": "Bat",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "medicine.vector_of_disease.disease",
					"friendly_name": "Disease(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.infectious_disease . \nVALUES ?x1 { :en.bat } \n?x1 :medicine.vector_of_disease.disease ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 130000301,
		"question": "how many infectious diseases are carried by bats?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -15.511404288060435,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.infectious_disease",
					"class": "medicine.infectious_disease",
					"friendly_name": "Infectious Disease",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.bat",
					"class": "medicine.vector_of_disease",
					"friendly_name": "bats",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "medicine.vector_of_disease.disease",
					"friendly_name": "Disease(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.infectious_disease . \nVALUES ?x1 { :en.bat } \n?x1 :medicine.vector_of_disease.disease ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]