[
	{
		"qid": 249000501,
		"question": "of all golf courses designed by nicklaus in 2003, which has the largest number of par?",
		"answer": [
			"Bull Golf Course",
			"The Sagamore Golf Course",
			"Longview Golf Course"
		],
		"function": "argmax",
		"commonness": -36.10002195245568,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.golf_course",
					"class": "sports.golf_course",
					"friendly_name": "Golf Course",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.jack_nicklaus",
					"class": "sports.golf_course_designer",
					"friendly_name": "nicklaus",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "2003^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "2003",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "literal",
					"id": "0",
					"class": "type.int",
					"friendly_name": "0",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "sports.golf_course_designer.golf_courses",
					"friendly_name": "Golf Courses Designed"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "sports.golf_course.year_built",
					"friendly_name": "Year Built"
				},
				{
					"start": 0,
					"end": 3,
					"relation": "sports.golf_course.par",
					"friendly_name": "Par"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.golf_course . \nVALUES ?x1 { :en.jack_nicklaus } \nVALUES ?x2 { \"2003\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n{\nSELECT (MAX(?y3) AS ?x3)  WHERE { \n?y0 :type.object.type :sports.golf_course . \nVALUES ?y1 { :en.jack_nicklaus } \nVALUES ?y2 { \"2003\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?y1 :sports.golf_course_designer.golf_courses ?y0 . \n?y0 :sports.golf_course.year_built ?y2 . \n?y0 :sports.golf_course.par ?y3 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y0 != ?y3 && ?y1 != ?y2 && ?y1 != ?y3 && ?y2 != ?y3  )\n}\n}\n?x1 :sports.golf_course_designer.golf_courses ?x0 . \n?x0 :sports.golf_course.year_built ?x2 . \n?x0 :sports.golf_course.par ?x3 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 249000502,
		"question": "of all golf courses designed by jack william nicklaus in 2003, which has the largest number of par?",
		"answer": [
			"Longview Golf Course",
			"The Sagamore Golf Course",
			"Bull Golf Course"
		],
		"function": "argmax",
		"commonness": -36.10002195245568,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.golf_course",
					"class": "sports.golf_course",
					"friendly_name": "Golf Course",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.jack_nicklaus",
					"class": "sports.golf_course_designer",
					"friendly_name": "jack william nicklaus",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "2003^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "2003",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "literal",
					"id": "0",
					"class": "type.int",
					"friendly_name": "0",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "sports.golf_course_designer.golf_courses",
					"friendly_name": "Golf Courses Designed"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "sports.golf_course.year_built",
					"friendly_name": "Year Built"
				},
				{
					"start": 0,
					"end": 3,
					"relation": "sports.golf_course.par",
					"friendly_name": "Par"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.golf_course . \nVALUES ?x1 { :en.jack_nicklaus } \nVALUES ?x2 { \"2003\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n{\nSELECT (MAX(?y3) AS ?x3)  WHERE { \n?y0 :type.object.type :sports.golf_course . \nVALUES ?y1 { :en.jack_nicklaus } \nVALUES ?y2 { \"2003\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?y1 :sports.golf_course_designer.golf_courses ?y0 . \n?y0 :sports.golf_course.year_built ?y2 . \n?y0 :sports.golf_course.par ?y3 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y0 != ?y3 && ?y1 != ?y2 && ?y1 != ?y3 && ?y2 != ?y3  )\n}\n}\n?x1 :sports.golf_course_designer.golf_courses ?x0 . \n?x0 :sports.golf_course.year_built ?x2 . \n?x0 :sports.golf_course.par ?x3 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 250000000,
		"question": "hailing from the same place as 1st louisiana native guard, which military units took part in the battle of gettysburg?",
		"answer": [
			"14th Louisiana Infantry Regiment",
			"10th Louisiana Infantry",
			"15th Louisiana Infantry Regiment"
		],
		"function": "none",
		"commonness": -39.21320322942388,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancivilwar.military_unit",
					"class": "base.americancivilwar.military_unit",
					"friendly_name": "American Civil War Military Unit",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "military.military_unit_place_of_origin",
					"class": "military.military_unit_place_of_origin",
					"friendly_name": "Military unit place of origin",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.battle_of_gettysburg",
					"class": "base.americancivilwar.battle",
					"friendly_name": "Battle of Gettysburg",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "m.0hr6dl9",
					"class": "base.americancivilwar.military_unit",
					"friendly_name": "1st Louisiana Native Guard",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "military.military_unit.place_of_origin",
					"friendly_name": "Place of origin"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.americancivilwar.military_unit.conflicts_participated_in",
					"friendly_name": "Conflict(s) participated in"
				},
				{
					"start": 3,
					"end": 1,
					"relation": "military.military_unit.place_of_origin",
					"friendly_name": "Place of origin"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancivilwar.military_unit . \n?x1 :type.object.type :military.military_unit_place_of_origin . \nVALUES ?x2 { :en.battle_of_gettysburg } \nVALUES ?x3 { :m.0hr6dl9 } \n?x0 :military.military_unit.place_of_origin ?x1 . \n?x0 :base.americancivilwar.military_unit.conflicts_participated_in ?x2 . \n?x3 :military.military_unit.place_of_origin ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 250000001,
		"question": "hailing from the same place as 1st louisiana native guard, which military units took part in the gettysburg battle?",
		"answer": [
			"15th Louisiana Infantry Regiment",
			"10th Louisiana Infantry",
			"14th Louisiana Infantry Regiment"
		],
		"function": "none",
		"commonness": -39.21320322942388,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancivilwar.military_unit",
					"class": "base.americancivilwar.military_unit",
					"friendly_name": "American Civil War Military Unit",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "military.military_unit_place_of_origin",
					"class": "military.military_unit_place_of_origin",
					"friendly_name": "Military unit place of origin",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.battle_of_gettysburg",
					"class": "base.americancivilwar.battle",
					"friendly_name": "gettysburg battle",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "m.0hr6dl9",
					"class": "base.americancivilwar.military_unit",
					"friendly_name": "1st Louisiana Native Guard",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "military.military_unit.place_of_origin",
					"friendly_name": "Place of origin"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.americancivilwar.military_unit.conflicts_participated_in",
					"friendly_name": "Conflict(s) participated in"
				},
				{
					"start": 3,
					"end": 1,
					"relation": "military.military_unit.place_of_origin",
					"friendly_name": "Place of origin"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancivilwar.military_unit . \n?x1 :type.object.type :military.military_unit_place_of_origin . \nVALUES ?x2 { :en.battle_of_gettysburg } \nVALUES ?x3 { :m.0hr6dl9 } \n?x0 :military.military_unit.place_of_origin ?x1 . \n?x0 :base.americancivilwar.military_unit.conflicts_participated_in ?x2 . \n?x3 :military.military_unit.place_of_origin ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 250000100,
		"question": "which military units who fought in the battle of gettysburg come from the same place as 1st louisiana native guard?",
		"answer": [
			"15th Louisiana Infantry Regiment",
			"10th Louisiana Infantry",
			"14th Louisiana Infantry Regiment"
		],
		"function": "none",
		"commonness": -39.21320322942388,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancivilwar.military_unit",
					"class": "base.americancivilwar.military_unit",
					"friendly_name": "American Civil War Military Unit",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "military.military_unit_place_of_origin",
					"class": "military.military_unit_place_of_origin",
					"friendly_name": "Military unit place of origin",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.battle_of_gettysburg",
					"class": "base.americancivilwar.battle",
					"friendly_name": "Battle of Gettysburg",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "m.0hr6dl9",
					"class": "base.americancivilwar.military_unit",
					"friendly_name": "1st Louisiana Native Guard",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "military.military_unit.place_of_origin",
					"friendly_name": "Place of origin"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.americancivilwar.military_unit.conflicts_participated_in",
					"friendly_name": "Conflict(s) participated in"
				},
				{
					"start": 3,
					"end": 1,
					"relation": "military.military_unit.place_of_origin",
					"friendly_name": "Place of origin"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancivilwar.military_unit . \n?x1 :type.object.type :military.military_unit_place_of_origin . \nVALUES ?x2 { :en.battle_of_gettysburg } \nVALUES ?x3 { :m.0hr6dl9 } \n?x0 :military.military_unit.place_of_origin ?x1 . \n?x0 :base.americancivilwar.military_unit.conflicts_participated_in ?x2 . \n?x3 :military.military_unit.place_of_origin ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 250000101,
		"question": "which military units who fought in the gettysburg battle come from the same place as 1st louisiana native guard?",
		"answer": [
			"15th Louisiana Infantry Regiment",
			"14th Louisiana Infantry Regiment",
			"10th Louisiana Infantry"
		],
		"function": "none",
		"commonness": -39.21320322942388,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancivilwar.military_unit",
					"class": "base.americancivilwar.military_unit",
					"friendly_name": "American Civil War Military Unit",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "military.military_unit_place_of_origin",
					"class": "military.military_unit_place_of_origin",
					"friendly_name": "Military unit place of origin",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.battle_of_gettysburg",
					"class": "base.americancivilwar.battle",
					"friendly_name": "gettysburg battle",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "m.0hr6dl9",
					"class": "base.americancivilwar.military_unit",
					"friendly_name": "1st Louisiana Native Guard",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "military.military_unit.place_of_origin",
					"friendly_name": "Place of origin"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.americancivilwar.military_unit.conflicts_participated_in",
					"friendly_name": "Conflict(s) participated in"
				},
				{
					"start": 3,
					"end": 1,
					"relation": "military.military_unit.place_of_origin",
					"friendly_name": "Place of origin"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancivilwar.military_unit . \n?x1 :type.object.type :military.military_unit_place_of_origin . \nVALUES ?x2 { :en.battle_of_gettysburg } \nVALUES ?x3 { :m.0hr6dl9 } \n?x0 :military.military_unit.place_of_origin ?x1 . \n?x0 :base.americancivilwar.military_unit.conflicts_participated_in ?x2 . \n?x3 :military.military_unit.place_of_origin ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 250000300,
		"question": "which military groups were from the same place as 1st louisiana native guard and were at the battle of gettysburg?",
		"answer": [
			"10th Louisiana Infantry",
			"15th Louisiana Infantry Regiment",
			"14th Louisiana Infantry Regiment"
		],
		"function": "none",
		"commonness": -39.21320322942388,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancivilwar.military_unit",
					"class": "base.americancivilwar.military_unit",
					"friendly_name": "American Civil War Military Unit",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "military.military_unit_place_of_origin",
					"class": "military.military_unit_place_of_origin",
					"friendly_name": "Military unit place of origin",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.battle_of_gettysburg",
					"class": "base.americancivilwar.battle",
					"friendly_name": "Battle of Gettysburg",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "m.0hr6dl9",
					"class": "base.americancivilwar.military_unit",
					"friendly_name": "1st Louisiana Native Guard",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "military.military_unit.place_of_origin",
					"friendly_name": "Place of origin"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.americancivilwar.military_unit.conflicts_participated_in",
					"friendly_name": "Conflict(s) participated in"
				},
				{
					"start": 3,
					"end": 1,
					"relation": "military.military_unit.place_of_origin",
					"friendly_name": "Place of origin"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancivilwar.military_unit . \n?x1 :type.object.type :military.military_unit_place_of_origin . \nVALUES ?x2 { :en.battle_of_gettysburg } \nVALUES ?x3 { :m.0hr6dl9 } \n?x0 :military.military_unit.place_of_origin ?x1 . \n?x0 :base.americancivilwar.military_unit.conflicts_participated_in ?x2 . \n?x3 :military.military_unit.place_of_origin ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 250000301,
		"question": "which military groups were from the same place as 1st louisiana native guard and were at the gettysburg battle?",
		"answer": [
			"15th Louisiana Infantry Regiment",
			"14th Louisiana Infantry Regiment",
			"10th Louisiana Infantry"
		],
		"function": "none",
		"commonness": -39.21320322942388,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancivilwar.military_unit",
					"class": "base.americancivilwar.military_unit",
					"friendly_name": "American Civil War Military Unit",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "military.military_unit_place_of_origin",
					"class": "military.military_unit_place_of_origin",
					"friendly_name": "Military unit place of origin",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.battle_of_gettysburg",
					"class": "base.americancivilwar.battle",
					"friendly_name": "gettysburg battle",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "m.0hr6dl9",
					"class": "base.americancivilwar.military_unit",
					"friendly_name": "1st Louisiana Native Guard",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "military.military_unit.place_of_origin",
					"friendly_name": "Place of origin"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.americancivilwar.military_unit.conflicts_participated_in",
					"friendly_name": "Conflict(s) participated in"
				},
				{
					"start": 3,
					"end": 1,
					"relation": "military.military_unit.place_of_origin",
					"friendly_name": "Place of origin"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancivilwar.military_unit . \n?x1 :type.object.type :military.military_unit_place_of_origin . \nVALUES ?x2 { :en.battle_of_gettysburg } \nVALUES ?x3 { :m.0hr6dl9 } \n?x0 :military.military_unit.place_of_origin ?x1 . \n?x0 :base.americancivilwar.military_unit.conflicts_participated_in ?x2 . \n?x3 :military.military_unit.place_of_origin ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 250000400,
		"question": "which military units participated in the battle of gettysburg are from the same place as 1st louisiana native guard?",
		"answer": [
			"14th Louisiana Infantry Regiment",
			"10th Louisiana Infantry",
			"15th Louisiana Infantry Regiment"
		],
		"function": "none",
		"commonness": -39.21320322942388,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancivilwar.military_unit",
					"class": "base.americancivilwar.military_unit",
					"friendly_name": "American Civil War Military Unit",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "military.military_unit_place_of_origin",
					"class": "military.military_unit_place_of_origin",
					"friendly_name": "Military unit place of origin",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.battle_of_gettysburg",
					"class": "base.americancivilwar.battle",
					"friendly_name": "Battle of Gettysburg",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "m.0hr6dl9",
					"class": "base.americancivilwar.military_unit",
					"friendly_name": "1st Louisiana Native Guard",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "military.military_unit.place_of_origin",
					"friendly_name": "Place of origin"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.americancivilwar.military_unit.conflicts_participated_in",
					"friendly_name": "Conflict(s) participated in"
				},
				{
					"start": 3,
					"end": 1,
					"relation": "military.military_unit.place_of_origin",
					"friendly_name": "Place of origin"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancivilwar.military_unit . \n?x1 :type.object.type :military.military_unit_place_of_origin . \nVALUES ?x2 { :en.battle_of_gettysburg } \nVALUES ?x3 { :m.0hr6dl9 } \n?x0 :military.military_unit.place_of_origin ?x1 . \n?x0 :base.americancivilwar.military_unit.conflicts_participated_in ?x2 . \n?x3 :military.military_unit.place_of_origin ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 250000401,
		"question": "which military units participated in the gettysburg battle are from the same place as 1st louisiana native guard?",
		"answer": [
			"14th Louisiana Infantry Regiment",
			"15th Louisiana Infantry Regiment",
			"10th Louisiana Infantry"
		],
		"function": "none",
		"commonness": -39.21320322942388,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancivilwar.military_unit",
					"class": "base.americancivilwar.military_unit",
					"friendly_name": "American Civil War Military Unit",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "military.military_unit_place_of_origin",
					"class": "military.military_unit_place_of_origin",
					"friendly_name": "Military unit place of origin",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.battle_of_gettysburg",
					"class": "base.americancivilwar.battle",
					"friendly_name": "gettysburg battle",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "m.0hr6dl9",
					"class": "base.americancivilwar.military_unit",
					"friendly_name": "1st Louisiana Native Guard",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "military.military_unit.place_of_origin",
					"friendly_name": "Place of origin"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.americancivilwar.military_unit.conflicts_participated_in",
					"friendly_name": "Conflict(s) participated in"
				},
				{
					"start": 3,
					"end": 1,
					"relation": "military.military_unit.place_of_origin",
					"friendly_name": "Place of origin"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancivilwar.military_unit . \n?x1 :type.object.type :military.military_unit_place_of_origin . \nVALUES ?x2 { :en.battle_of_gettysburg } \nVALUES ?x3 { :m.0hr6dl9 } \n?x0 :military.military_unit.place_of_origin ?x1 . \n?x0 :base.americancivilwar.military_unit.conflicts_participated_in ?x2 . \n?x3 :military.military_unit.place_of_origin ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 250000500,
		"question": "list down all the military units which participated in the battle of gettysburg and are from the same place as 1st louisiana native guard?",
		"answer": [
			"14th Louisiana Infantry Regiment",
			"10th Louisiana Infantry",
			"15th Louisiana Infantry Regiment"
		],
		"function": "none",
		"commonness": -39.21320322942388,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancivilwar.military_unit",
					"class": "base.americancivilwar.military_unit",
					"friendly_name": "American Civil War Military Unit",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "military.military_unit_place_of_origin",
					"class": "military.military_unit_place_of_origin",
					"friendly_name": "Military unit place of origin",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.battle_of_gettysburg",
					"class": "base.americancivilwar.battle",
					"friendly_name": "Battle of Gettysburg",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "m.0hr6dl9",
					"class": "base.americancivilwar.military_unit",
					"friendly_name": "1st Louisiana Native Guard",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "military.military_unit.place_of_origin",
					"friendly_name": "Place of origin"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.americancivilwar.military_unit.conflicts_participated_in",
					"friendly_name": "Conflict(s) participated in"
				},
				{
					"start": 3,
					"end": 1,
					"relation": "military.military_unit.place_of_origin",
					"friendly_name": "Place of origin"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancivilwar.military_unit . \n?x1 :type.object.type :military.military_unit_place_of_origin . \nVALUES ?x2 { :en.battle_of_gettysburg } \nVALUES ?x3 { :m.0hr6dl9 } \n?x0 :military.military_unit.place_of_origin ?x1 . \n?x0 :base.americancivilwar.military_unit.conflicts_participated_in ?x2 . \n?x3 :military.military_unit.place_of_origin ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 250000501,
		"question": "list down all the military units which participated in the gettysburg battle and are from the same place as 1st louisiana native guard?",
		"answer": [
			"14th Louisiana Infantry Regiment",
			"15th Louisiana Infantry Regiment",
			"10th Louisiana Infantry"
		],
		"function": "none",
		"commonness": -39.21320322942388,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancivilwar.military_unit",
					"class": "base.americancivilwar.military_unit",
					"friendly_name": "American Civil War Military Unit",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "military.military_unit_place_of_origin",
					"class": "military.military_unit_place_of_origin",
					"friendly_name": "Military unit place of origin",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.battle_of_gettysburg",
					"class": "base.americancivilwar.battle",
					"friendly_name": "gettysburg battle",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "m.0hr6dl9",
					"class": "base.americancivilwar.military_unit",
					"friendly_name": "1st Louisiana Native Guard",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "military.military_unit.place_of_origin",
					"friendly_name": "Place of origin"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.americancivilwar.military_unit.conflicts_participated_in",
					"friendly_name": "Conflict(s) participated in"
				},
				{
					"start": 3,
					"end": 1,
					"relation": "military.military_unit.place_of_origin",
					"friendly_name": "Place of origin"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancivilwar.military_unit . \n?x1 :type.object.type :military.military_unit_place_of_origin . \nVALUES ?x2 { :en.battle_of_gettysburg } \nVALUES ?x3 { :m.0hr6dl9 } \n?x0 :military.military_unit.place_of_origin ?x1 . \n?x0 :base.americancivilwar.military_unit.conflicts_participated_in ?x2 . \n?x3 :military.military_unit.place_of_origin ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	}
]