[
	{
		"qid": 226000500,
		"question": "what other games did the company that made dungeons & dragons make?",
		"answer": [
			"Dune",
			"Gamma World",
			"Star Wars Trading Card Game",
			"RoboRally",
			"Dungeons & Dragons Miniatures Game",
			"d20 System",
			"Duel Masters Trading Card Game",
			"Dungeons & Dragons (4th Edition)",
			"Star Wars Miniatures",
			"Dreamblade",
			"Advanced Dungeons & Dragons 2nd Edition",
			"d20 Modern",
			"Dungeons & Dragons Expert Set",
			"Blood Wars",
			"The Simpsons Trading Card Game",
			"Magic: The Gathering",
			"MLB Showdown",
			"Dungeons & Dragons Basic Game",
			"BattleTech Collectible Card Game",
			"Netrunner",
			"Codename: Kids Next Door Trading Card Game",
			"Doomtown",
			"Dungeons & Dragons (3rd Edition)",
			"Chainmail",
			"NBA Showdown",
			"Dungeons & Dragons Basic Set",
			"Advanced Dungeons & Dragons",
			"Indiana Jones",
			"Axis & Allies: D-Day",
			"Hecatomb",
			"Pokémon Trading Card Game",
			"Axis & Allies: Europe",
			"Pivot",
			"Xiaolin Showdown Trading Card Game",
			"Neopets Trading Card Game",
			"Filthy Rich",
			"Castle Ravenloft Board Game",
			"NFL Showdown",
			"Cavaliers and Roundheads"
		],
		"function": "none",
		"commonness": -22.65814471208033,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "games.game",
					"class": "games.game",
					"friendly_name": "Game",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "games.game_publisher",
					"class": "games.game_publisher",
					"friendly_name": "Game publisher",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.dungeons_dragons",
					"class": "games.game",
					"friendly_name": "Dungeons & Dragons",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "games.game.publisher",
					"friendly_name": "Publisher"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "games.game_publisher.games_published",
					"friendly_name": "Games published"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :games.game . \n?x1 :type.object.type :games.game_publisher . \nVALUES ?x2 { :en.dungeons_dragons } \n?x0 :games.game.publisher ?x1 . \n?x1 :games.game_publisher.games_published ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 226000501,
		"question": "what other games did the company that made d&d make?",
		"answer": [
			"Dreamblade",
			"Duel Masters Trading Card Game",
			"Dungeons & Dragons Basic Game",
			"Cavaliers and Roundheads",
			"Filthy Rich",
			"RoboRally",
			"Indiana Jones",
			"NFL Showdown",
			"d20 Modern",
			"Dungeons & Dragons Miniatures Game",
			"Pivot",
			"BattleTech Collectible Card Game",
			"Xiaolin Showdown Trading Card Game",
			"Blood Wars",
			"Dune",
			"Dungeons & Dragons (4th Edition)",
			"Magic: The Gathering",
			"Dungeons & Dragons (3rd Edition)",
			"NBA Showdown",
			"Hecatomb",
			"The Simpsons Trading Card Game",
			"Dungeons & Dragons Basic Set",
			"Netrunner",
			"Gamma World",
			"Dungeons & Dragons Expert Set",
			"Axis & Allies: Europe",
			"Advanced Dungeons & Dragons 2nd Edition",
			"Doomtown",
			"MLB Showdown",
			"Chainmail",
			"Pokémon Trading Card Game",
			"Castle Ravenloft Board Game",
			"Codename: Kids Next Door Trading Card Game",
			"Neopets Trading Card Game",
			"Star Wars Trading Card Game",
			"Advanced Dungeons & Dragons",
			"Star Wars Miniatures",
			"Axis & Allies: D-Day",
			"d20 System"
		],
		"function": "none",
		"commonness": -22.65814471208033,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "games.game",
					"class": "games.game",
					"friendly_name": "Game",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "games.game_publisher",
					"class": "games.game_publisher",
					"friendly_name": "Game publisher",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.dungeons_dragons",
					"class": "games.game",
					"friendly_name": "d&d",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "games.game.publisher",
					"friendly_name": "Publisher"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "games.game_publisher.games_published",
					"friendly_name": "Games published"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :games.game . \n?x1 :type.object.type :games.game_publisher . \nVALUES ?x2 { :en.dungeons_dragons } \n?x0 :games.game.publisher ?x1 . \n?x1 :games.game_publisher.games_published ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 226000502,
		"question": "what other games did the company that made dungeons and dragons make?",
		"answer": [
			"Dungeons & Dragons Expert Set",
			"Dune",
			"RoboRally",
			"Doomtown",
			"Dungeons & Dragons Miniatures Game",
			"Chainmail",
			"Neopets Trading Card Game",
			"Dreamblade",
			"Codename: Kids Next Door Trading Card Game",
			"Advanced Dungeons & Dragons",
			"Castle Ravenloft Board Game",
			"NFL Showdown",
			"Star Wars Miniatures",
			"Axis & Allies: Europe",
			"Netrunner",
			"Indiana Jones",
			"Hecatomb",
			"Magic: The Gathering",
			"Advanced Dungeons & Dragons 2nd Edition",
			"Dungeons & Dragons Basic Set",
			"Blood Wars",
			"Gamma World",
			"Dungeons & Dragons (4th Edition)",
			"The Simpsons Trading Card Game",
			"d20 System",
			"BattleTech Collectible Card Game",
			"d20 Modern",
			"Duel Masters Trading Card Game",
			"Dungeons & Dragons (3rd Edition)",
			"Dungeons & Dragons Basic Game",
			"MLB Showdown",
			"Star Wars Trading Card Game",
			"Axis & Allies: D-Day",
			"Cavaliers and Roundheads",
			"Filthy Rich",
			"Pivot",
			"Pokémon Trading Card Game",
			"Xiaolin Showdown Trading Card Game",
			"NBA Showdown"
		],
		"function": "none",
		"commonness": -22.65814471208033,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "games.game",
					"class": "games.game",
					"friendly_name": "Game",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "games.game_publisher",
					"class": "games.game_publisher",
					"friendly_name": "Game publisher",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.dungeons_dragons",
					"class": "games.game",
					"friendly_name": "dungeons and dragons",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "games.game.publisher",
					"friendly_name": "Publisher"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "games.game_publisher.games_published",
					"friendly_name": "Games published"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :games.game . \n?x1 :type.object.type :games.game_publisher . \nVALUES ?x2 { :en.dungeons_dragons } \n?x0 :games.game.publisher ?x1 . \n?x1 :games.game_publisher.games_published ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 227000000,
		"question": "who are the sponsors of major league baseball",
		"answer": [
			"Fujifilm"
		],
		"function": "none",
		"commonness": -18.06442429580015,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "business.sponsor",
					"class": "business.sponsor",
					"friendly_name": "Sponsor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "business.sponsorship",
					"class": "business.sponsorship",
					"friendly_name": "Sponsorship",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.major_league_baseball",
					"class": "business.sponsored_recipient",
					"friendly_name": "Major League Baseball",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "business.sponsor.sponsorship",
					"friendly_name": "Sponsorship"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "business.sponsorship.sponsored_recipient",
					"friendly_name": "Sponsored Recipient"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :business.sponsor . \n?x1 :type.object.type :business.sponsorship . \nVALUES ?x2 { :en.major_league_baseball } \n?x0 :business.sponsor.sponsorship ?x1 . \n?x1 :business.sponsorship.sponsored_recipient ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 227000100,
		"question": "what are major league baseball's sponsors?",
		"answer": [
			"Fujifilm"
		],
		"function": "none",
		"commonness": -18.06442429580015,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "business.sponsor",
					"class": "business.sponsor",
					"friendly_name": "Sponsor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "business.sponsorship",
					"class": "business.sponsorship",
					"friendly_name": "Sponsorship",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.major_league_baseball",
					"class": "business.sponsored_recipient",
					"friendly_name": "Major League Baseball",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "business.sponsor.sponsorship",
					"friendly_name": "Sponsorship"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "business.sponsorship.sponsored_recipient",
					"friendly_name": "Sponsored Recipient"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :business.sponsor . \n?x1 :type.object.type :business.sponsorship . \nVALUES ?x2 { :en.major_league_baseball } \n?x0 :business.sponsor.sponsorship ?x1 . \n?x1 :business.sponsorship.sponsored_recipient ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 227000101,
		"question": "what are mlb's sponsors?",
		"answer": [
			"Fujifilm"
		],
		"function": "none",
		"commonness": -18.06442429580015,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "business.sponsor",
					"class": "business.sponsor",
					"friendly_name": "Sponsor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "business.sponsorship",
					"class": "business.sponsorship",
					"friendly_name": "Sponsorship",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.major_league_baseball",
					"class": "business.sponsored_recipient",
					"friendly_name": "mlb",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "business.sponsor.sponsorship",
					"friendly_name": "Sponsorship"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "business.sponsorship.sponsored_recipient",
					"friendly_name": "Sponsored Recipient"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :business.sponsor . \n?x1 :type.object.type :business.sponsorship . \nVALUES ?x2 { :en.major_league_baseball } \n?x0 :business.sponsor.sponsorship ?x1 . \n?x1 :business.sponsorship.sponsored_recipient ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 227000102,
		"question": "what are major league's sponsors?",
		"answer": [
			"Fujifilm"
		],
		"function": "none",
		"commonness": -18.06442429580015,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "business.sponsor",
					"class": "business.sponsor",
					"friendly_name": "Sponsor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "business.sponsorship",
					"class": "business.sponsorship",
					"friendly_name": "Sponsorship",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.major_league_baseball",
					"class": "business.sponsored_recipient",
					"friendly_name": "major league",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "business.sponsor.sponsorship",
					"friendly_name": "Sponsorship"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "business.sponsorship.sponsored_recipient",
					"friendly_name": "Sponsored Recipient"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :business.sponsor . \n?x1 :type.object.type :business.sponsorship . \nVALUES ?x2 { :en.major_league_baseball } \n?x0 :business.sponsor.sponsorship ?x1 . \n?x1 :business.sponsorship.sponsored_recipient ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 228000000,
		"question": "batman is employed by what company?",
		"answer": [
			"Wayne Enterprises"
		],
		"function": "none",
		"commonness": -20.258084186000367,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.fictional_employer",
					"class": "fictional_universe.fictional_employer",
					"friendly_name": "Employer in fiction",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "fictional_universe.fictional_employment_tenure",
					"class": "fictional_universe.fictional_employment_tenure",
					"friendly_name": "Fictional employment tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.batman",
					"class": "fictional_universe.fictional_character",
					"friendly_name": "Batman",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "fictional_universe.fictional_employer.employees",
					"friendly_name": "Employees"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "fictional_universe.fictional_character.employers",
					"friendly_name": "Employers"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.fictional_employer . \n?x1 :type.object.type :fictional_universe.fictional_employment_tenure . \nVALUES ?x2 { :en.batman } \n?x0 :fictional_universe.fictional_employer.employees ?x1 . \n?x2 :fictional_universe.fictional_character.employers ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 228000001,
		"question": "bruce wayne is employed by what company?",
		"answer": [
			"Wayne Enterprises"
		],
		"function": "none",
		"commonness": -20.258084186000367,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.fictional_employer",
					"class": "fictional_universe.fictional_employer",
					"friendly_name": "Employer in fiction",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "fictional_universe.fictional_employment_tenure",
					"class": "fictional_universe.fictional_employment_tenure",
					"friendly_name": "Fictional employment tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.batman",
					"class": "fictional_universe.fictional_character",
					"friendly_name": "bruce wayne",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "fictional_universe.fictional_employer.employees",
					"friendly_name": "Employees"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "fictional_universe.fictional_character.employers",
					"friendly_name": "Employers"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.fictional_employer . \n?x1 :type.object.type :fictional_universe.fictional_employment_tenure . \nVALUES ?x2 { :en.batman } \n?x0 :fictional_universe.fictional_employer.employees ?x1 . \n?x2 :fictional_universe.fictional_character.employers ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 228000100,
		"question": "who is batman hired by?",
		"answer": [
			"Wayne Enterprises"
		],
		"function": "none",
		"commonness": -20.258084186000367,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.fictional_employer",
					"class": "fictional_universe.fictional_employer",
					"friendly_name": "Employer in fiction",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "fictional_universe.fictional_employment_tenure",
					"class": "fictional_universe.fictional_employment_tenure",
					"friendly_name": "Fictional employment tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.batman",
					"class": "fictional_universe.fictional_character",
					"friendly_name": "Batman",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "fictional_universe.fictional_employer.employees",
					"friendly_name": "Employees"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "fictional_universe.fictional_character.employers",
					"friendly_name": "Employers"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.fictional_employer . \n?x1 :type.object.type :fictional_universe.fictional_employment_tenure . \nVALUES ?x2 { :en.batman } \n?x0 :fictional_universe.fictional_employer.employees ?x1 . \n?x2 :fictional_universe.fictional_character.employers ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 228000101,
		"question": "who is bruce wayne hired by?",
		"answer": [
			"Wayne Enterprises"
		],
		"function": "none",
		"commonness": -20.258084186000367,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.fictional_employer",
					"class": "fictional_universe.fictional_employer",
					"friendly_name": "Employer in fiction",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "fictional_universe.fictional_employment_tenure",
					"class": "fictional_universe.fictional_employment_tenure",
					"friendly_name": "Fictional employment tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.batman",
					"class": "fictional_universe.fictional_character",
					"friendly_name": "bruce wayne",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "fictional_universe.fictional_employer.employees",
					"friendly_name": "Employees"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "fictional_universe.fictional_character.employers",
					"friendly_name": "Employers"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.fictional_employer . \n?x1 :type.object.type :fictional_universe.fictional_employment_tenure . \nVALUES ?x2 { :en.batman } \n?x0 :fictional_universe.fictional_employer.employees ?x1 . \n?x2 :fictional_universe.fictional_character.employers ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 228000200,
		"question": "who is the employer of batman?",
		"answer": [
			"Wayne Enterprises"
		],
		"function": "none",
		"commonness": -20.258084186000367,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.fictional_employer",
					"class": "fictional_universe.fictional_employer",
					"friendly_name": "Employer in fiction",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "fictional_universe.fictional_employment_tenure",
					"class": "fictional_universe.fictional_employment_tenure",
					"friendly_name": "Fictional employment tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.batman",
					"class": "fictional_universe.fictional_character",
					"friendly_name": "Batman",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "fictional_universe.fictional_employer.employees",
					"friendly_name": "Employees"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "fictional_universe.fictional_character.employers",
					"friendly_name": "Employers"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.fictional_employer . \n?x1 :type.object.type :fictional_universe.fictional_employment_tenure . \nVALUES ?x2 { :en.batman } \n?x0 :fictional_universe.fictional_employer.employees ?x1 . \n?x2 :fictional_universe.fictional_character.employers ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 228000201,
		"question": "who is the employer of bruce wayne?",
		"answer": [
			"Wayne Enterprises"
		],
		"function": "none",
		"commonness": -20.258084186000367,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.fictional_employer",
					"class": "fictional_universe.fictional_employer",
					"friendly_name": "Employer in fiction",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "fictional_universe.fictional_employment_tenure",
					"class": "fictional_universe.fictional_employment_tenure",
					"friendly_name": "Fictional employment tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.batman",
					"class": "fictional_universe.fictional_character",
					"friendly_name": "bruce wayne",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "fictional_universe.fictional_employer.employees",
					"friendly_name": "Employees"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "fictional_universe.fictional_character.employers",
					"friendly_name": "Employers"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.fictional_employer . \n?x1 :type.object.type :fictional_universe.fictional_employment_tenure . \nVALUES ?x2 { :en.batman } \n?x0 :fictional_universe.fictional_employer.employees ?x1 . \n?x2 :fictional_universe.fictional_character.employers ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 228000300,
		"question": "who is batman's employer?",
		"answer": [
			"Wayne Enterprises"
		],
		"function": "none",
		"commonness": -20.258084186000367,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.fictional_employer",
					"class": "fictional_universe.fictional_employer",
					"friendly_name": "Employer in fiction",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "fictional_universe.fictional_employment_tenure",
					"class": "fictional_universe.fictional_employment_tenure",
					"friendly_name": "Fictional employment tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.batman",
					"class": "fictional_universe.fictional_character",
					"friendly_name": "Batman",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "fictional_universe.fictional_employer.employees",
					"friendly_name": "Employees"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "fictional_universe.fictional_character.employers",
					"friendly_name": "Employers"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.fictional_employer . \n?x1 :type.object.type :fictional_universe.fictional_employment_tenure . \nVALUES ?x2 { :en.batman } \n?x0 :fictional_universe.fictional_employer.employees ?x1 . \n?x2 :fictional_universe.fictional_character.employers ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 228000301,
		"question": "who is bruce wayne's employer?",
		"answer": [
			"Wayne Enterprises"
		],
		"function": "none",
		"commonness": -20.258084186000367,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.fictional_employer",
					"class": "fictional_universe.fictional_employer",
					"friendly_name": "Employer in fiction",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "fictional_universe.fictional_employment_tenure",
					"class": "fictional_universe.fictional_employment_tenure",
					"friendly_name": "Fictional employment tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.batman",
					"class": "fictional_universe.fictional_character",
					"friendly_name": "bruce wayne",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "fictional_universe.fictional_employer.employees",
					"friendly_name": "Employees"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "fictional_universe.fictional_character.employers",
					"friendly_name": "Employers"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.fictional_employer . \n?x1 :type.object.type :fictional_universe.fictional_employment_tenure . \nVALUES ?x2 { :en.batman } \n?x0 :fictional_universe.fictional_employer.employees ?x1 . \n?x2 :fictional_universe.fictional_character.employers ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	}
]