[
	{
		"qid": 89000100,
		"question": "buffalo sabres is now coached by whom?",
		"answer": [
			"Ron Rolston"
		],
		"function": "none",
		"commonness": -15.280293643752703,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "ice_hockey.hockey_coach",
					"class": "ice_hockey.hockey_coach",
					"friendly_name": "Ice hockey coach",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.buffalo_sabres",
					"class": "ice_hockey.hockey_team",
					"friendly_name": "Buffalo Sabres",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "ice_hockey.hockey_coach.current_team",
					"friendly_name": "Current Team Coached"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :ice_hockey.hockey_coach . \nVALUES ?x1 { :en.buffalo_sabres } \n?x0 :ice_hockey.hockey_coach.current_team ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 89000101,
		"question": "buffalo is now coached by whom?",
		"answer": [
			"Ron Rolston"
		],
		"function": "none",
		"commonness": -15.280293643752703,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "ice_hockey.hockey_coach",
					"class": "ice_hockey.hockey_coach",
					"friendly_name": "Ice hockey coach",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.buffalo_sabres",
					"class": "ice_hockey.hockey_team",
					"friendly_name": "buffalo",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "ice_hockey.hockey_coach.current_team",
					"friendly_name": "Current Team Coached"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :ice_hockey.hockey_coach . \nVALUES ?x1 { :en.buffalo_sabres } \n?x0 :ice_hockey.hockey_coach.current_team ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 89000102,
		"question": "sabres is now coached by whom?",
		"answer": [
			"Ron Rolston"
		],
		"function": "none",
		"commonness": -15.280293643752703,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "ice_hockey.hockey_coach",
					"class": "ice_hockey.hockey_coach",
					"friendly_name": "Ice hockey coach",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.buffalo_sabres",
					"class": "ice_hockey.hockey_team",
					"friendly_name": "sabres",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "ice_hockey.hockey_coach.current_team",
					"friendly_name": "Current Team Coached"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :ice_hockey.hockey_coach . \nVALUES ?x1 { :en.buffalo_sabres } \n?x0 :ice_hockey.hockey_coach.current_team ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 89000200,
		"question": "who is the current coach of buffalo sabres?",
		"answer": [
			"Ron Rolston"
		],
		"function": "none",
		"commonness": -15.280293643752703,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "ice_hockey.hockey_coach",
					"class": "ice_hockey.hockey_coach",
					"friendly_name": "Ice hockey coach",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.buffalo_sabres",
					"class": "ice_hockey.hockey_team",
					"friendly_name": "Buffalo Sabres",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "ice_hockey.hockey_coach.current_team",
					"friendly_name": "Current Team Coached"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :ice_hockey.hockey_coach . \nVALUES ?x1 { :en.buffalo_sabres } \n?x0 :ice_hockey.hockey_coach.current_team ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 89000201,
		"question": "who is the current coach of buffalo?",
		"answer": [
			"Ron Rolston"
		],
		"function": "none",
		"commonness": -15.280293643752703,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "ice_hockey.hockey_coach",
					"class": "ice_hockey.hockey_coach",
					"friendly_name": "Ice hockey coach",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.buffalo_sabres",
					"class": "ice_hockey.hockey_team",
					"friendly_name": "buffalo",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "ice_hockey.hockey_coach.current_team",
					"friendly_name": "Current Team Coached"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :ice_hockey.hockey_coach . \nVALUES ?x1 { :en.buffalo_sabres } \n?x0 :ice_hockey.hockey_coach.current_team ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 89000202,
		"question": "who is the current coach of sabres?",
		"answer": [
			"Ron Rolston"
		],
		"function": "none",
		"commonness": -15.280293643752703,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "ice_hockey.hockey_coach",
					"class": "ice_hockey.hockey_coach",
					"friendly_name": "Ice hockey coach",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.buffalo_sabres",
					"class": "ice_hockey.hockey_team",
					"friendly_name": "sabres",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "ice_hockey.hockey_coach.current_team",
					"friendly_name": "Current Team Coached"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :ice_hockey.hockey_coach . \nVALUES ?x1 { :en.buffalo_sabres } \n?x0 :ice_hockey.hockey_coach.current_team ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 89000300,
		"question": "who is the coach of buffalo sabres now?",
		"answer": [
			"Ron Rolston"
		],
		"function": "none",
		"commonness": -15.280293643752703,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "ice_hockey.hockey_coach",
					"class": "ice_hockey.hockey_coach",
					"friendly_name": "Ice hockey coach",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.buffalo_sabres",
					"class": "ice_hockey.hockey_team",
					"friendly_name": "Buffalo Sabres",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "ice_hockey.hockey_coach.current_team",
					"friendly_name": "Current Team Coached"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :ice_hockey.hockey_coach . \nVALUES ?x1 { :en.buffalo_sabres } \n?x0 :ice_hockey.hockey_coach.current_team ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 89000301,
		"question": "who is the coach of buffalo now?",
		"answer": [
			"Ron Rolston"
		],
		"function": "none",
		"commonness": -15.280293643752703,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "ice_hockey.hockey_coach",
					"class": "ice_hockey.hockey_coach",
					"friendly_name": "Ice hockey coach",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.buffalo_sabres",
					"class": "ice_hockey.hockey_team",
					"friendly_name": "buffalo",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "ice_hockey.hockey_coach.current_team",
					"friendly_name": "Current Team Coached"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :ice_hockey.hockey_coach . \nVALUES ?x1 { :en.buffalo_sabres } \n?x0 :ice_hockey.hockey_coach.current_team ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 89000302,
		"question": "who is the coach of sabres now?",
		"answer": [
			"Ron Rolston"
		],
		"function": "none",
		"commonness": -15.280293643752703,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "ice_hockey.hockey_coach",
					"class": "ice_hockey.hockey_coach",
					"friendly_name": "Ice hockey coach",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.buffalo_sabres",
					"class": "ice_hockey.hockey_team",
					"friendly_name": "sabres",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "ice_hockey.hockey_coach.current_team",
					"friendly_name": "Current Team Coached"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :ice_hockey.hockey_coach . \nVALUES ?x1 { :en.buffalo_sabres } \n?x0 :ice_hockey.hockey_coach.current_team ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 89000400,
		"question": "who is currently coaching buffalo sabres?",
		"answer": [
			"Ron Rolston"
		],
		"function": "none",
		"commonness": -15.280293643752703,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "ice_hockey.hockey_coach",
					"class": "ice_hockey.hockey_coach",
					"friendly_name": "Ice hockey coach",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.buffalo_sabres",
					"class": "ice_hockey.hockey_team",
					"friendly_name": "Buffalo Sabres",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "ice_hockey.hockey_coach.current_team",
					"friendly_name": "Current Team Coached"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :ice_hockey.hockey_coach . \nVALUES ?x1 { :en.buffalo_sabres } \n?x0 :ice_hockey.hockey_coach.current_team ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 89000401,
		"question": "who is currently coaching buffalo?",
		"answer": [
			"Ron Rolston"
		],
		"function": "none",
		"commonness": -15.280293643752703,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "ice_hockey.hockey_coach",
					"class": "ice_hockey.hockey_coach",
					"friendly_name": "Ice hockey coach",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.buffalo_sabres",
					"class": "ice_hockey.hockey_team",
					"friendly_name": "buffalo",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "ice_hockey.hockey_coach.current_team",
					"friendly_name": "Current Team Coached"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :ice_hockey.hockey_coach . \nVALUES ?x1 { :en.buffalo_sabres } \n?x0 :ice_hockey.hockey_coach.current_team ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 89000402,
		"question": "who is currently coaching sabres?",
		"answer": [
			"Ron Rolston"
		],
		"function": "none",
		"commonness": -15.280293643752703,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "ice_hockey.hockey_coach",
					"class": "ice_hockey.hockey_coach",
					"friendly_name": "Ice hockey coach",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.buffalo_sabres",
					"class": "ice_hockey.hockey_team",
					"friendly_name": "sabres",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "ice_hockey.hockey_coach.current_team",
					"friendly_name": "Current Team Coached"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :ice_hockey.hockey_coach . \nVALUES ?x1 { :en.buffalo_sabres } \n?x0 :ice_hockey.hockey_coach.current_team ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 89000500,
		"question": "who coaches the buffalo sabres?",
		"answer": [
			"Ron Rolston"
		],
		"function": "none",
		"commonness": -15.280293643752703,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "ice_hockey.hockey_coach",
					"class": "ice_hockey.hockey_coach",
					"friendly_name": "Ice hockey coach",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.buffalo_sabres",
					"class": "ice_hockey.hockey_team",
					"friendly_name": "Buffalo Sabres",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "ice_hockey.hockey_coach.current_team",
					"friendly_name": "Current Team Coached"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :ice_hockey.hockey_coach . \nVALUES ?x1 { :en.buffalo_sabres } \n?x0 :ice_hockey.hockey_coach.current_team ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 89000501,
		"question": "who coaches the buffalo?",
		"answer": [
			"Ron Rolston"
		],
		"function": "none",
		"commonness": -15.280293643752703,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "ice_hockey.hockey_coach",
					"class": "ice_hockey.hockey_coach",
					"friendly_name": "Ice hockey coach",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.buffalo_sabres",
					"class": "ice_hockey.hockey_team",
					"friendly_name": "buffalo",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "ice_hockey.hockey_coach.current_team",
					"friendly_name": "Current Team Coached"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :ice_hockey.hockey_coach . \nVALUES ?x1 { :en.buffalo_sabres } \n?x0 :ice_hockey.hockey_coach.current_team ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 89000502,
		"question": "who coaches the sabres?",
		"answer": [
			"Ron Rolston"
		],
		"function": "none",
		"commonness": -15.280293643752703,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "ice_hockey.hockey_coach",
					"class": "ice_hockey.hockey_coach",
					"friendly_name": "Ice hockey coach",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.buffalo_sabres",
					"class": "ice_hockey.hockey_team",
					"friendly_name": "sabres",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "ice_hockey.hockey_coach.current_team",
					"friendly_name": "Current Team Coached"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :ice_hockey.hockey_coach . \nVALUES ?x1 { :en.buffalo_sabres } \n?x0 :ice_hockey.hockey_coach.current_team ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 90000000,
		"question": "which group does great comet of 1843 belong to?",
		"answer": [
			"Kreutz Sungrazers"
		],
		"function": "none",
		"commonness": -23.410432544467408,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.comet_group",
					"class": "astronomy.comet_group",
					"friendly_name": "Comet group",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.great_comet_of_1843",
					"class": "astronomy.comet",
					"friendly_name": "Great Comet of 1843",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "astronomy.comet.comet_group",
					"friendly_name": "Comet group"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.comet_group . \nVALUES ?x1 { :en.great_comet_of_1843 } \n?x1 :astronomy.comet.comet_group ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 90000002,
		"question": "which group does great march comet of 1843 belong to?",
		"answer": [
			"Kreutz Sungrazers"
		],
		"function": "none",
		"commonness": -23.410432544467408,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.comet_group",
					"class": "astronomy.comet_group",
					"friendly_name": "Comet group",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.great_comet_of_1843",
					"class": "astronomy.comet",
					"friendly_name": "great march comet of 1843",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "astronomy.comet.comet_group",
					"friendly_name": "Comet group"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.comet_group . \nVALUES ?x1 { :en.great_comet_of_1843 } \n?x1 :astronomy.comet.comet_group ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 90000100,
		"question": "how is great comet of 1843 classified?",
		"answer": [
			"Kreutz Sungrazers"
		],
		"function": "none",
		"commonness": -23.410432544467408,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.comet_group",
					"class": "astronomy.comet_group",
					"friendly_name": "Comet group",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.great_comet_of_1843",
					"class": "astronomy.comet",
					"friendly_name": "Great Comet of 1843",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "astronomy.comet.comet_group",
					"friendly_name": "Comet group"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.comet_group . \nVALUES ?x1 { :en.great_comet_of_1843 } \n?x1 :astronomy.comet.comet_group ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 90000101,
		"question": "how is c/1843 d1 classified?",
		"answer": [
			"Kreutz Sungrazers"
		],
		"function": "none",
		"commonness": -23.410432544467408,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.comet_group",
					"class": "astronomy.comet_group",
					"friendly_name": "Comet group",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.great_comet_of_1843",
					"class": "astronomy.comet",
					"friendly_name": "c/1843 d1",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "astronomy.comet.comet_group",
					"friendly_name": "Comet group"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.comet_group . \nVALUES ?x1 { :en.great_comet_of_1843 } \n?x1 :astronomy.comet.comet_group ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 90000102,
		"question": "how is great march comet of 1843 classified?",
		"answer": [
			"Kreutz Sungrazers"
		],
		"function": "none",
		"commonness": -23.410432544467408,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.comet_group",
					"class": "astronomy.comet_group",
					"friendly_name": "Comet group",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.great_comet_of_1843",
					"class": "astronomy.comet",
					"friendly_name": "great march comet of 1843",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "astronomy.comet.comet_group",
					"friendly_name": "Comet group"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.comet_group . \nVALUES ?x1 { :en.great_comet_of_1843 } \n?x1 :astronomy.comet.comet_group ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 90000200,
		"question": "what is the comet class of the great comet of 1843?",
		"answer": [
			"Kreutz Sungrazers"
		],
		"function": "none",
		"commonness": -23.410432544467408,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.comet_group",
					"class": "astronomy.comet_group",
					"friendly_name": "Comet group",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.great_comet_of_1843",
					"class": "astronomy.comet",
					"friendly_name": "Great Comet of 1843",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "astronomy.comet.comet_group",
					"friendly_name": "Comet group"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.comet_group . \nVALUES ?x1 { :en.great_comet_of_1843 } \n?x1 :astronomy.comet.comet_group ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 90000201,
		"question": "what is the comet class of the c/1843 d1?",
		"answer": [
			"Kreutz Sungrazers"
		],
		"function": "none",
		"commonness": -23.410432544467408,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.comet_group",
					"class": "astronomy.comet_group",
					"friendly_name": "Comet group",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.great_comet_of_1843",
					"class": "astronomy.comet",
					"friendly_name": "c/1843 d1",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "astronomy.comet.comet_group",
					"friendly_name": "Comet group"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.comet_group . \nVALUES ?x1 { :en.great_comet_of_1843 } \n?x1 :astronomy.comet.comet_group ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 90000202,
		"question": "what is the comet class of the great march comet of 1843?",
		"answer": [
			"Kreutz Sungrazers"
		],
		"function": "none",
		"commonness": -23.410432544467408,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.comet_group",
					"class": "astronomy.comet_group",
					"friendly_name": "Comet group",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.great_comet_of_1843",
					"class": "astronomy.comet",
					"friendly_name": "great march comet of 1843",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "astronomy.comet.comet_group",
					"friendly_name": "Comet group"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.comet_group . \nVALUES ?x1 { :en.great_comet_of_1843 } \n?x1 :astronomy.comet.comet_group ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 90000300,
		"question": "which comet family grouping is great comet of 1843 in?",
		"answer": [
			"Kreutz Sungrazers"
		],
		"function": "none",
		"commonness": -23.410432544467408,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.comet_group",
					"class": "astronomy.comet_group",
					"friendly_name": "Comet group",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.great_comet_of_1843",
					"class": "astronomy.comet",
					"friendly_name": "Great Comet of 1843",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "astronomy.comet.comet_group",
					"friendly_name": "Comet group"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.comet_group . \nVALUES ?x1 { :en.great_comet_of_1843 } \n?x1 :astronomy.comet.comet_group ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 90000302,
		"question": "which comet family grouping is great march comet of 1843 in?",
		"answer": [
			"Kreutz Sungrazers"
		],
		"function": "none",
		"commonness": -23.410432544467408,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.comet_group",
					"class": "astronomy.comet_group",
					"friendly_name": "Comet group",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.great_comet_of_1843",
					"class": "astronomy.comet",
					"friendly_name": "great march comet of 1843",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "astronomy.comet.comet_group",
					"friendly_name": "Comet group"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.comet_group . \nVALUES ?x1 { :en.great_comet_of_1843 } \n?x1 :astronomy.comet.comet_group ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]