[
	{
		"qid": 196000101,
		"question": "what positions make up the yankees?",
		"answer": [
			"Center fielder",
			"Middle relief pitcher",
			"Pitcher",
			"Right fielder",
			"Infielder",
			"Second baseman",
			"Hitting Coach",
			"First baseman",
			"Left fielder",
			"Catcher",
			"Setup pitcher",
			"Relief pitcher",
			"Starting pitcher",
			"Closer",
			"Designated hitter",
			"Shortstop",
			"Utility player",
			"Outfielder",
			"Third baseman",
			"Utility infielder"
		],
		"function": "none",
		"commonness": -21.716341203072073,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.sports_position",
					"class": "sports.sports_position",
					"friendly_name": "Sports position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "sports.sport",
					"class": "sports.sport",
					"friendly_name": "Sport",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.new_york_yankees",
					"class": "sports.sports_team",
					"friendly_name": "yankees",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "sports.sport.positions",
					"friendly_name": "Positions"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "sports.sport.teams",
					"friendly_name": "Teams"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.sports_position . \n?x1 :type.object.type :sports.sport . \nVALUES ?x2 { :en.new_york_yankees } \n?x1 :sports.sport.positions ?x0 . \n?x1 :sports.sport.teams ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 196000102,
		"question": "what positions make up the yankee?",
		"answer": [
			"Setup pitcher",
			"Right fielder",
			"Shortstop",
			"Utility infielder",
			"Designated hitter",
			"Middle relief pitcher",
			"Catcher",
			"Center fielder",
			"Starting pitcher",
			"Pitcher",
			"Left fielder",
			"Closer",
			"Third baseman",
			"Infielder",
			"Hitting Coach",
			"Outfielder",
			"Utility player",
			"Relief pitcher",
			"Second baseman",
			"First baseman"
		],
		"function": "none",
		"commonness": -21.716341203072073,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.sports_position",
					"class": "sports.sports_position",
					"friendly_name": "Sports position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "sports.sport",
					"class": "sports.sport",
					"friendly_name": "Sport",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.new_york_yankees",
					"class": "sports.sports_team",
					"friendly_name": "yankee",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "sports.sport.positions",
					"friendly_name": "Positions"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "sports.sport.teams",
					"friendly_name": "Teams"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.sports_position . \n?x1 :type.object.type :sports.sport . \nVALUES ?x2 { :en.new_york_yankees } \n?x1 :sports.sport.positions ?x0 . \n?x1 :sports.sport.teams ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 196000200,
		"question": "what are the different positions on the new york yankees?",
		"answer": [
			"Utility player",
			"Closer",
			"First baseman",
			"Catcher",
			"Center fielder",
			"Second baseman",
			"Middle relief pitcher",
			"Pitcher",
			"Relief pitcher",
			"Utility infielder",
			"Starting pitcher",
			"Infielder",
			"Shortstop",
			"Third baseman",
			"Setup pitcher",
			"Designated hitter",
			"Hitting Coach",
			"Right fielder",
			"Left fielder",
			"Outfielder"
		],
		"function": "none",
		"commonness": -21.716341203072073,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.sports_position",
					"class": "sports.sports_position",
					"friendly_name": "Sports position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "sports.sport",
					"class": "sports.sport",
					"friendly_name": "Sport",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.new_york_yankees",
					"class": "sports.sports_team",
					"friendly_name": "New York Yankees",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "sports.sport.positions",
					"friendly_name": "Positions"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "sports.sport.teams",
					"friendly_name": "Teams"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.sports_position . \n?x1 :type.object.type :sports.sport . \nVALUES ?x2 { :en.new_york_yankees } \n?x1 :sports.sport.positions ?x0 . \n?x1 :sports.sport.teams ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 196000201,
		"question": "what are the different positions on the yankees?",
		"answer": [
			"Third baseman",
			"Shortstop",
			"Second baseman",
			"Pitcher",
			"Outfielder",
			"Designated hitter",
			"Closer",
			"Middle relief pitcher",
			"Center fielder",
			"First baseman",
			"Starting pitcher",
			"Infielder",
			"Catcher",
			"Relief pitcher",
			"Setup pitcher",
			"Left fielder",
			"Hitting Coach",
			"Right fielder",
			"Utility player",
			"Utility infielder"
		],
		"function": "none",
		"commonness": -21.716341203072073,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.sports_position",
					"class": "sports.sports_position",
					"friendly_name": "Sports position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "sports.sport",
					"class": "sports.sport",
					"friendly_name": "Sport",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.new_york_yankees",
					"class": "sports.sports_team",
					"friendly_name": "yankees",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "sports.sport.positions",
					"friendly_name": "Positions"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "sports.sport.teams",
					"friendly_name": "Teams"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.sports_position . \n?x1 :type.object.type :sports.sport . \nVALUES ?x2 { :en.new_york_yankees } \n?x1 :sports.sport.positions ?x0 . \n?x1 :sports.sport.teams ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 196000202,
		"question": "what are the different positions on the yankee?",
		"answer": [
			"Center fielder",
			"Utility player",
			"Shortstop",
			"Closer",
			"Right fielder",
			"Pitcher",
			"Catcher",
			"Second baseman",
			"Outfielder",
			"Utility infielder",
			"Designated hitter",
			"Infielder",
			"Relief pitcher",
			"Hitting Coach",
			"Third baseman",
			"Middle relief pitcher",
			"First baseman",
			"Setup pitcher",
			"Starting pitcher",
			"Left fielder"
		],
		"function": "none",
		"commonness": -21.716341203072073,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.sports_position",
					"class": "sports.sports_position",
					"friendly_name": "Sports position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "sports.sport",
					"class": "sports.sport",
					"friendly_name": "Sport",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.new_york_yankees",
					"class": "sports.sports_team",
					"friendly_name": "yankee",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "sports.sport.positions",
					"friendly_name": "Positions"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "sports.sport.teams",
					"friendly_name": "Teams"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.sports_position . \n?x1 :type.object.type :sports.sport . \nVALUES ?x2 { :en.new_york_yankees } \n?x1 :sports.sport.positions ?x0 . \n?x1 :sports.sport.teams ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 196000300,
		"question": "what are the different positions for the players on the new york yankees?",
		"answer": [
			"Pitcher",
			"Left fielder",
			"Center fielder",
			"Setup pitcher",
			"Designated hitter",
			"Second baseman",
			"First baseman",
			"Closer",
			"Utility infielder",
			"Utility player",
			"Relief pitcher",
			"Middle relief pitcher",
			"Outfielder",
			"Third baseman",
			"Shortstop",
			"Catcher",
			"Hitting Coach",
			"Infielder",
			"Starting pitcher",
			"Right fielder"
		],
		"function": "none",
		"commonness": -21.716341203072073,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.sports_position",
					"class": "sports.sports_position",
					"friendly_name": "Sports position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "sports.sport",
					"class": "sports.sport",
					"friendly_name": "Sport",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.new_york_yankees",
					"class": "sports.sports_team",
					"friendly_name": "New York Yankees",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "sports.sport.positions",
					"friendly_name": "Positions"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "sports.sport.teams",
					"friendly_name": "Teams"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.sports_position . \n?x1 :type.object.type :sports.sport . \nVALUES ?x2 { :en.new_york_yankees } \n?x1 :sports.sport.positions ?x0 . \n?x1 :sports.sport.teams ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 196000301,
		"question": "what are the different positions for the players on the yankees?",
		"answer": [
			"Utility infielder",
			"Second baseman",
			"First baseman",
			"Setup pitcher",
			"Infielder",
			"Middle relief pitcher",
			"Right fielder",
			"Hitting Coach",
			"Shortstop",
			"Closer",
			"Designated hitter",
			"Catcher",
			"Starting pitcher",
			"Pitcher",
			"Center fielder",
			"Left fielder",
			"Outfielder",
			"Relief pitcher",
			"Utility player",
			"Third baseman"
		],
		"function": "none",
		"commonness": -21.716341203072073,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.sports_position",
					"class": "sports.sports_position",
					"friendly_name": "Sports position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "sports.sport",
					"class": "sports.sport",
					"friendly_name": "Sport",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.new_york_yankees",
					"class": "sports.sports_team",
					"friendly_name": "yankees",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "sports.sport.positions",
					"friendly_name": "Positions"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "sports.sport.teams",
					"friendly_name": "Teams"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.sports_position . \n?x1 :type.object.type :sports.sport . \nVALUES ?x2 { :en.new_york_yankees } \n?x1 :sports.sport.positions ?x0 . \n?x1 :sports.sport.teams ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 196000302,
		"question": "what are the different positions for the players on the yankee?",
		"answer": [
			"Infielder",
			"Relief pitcher",
			"Right fielder",
			"Hitting Coach",
			"Setup pitcher",
			"Utility infielder",
			"Middle relief pitcher",
			"Closer",
			"Second baseman",
			"Outfielder",
			"Third baseman",
			"Starting pitcher",
			"Designated hitter",
			"Center fielder",
			"Utility player",
			"Shortstop",
			"Left fielder",
			"First baseman",
			"Catcher",
			"Pitcher"
		],
		"function": "none",
		"commonness": -21.716341203072073,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.sports_position",
					"class": "sports.sports_position",
					"friendly_name": "Sports position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "sports.sport",
					"class": "sports.sport",
					"friendly_name": "Sport",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.new_york_yankees",
					"class": "sports.sports_team",
					"friendly_name": "yankee",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "sports.sport.positions",
					"friendly_name": "Positions"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "sports.sport.teams",
					"friendly_name": "Teams"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.sports_position . \n?x1 :type.object.type :sports.sport . \nVALUES ?x2 { :en.new_york_yankees } \n?x1 :sports.sport.positions ?x0 . \n?x1 :sports.sport.teams ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 196000500,
		"question": "what positions does the new york yankees have on their team?",
		"answer": [
			"Utility player",
			"Middle relief pitcher",
			"Pitcher",
			"First baseman",
			"Center fielder",
			"Left fielder",
			"Right fielder",
			"Third baseman",
			"Relief pitcher",
			"Shortstop",
			"Closer",
			"Second baseman",
			"Starting pitcher",
			"Designated hitter",
			"Hitting Coach",
			"Utility infielder",
			"Catcher",
			"Infielder",
			"Setup pitcher",
			"Outfielder"
		],
		"function": "none",
		"commonness": -21.716341203072073,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.sports_position",
					"class": "sports.sports_position",
					"friendly_name": "Sports position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "sports.sport",
					"class": "sports.sport",
					"friendly_name": "Sport",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.new_york_yankees",
					"class": "sports.sports_team",
					"friendly_name": "New York Yankees",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "sports.sport.positions",
					"friendly_name": "Positions"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "sports.sport.teams",
					"friendly_name": "Teams"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.sports_position . \n?x1 :type.object.type :sports.sport . \nVALUES ?x2 { :en.new_york_yankees } \n?x1 :sports.sport.positions ?x0 . \n?x1 :sports.sport.teams ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 196000501,
		"question": "what positions does the yankees have on their team?",
		"answer": [
			"Third baseman",
			"Relief pitcher",
			"Starting pitcher",
			"Middle relief pitcher",
			"First baseman",
			"Center fielder",
			"Second baseman",
			"Catcher",
			"Outfielder",
			"Designated hitter",
			"Shortstop",
			"Closer",
			"Left fielder",
			"Infielder",
			"Utility infielder",
			"Right fielder",
			"Utility player",
			"Setup pitcher",
			"Pitcher",
			"Hitting Coach"
		],
		"function": "none",
		"commonness": -21.716341203072073,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.sports_position",
					"class": "sports.sports_position",
					"friendly_name": "Sports position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "sports.sport",
					"class": "sports.sport",
					"friendly_name": "Sport",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.new_york_yankees",
					"class": "sports.sports_team",
					"friendly_name": "yankees",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "sports.sport.positions",
					"friendly_name": "Positions"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "sports.sport.teams",
					"friendly_name": "Teams"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.sports_position . \n?x1 :type.object.type :sports.sport . \nVALUES ?x2 { :en.new_york_yankees } \n?x1 :sports.sport.positions ?x0 . \n?x1 :sports.sport.teams ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 196000502,
		"question": "what positions does the yankee have on their team?",
		"answer": [
			"Catcher",
			"Third baseman",
			"Utility infielder",
			"Center fielder",
			"Relief pitcher",
			"Pitcher",
			"Left fielder",
			"First baseman",
			"Setup pitcher",
			"Closer",
			"Infielder",
			"Shortstop",
			"Outfielder",
			"Starting pitcher",
			"Right fielder",
			"Middle relief pitcher",
			"Hitting Coach",
			"Utility player",
			"Designated hitter",
			"Second baseman"
		],
		"function": "none",
		"commonness": -21.716341203072073,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.sports_position",
					"class": "sports.sports_position",
					"friendly_name": "Sports position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "sports.sport",
					"class": "sports.sport",
					"friendly_name": "Sport",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.new_york_yankees",
					"class": "sports.sports_team",
					"friendly_name": "yankee",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "sports.sport.positions",
					"friendly_name": "Positions"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "sports.sport.teams",
					"friendly_name": "Teams"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.sports_position . \n?x1 :type.object.type :sports.sport . \nVALUES ?x2 { :en.new_york_yankees } \n?x1 :sports.sport.positions ?x0 . \n?x1 :sports.sport.teams ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 197000000,
		"question": "which crewman positions are there on spaceship uss voyager?",
		"answer": [
			"First officer",
			"Chief medical officer",
			"Security Officer",
			"Cook",
			"Captain"
		],
		"function": "none",
		"commonness": -25.230349463796532,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.character_occupation",
					"class": "fictional_universe.character_occupation",
					"friendly_name": "Character Occupation",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.fictionaluniverse.fictional_spaceship_crewman_posting",
					"class": "base.fictionaluniverse.fictional_spaceship_crewman_posting",
					"friendly_name": "Fictional Spaceship Crewman Posting",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.uss_voyager",
					"class": "base.fictionaluniverse.fictional_spacecraft",
					"friendly_name": "USS Voyager",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.fictionaluniverse.fictional_spaceship_crewman_posting.position",
					"friendly_name": "Position"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "base.fictionaluniverse.fictional_spacecraft.crew",
					"friendly_name": "Crew"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.character_occupation . \n?x1 :type.object.type :base.fictionaluniverse.fictional_spaceship_crewman_posting . \nVALUES ?x2 { :en.uss_voyager } \n?x1 :base.fictionaluniverse.fictional_spaceship_crewman_posting.position ?x0 . \n?x2 :base.fictionaluniverse.fictional_spacecraft.crew ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 197000001,
		"question": "which crewman positions are there on spaceship voyager?",
		"answer": [
			"Security Officer",
			"First officer",
			"Chief medical officer",
			"Cook",
			"Captain"
		],
		"function": "none",
		"commonness": -25.230349463796532,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.character_occupation",
					"class": "fictional_universe.character_occupation",
					"friendly_name": "Character Occupation",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.fictionaluniverse.fictional_spaceship_crewman_posting",
					"class": "base.fictionaluniverse.fictional_spaceship_crewman_posting",
					"friendly_name": "Fictional Spaceship Crewman Posting",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.uss_voyager",
					"class": "base.fictionaluniverse.fictional_spacecraft",
					"friendly_name": "voyager",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.fictionaluniverse.fictional_spaceship_crewman_posting.position",
					"friendly_name": "Position"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "base.fictionaluniverse.fictional_spacecraft.crew",
					"friendly_name": "Crew"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.character_occupation . \n?x1 :type.object.type :base.fictionaluniverse.fictional_spaceship_crewman_posting . \nVALUES ?x2 { :en.uss_voyager } \n?x1 :base.fictionaluniverse.fictional_spaceship_crewman_posting.position ?x0 . \n?x2 :base.fictionaluniverse.fictional_spacecraft.crew ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 197000002,
		"question": "which crewman positions are there on spaceship starship voyager?",
		"answer": [
			"Security Officer",
			"First officer",
			"Captain",
			"Cook",
			"Chief medical officer"
		],
		"function": "none",
		"commonness": -25.230349463796532,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.character_occupation",
					"class": "fictional_universe.character_occupation",
					"friendly_name": "Character Occupation",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.fictionaluniverse.fictional_spaceship_crewman_posting",
					"class": "base.fictionaluniverse.fictional_spaceship_crewman_posting",
					"friendly_name": "Fictional Spaceship Crewman Posting",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.uss_voyager",
					"class": "base.fictionaluniverse.fictional_spacecraft",
					"friendly_name": "starship voyager",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.fictionaluniverse.fictional_spaceship_crewman_posting.position",
					"friendly_name": "Position"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "base.fictionaluniverse.fictional_spacecraft.crew",
					"friendly_name": "Crew"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.character_occupation . \n?x1 :type.object.type :base.fictionaluniverse.fictional_spaceship_crewman_posting . \nVALUES ?x2 { :en.uss_voyager } \n?x1 :base.fictionaluniverse.fictional_spaceship_crewman_posting.position ?x0 . \n?x2 :base.fictionaluniverse.fictional_spacecraft.crew ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 197000100,
		"question": "on the spaceship uss voyager, crewmen are of what positions?",
		"answer": [
			"Cook",
			"Security Officer",
			"Captain",
			"First officer",
			"Chief medical officer"
		],
		"function": "none",
		"commonness": -25.230349463796532,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.character_occupation",
					"class": "fictional_universe.character_occupation",
					"friendly_name": "Character Occupation",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.fictionaluniverse.fictional_spaceship_crewman_posting",
					"class": "base.fictionaluniverse.fictional_spaceship_crewman_posting",
					"friendly_name": "Fictional Spaceship Crewman Posting",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.uss_voyager",
					"class": "base.fictionaluniverse.fictional_spacecraft",
					"friendly_name": "USS Voyager",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.fictionaluniverse.fictional_spaceship_crewman_posting.position",
					"friendly_name": "Position"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "base.fictionaluniverse.fictional_spacecraft.crew",
					"friendly_name": "Crew"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.character_occupation . \n?x1 :type.object.type :base.fictionaluniverse.fictional_spaceship_crewman_posting . \nVALUES ?x2 { :en.uss_voyager } \n?x1 :base.fictionaluniverse.fictional_spaceship_crewman_posting.position ?x0 . \n?x2 :base.fictionaluniverse.fictional_spacecraft.crew ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	}
]