[
	{
		"qid": 14000100,
		"question": "whose work has been adapted for the film twilight?",
		"answer": [
			"Stephenie Meyer"
		],
		"function": "none",
		"commonness": -11.10139189737362,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.film_story_contributor",
					"class": "film.film_story_contributor",
					"friendly_name": "Film story contributor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.03nm_fh",
					"class": "film.film",
					"friendly_name": "Twilight",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "film.film.story_by",
					"friendly_name": "Story by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.film_story_contributor . \nVALUES ?x1 { :m.03nm_fh } \n?x1 :film.film.story_by ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 14000200,
		"question": "the movie twilight is based on whose book?",
		"answer": [
			"Stephenie Meyer"
		],
		"function": "none",
		"commonness": -11.10139189737362,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.film_story_contributor",
					"class": "film.film_story_contributor",
					"friendly_name": "Film story contributor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.03nm_fh",
					"class": "film.film",
					"friendly_name": "Twilight",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "film.film.story_by",
					"friendly_name": "Story by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.film_story_contributor . \nVALUES ?x1 { :m.03nm_fh } \n?x1 :film.film.story_by ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 14000300,
		"question": "what is the name of the author that wrote twilight?",
		"answer": [
			"Stephenie Meyer"
		],
		"function": "none",
		"commonness": -11.10139189737362,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.film_story_contributor",
					"class": "film.film_story_contributor",
					"friendly_name": "Film story contributor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.03nm_fh",
					"class": "film.film",
					"friendly_name": "Twilight",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "film.film.story_by",
					"friendly_name": "Story by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.film_story_contributor . \nVALUES ?x1 { :m.03nm_fh } \n?x1 :film.film.story_by ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 14000400,
		"question": "what is the name of twilight's author?",
		"answer": [
			"Stephenie Meyer"
		],
		"function": "none",
		"commonness": -11.10139189737362,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.film_story_contributor",
					"class": "film.film_story_contributor",
					"friendly_name": "Film story contributor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.03nm_fh",
					"class": "film.film",
					"friendly_name": "Twilight",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "film.film.story_by",
					"friendly_name": "Story by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.film_story_contributor . \nVALUES ?x1 { :m.03nm_fh } \n?x1 :film.film.story_by ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 14000500,
		"question": "who wrote the story of twilight?",
		"answer": [
			"Stephenie Meyer"
		],
		"function": "none",
		"commonness": -11.10139189737362,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.film_story_contributor",
					"class": "film.film_story_contributor",
					"friendly_name": "Film story contributor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.03nm_fh",
					"class": "film.film",
					"friendly_name": "Twilight",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "film.film.story_by",
					"friendly_name": "Story by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.film_story_contributor . \nVALUES ?x1 { :m.03nm_fh } \n?x1 :film.film.story_by ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 14000600,
		"question": "who is the author of twilight?",
		"answer": [
			"Stephenie Meyer"
		],
		"function": "none",
		"commonness": -11.10139189737362,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.film_story_contributor",
					"class": "film.film_story_contributor",
					"friendly_name": "Film story contributor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.03nm_fh",
					"class": "film.film",
					"friendly_name": "Twilight",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "film.film.story_by",
					"friendly_name": "Story by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.film_story_contributor . \nVALUES ?x1 { :m.03nm_fh } \n?x1 :film.film.story_by ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 15000000,
		"question": "what kind of spirit is justerini & brooks?",
		"answer": [
			"Single malt Scotch whisky",
			"Grain whisky"
		],
		"function": "none",
		"commonness": -19.489905632213564,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "distilled_spirits.distilled_spirit_type",
					"class": "distilled_spirits.distilled_spirit_type",
					"friendly_name": "Distilled spirit type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.justerini_brooks_whisky",
					"class": "distilled_spirits.blended_spirit",
					"friendly_name": "Justerini & Brooks",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "distilled_spirits.distilled_spirit_type.blends",
					"friendly_name": "Blends using this type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :distilled_spirits.distilled_spirit_type . \nVALUES ?x1 { :en.justerini_brooks_whisky } \n?x0 :distilled_spirits.distilled_spirit_type.blends ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 15000100,
		"question": "what kind of alcoholic beverage is justerini & brooks?",
		"answer": [
			"Grain whisky",
			"Single malt Scotch whisky"
		],
		"function": "none",
		"commonness": -19.489905632213564,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "distilled_spirits.distilled_spirit_type",
					"class": "distilled_spirits.distilled_spirit_type",
					"friendly_name": "Distilled spirit type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.justerini_brooks_whisky",
					"class": "distilled_spirits.blended_spirit",
					"friendly_name": "Justerini & Brooks",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "distilled_spirits.distilled_spirit_type.blends",
					"friendly_name": "Blends using this type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :distilled_spirits.distilled_spirit_type . \nVALUES ?x1 { :en.justerini_brooks_whisky } \n?x0 :distilled_spirits.distilled_spirit_type.blends ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 15000101,
		"question": "what kind of alcoholic beverage is j&b?",
		"answer": [
			"Grain whisky",
			"Single malt Scotch whisky"
		],
		"function": "none",
		"commonness": -19.489905632213564,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "distilled_spirits.distilled_spirit_type",
					"class": "distilled_spirits.distilled_spirit_type",
					"friendly_name": "Distilled spirit type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.justerini_brooks_whisky",
					"class": "distilled_spirits.blended_spirit",
					"friendly_name": "j&b",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "distilled_spirits.distilled_spirit_type.blends",
					"friendly_name": "Blends using this type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :distilled_spirits.distilled_spirit_type . \nVALUES ?x1 { :en.justerini_brooks_whisky } \n?x0 :distilled_spirits.distilled_spirit_type.blends ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 15000200,
		"question": "what type of distilled spirit is justerini & brooks?",
		"answer": [
			"Single malt Scotch whisky",
			"Grain whisky"
		],
		"function": "none",
		"commonness": -19.489905632213564,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "distilled_spirits.distilled_spirit_type",
					"class": "distilled_spirits.distilled_spirit_type",
					"friendly_name": "Distilled spirit type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.justerini_brooks_whisky",
					"class": "distilled_spirits.blended_spirit",
					"friendly_name": "Justerini & Brooks",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "distilled_spirits.distilled_spirit_type.blends",
					"friendly_name": "Blends using this type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :distilled_spirits.distilled_spirit_type . \nVALUES ?x1 { :en.justerini_brooks_whisky } \n?x0 :distilled_spirits.distilled_spirit_type.blends ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 15000201,
		"question": "what type of distilled spirit is j&b?",
		"answer": [
			"Grain whisky",
			"Single malt Scotch whisky"
		],
		"function": "none",
		"commonness": -19.489905632213564,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "distilled_spirits.distilled_spirit_type",
					"class": "distilled_spirits.distilled_spirit_type",
					"friendly_name": "Distilled spirit type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.justerini_brooks_whisky",
					"class": "distilled_spirits.blended_spirit",
					"friendly_name": "j&b",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "distilled_spirits.distilled_spirit_type.blends",
					"friendly_name": "Blends using this type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :distilled_spirits.distilled_spirit_type . \nVALUES ?x1 { :en.justerini_brooks_whisky } \n?x0 :distilled_spirits.distilled_spirit_type.blends ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 15000300,
		"question": "justerini & brooks is which type of distilled spirit?",
		"answer": [
			"Grain whisky",
			"Single malt Scotch whisky"
		],
		"function": "none",
		"commonness": -19.489905632213564,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "distilled_spirits.distilled_spirit_type",
					"class": "distilled_spirits.distilled_spirit_type",
					"friendly_name": "Distilled spirit type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.justerini_brooks_whisky",
					"class": "distilled_spirits.blended_spirit",
					"friendly_name": "Justerini & Brooks",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "distilled_spirits.distilled_spirit_type.blends",
					"friendly_name": "Blends using this type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :distilled_spirits.distilled_spirit_type . \nVALUES ?x1 { :en.justerini_brooks_whisky } \n?x0 :distilled_spirits.distilled_spirit_type.blends ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 16000000,
		"question": "what comic book series belong to science fiction?",
		"answer": [
			"Echo",
			"Gene Wolfe's The Shadow of the Torturer",
			"2000 AD",
			"Justy",
			"Gate keepers",
			"Dominion: Tank Police",
			"The Invisibles",
			"Amazing Fantasy",
			"Infinite Stratos",
			"Monkeyman & O'Brien",
			"Dominion Conflict One: No More Noise",
			"Amuri in Star Ocean",
			"Twin Signal",
			"The Private Eye",
			"Barabanba",
			"Absolute Boyfriend",
			"Mojacko",
			"Blake and Mortimer",
			"20th Century Boys",
			"DT Eightron",
			"Longshot",
			"The Surrogates"
		],
		"function": "none",
		"commonness": -14.708929816205657,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_series",
					"class": "comic_books.comic_book_series",
					"friendly_name": "Comic Book Series",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.science_fiction",
					"class": "comic_books.comic_book_genre",
					"friendly_name": "Science Fiction",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "comic_books.comic_book_series.genre",
					"friendly_name": "Genre"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_series . \nVALUES ?x1 { :en.science_fiction } \n?x0 :comic_books.comic_book_series.genre ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 16000001,
		"question": "what comic book series belong to sci-fi?",
		"answer": [
			"Amuri in Star Ocean",
			"Mojacko",
			"Dominion Conflict One: No More Noise",
			"Amazing Fantasy",
			"The Private Eye",
			"The Invisibles",
			"Barabanba",
			"Justy",
			"The Surrogates",
			"Gate keepers",
			"Blake and Mortimer",
			"20th Century Boys",
			"Twin Signal",
			"Dominion: Tank Police",
			"Absolute Boyfriend",
			"2000 AD",
			"DT Eightron",
			"Monkeyman & O'Brien",
			"Longshot",
			"Gene Wolfe's The Shadow of the Torturer",
			"Echo",
			"Infinite Stratos"
		],
		"function": "none",
		"commonness": -14.708929816205657,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_series",
					"class": "comic_books.comic_book_series",
					"friendly_name": "Comic Book Series",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.science_fiction",
					"class": "comic_books.comic_book_genre",
					"friendly_name": "sci-fi",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "comic_books.comic_book_series.genre",
					"friendly_name": "Genre"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_series . \nVALUES ?x1 { :en.science_fiction } \n?x0 :comic_books.comic_book_series.genre ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 16000200,
		"question": "what are the science fiction themed comic book series?",
		"answer": [
			"Twin Signal",
			"Longshot",
			"Monkeyman & O'Brien",
			"The Surrogates",
			"Amazing Fantasy",
			"Mojacko",
			"Dominion: Tank Police",
			"Gate keepers",
			"Infinite Stratos",
			"Amuri in Star Ocean",
			"The Invisibles",
			"Barabanba",
			"DT Eightron",
			"2000 AD",
			"Blake and Mortimer",
			"Absolute Boyfriend",
			"Justy",
			"20th Century Boys",
			"The Private Eye",
			"Dominion Conflict One: No More Noise",
			"Gene Wolfe's The Shadow of the Torturer",
			"Echo"
		],
		"function": "none",
		"commonness": -14.708929816205657,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_series",
					"class": "comic_books.comic_book_series",
					"friendly_name": "Comic Book Series",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.science_fiction",
					"class": "comic_books.comic_book_genre",
					"friendly_name": "Science Fiction",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "comic_books.comic_book_series.genre",
					"friendly_name": "Genre"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_series . \nVALUES ?x1 { :en.science_fiction } \n?x0 :comic_books.comic_book_series.genre ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 16000201,
		"question": "what are the sci-fi themed comic book series?",
		"answer": [
			"Mojacko",
			"Absolute Boyfriend",
			"Amazing Fantasy",
			"Blake and Mortimer",
			"The Invisibles",
			"DT Eightron",
			"Dominion: Tank Police",
			"2000 AD",
			"The Private Eye",
			"20th Century Boys",
			"Amuri in Star Ocean",
			"The Surrogates",
			"Infinite Stratos",
			"Longshot",
			"Gate keepers",
			"Monkeyman & O'Brien",
			"Justy",
			"Dominion Conflict One: No More Noise",
			"Barabanba",
			"Echo",
			"Twin Signal",
			"Gene Wolfe's The Shadow of the Torturer"
		],
		"function": "none",
		"commonness": -14.708929816205657,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_series",
					"class": "comic_books.comic_book_series",
					"friendly_name": "Comic Book Series",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.science_fiction",
					"class": "comic_books.comic_book_genre",
					"friendly_name": "sci-fi",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "comic_books.comic_book_series.genre",
					"friendly_name": "Genre"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_series . \nVALUES ?x1 { :en.science_fiction } \n?x0 :comic_books.comic_book_series.genre ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 17000000,
		"question": "name an academic article on the subject of sociology?",
		"answer": [
			"Toward Racial Healing"
		],
		"function": "none",
		"commonness": -17.964997006047682,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.journal_article",
					"class": "book.journal_article",
					"friendly_name": "Journal article",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.sociology",
					"class": "book.school_or_movement",
					"friendly_name": "Sociology",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "book.school_or_movement.associated_works",
					"friendly_name": "Associated Works"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.journal_article . \nVALUES ?x1 { :en.sociology } \n?x1 :book.school_or_movement.associated_works ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 17000100,
		"question": "what are the articles about sociology published in a journal?",
		"answer": [
			"Toward Racial Healing"
		],
		"function": "none",
		"commonness": -17.964997006047682,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.journal_article",
					"class": "book.journal_article",
					"friendly_name": "Journal article",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.sociology",
					"class": "book.school_or_movement",
					"friendly_name": "Sociology",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "book.school_or_movement.associated_works",
					"friendly_name": "Associated Works"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.journal_article . \nVALUES ?x1 { :en.sociology } \n?x1 :book.school_or_movement.associated_works ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 17000300,
		"question": "what journal articles are there in sociology?",
		"answer": [
			"Toward Racial Healing"
		],
		"function": "none",
		"commonness": -17.964997006047682,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.journal_article",
					"class": "book.journal_article",
					"friendly_name": "Journal article",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.sociology",
					"class": "book.school_or_movement",
					"friendly_name": "Sociology",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "book.school_or_movement.associated_works",
					"friendly_name": "Associated Works"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.journal_article . \nVALUES ?x1 { :en.sociology } \n?x1 :book.school_or_movement.associated_works ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 18000000,
		"question": "in which tournaments did west indies cricket team win the championship?",
		"answer": [
			"2012 ICC World Twenty20",
			"1979 Cricket World Cup"
		],
		"function": "none",
		"commonness": -16.18711506680925,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "cricket.cricket_tournament_event",
					"class": "cricket.cricket_tournament_event",
					"friendly_name": "Cricket Tournament Event",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.west_indian_cricket_team",
					"class": "sports.sports_team",
					"friendly_name": "West Indies cricket team",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.sports_championship_event.champion",
					"friendly_name": "Champion"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :cricket.cricket_tournament_event . \nVALUES ?x1 { :en.west_indian_cricket_team } \n?x0 :sports.sports_championship_event.champion ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 18000001,
		"question": "in which tournaments did west indies win the championship?",
		"answer": [
			"1979 Cricket World Cup",
			"2012 ICC World Twenty20"
		],
		"function": "none",
		"commonness": -16.18711506680925,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "cricket.cricket_tournament_event",
					"class": "cricket.cricket_tournament_event",
					"friendly_name": "Cricket Tournament Event",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.west_indian_cricket_team",
					"class": "sports.sports_team",
					"friendly_name": "west indies",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.sports_championship_event.champion",
					"friendly_name": "Champion"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :cricket.cricket_tournament_event . \nVALUES ?x1 { :en.west_indian_cricket_team } \n?x0 :sports.sports_championship_event.champion ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 18000002,
		"question": "in which tournaments did windies win the championship?",
		"answer": [
			"2012 ICC World Twenty20",
			"1979 Cricket World Cup"
		],
		"function": "none",
		"commonness": -16.18711506680925,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "cricket.cricket_tournament_event",
					"class": "cricket.cricket_tournament_event",
					"friendly_name": "Cricket Tournament Event",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.west_indian_cricket_team",
					"class": "sports.sports_team",
					"friendly_name": "windies",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.sports_championship_event.champion",
					"friendly_name": "Champion"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :cricket.cricket_tournament_event . \nVALUES ?x1 { :en.west_indian_cricket_team } \n?x0 :sports.sports_championship_event.champion ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 18000100,
		"question": "which tournaments has west indies cricket team won?",
		"answer": [
			"2012 ICC World Twenty20",
			"1979 Cricket World Cup"
		],
		"function": "none",
		"commonness": -16.18711506680925,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "cricket.cricket_tournament_event",
					"class": "cricket.cricket_tournament_event",
					"friendly_name": "Cricket Tournament Event",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.west_indian_cricket_team",
					"class": "sports.sports_team",
					"friendly_name": "West Indies cricket team",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.sports_championship_event.champion",
					"friendly_name": "Champion"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :cricket.cricket_tournament_event . \nVALUES ?x1 { :en.west_indian_cricket_team } \n?x0 :sports.sports_championship_event.champion ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]