[
	{
		"qid": 239000102,
		"question": "what do religions that share a common deity with christian religion believe?",
		"answer": [
			"Incarnation",
			"Omniscience",
			"Salvation",
			"Infallibility of the Church",
			"Unity of God",
			"Families Can Be Forever",
			"Harmony of religion and science",
			"Elimination of extremes of wealth and poverty",
			"Equality between men and women",
			"Resurrection appearances of Jesus",
			"World peace",
			"Divine simplicity",
			"Marriage for Time and All Eternity",
			"Unity of Religeon",
			"Omnipotence",
			"Soli Deo gloria",
			"Fall of man",
			"Unitarian monotheism",
			"Papal infallibility",
			"Nontrinitarianism",
			"Universal auxiliary language",
			"Eastern Orthodox view of sin",
			"Degrees of glory",
			"God in Mormonism",
			"Solus Christus",
			"Transubstantiation",
			"Sola scriptura",
			"Universal compulsory education",
			"Tikkun olam",
			"Elimination of all forms of prejudice",
			"Sola fide",
			"Independent investigation of truth",
			"Sola gratia",
			"Virgin birth of Jesus",
			"Creation",
			"Premortality",
			"Original sin",
			"Obedience to government and non-involvement in partisan politics",
			"Monotheism",
			"Unity of Mankind",
			"Trinity"
		],
		"function": "none",
		"commonness": -24.899294145777223,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "religion.belief",
					"class": "religion.belief",
					"friendly_name": "Belief",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "religion.religion",
					"class": "religion.religion",
					"friendly_name": "Religion",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "religion.deity",
					"class": "religion.deity",
					"friendly_name": "Deity",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.christianity",
					"class": "religion.religion",
					"friendly_name": "christian religion",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "religion.belief.belief_of",
					"friendly_name": "Belief Of"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "religion.deity.deity_of",
					"friendly_name": "Religion(s) That Worship This Deity"
				},
				{
					"start": 2,
					"end": 3,
					"relation": "religion.deity.deity_of",
					"friendly_name": "Religion(s) That Worship This Deity"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :religion.belief . \n?x1 :type.object.type :religion.religion . \n?x2 :type.object.type :religion.deity . \nVALUES ?x3 { :en.christianity } \n?x0 :religion.belief.belief_of ?x1 . \n?x2 :religion.deity.deity_of ?x1 . \n?x2 :religion.deity.deity_of ?x3 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 239000200,
		"question": "what are some things that are believed by members of different religions that share common deity with christianity?",
		"answer": [
			"Sola fide",
			"Omnipotence",
			"Solus Christus",
			"Independent investigation of truth",
			"Unity of God",
			"Fall of man",
			"Salvation",
			"Transubstantiation",
			"Divine simplicity",
			"Original sin",
			"Equality between men and women",
			"Obedience to government and non-involvement in partisan politics",
			"Universal auxiliary language",
			"World peace",
			"Resurrection appearances of Jesus",
			"Unity of Religeon",
			"Elimination of all forms of prejudice",
			"Eastern Orthodox view of sin",
			"Tikkun olam",
			"Degrees of glory",
			"Premortality",
			"Monotheism",
			"Nontrinitarianism",
			"Unity of Mankind",
			"Families Can Be Forever",
			"Trinity",
			"Incarnation",
			"Elimination of extremes of wealth and poverty",
			"Marriage for Time and All Eternity",
			"Infallibility of the Church",
			"Sola gratia",
			"Universal compulsory education",
			"Creation",
			"Sola scriptura",
			"Virgin birth of Jesus",
			"Soli Deo gloria",
			"Harmony of religion and science",
			"God in Mormonism",
			"Omniscience",
			"Unitarian monotheism",
			"Papal infallibility"
		],
		"function": "none",
		"commonness": -24.899294145777223,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "religion.belief",
					"class": "religion.belief",
					"friendly_name": "Belief",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "religion.religion",
					"class": "religion.religion",
					"friendly_name": "Religion",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "religion.deity",
					"class": "religion.deity",
					"friendly_name": "Deity",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.christianity",
					"class": "religion.religion",
					"friendly_name": "Christianity",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "religion.belief.belief_of",
					"friendly_name": "Belief Of"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "religion.deity.deity_of",
					"friendly_name": "Religion(s) That Worship This Deity"
				},
				{
					"start": 2,
					"end": 3,
					"relation": "religion.deity.deity_of",
					"friendly_name": "Religion(s) That Worship This Deity"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :religion.belief . \n?x1 :type.object.type :religion.religion . \n?x2 :type.object.type :religion.deity . \nVALUES ?x3 { :en.christianity } \n?x0 :religion.belief.belief_of ?x1 . \n?x2 :religion.deity.deity_of ?x1 . \n?x2 :religion.deity.deity_of ?x3 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 239000201,
		"question": "what are some things that are believed by members of different religions that share common deity with christian faith?",
		"answer": [
			"Sola scriptura",
			"Families Can Be Forever",
			"Eastern Orthodox view of sin",
			"Transubstantiation",
			"Equality between men and women",
			"Degrees of glory",
			"Elimination of all forms of prejudice",
			"Incarnation",
			"Soli Deo gloria",
			"Nontrinitarianism",
			"Salvation",
			"Unity of Mankind",
			"Omniscience",
			"Solus Christus",
			"Obedience to government and non-involvement in partisan politics",
			"Marriage for Time and All Eternity",
			"Unity of Religeon",
			"Sola fide",
			"Premortality",
			"Virgin birth of Jesus",
			"Fall of man",
			"Universal auxiliary language",
			"Universal compulsory education",
			"Original sin",
			"Creation",
			"Monotheism",
			"Sola gratia",
			"World peace",
			"Unity of God",
			"God in Mormonism",
			"Elimination of extremes of wealth and poverty",
			"Tikkun olam",
			"Omnipotence",
			"Trinity",
			"Infallibility of the Church",
			"Independent investigation of truth",
			"Divine simplicity",
			"Unitarian monotheism",
			"Papal infallibility",
			"Resurrection appearances of Jesus",
			"Harmony of religion and science"
		],
		"function": "none",
		"commonness": -24.899294145777223,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "religion.belief",
					"class": "religion.belief",
					"friendly_name": "Belief",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "religion.religion",
					"class": "religion.religion",
					"friendly_name": "Religion",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "religion.deity",
					"class": "religion.deity",
					"friendly_name": "Deity",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.christianity",
					"class": "religion.religion",
					"friendly_name": "christian faith",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "religion.belief.belief_of",
					"friendly_name": "Belief Of"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "religion.deity.deity_of",
					"friendly_name": "Religion(s) That Worship This Deity"
				},
				{
					"start": 2,
					"end": 3,
					"relation": "religion.deity.deity_of",
					"friendly_name": "Religion(s) That Worship This Deity"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :religion.belief . \n?x1 :type.object.type :religion.religion . \n?x2 :type.object.type :religion.deity . \nVALUES ?x3 { :en.christianity } \n?x0 :religion.belief.belief_of ?x1 . \n?x2 :religion.deity.deity_of ?x1 . \n?x2 :religion.deity.deity_of ?x3 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 239000202,
		"question": "what are some things that are believed by members of different religions that share common deity with christian religion?",
		"answer": [
			"Resurrection appearances of Jesus",
			"Divine simplicity",
			"Creation",
			"Transubstantiation",
			"World peace",
			"Incarnation",
			"Eastern Orthodox view of sin",
			"Degrees of glory",
			"Sola fide",
			"Unity of God",
			"Trinity",
			"Universal auxiliary language",
			"Unitarian monotheism",
			"Tikkun olam",
			"God in Mormonism",
			"Virgin birth of Jesus",
			"Sola gratia",
			"Salvation",
			"Families Can Be Forever",
			"Monotheism",
			"Soli Deo gloria",
			"Original sin",
			"Papal infallibility",
			"Nontrinitarianism",
			"Sola scriptura",
			"Universal compulsory education",
			"Infallibility of the Church",
			"Obedience to government and non-involvement in partisan politics",
			"Unity of Religeon",
			"Independent investigation of truth",
			"Fall of man",
			"Harmony of religion and science",
			"Omnipotence",
			"Marriage for Time and All Eternity",
			"Solus Christus",
			"Elimination of all forms of prejudice",
			"Elimination of extremes of wealth and poverty",
			"Equality between men and women",
			"Omniscience",
			"Premortality",
			"Unity of Mankind"
		],
		"function": "none",
		"commonness": -24.899294145777223,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "religion.belief",
					"class": "religion.belief",
					"friendly_name": "Belief",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "religion.religion",
					"class": "religion.religion",
					"friendly_name": "Religion",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "religion.deity",
					"class": "religion.deity",
					"friendly_name": "Deity",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.christianity",
					"class": "religion.religion",
					"friendly_name": "christian religion",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "religion.belief.belief_of",
					"friendly_name": "Belief Of"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "religion.deity.deity_of",
					"friendly_name": "Religion(s) That Worship This Deity"
				},
				{
					"start": 2,
					"end": 3,
					"relation": "religion.deity.deity_of",
					"friendly_name": "Religion(s) That Worship This Deity"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :religion.belief . \n?x1 :type.object.type :religion.religion . \n?x2 :type.object.type :religion.deity . \nVALUES ?x3 { :en.christianity } \n?x0 :religion.belief.belief_of ?x1 . \n?x2 :religion.deity.deity_of ?x1 . \n?x2 :religion.deity.deity_of ?x3 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 239000400,
		"question": "what are the beliefs of religions that share common deity with christianity?",
		"answer": [
			"Premortality",
			"Nontrinitarianism",
			"Elimination of extremes of wealth and poverty",
			"Sola fide",
			"Unitarian monotheism",
			"Creation",
			"Eastern Orthodox view of sin",
			"World peace",
			"Monotheism",
			"Elimination of all forms of prejudice",
			"Marriage for Time and All Eternity",
			"Resurrection appearances of Jesus",
			"Equality between men and women",
			"Incarnation",
			"Solus Christus",
			"Unity of Mankind",
			"Tikkun olam",
			"Obedience to government and non-involvement in partisan politics",
			"Unity of God",
			"Unity of Religeon",
			"Salvation",
			"Sola scriptura",
			"Infallibility of the Church",
			"Omniscience",
			"Divine simplicity",
			"Sola gratia",
			"Omnipotence",
			"Universal compulsory education",
			"Fall of man",
			"Harmony of religion and science",
			"Original sin",
			"Virgin birth of Jesus",
			"Trinity",
			"God in Mormonism",
			"Degrees of glory",
			"Families Can Be Forever",
			"Soli Deo gloria",
			"Universal auxiliary language",
			"Transubstantiation",
			"Papal infallibility",
			"Independent investigation of truth"
		],
		"function": "none",
		"commonness": -24.899294145777223,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "religion.belief",
					"class": "religion.belief",
					"friendly_name": "Belief",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "religion.religion",
					"class": "religion.religion",
					"friendly_name": "Religion",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "religion.deity",
					"class": "religion.deity",
					"friendly_name": "Deity",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.christianity",
					"class": "religion.religion",
					"friendly_name": "Christianity",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "religion.belief.belief_of",
					"friendly_name": "Belief Of"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "religion.deity.deity_of",
					"friendly_name": "Religion(s) That Worship This Deity"
				},
				{
					"start": 2,
					"end": 3,
					"relation": "religion.deity.deity_of",
					"friendly_name": "Religion(s) That Worship This Deity"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :religion.belief . \n?x1 :type.object.type :religion.religion . \n?x2 :type.object.type :religion.deity . \nVALUES ?x3 { :en.christianity } \n?x0 :religion.belief.belief_of ?x1 . \n?x2 :religion.deity.deity_of ?x1 . \n?x2 :religion.deity.deity_of ?x3 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 239000401,
		"question": "what are the beliefs of religions that share common deity with christian faith?",
		"answer": [
			"Sola fide",
			"Omnipotence",
			"Creation",
			"Universal auxiliary language",
			"Papal infallibility",
			"Unitarian monotheism",
			"Transubstantiation",
			"Monotheism",
			"Unity of God",
			"Fall of man",
			"Degrees of glory",
			"Universal compulsory education",
			"Unity of Religeon",
			"Resurrection appearances of Jesus",
			"World peace",
			"Marriage for Time and All Eternity",
			"Tikkun olam",
			"Soli Deo gloria",
			"Solus Christus",
			"Families Can Be Forever",
			"Unity of Mankind",
			"God in Mormonism",
			"Omniscience",
			"Virgin birth of Jesus",
			"Sola gratia",
			"Divine simplicity",
			"Original sin",
			"Obedience to government and non-involvement in partisan politics",
			"Independent investigation of truth",
			"Eastern Orthodox view of sin",
			"Harmony of religion and science",
			"Elimination of extremes of wealth and poverty",
			"Trinity",
			"Nontrinitarianism",
			"Equality between men and women",
			"Premortality",
			"Infallibility of the Church",
			"Incarnation",
			"Sola scriptura",
			"Elimination of all forms of prejudice",
			"Salvation"
		],
		"function": "none",
		"commonness": -24.899294145777223,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "religion.belief",
					"class": "religion.belief",
					"friendly_name": "Belief",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "religion.religion",
					"class": "religion.religion",
					"friendly_name": "Religion",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "religion.deity",
					"class": "religion.deity",
					"friendly_name": "Deity",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.christianity",
					"class": "religion.religion",
					"friendly_name": "christian faith",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "religion.belief.belief_of",
					"friendly_name": "Belief Of"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "religion.deity.deity_of",
					"friendly_name": "Religion(s) That Worship This Deity"
				},
				{
					"start": 2,
					"end": 3,
					"relation": "religion.deity.deity_of",
					"friendly_name": "Religion(s) That Worship This Deity"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :religion.belief . \n?x1 :type.object.type :religion.religion . \n?x2 :type.object.type :religion.deity . \nVALUES ?x3 { :en.christianity } \n?x0 :religion.belief.belief_of ?x1 . \n?x2 :religion.deity.deity_of ?x1 . \n?x2 :religion.deity.deity_of ?x3 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 239000402,
		"question": "what are the beliefs of religions that share common deity with christian religion?",
		"answer": [
			"Elimination of extremes of wealth and poverty",
			"Solus Christus",
			"Unity of Mankind",
			"Creation",
			"Elimination of all forms of prejudice",
			"Fall of man",
			"Harmony of religion and science",
			"Independent investigation of truth",
			"Omnipotence",
			"Incarnation",
			"Degrees of glory",
			"Sola fide",
			"Unity of God",
			"World peace",
			"Trinity",
			"Infallibility of the Church",
			"Papal infallibility",
			"Nontrinitarianism",
			"Omniscience",
			"Universal compulsory education",
			"Transubstantiation",
			"Eastern Orthodox view of sin",
			"Tikkun olam",
			"Sola scriptura",
			"Universal auxiliary language",
			"Sola gratia",
			"God in Mormonism",
			"Salvation",
			"Premortality",
			"Families Can Be Forever",
			"Marriage for Time and All Eternity",
			"Obedience to government and non-involvement in partisan politics",
			"Unitarian monotheism",
			"Equality between men and women",
			"Monotheism",
			"Unity of Religeon",
			"Soli Deo gloria",
			"Divine simplicity",
			"Resurrection appearances of Jesus",
			"Virgin birth of Jesus",
			"Original sin"
		],
		"function": "none",
		"commonness": -24.899294145777223,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "religion.belief",
					"class": "religion.belief",
					"friendly_name": "Belief",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "religion.religion",
					"class": "religion.religion",
					"friendly_name": "Religion",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "religion.deity",
					"class": "religion.deity",
					"friendly_name": "Deity",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.christianity",
					"class": "religion.religion",
					"friendly_name": "christian religion",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "religion.belief.belief_of",
					"friendly_name": "Belief Of"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "religion.deity.deity_of",
					"friendly_name": "Religion(s) That Worship This Deity"
				},
				{
					"start": 2,
					"end": 3,
					"relation": "religion.deity.deity_of",
					"friendly_name": "Religion(s) That Worship This Deity"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :religion.belief . \n?x1 :type.object.type :religion.religion . \n?x2 :type.object.type :religion.deity . \nVALUES ?x3 { :en.christianity } \n?x0 :religion.belief.belief_of ?x1 . \n?x2 :religion.deity.deity_of ?x1 . \n?x2 :religion.deity.deity_of ?x3 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 240000000,
		"question": "people who are on a gluten-free diet can't eat what cereal grain that is used to make challah?",
		"answer": [
			"Wheat"
		],
		"function": "none",
		"commonness": -39.47646987193651,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.cerealgrains.cereal_grain",
					"class": "base.cerealgrains.cereal_grain",
					"friendly_name": "Cereal Grain",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.challah",
					"class": "food.dish",
					"friendly_name": "Challah",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "food.ingredient",
					"class": "food.ingredient",
					"friendly_name": "Ingredient",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.gluten-free_diet",
					"class": "food.dietary_restriction",
					"friendly_name": "Gluten-free diet",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.cerealgrains.cereal_grain.produced_into_breads",
					"friendly_name": "Produced into breads"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.cerealgrains.cereal_grain.milled_into",
					"friendly_name": "milled into"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "food.dietary_restriction.incompatible_ingredients",
					"friendly_name": "Incompatible ingredients"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.cerealgrains.cereal_grain . \nVALUES ?x1 { :en.challah } \n?x2 :type.object.type :food.ingredient . \nVALUES ?x3 { :en.gluten-free_diet } \n?x0 :base.cerealgrains.cereal_grain.produced_into_breads ?x1 . \n?x0 :base.cerealgrains.cereal_grain.milled_into ?x2 . \n?x3 :food.dietary_restriction.incompatible_ingredients ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 240000001,
		"question": "people who are on a gluten free can't eat what cereal grain that is used to make challah?",
		"answer": [
			"Wheat"
		],
		"function": "none",
		"commonness": -39.47646987193651,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.cerealgrains.cereal_grain",
					"class": "base.cerealgrains.cereal_grain",
					"friendly_name": "Cereal Grain",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.challah",
					"class": "food.dish",
					"friendly_name": "Challah",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "food.ingredient",
					"class": "food.ingredient",
					"friendly_name": "Ingredient",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.gluten-free_diet",
					"class": "food.dietary_restriction",
					"friendly_name": "gluten free",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.cerealgrains.cereal_grain.produced_into_breads",
					"friendly_name": "Produced into breads"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.cerealgrains.cereal_grain.milled_into",
					"friendly_name": "milled into"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "food.dietary_restriction.incompatible_ingredients",
					"friendly_name": "Incompatible ingredients"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.cerealgrains.cereal_grain . \nVALUES ?x1 { :en.challah } \n?x2 :type.object.type :food.ingredient . \nVALUES ?x3 { :en.gluten-free_diet } \n?x0 :base.cerealgrains.cereal_grain.produced_into_breads ?x1 . \n?x0 :base.cerealgrains.cereal_grain.milled_into ?x2 . \n?x3 :food.dietary_restriction.incompatible_ingredients ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 240000100,
		"question": "what are the cereal grains in challah that people on gluten-free diet are not allowed to eat?",
		"answer": [
			"Wheat"
		],
		"function": "none",
		"commonness": -39.47646987193651,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.cerealgrains.cereal_grain",
					"class": "base.cerealgrains.cereal_grain",
					"friendly_name": "Cereal Grain",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.challah",
					"class": "food.dish",
					"friendly_name": "Challah",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "food.ingredient",
					"class": "food.ingredient",
					"friendly_name": "Ingredient",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.gluten-free_diet",
					"class": "food.dietary_restriction",
					"friendly_name": "Gluten-free diet",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.cerealgrains.cereal_grain.produced_into_breads",
					"friendly_name": "Produced into breads"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.cerealgrains.cereal_grain.milled_into",
					"friendly_name": "milled into"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "food.dietary_restriction.incompatible_ingredients",
					"friendly_name": "Incompatible ingredients"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.cerealgrains.cereal_grain . \nVALUES ?x1 { :en.challah } \n?x2 :type.object.type :food.ingredient . \nVALUES ?x3 { :en.gluten-free_diet } \n?x0 :base.cerealgrains.cereal_grain.produced_into_breads ?x1 . \n?x0 :base.cerealgrains.cereal_grain.milled_into ?x2 . \n?x3 :food.dietary_restriction.incompatible_ingredients ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	}
]