[
	{
		"qid": 66000200,
		"question": "what theses are available from university of california, berkeley?",
		"answer": [
			"Ultraproducts and Elementary Classes",
			"A Framework for Separating Server Scalability and Availability from Internet Application Functionality"
		],
		"function": "none",
		"commonness": -17.258794343414916,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.bibkn.thesis",
					"class": "base.bibkn.thesis",
					"friendly_name": "Thesis",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.university_of_california_berkeley",
					"class": "education.educational_institution",
					"friendly_name": "University of California, Berkeley",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "education.dissertation.institution",
					"friendly_name": "Institution"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.bibkn.thesis . \nVALUES ?x1 { :en.university_of_california_berkeley } \n?x0 :education.dissertation.institution ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 66000201,
		"question": "what theses are available from uc berkeley?",
		"answer": [
			"Ultraproducts and Elementary Classes",
			"A Framework for Separating Server Scalability and Availability from Internet Application Functionality"
		],
		"function": "none",
		"commonness": -17.258794343414916,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.bibkn.thesis",
					"class": "base.bibkn.thesis",
					"friendly_name": "Thesis",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.university_of_california_berkeley",
					"class": "education.educational_institution",
					"friendly_name": "uc berkeley",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "education.dissertation.institution",
					"friendly_name": "Institution"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.bibkn.thesis . \nVALUES ?x1 { :en.university_of_california_berkeley } \n?x0 :education.dissertation.institution ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 66000202,
		"question": "what theses are available from university of california at berkeley?",
		"answer": [
			"A Framework for Separating Server Scalability and Availability from Internet Application Functionality",
			"Ultraproducts and Elementary Classes"
		],
		"function": "none",
		"commonness": -17.258794343414916,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.bibkn.thesis",
					"class": "base.bibkn.thesis",
					"friendly_name": "Thesis",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.university_of_california_berkeley",
					"class": "education.educational_institution",
					"friendly_name": "university of california at berkeley",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "education.dissertation.institution",
					"friendly_name": "Institution"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.bibkn.thesis . \nVALUES ?x1 { :en.university_of_california_berkeley } \n?x0 :education.dissertation.institution ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 67000000,
		"question": "what sort of grip does ma lin use when holding the bat?",
		"answer": [
			"Chinese Penhold",
			"Reverse Penhold Backhand"
		],
		"function": "none",
		"commonness": -23.663002565494438,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.tabletennis.grip",
					"class": "base.tabletennis.grip",
					"friendly_name": "Grip",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ma_lin_1980",
					"class": "base.tabletennis.athlete",
					"friendly_name": "Ma Lin",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.tabletennis.athlete.style_of_grip",
					"friendly_name": "Style of grip"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.tabletennis.grip . \nVALUES ?x1 { :en.ma_lin_1980 } \n?x1 :base.tabletennis.athlete.style_of_grip ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 67000001,
		"question": "what sort of grip does lin ma use when holding the bat?",
		"answer": [
			"Chinese Penhold",
			"Reverse Penhold Backhand"
		],
		"function": "none",
		"commonness": -23.663002565494438,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.tabletennis.grip",
					"class": "base.tabletennis.grip",
					"friendly_name": "Grip",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ma_lin_1980",
					"class": "base.tabletennis.athlete",
					"friendly_name": "lin ma",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.tabletennis.athlete.style_of_grip",
					"friendly_name": "Style of grip"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.tabletennis.grip . \nVALUES ?x1 { :en.ma_lin_1980 } \n?x1 :base.tabletennis.athlete.style_of_grip ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 67000200,
		"question": "what style of grip is ma lin using?",
		"answer": [
			"Chinese Penhold",
			"Reverse Penhold Backhand"
		],
		"function": "none",
		"commonness": -23.663002565494438,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.tabletennis.grip",
					"class": "base.tabletennis.grip",
					"friendly_name": "Grip",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ma_lin_1980",
					"class": "base.tabletennis.athlete",
					"friendly_name": "Ma Lin",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.tabletennis.athlete.style_of_grip",
					"friendly_name": "Style of grip"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.tabletennis.grip . \nVALUES ?x1 { :en.ma_lin_1980 } \n?x1 :base.tabletennis.athlete.style_of_grip ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 67000201,
		"question": "what style of grip is lin ma using?",
		"answer": [
			"Chinese Penhold",
			"Reverse Penhold Backhand"
		],
		"function": "none",
		"commonness": -23.663002565494438,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.tabletennis.grip",
					"class": "base.tabletennis.grip",
					"friendly_name": "Grip",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ma_lin_1980",
					"class": "base.tabletennis.athlete",
					"friendly_name": "lin ma",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.tabletennis.athlete.style_of_grip",
					"friendly_name": "Style of grip"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.tabletennis.grip . \nVALUES ?x1 { :en.ma_lin_1980 } \n?x1 :base.tabletennis.athlete.style_of_grip ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 67000300,
		"question": "how does ma lin grip the bat?",
		"answer": [
			"Reverse Penhold Backhand",
			"Chinese Penhold"
		],
		"function": "none",
		"commonness": -23.663002565494438,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.tabletennis.grip",
					"class": "base.tabletennis.grip",
					"friendly_name": "Grip",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ma_lin_1980",
					"class": "base.tabletennis.athlete",
					"friendly_name": "Ma Lin",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.tabletennis.athlete.style_of_grip",
					"friendly_name": "Style of grip"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.tabletennis.grip . \nVALUES ?x1 { :en.ma_lin_1980 } \n?x1 :base.tabletennis.athlete.style_of_grip ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 67000301,
		"question": "how does lin ma grip the bat?",
		"answer": [
			"Reverse Penhold Backhand",
			"Chinese Penhold"
		],
		"function": "none",
		"commonness": -23.663002565494438,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.tabletennis.grip",
					"class": "base.tabletennis.grip",
					"friendly_name": "Grip",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ma_lin_1980",
					"class": "base.tabletennis.athlete",
					"friendly_name": "lin ma",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.tabletennis.athlete.style_of_grip",
					"friendly_name": "Style of grip"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.tabletennis.grip . \nVALUES ?x1 { :en.ma_lin_1980 } \n?x1 :base.tabletennis.athlete.style_of_grip ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 68000000,
		"question": "what are the tropical cyclone classes that the australian bureau of meteorology is using?",
		"answer": [
			"Category 1 Tropical Cyclone (BOM)",
			"Category 4 Severe Tropical Cyclone (BOM)",
			"Category 3 Severe Tropical Cyclone (BOM)",
			"Category 2 Tropical Cyclone (BOM)",
			"Category 5 Severe Tropical Cyclone (BOM)",
			"Tropical Low (BOM)"
		],
		"function": "none",
		"commonness": -17.939991743423864,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "meteorology.tropical_cyclone_category",
					"class": "meteorology.tropical_cyclone_category",
					"friendly_name": "Tropical cyclone category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.bureau_of_meteorology",
					"class": "meteorology.meteorological_service",
					"friendly_name": "Australian Bureau of Meteorology",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "meteorology.meteorological_service.tropical_cyclone_categories",
					"friendly_name": "Tropical Cyclone Categories"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :meteorology.tropical_cyclone_category . \nVALUES ?x1 { :en.bureau_of_meteorology } \n?x1 :meteorology.meteorological_service.tropical_cyclone_categories ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 68000001,
		"question": "what are the tropical cyclone classes that the bom is using?",
		"answer": [
			"Tropical Low (BOM)",
			"Category 3 Severe Tropical Cyclone (BOM)",
			"Category 2 Tropical Cyclone (BOM)",
			"Category 4 Severe Tropical Cyclone (BOM)",
			"Category 1 Tropical Cyclone (BOM)",
			"Category 5 Severe Tropical Cyclone (BOM)"
		],
		"function": "none",
		"commonness": -17.939991743423864,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "meteorology.tropical_cyclone_category",
					"class": "meteorology.tropical_cyclone_category",
					"friendly_name": "Tropical cyclone category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.bureau_of_meteorology",
					"class": "meteorology.meteorological_service",
					"friendly_name": "bom",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "meteorology.meteorological_service.tropical_cyclone_categories",
					"friendly_name": "Tropical Cyclone Categories"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :meteorology.tropical_cyclone_category . \nVALUES ?x1 { :en.bureau_of_meteorology } \n?x1 :meteorology.meteorological_service.tropical_cyclone_categories ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 68000002,
		"question": "what are the tropical cyclone classes that the bureau of meteorology is using?",
		"answer": [
			"Tropical Low (BOM)",
			"Category 5 Severe Tropical Cyclone (BOM)",
			"Category 1 Tropical Cyclone (BOM)",
			"Category 2 Tropical Cyclone (BOM)",
			"Category 4 Severe Tropical Cyclone (BOM)",
			"Category 3 Severe Tropical Cyclone (BOM)"
		],
		"function": "none",
		"commonness": -17.939991743423864,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "meteorology.tropical_cyclone_category",
					"class": "meteorology.tropical_cyclone_category",
					"friendly_name": "Tropical cyclone category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.bureau_of_meteorology",
					"class": "meteorology.meteorological_service",
					"friendly_name": "bureau of meteorology",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "meteorology.meteorological_service.tropical_cyclone_categories",
					"friendly_name": "Tropical Cyclone Categories"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :meteorology.tropical_cyclone_category . \nVALUES ?x1 { :en.bureau_of_meteorology } \n?x1 :meteorology.meteorological_service.tropical_cyclone_categories ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 68000100,
		"question": "what categories of tropical cyclones are used by the australian bureau of meteorology?",
		"answer": [
			"Tropical Low (BOM)",
			"Category 3 Severe Tropical Cyclone (BOM)",
			"Category 4 Severe Tropical Cyclone (BOM)",
			"Category 5 Severe Tropical Cyclone (BOM)",
			"Category 2 Tropical Cyclone (BOM)",
			"Category 1 Tropical Cyclone (BOM)"
		],
		"function": "none",
		"commonness": -17.939991743423864,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "meteorology.tropical_cyclone_category",
					"class": "meteorology.tropical_cyclone_category",
					"friendly_name": "Tropical cyclone category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.bureau_of_meteorology",
					"class": "meteorology.meteorological_service",
					"friendly_name": "Australian Bureau of Meteorology",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "meteorology.meteorological_service.tropical_cyclone_categories",
					"friendly_name": "Tropical Cyclone Categories"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :meteorology.tropical_cyclone_category . \nVALUES ?x1 { :en.bureau_of_meteorology } \n?x1 :meteorology.meteorological_service.tropical_cyclone_categories ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 68000101,
		"question": "what categories of tropical cyclones are used by the bom?",
		"answer": [
			"Category 3 Severe Tropical Cyclone (BOM)",
			"Category 1 Tropical Cyclone (BOM)",
			"Category 2 Tropical Cyclone (BOM)",
			"Category 4 Severe Tropical Cyclone (BOM)",
			"Tropical Low (BOM)",
			"Category 5 Severe Tropical Cyclone (BOM)"
		],
		"function": "none",
		"commonness": -17.939991743423864,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "meteorology.tropical_cyclone_category",
					"class": "meteorology.tropical_cyclone_category",
					"friendly_name": "Tropical cyclone category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.bureau_of_meteorology",
					"class": "meteorology.meteorological_service",
					"friendly_name": "bom",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "meteorology.meteorological_service.tropical_cyclone_categories",
					"friendly_name": "Tropical Cyclone Categories"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :meteorology.tropical_cyclone_category . \nVALUES ?x1 { :en.bureau_of_meteorology } \n?x1 :meteorology.meteorological_service.tropical_cyclone_categories ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 68000102,
		"question": "what categories of tropical cyclones are used by the bureau of meteorology?",
		"answer": [
			"Category 2 Tropical Cyclone (BOM)",
			"Category 3 Severe Tropical Cyclone (BOM)",
			"Category 4 Severe Tropical Cyclone (BOM)",
			"Category 5 Severe Tropical Cyclone (BOM)",
			"Tropical Low (BOM)",
			"Category 1 Tropical Cyclone (BOM)"
		],
		"function": "none",
		"commonness": -17.939991743423864,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "meteorology.tropical_cyclone_category",
					"class": "meteorology.tropical_cyclone_category",
					"friendly_name": "Tropical cyclone category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.bureau_of_meteorology",
					"class": "meteorology.meteorological_service",
					"friendly_name": "bureau of meteorology",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "meteorology.meteorological_service.tropical_cyclone_categories",
					"friendly_name": "Tropical Cyclone Categories"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :meteorology.tropical_cyclone_category . \nVALUES ?x1 { :en.bureau_of_meteorology } \n?x1 :meteorology.meteorological_service.tropical_cyclone_categories ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 68000200,
		"question": "the australian bureau of meteorology uses which categories of tropical cyclones?",
		"answer": [
			"Category 2 Tropical Cyclone (BOM)",
			"Category 5 Severe Tropical Cyclone (BOM)",
			"Category 4 Severe Tropical Cyclone (BOM)",
			"Tropical Low (BOM)",
			"Category 3 Severe Tropical Cyclone (BOM)",
			"Category 1 Tropical Cyclone (BOM)"
		],
		"function": "none",
		"commonness": -17.939991743423864,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "meteorology.tropical_cyclone_category",
					"class": "meteorology.tropical_cyclone_category",
					"friendly_name": "Tropical cyclone category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.bureau_of_meteorology",
					"class": "meteorology.meteorological_service",
					"friendly_name": "Australian Bureau of Meteorology",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "meteorology.meteorological_service.tropical_cyclone_categories",
					"friendly_name": "Tropical Cyclone Categories"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :meteorology.tropical_cyclone_category . \nVALUES ?x1 { :en.bureau_of_meteorology } \n?x1 :meteorology.meteorological_service.tropical_cyclone_categories ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 68000201,
		"question": "the bom uses which categories of tropical cyclones?",
		"answer": [
			"Category 4 Severe Tropical Cyclone (BOM)",
			"Category 5 Severe Tropical Cyclone (BOM)",
			"Category 2 Tropical Cyclone (BOM)",
			"Tropical Low (BOM)",
			"Category 1 Tropical Cyclone (BOM)",
			"Category 3 Severe Tropical Cyclone (BOM)"
		],
		"function": "none",
		"commonness": -17.939991743423864,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "meteorology.tropical_cyclone_category",
					"class": "meteorology.tropical_cyclone_category",
					"friendly_name": "Tropical cyclone category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.bureau_of_meteorology",
					"class": "meteorology.meteorological_service",
					"friendly_name": "bom",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "meteorology.meteorological_service.tropical_cyclone_categories",
					"friendly_name": "Tropical Cyclone Categories"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :meteorology.tropical_cyclone_category . \nVALUES ?x1 { :en.bureau_of_meteorology } \n?x1 :meteorology.meteorological_service.tropical_cyclone_categories ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 68000202,
		"question": "the bureau of meteorology uses which categories of tropical cyclones?",
		"answer": [
			"Category 4 Severe Tropical Cyclone (BOM)",
			"Category 2 Tropical Cyclone (BOM)",
			"Category 1 Tropical Cyclone (BOM)",
			"Category 5 Severe Tropical Cyclone (BOM)",
			"Tropical Low (BOM)",
			"Category 3 Severe Tropical Cyclone (BOM)"
		],
		"function": "none",
		"commonness": -17.939991743423864,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "meteorology.tropical_cyclone_category",
					"class": "meteorology.tropical_cyclone_category",
					"friendly_name": "Tropical cyclone category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.bureau_of_meteorology",
					"class": "meteorology.meteorological_service",
					"friendly_name": "bureau of meteorology",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "meteorology.meteorological_service.tropical_cyclone_categories",
					"friendly_name": "Tropical Cyclone Categories"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :meteorology.tropical_cyclone_category . \nVALUES ?x1 { :en.bureau_of_meteorology } \n?x1 :meteorology.meteorological_service.tropical_cyclone_categories ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 68000300,
		"question": "what categories does the australian bureau of meteorology use for tropical cyclones?",
		"answer": [
			"Tropical Low (BOM)",
			"Category 1 Tropical Cyclone (BOM)",
			"Category 4 Severe Tropical Cyclone (BOM)",
			"Category 3 Severe Tropical Cyclone (BOM)",
			"Category 2 Tropical Cyclone (BOM)",
			"Category 5 Severe Tropical Cyclone (BOM)"
		],
		"function": "none",
		"commonness": -17.939991743423864,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "meteorology.tropical_cyclone_category",
					"class": "meteorology.tropical_cyclone_category",
					"friendly_name": "Tropical cyclone category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.bureau_of_meteorology",
					"class": "meteorology.meteorological_service",
					"friendly_name": "Australian Bureau of Meteorology",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "meteorology.meteorological_service.tropical_cyclone_categories",
					"friendly_name": "Tropical Cyclone Categories"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :meteorology.tropical_cyclone_category . \nVALUES ?x1 { :en.bureau_of_meteorology } \n?x1 :meteorology.meteorological_service.tropical_cyclone_categories ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 68000301,
		"question": "what categories does the bom use for tropical cyclones?",
		"answer": [
			"Category 5 Severe Tropical Cyclone (BOM)",
			"Category 3 Severe Tropical Cyclone (BOM)",
			"Category 4 Severe Tropical Cyclone (BOM)",
			"Category 2 Tropical Cyclone (BOM)",
			"Category 1 Tropical Cyclone (BOM)",
			"Tropical Low (BOM)"
		],
		"function": "none",
		"commonness": -17.939991743423864,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "meteorology.tropical_cyclone_category",
					"class": "meteorology.tropical_cyclone_category",
					"friendly_name": "Tropical cyclone category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.bureau_of_meteorology",
					"class": "meteorology.meteorological_service",
					"friendly_name": "bom",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "meteorology.meteorological_service.tropical_cyclone_categories",
					"friendly_name": "Tropical Cyclone Categories"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :meteorology.tropical_cyclone_category . \nVALUES ?x1 { :en.bureau_of_meteorology } \n?x1 :meteorology.meteorological_service.tropical_cyclone_categories ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 68000302,
		"question": "what categories does the bureau of meteorology use for tropical cyclones?",
		"answer": [
			"Category 2 Tropical Cyclone (BOM)",
			"Category 1 Tropical Cyclone (BOM)",
			"Category 3 Severe Tropical Cyclone (BOM)",
			"Category 5 Severe Tropical Cyclone (BOM)",
			"Category 4 Severe Tropical Cyclone (BOM)",
			"Tropical Low (BOM)"
		],
		"function": "none",
		"commonness": -17.939991743423864,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "meteorology.tropical_cyclone_category",
					"class": "meteorology.tropical_cyclone_category",
					"friendly_name": "Tropical cyclone category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.bureau_of_meteorology",
					"class": "meteorology.meteorological_service",
					"friendly_name": "bureau of meteorology",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "meteorology.meteorological_service.tropical_cyclone_categories",
					"friendly_name": "Tropical Cyclone Categories"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :meteorology.tropical_cyclone_category . \nVALUES ?x1 { :en.bureau_of_meteorology } \n?x1 :meteorology.meteorological_service.tropical_cyclone_categories ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]