[
	{
		"qid": 130000302,
		"question": "how many infectious diseases are carried by chiroptera?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -15.511404288060435,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.infectious_disease",
					"class": "medicine.infectious_disease",
					"friendly_name": "Infectious Disease",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.bat",
					"class": "medicine.vector_of_disease",
					"friendly_name": "chiroptera",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "medicine.vector_of_disease.disease",
					"friendly_name": "Disease(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.infectious_disease . \nVALUES ?x1 { :en.bat } \n?x1 :medicine.vector_of_disease.disease ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 130000400,
		"question": "how many diseases do bat spread?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -15.511404288060435,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.infectious_disease",
					"class": "medicine.infectious_disease",
					"friendly_name": "Infectious Disease",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.bat",
					"class": "medicine.vector_of_disease",
					"friendly_name": "Bat",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "medicine.vector_of_disease.disease",
					"friendly_name": "Disease(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.infectious_disease . \nVALUES ?x1 { :en.bat } \n?x1 :medicine.vector_of_disease.disease ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 130000401,
		"question": "how many diseases do bats spread?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -15.511404288060435,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.infectious_disease",
					"class": "medicine.infectious_disease",
					"friendly_name": "Infectious Disease",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.bat",
					"class": "medicine.vector_of_disease",
					"friendly_name": "bats",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "medicine.vector_of_disease.disease",
					"friendly_name": "Disease(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.infectious_disease . \nVALUES ?x1 { :en.bat } \n?x1 :medicine.vector_of_disease.disease ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 130000402,
		"question": "how many diseases do chiroptera spread?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -15.511404288060435,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.infectious_disease",
					"class": "medicine.infectious_disease",
					"friendly_name": "Infectious Disease",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.bat",
					"class": "medicine.vector_of_disease",
					"friendly_name": "chiroptera",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "medicine.vector_of_disease.disease",
					"friendly_name": "Disease(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.infectious_disease . \nVALUES ?x1 { :en.bat } \n?x1 :medicine.vector_of_disease.disease ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 131000000,
		"question": "tell me the number of works written by britney spears.",
		"answer": [
			"6"
		],
		"function": "count",
		"commonness": -11.2678746151692,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.composition",
					"class": "music.composition",
					"friendly_name": "Composition",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.britney_spears",
					"class": "music.composer",
					"friendly_name": "Britney Spears",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "music.composer.compositions",
					"friendly_name": "Works Composed"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.composition . \nVALUES ?x1 { :en.britney_spears } \n?x1 :music.composer.compositions ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 131000100,
		"question": "how many works has britney spears written?",
		"answer": [
			"6"
		],
		"function": "count",
		"commonness": -11.2678746151692,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.composition",
					"class": "music.composition",
					"friendly_name": "Composition",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.britney_spears",
					"class": "music.composer",
					"friendly_name": "Britney Spears",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "music.composer.compositions",
					"friendly_name": "Works Composed"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.composition . \nVALUES ?x1 { :en.britney_spears } \n?x1 :music.composer.compositions ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 131000101,
		"question": "how many works has britney written?",
		"answer": [
			"6"
		],
		"function": "count",
		"commonness": -11.2678746151692,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.composition",
					"class": "music.composition",
					"friendly_name": "Composition",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.britney_spears",
					"class": "music.composer",
					"friendly_name": "britney",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "music.composer.compositions",
					"friendly_name": "Works Composed"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.composition . \nVALUES ?x1 { :en.britney_spears } \n?x1 :music.composer.compositions ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 131000200,
		"question": "how many compositions has britney spears written?",
		"answer": [
			"6"
		],
		"function": "count",
		"commonness": -11.2678746151692,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.composition",
					"class": "music.composition",
					"friendly_name": "Composition",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.britney_spears",
					"class": "music.composer",
					"friendly_name": "Britney Spears",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "music.composer.compositions",
					"friendly_name": "Works Composed"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.composition . \nVALUES ?x1 { :en.britney_spears } \n?x1 :music.composer.compositions ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 131000201,
		"question": "how many compositions has britney written?",
		"answer": [
			"6"
		],
		"function": "count",
		"commonness": -11.2678746151692,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.composition",
					"class": "music.composition",
					"friendly_name": "Composition",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.britney_spears",
					"class": "music.composer",
					"friendly_name": "britney",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "music.composer.compositions",
					"friendly_name": "Works Composed"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.composition . \nVALUES ?x1 { :en.britney_spears } \n?x1 :music.composer.compositions ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 131000202,
		"question": "how many compositions has brit written?",
		"answer": [
			"6"
		],
		"function": "count",
		"commonness": -11.2678746151692,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.composition",
					"class": "music.composition",
					"friendly_name": "Composition",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.britney_spears",
					"class": "music.composer",
					"friendly_name": "brit",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "music.composer.compositions",
					"friendly_name": "Works Composed"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.composition . \nVALUES ?x1 { :en.britney_spears } \n?x1 :music.composer.compositions ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 131000300,
		"question": "how many different works have been written by the artist britney spears?",
		"answer": [
			"6"
		],
		"function": "count",
		"commonness": -11.2678746151692,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.composition",
					"class": "music.composition",
					"friendly_name": "Composition",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.britney_spears",
					"class": "music.composer",
					"friendly_name": "Britney Spears",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "music.composer.compositions",
					"friendly_name": "Works Composed"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.composition . \nVALUES ?x1 { :en.britney_spears } \n?x1 :music.composer.compositions ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 131000301,
		"question": "how many different works have been written by the artist britney?",
		"answer": [
			"6"
		],
		"function": "count",
		"commonness": -11.2678746151692,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.composition",
					"class": "music.composition",
					"friendly_name": "Composition",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.britney_spears",
					"class": "music.composer",
					"friendly_name": "britney",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "music.composer.compositions",
					"friendly_name": "Works Composed"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.composition . \nVALUES ?x1 { :en.britney_spears } \n?x1 :music.composer.compositions ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 131000302,
		"question": "how many different works have been written by the artist brit?",
		"answer": [
			"6"
		],
		"function": "count",
		"commonness": -11.2678746151692,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.composition",
					"class": "music.composition",
					"friendly_name": "Composition",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.britney_spears",
					"class": "music.composer",
					"friendly_name": "brit",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "music.composer.compositions",
					"friendly_name": "Works Composed"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.composition . \nVALUES ?x1 { :en.britney_spears } \n?x1 :music.composer.compositions ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 131000400,
		"question": "how many works are there composed by britney spears?",
		"answer": [
			"6"
		],
		"function": "count",
		"commonness": -11.2678746151692,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.composition",
					"class": "music.composition",
					"friendly_name": "Composition",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.britney_spears",
					"class": "music.composer",
					"friendly_name": "Britney Spears",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "music.composer.compositions",
					"friendly_name": "Works Composed"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.composition . \nVALUES ?x1 { :en.britney_spears } \n?x1 :music.composer.compositions ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 131000401,
		"question": "how many works are there composed by britney?",
		"answer": [
			"6"
		],
		"function": "count",
		"commonness": -11.2678746151692,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.composition",
					"class": "music.composition",
					"friendly_name": "Composition",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.britney_spears",
					"class": "music.composer",
					"friendly_name": "britney",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "music.composer.compositions",
					"friendly_name": "Works Composed"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.composition . \nVALUES ?x1 { :en.britney_spears } \n?x1 :music.composer.compositions ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 131000402,
		"question": "how many works are there composed by brit?",
		"answer": [
			"6"
		],
		"function": "count",
		"commonness": -11.2678746151692,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.composition",
					"class": "music.composition",
					"friendly_name": "Composition",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.britney_spears",
					"class": "music.composer",
					"friendly_name": "brit",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "music.composer.compositions",
					"friendly_name": "Works Composed"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.composition . \nVALUES ?x1 { :en.britney_spears } \n?x1 :music.composer.compositions ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 131000500,
		"question": "britney spears has produced how many works?",
		"answer": [
			"6"
		],
		"function": "count",
		"commonness": -11.2678746151692,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.composition",
					"class": "music.composition",
					"friendly_name": "Composition",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.britney_spears",
					"class": "music.composer",
					"friendly_name": "Britney Spears",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "music.composer.compositions",
					"friendly_name": "Works Composed"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.composition . \nVALUES ?x1 { :en.britney_spears } \n?x1 :music.composer.compositions ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 131000501,
		"question": "britney has produced how many works?",
		"answer": [
			"6"
		],
		"function": "count",
		"commonness": -11.2678746151692,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.composition",
					"class": "music.composition",
					"friendly_name": "Composition",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.britney_spears",
					"class": "music.composer",
					"friendly_name": "britney",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "music.composer.compositions",
					"friendly_name": "Works Composed"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.composition . \nVALUES ?x1 { :en.britney_spears } \n?x1 :music.composer.compositions ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 131000502,
		"question": "brit has produced how many works?",
		"answer": [
			"6"
		],
		"function": "count",
		"commonness": -11.2678746151692,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.composition",
					"class": "music.composition",
					"friendly_name": "Composition",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.britney_spears",
					"class": "music.composer",
					"friendly_name": "brit",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "music.composer.compositions",
					"friendly_name": "Works Composed"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.composition . \nVALUES ?x1 { :en.britney_spears } \n?x1 :music.composer.compositions ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 133000000,
		"question": "which elements take 6.8281 ev or more to remove the first electron?",
		"answer": [
			"Bromine",
			"Radon",
			"Lead",
			"Gold",
			"Antimony",
			"Iridium",
			"Polonium",
			"Tin",
			"Astatine",
			"Hydrogen",
			"Beryllium",
			"Silicon",
			"Iodine",
			"Palladium",
			"Krypton",
			"Zinc",
			"Tantalum",
			"Titanium",
			"Rhenium",
			"Sulfur",
			"Neon",
			"Iron",
			"Carbon",
			"Ruthenium",
			"Platinum",
			"Argon",
			"Tungsten",
			"Cobalt",
			"Oxygen",
			"Arsenic",
			"Selenium",
			"Chlorine",
			"Silver",
			"Fluorine",
			"Cadmium",
			"Mercury",
			"Phosphorus",
			"Molybdenum",
			"Manganese",
			"Nitrogen",
			"Rhodium",
			"Germanium",
			"Osmium",
			"Boron",
			"Copper",
			"Technetium",
			"Tellurium",
			"Xenon",
			"Bismuth",
			"Magnesium",
			"Helium",
			"Nickel"
		],
		"function": ">=",
		"commonness": -15.146760603120509,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "chemistry.chemical_element",
					"class": "chemistry.chemical_element",
					"friendly_name": "Chemical Element",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "6.8281^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "6.8281",
					"question_node": 0,
					"function": ">="
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "chemistry.chemical_element.ionization_energy",
					"friendly_name": "Ionization Energy"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :chemistry.chemical_element . \nFILTER (?x1 >= 6.8281)\n?x0 :chemistry.chemical_element.ionization_energy ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 133000100,
		"question": "the ionization energy of which elements are at least 6.8281 ev?",
		"answer": [
			"Neon",
			"Krypton",
			"Selenium",
			"Boron",
			"Iron",
			"Iodine",
			"Germanium",
			"Hydrogen",
			"Antimony",
			"Cobalt",
			"Fluorine",
			"Helium",
			"Gold",
			"Nickel",
			"Platinum",
			"Cadmium",
			"Chlorine",
			"Silver",
			"Zinc",
			"Phosphorus",
			"Radon",
			"Rhodium",
			"Tin",
			"Osmium",
			"Tantalum",
			"Arsenic",
			"Bismuth",
			"Ruthenium",
			"Magnesium",
			"Rhenium",
			"Iridium",
			"Silicon",
			"Sulfur",
			"Manganese",
			"Lead",
			"Argon",
			"Molybdenum",
			"Astatine",
			"Technetium",
			"Mercury",
			"Palladium",
			"Titanium",
			"Oxygen",
			"Tellurium",
			"Bromine",
			"Tungsten",
			"Copper",
			"Carbon",
			"Xenon",
			"Nitrogen",
			"Beryllium",
			"Polonium"
		],
		"function": ">=",
		"commonness": -15.146760603120509,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "chemistry.chemical_element",
					"class": "chemistry.chemical_element",
					"friendly_name": "Chemical Element",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "6.8281^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "6.8281",
					"question_node": 0,
					"function": ">="
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "chemistry.chemical_element.ionization_energy",
					"friendly_name": "Ionization Energy"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :chemistry.chemical_element . \nFILTER (?x1 >= 6.8281)\n?x0 :chemistry.chemical_element.ionization_energy ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 133000200,
		"question": "which elements have an ionization energy higher than or equal to 6.8281 ev?",
		"answer": [
			"Astatine",
			"Tin",
			"Mercury",
			"Phosphorus",
			"Neon",
			"Oxygen",
			"Polonium",
			"Gold",
			"Silver",
			"Boron",
			"Germanium",
			"Bromine",
			"Fluorine",
			"Iridium",
			"Rhenium",
			"Cadmium",
			"Nickel",
			"Technetium",
			"Rhodium",
			"Iodine",
			"Titanium",
			"Lead",
			"Nitrogen",
			"Argon",
			"Radon",
			"Tungsten",
			"Tellurium",
			"Antimony",
			"Tantalum",
			"Hydrogen",
			"Zinc",
			"Beryllium",
			"Manganese",
			"Copper",
			"Silicon",
			"Cobalt",
			"Platinum",
			"Osmium",
			"Xenon",
			"Selenium",
			"Chlorine",
			"Carbon",
			"Krypton",
			"Ruthenium",
			"Helium",
			"Palladium",
			"Sulfur",
			"Arsenic",
			"Molybdenum",
			"Bismuth",
			"Iron",
			"Magnesium"
		],
		"function": ">=",
		"commonness": -15.146760603120509,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "chemistry.chemical_element",
					"class": "chemistry.chemical_element",
					"friendly_name": "Chemical Element",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "6.8281^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "6.8281",
					"question_node": 0,
					"function": ">="
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "chemistry.chemical_element.ionization_energy",
					"friendly_name": "Ionization Energy"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :chemistry.chemical_element . \nFILTER (?x1 >= 6.8281)\n?x0 :chemistry.chemical_element.ionization_energy ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 135000000,
		"question": "can you mention the number of video game versions developed on microsoft windows?",
		"answer": [
			"5977"
		],
		"function": "count",
		"commonness": -11.13681288636446,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "cvg.game_version",
					"class": "cvg.game_version",
					"friendly_name": "Video Game Version",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.microsoft_windows",
					"class": "cvg.cvg_platform",
					"friendly_name": "Microsoft Windows",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "cvg.game_version.platform",
					"friendly_name": "Platform"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :cvg.game_version . \nVALUES ?x1 { :en.microsoft_windows } \n?x0 :cvg.game_version.platform ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 135000001,
		"question": "can you mention the number of video game versions developed on windows?",
		"answer": [
			"5977"
		],
		"function": "count",
		"commonness": -11.13681288636446,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "cvg.game_version",
					"class": "cvg.game_version",
					"friendly_name": "Video Game Version",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.microsoft_windows",
					"class": "cvg.cvg_platform",
					"friendly_name": "windows",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "cvg.game_version.platform",
					"friendly_name": "Platform"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :cvg.game_version . \nVALUES ?x1 { :en.microsoft_windows } \n?x0 :cvg.game_version.platform ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]