[
	{
		"qid": 176000000,
		"question": "who has curated an art exhibition about the united states of america?",
		"answer": [
			"Hagedorn Foundation Gallery"
		],
		"function": "none",
		"commonness": -26.893781750444095,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "exhibitions.exhibition_curator",
					"class": "exhibitions.exhibition_curator",
					"friendly_name": "Exhibition curator",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "exhibitions.exhibition",
					"class": "exhibitions.exhibition",
					"friendly_name": "Exhibition",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "exhibitions.exhibition_subject",
					"friendly_name": "United States of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "exhibitions.exhibition.curators",
					"friendly_name": "Curators"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "exhibitions.exhibition_subject.exhibitions_created_about_this_subject",
					"friendly_name": "Exhibitions created about this subject"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :exhibitions.exhibition_curator . \n?x1 :type.object.type :exhibitions.exhibition . \nVALUES ?x2 { :en.united_states_of_america } \n?x1 :exhibitions.exhibition.curators ?x0 . \n?x2 :exhibitions.exhibition_subject.exhibitions_created_about_this_subject ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 176000001,
		"question": "who has curated an art exhibition about the us?",
		"answer": [
			"Hagedorn Foundation Gallery"
		],
		"function": "none",
		"commonness": -26.893781750444095,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "exhibitions.exhibition_curator",
					"class": "exhibitions.exhibition_curator",
					"friendly_name": "Exhibition curator",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "exhibitions.exhibition",
					"class": "exhibitions.exhibition",
					"friendly_name": "Exhibition",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "exhibitions.exhibition_subject",
					"friendly_name": "us",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "exhibitions.exhibition.curators",
					"friendly_name": "Curators"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "exhibitions.exhibition_subject.exhibitions_created_about_this_subject",
					"friendly_name": "Exhibitions created about this subject"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :exhibitions.exhibition_curator . \n?x1 :type.object.type :exhibitions.exhibition . \nVALUES ?x2 { :en.united_states_of_america } \n?x1 :exhibitions.exhibition.curators ?x0 . \n?x2 :exhibitions.exhibition_subject.exhibitions_created_about_this_subject ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 176000002,
		"question": "who has curated an art exhibition about the united states?",
		"answer": [
			"Hagedorn Foundation Gallery"
		],
		"function": "none",
		"commonness": -26.893781750444095,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "exhibitions.exhibition_curator",
					"class": "exhibitions.exhibition_curator",
					"friendly_name": "Exhibition curator",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "exhibitions.exhibition",
					"class": "exhibitions.exhibition",
					"friendly_name": "Exhibition",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "exhibitions.exhibition_subject",
					"friendly_name": "united states",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "exhibitions.exhibition.curators",
					"friendly_name": "Curators"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "exhibitions.exhibition_subject.exhibitions_created_about_this_subject",
					"friendly_name": "Exhibitions created about this subject"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :exhibitions.exhibition_curator . \n?x1 :type.object.type :exhibitions.exhibition . \nVALUES ?x2 { :en.united_states_of_america } \n?x1 :exhibitions.exhibition.curators ?x0 . \n?x2 :exhibitions.exhibition_subject.exhibitions_created_about_this_subject ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 176000200,
		"question": "who has curated an exhibition with the united states of america as it's subject?",
		"answer": [
			"Hagedorn Foundation Gallery"
		],
		"function": "none",
		"commonness": -26.893781750444095,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "exhibitions.exhibition_curator",
					"class": "exhibitions.exhibition_curator",
					"friendly_name": "Exhibition curator",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "exhibitions.exhibition",
					"class": "exhibitions.exhibition",
					"friendly_name": "Exhibition",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "exhibitions.exhibition_subject",
					"friendly_name": "United States of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "exhibitions.exhibition.curators",
					"friendly_name": "Curators"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "exhibitions.exhibition_subject.exhibitions_created_about_this_subject",
					"friendly_name": "Exhibitions created about this subject"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :exhibitions.exhibition_curator . \n?x1 :type.object.type :exhibitions.exhibition . \nVALUES ?x2 { :en.united_states_of_america } \n?x1 :exhibitions.exhibition.curators ?x0 . \n?x2 :exhibitions.exhibition_subject.exhibitions_created_about_this_subject ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 176000202,
		"question": "who has curated an exhibition with the united states as it's subject?",
		"answer": [
			"Hagedorn Foundation Gallery"
		],
		"function": "none",
		"commonness": -26.893781750444095,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "exhibitions.exhibition_curator",
					"class": "exhibitions.exhibition_curator",
					"friendly_name": "Exhibition curator",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "exhibitions.exhibition",
					"class": "exhibitions.exhibition",
					"friendly_name": "Exhibition",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "exhibitions.exhibition_subject",
					"friendly_name": "united states",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "exhibitions.exhibition.curators",
					"friendly_name": "Curators"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "exhibitions.exhibition_subject.exhibitions_created_about_this_subject",
					"friendly_name": "Exhibitions created about this subject"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :exhibitions.exhibition_curator . \n?x1 :type.object.type :exhibitions.exhibition . \nVALUES ?x2 { :en.united_states_of_america } \n?x1 :exhibitions.exhibition.curators ?x0 . \n?x2 :exhibitions.exhibition_subject.exhibitions_created_about_this_subject ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 176000300,
		"question": "who curated exhibitions about the united states of america?",
		"answer": [
			"Hagedorn Foundation Gallery"
		],
		"function": "none",
		"commonness": -26.893781750444095,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "exhibitions.exhibition_curator",
					"class": "exhibitions.exhibition_curator",
					"friendly_name": "Exhibition curator",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "exhibitions.exhibition",
					"class": "exhibitions.exhibition",
					"friendly_name": "Exhibition",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "exhibitions.exhibition_subject",
					"friendly_name": "United States of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "exhibitions.exhibition.curators",
					"friendly_name": "Curators"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "exhibitions.exhibition_subject.exhibitions_created_about_this_subject",
					"friendly_name": "Exhibitions created about this subject"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :exhibitions.exhibition_curator . \n?x1 :type.object.type :exhibitions.exhibition . \nVALUES ?x2 { :en.united_states_of_america } \n?x1 :exhibitions.exhibition.curators ?x0 . \n?x2 :exhibitions.exhibition_subject.exhibitions_created_about_this_subject ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 176000301,
		"question": "who curated exhibitions about the us?",
		"answer": [
			"Hagedorn Foundation Gallery"
		],
		"function": "none",
		"commonness": -26.893781750444095,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "exhibitions.exhibition_curator",
					"class": "exhibitions.exhibition_curator",
					"friendly_name": "Exhibition curator",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "exhibitions.exhibition",
					"class": "exhibitions.exhibition",
					"friendly_name": "Exhibition",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "exhibitions.exhibition_subject",
					"friendly_name": "us",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "exhibitions.exhibition.curators",
					"friendly_name": "Curators"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "exhibitions.exhibition_subject.exhibitions_created_about_this_subject",
					"friendly_name": "Exhibitions created about this subject"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :exhibitions.exhibition_curator . \n?x1 :type.object.type :exhibitions.exhibition . \nVALUES ?x2 { :en.united_states_of_america } \n?x1 :exhibitions.exhibition.curators ?x0 . \n?x2 :exhibitions.exhibition_subject.exhibitions_created_about_this_subject ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 176000401,
		"question": "who are the curators of exhibitions on the subject the us?",
		"answer": [
			"Hagedorn Foundation Gallery"
		],
		"function": "none",
		"commonness": -26.893781750444095,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "exhibitions.exhibition_curator",
					"class": "exhibitions.exhibition_curator",
					"friendly_name": "Exhibition curator",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "exhibitions.exhibition",
					"class": "exhibitions.exhibition",
					"friendly_name": "Exhibition",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "exhibitions.exhibition_subject",
					"friendly_name": "us",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "exhibitions.exhibition.curators",
					"friendly_name": "Curators"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "exhibitions.exhibition_subject.exhibitions_created_about_this_subject",
					"friendly_name": "Exhibitions created about this subject"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :exhibitions.exhibition_curator . \n?x1 :type.object.type :exhibitions.exhibition . \nVALUES ?x2 { :en.united_states_of_america } \n?x1 :exhibitions.exhibition.curators ?x0 . \n?x2 :exhibitions.exhibition_subject.exhibitions_created_about_this_subject ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 176000500,
		"question": "what is the name of someone responsible for curating an exhibition about the united states of america?",
		"answer": [
			"Hagedorn Foundation Gallery"
		],
		"function": "none",
		"commonness": -26.893781750444095,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "exhibitions.exhibition_curator",
					"class": "exhibitions.exhibition_curator",
					"friendly_name": "Exhibition curator",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "exhibitions.exhibition",
					"class": "exhibitions.exhibition",
					"friendly_name": "Exhibition",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "exhibitions.exhibition_subject",
					"friendly_name": "United States of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "exhibitions.exhibition.curators",
					"friendly_name": "Curators"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "exhibitions.exhibition_subject.exhibitions_created_about_this_subject",
					"friendly_name": "Exhibitions created about this subject"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :exhibitions.exhibition_curator . \n?x1 :type.object.type :exhibitions.exhibition . \nVALUES ?x2 { :en.united_states_of_america } \n?x1 :exhibitions.exhibition.curators ?x0 . \n?x2 :exhibitions.exhibition_subject.exhibitions_created_about_this_subject ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 176000501,
		"question": "what is the name of someone responsible for curating an exhibition about the us?",
		"answer": [
			"Hagedorn Foundation Gallery"
		],
		"function": "none",
		"commonness": -26.893781750444095,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "exhibitions.exhibition_curator",
					"class": "exhibitions.exhibition_curator",
					"friendly_name": "Exhibition curator",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "exhibitions.exhibition",
					"class": "exhibitions.exhibition",
					"friendly_name": "Exhibition",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "exhibitions.exhibition_subject",
					"friendly_name": "us",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "exhibitions.exhibition.curators",
					"friendly_name": "Curators"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "exhibitions.exhibition_subject.exhibitions_created_about_this_subject",
					"friendly_name": "Exhibitions created about this subject"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :exhibitions.exhibition_curator . \n?x1 :type.object.type :exhibitions.exhibition . \nVALUES ?x2 { :en.united_states_of_america } \n?x1 :exhibitions.exhibition.curators ?x0 . \n?x2 :exhibitions.exhibition_subject.exhibitions_created_about_this_subject ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 176000502,
		"question": "what is the name of someone responsible for curating an exhibition about the united states?",
		"answer": [
			"Hagedorn Foundation Gallery"
		],
		"function": "none",
		"commonness": -26.893781750444095,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "exhibitions.exhibition_curator",
					"class": "exhibitions.exhibition_curator",
					"friendly_name": "Exhibition curator",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "exhibitions.exhibition",
					"class": "exhibitions.exhibition",
					"friendly_name": "Exhibition",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "exhibitions.exhibition_subject",
					"friendly_name": "united states",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "exhibitions.exhibition.curators",
					"friendly_name": "Curators"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "exhibitions.exhibition_subject.exhibitions_created_about_this_subject",
					"friendly_name": "Exhibitions created about this subject"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :exhibitions.exhibition_curator . \n?x1 :type.object.type :exhibitions.exhibition . \nVALUES ?x2 { :en.united_states_of_america } \n?x1 :exhibitions.exhibition.curators ?x0 . \n?x2 :exhibitions.exhibition_subject.exhibitions_created_about_this_subject ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 177000000,
		"question": "geoffrey marcy has worked in what astronomical survey projects?",
		"answer": [
			"Eta-Earth Survey for Low Mass Planets"
		],
		"function": "none",
		"commonness": -25.741619783117866,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.astronomical_survey_project_organization",
					"class": "astronomy.astronomical_survey_project_organization",
					"friendly_name": "Astronomical Survey/Project Organization",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "astronomy.astronomical_discovery",
					"class": "astronomy.astronomical_discovery",
					"friendly_name": "Astronomical Discovery",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.geoffrey_marcy",
					"class": "astronomy.astronomer",
					"friendly_name": "Geoffrey Marcy",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "astronomy.astronomical_discovery.discovery_organization",
					"friendly_name": "Discovery Organization"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "astronomy.astronomer.astronomical_objects_discovered",
					"friendly_name": "Astronomical objects discovered"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.astronomical_survey_project_organization . \n?x1 :type.object.type :astronomy.astronomical_discovery . \nVALUES ?x2 { :en.geoffrey_marcy } \n?x1 :astronomy.astronomical_discovery.discovery_organization ?x0 . \n?x2 :astronomy.astronomer.astronomical_objects_discovered ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 177000001,
		"question": "geoff marcy has worked in what astronomical survey projects?",
		"answer": [
			"Eta-Earth Survey for Low Mass Planets"
		],
		"function": "none",
		"commonness": -25.741619783117866,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.astronomical_survey_project_organization",
					"class": "astronomy.astronomical_survey_project_organization",
					"friendly_name": "Astronomical Survey/Project Organization",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "astronomy.astronomical_discovery",
					"class": "astronomy.astronomical_discovery",
					"friendly_name": "Astronomical Discovery",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.geoffrey_marcy",
					"class": "astronomy.astronomer",
					"friendly_name": "geoff marcy",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "astronomy.astronomical_discovery.discovery_organization",
					"friendly_name": "Discovery Organization"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "astronomy.astronomer.astronomical_objects_discovered",
					"friendly_name": "Astronomical objects discovered"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.astronomical_survey_project_organization . \n?x1 :type.object.type :astronomy.astronomical_discovery . \nVALUES ?x2 { :en.geoffrey_marcy } \n?x1 :astronomy.astronomical_discovery.discovery_organization ?x0 . \n?x2 :astronomy.astronomer.astronomical_objects_discovered ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 177000002,
		"question": "geoffrey w. marcy has worked in what astronomical survey projects?",
		"answer": [
			"Eta-Earth Survey for Low Mass Planets"
		],
		"function": "none",
		"commonness": -25.741619783117866,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.astronomical_survey_project_organization",
					"class": "astronomy.astronomical_survey_project_organization",
					"friendly_name": "Astronomical Survey/Project Organization",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "astronomy.astronomical_discovery",
					"class": "astronomy.astronomical_discovery",
					"friendly_name": "Astronomical Discovery",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.geoffrey_marcy",
					"class": "astronomy.astronomer",
					"friendly_name": "geoffrey w. marcy",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "astronomy.astronomical_discovery.discovery_organization",
					"friendly_name": "Discovery Organization"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "astronomy.astronomer.astronomical_objects_discovered",
					"friendly_name": "Astronomical objects discovered"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.astronomical_survey_project_organization . \n?x1 :type.object.type :astronomy.astronomical_discovery . \nVALUES ?x2 { :en.geoffrey_marcy } \n?x1 :astronomy.astronomical_discovery.discovery_organization ?x0 . \n?x2 :astronomy.astronomer.astronomical_objects_discovered ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 177000100,
		"question": "what astronimical discoverty projects did geoffrey marcy participate in?",
		"answer": [
			"Eta-Earth Survey for Low Mass Planets"
		],
		"function": "none",
		"commonness": -25.741619783117866,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.astronomical_survey_project_organization",
					"class": "astronomy.astronomical_survey_project_organization",
					"friendly_name": "Astronomical Survey/Project Organization",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "astronomy.astronomical_discovery",
					"class": "astronomy.astronomical_discovery",
					"friendly_name": "Astronomical Discovery",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.geoffrey_marcy",
					"class": "astronomy.astronomer",
					"friendly_name": "Geoffrey Marcy",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "astronomy.astronomical_discovery.discovery_organization",
					"friendly_name": "Discovery Organization"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "astronomy.astronomer.astronomical_objects_discovered",
					"friendly_name": "Astronomical objects discovered"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.astronomical_survey_project_organization . \n?x1 :type.object.type :astronomy.astronomical_discovery . \nVALUES ?x2 { :en.geoffrey_marcy } \n?x1 :astronomy.astronomical_discovery.discovery_organization ?x0 . \n?x2 :astronomy.astronomer.astronomical_objects_discovered ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 177000101,
		"question": "what astronimical discoverty projects did geoff marcy participate in?",
		"answer": [
			"Eta-Earth Survey for Low Mass Planets"
		],
		"function": "none",
		"commonness": -25.741619783117866,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.astronomical_survey_project_organization",
					"class": "astronomy.astronomical_survey_project_organization",
					"friendly_name": "Astronomical Survey/Project Organization",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "astronomy.astronomical_discovery",
					"class": "astronomy.astronomical_discovery",
					"friendly_name": "Astronomical Discovery",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.geoffrey_marcy",
					"class": "astronomy.astronomer",
					"friendly_name": "geoff marcy",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "astronomy.astronomical_discovery.discovery_organization",
					"friendly_name": "Discovery Organization"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "astronomy.astronomer.astronomical_objects_discovered",
					"friendly_name": "Astronomical objects discovered"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.astronomical_survey_project_organization . \n?x1 :type.object.type :astronomy.astronomical_discovery . \nVALUES ?x2 { :en.geoffrey_marcy } \n?x1 :astronomy.astronomical_discovery.discovery_organization ?x0 . \n?x2 :astronomy.astronomer.astronomical_objects_discovered ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	}
]