[
	{
		"qid": 56000001,
		"question": "google inc has what organizational sectors?",
		"answer": [
			"Software",
			"The Internet",
			"Telecommunications equipment"
		],
		"function": "none",
		"commonness": -9.222912598266827,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "organization.organization_sector",
					"class": "organization.organization_sector",
					"friendly_name": "Organization sector",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.google",
					"class": "organization.organization",
					"friendly_name": "google inc",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "organization.organization.sectors",
					"friendly_name": "Sectors"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :organization.organization_sector . \nVALUES ?x1 { :en.google } \n?x1 :organization.organization.sectors ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 56000100,
		"question": "what segments are in google?",
		"answer": [
			"Telecommunications equipment",
			"Software",
			"The Internet"
		],
		"function": "none",
		"commonness": -9.222912598266827,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "organization.organization_sector",
					"class": "organization.organization_sector",
					"friendly_name": "Organization sector",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.google",
					"class": "organization.organization",
					"friendly_name": "Google",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "organization.organization.sectors",
					"friendly_name": "Sectors"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :organization.organization_sector . \nVALUES ?x1 { :en.google } \n?x1 :organization.organization.sectors ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 56000101,
		"question": "what segments are in google inc?",
		"answer": [
			"Software",
			"The Internet",
			"Telecommunications equipment"
		],
		"function": "none",
		"commonness": -9.222912598266827,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "organization.organization_sector",
					"class": "organization.organization_sector",
					"friendly_name": "Organization sector",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.google",
					"class": "organization.organization",
					"friendly_name": "google inc",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "organization.organization.sectors",
					"friendly_name": "Sectors"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :organization.organization_sector . \nVALUES ?x1 { :en.google } \n?x1 :organization.organization.sectors ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 56000300,
		"question": "what sectors does google focus on?",
		"answer": [
			"Telecommunications equipment",
			"The Internet",
			"Software"
		],
		"function": "none",
		"commonness": -9.222912598266827,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "organization.organization_sector",
					"class": "organization.organization_sector",
					"friendly_name": "Organization sector",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.google",
					"class": "organization.organization",
					"friendly_name": "Google",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "organization.organization.sectors",
					"friendly_name": "Sectors"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :organization.organization_sector . \nVALUES ?x1 { :en.google } \n?x1 :organization.organization.sectors ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 56000301,
		"question": "what sectors does google inc focus on?",
		"answer": [
			"Telecommunications equipment",
			"The Internet",
			"Software"
		],
		"function": "none",
		"commonness": -9.222912598266827,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "organization.organization_sector",
					"class": "organization.organization_sector",
					"friendly_name": "Organization sector",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.google",
					"class": "organization.organization",
					"friendly_name": "google inc",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "organization.organization.sectors",
					"friendly_name": "Sectors"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :organization.organization_sector . \nVALUES ?x1 { :en.google } \n?x1 :organization.organization.sectors ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 56000400,
		"question": "what sectors does google have?",
		"answer": [
			"Software",
			"The Internet",
			"Telecommunications equipment"
		],
		"function": "none",
		"commonness": -9.222912598266827,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "organization.organization_sector",
					"class": "organization.organization_sector",
					"friendly_name": "Organization sector",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.google",
					"class": "organization.organization",
					"friendly_name": "Google",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "organization.organization.sectors",
					"friendly_name": "Sectors"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :organization.organization_sector . \nVALUES ?x1 { :en.google } \n?x1 :organization.organization.sectors ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 56000401,
		"question": "what sectors does google inc have?",
		"answer": [
			"The Internet",
			"Telecommunications equipment",
			"Software"
		],
		"function": "none",
		"commonness": -9.222912598266827,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "organization.organization_sector",
					"class": "organization.organization_sector",
					"friendly_name": "Organization sector",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.google",
					"class": "organization.organization",
					"friendly_name": "google inc",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "organization.organization.sectors",
					"friendly_name": "Sectors"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :organization.organization_sector . \nVALUES ?x1 { :en.google } \n?x1 :organization.organization.sectors ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 56000500,
		"question": "what sectors can be found in google?",
		"answer": [
			"The Internet",
			"Telecommunications equipment",
			"Software"
		],
		"function": "none",
		"commonness": -9.222912598266827,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "organization.organization_sector",
					"class": "organization.organization_sector",
					"friendly_name": "Organization sector",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.google",
					"class": "organization.organization",
					"friendly_name": "Google",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "organization.organization.sectors",
					"friendly_name": "Sectors"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :organization.organization_sector . \nVALUES ?x1 { :en.google } \n?x1 :organization.organization.sectors ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 56000501,
		"question": "what sectors can be found in google inc?",
		"answer": [
			"Telecommunications equipment",
			"The Internet",
			"Software"
		],
		"function": "none",
		"commonness": -9.222912598266827,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "organization.organization_sector",
					"class": "organization.organization_sector",
					"friendly_name": "Organization sector",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.google",
					"class": "organization.organization",
					"friendly_name": "google inc",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "organization.organization.sectors",
					"friendly_name": "Sectors"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :organization.organization_sector . \nVALUES ?x1 { :en.google } \n?x1 :organization.organization.sectors ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 57000000,
		"question": "what ski lift serves m1?",
		"answer": [
			"Coronet Express chair",
			"Greengates Express chair"
		],
		"function": "none",
		"commonness": -23.194543884806347,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "skiing.ski_lift",
					"class": "skiing.ski_lift",
					"friendly_name": "Ski Lift",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.0770934",
					"class": "skiing.ski_run",
					"friendly_name": "M1",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "skiing.ski_run.served_by",
					"friendly_name": "Served By"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :skiing.ski_lift . \nVALUES ?x1 { :m.0770934 } \n?x1 :skiing.ski_run.served_by ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 57000100,
		"question": "the m1 is accessible by which ski lifts?",
		"answer": [
			"Greengates Express chair",
			"Coronet Express chair"
		],
		"function": "none",
		"commonness": -23.194543884806347,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "skiing.ski_lift",
					"class": "skiing.ski_lift",
					"friendly_name": "Ski Lift",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.0770934",
					"class": "skiing.ski_run",
					"friendly_name": "M1",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "skiing.ski_run.served_by",
					"friendly_name": "Served By"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :skiing.ski_lift . \nVALUES ?x1 { :m.0770934 } \n?x1 :skiing.ski_run.served_by ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 57000200,
		"question": "m1 is served by what ski lift?",
		"answer": [
			"Coronet Express chair",
			"Greengates Express chair"
		],
		"function": "none",
		"commonness": -23.194543884806347,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "skiing.ski_lift",
					"class": "skiing.ski_lift",
					"friendly_name": "Ski Lift",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.0770934",
					"class": "skiing.ski_run",
					"friendly_name": "M1",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "skiing.ski_run.served_by",
					"friendly_name": "Served By"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :skiing.ski_lift . \nVALUES ?x1 { :m.0770934 } \n?x1 :skiing.ski_run.served_by ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 57000300,
		"question": "what kind of ski lift is m1 using?",
		"answer": [
			"Coronet Express chair",
			"Greengates Express chair"
		],
		"function": "none",
		"commonness": -23.194543884806347,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "skiing.ski_lift",
					"class": "skiing.ski_lift",
					"friendly_name": "Ski Lift",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.0770934",
					"class": "skiing.ski_run",
					"friendly_name": "M1",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "skiing.ski_run.served_by",
					"friendly_name": "Served By"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :skiing.ski_lift . \nVALUES ?x1 { :m.0770934 } \n?x1 :skiing.ski_run.served_by ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 58000000,
		"question": "what ratings are used in tv parental guidelines?",
		"answer": [
			"TV Y",
			"TV MA",
			"TV 14",
			"TV PG",
			"TV G",
			"TV Y7",
			"TV Y7 FV"
		],
		"function": "none",
		"commonness": -21.725644592316904,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "tv.tv_rating",
					"class": "tv.tv_rating",
					"friendly_name": "TV Rating",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.tv_parental_guidelines",
					"class": "tv.tv_rating_system",
					"friendly_name": "TV Parental Guidelines",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "tv.tv_rating.tv_rating_system",
					"friendly_name": "TV Rating System"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :tv.tv_rating . \nVALUES ?x1 { :en.tv_parental_guidelines } \n?x0 :tv.tv_rating.tv_rating_system ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 58000100,
		"question": "tv parental guidelines uses different ratings, what are they?",
		"answer": [
			"TV Y",
			"TV Y7",
			"TV PG",
			"TV G",
			"TV MA",
			"TV 14",
			"TV Y7 FV"
		],
		"function": "none",
		"commonness": -21.725644592316904,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "tv.tv_rating",
					"class": "tv.tv_rating",
					"friendly_name": "TV Rating",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.tv_parental_guidelines",
					"class": "tv.tv_rating_system",
					"friendly_name": "TV Parental Guidelines",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "tv.tv_rating.tv_rating_system",
					"friendly_name": "TV Rating System"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :tv.tv_rating . \nVALUES ?x1 { :en.tv_parental_guidelines } \n?x0 :tv.tv_rating.tv_rating_system ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 58000300,
		"question": "what ratings are included in the tv parental guidelines system?",
		"answer": [
			"TV MA",
			"TV Y",
			"TV 14",
			"TV Y7",
			"TV G",
			"TV PG",
			"TV Y7 FV"
		],
		"function": "none",
		"commonness": -21.725644592316904,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "tv.tv_rating",
					"class": "tv.tv_rating",
					"friendly_name": "TV Rating",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.tv_parental_guidelines",
					"class": "tv.tv_rating_system",
					"friendly_name": "TV Parental Guidelines",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "tv.tv_rating.tv_rating_system",
					"friendly_name": "TV Rating System"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :tv.tv_rating . \nVALUES ?x1 { :en.tv_parental_guidelines } \n?x0 :tv.tv_rating.tv_rating_system ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 59000000,
		"question": "in which classification of chemicals is vitamin sub-classified?",
		"answer": [
			"Organic compound"
		],
		"function": "none",
		"commonness": -15.775155317841211,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "chemistry.chemical_classification",
					"class": "chemistry.chemical_classification",
					"friendly_name": "Chemical Classification",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.vitamin",
					"class": "chemistry.chemical_classification",
					"friendly_name": "Vitamin",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "chemistry.chemical_classification.lower_classifications",
					"friendly_name": "Lower Classifications"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :chemistry.chemical_classification . \nVALUES ?x1 { :en.vitamin } \n?x0 :chemistry.chemical_classification.lower_classifications ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 59000001,
		"question": "in which classification of chemicals is vitamins sub-classified?",
		"answer": [
			"Organic compound"
		],
		"function": "none",
		"commonness": -15.775155317841211,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "chemistry.chemical_classification",
					"class": "chemistry.chemical_classification",
					"friendly_name": "Chemical Classification",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.vitamin",
					"class": "chemistry.chemical_classification",
					"friendly_name": "vitamins",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "chemistry.chemical_classification.lower_classifications",
					"friendly_name": "Lower Classifications"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :chemistry.chemical_classification . \nVALUES ?x1 { :en.vitamin } \n?x0 :chemistry.chemical_classification.lower_classifications ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 59000002,
		"question": "in which classification of chemicals is vitamine sub-classified?",
		"answer": [
			"Organic compound"
		],
		"function": "none",
		"commonness": -15.775155317841211,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "chemistry.chemical_classification",
					"class": "chemistry.chemical_classification",
					"friendly_name": "Chemical Classification",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.vitamin",
					"class": "chemistry.chemical_classification",
					"friendly_name": "vitamine",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "chemistry.chemical_classification.lower_classifications",
					"friendly_name": "Lower Classifications"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :chemistry.chemical_classification . \nVALUES ?x1 { :en.vitamin } \n?x0 :chemistry.chemical_classification.lower_classifications ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 59000100,
		"question": "vitamin is included in what chemical classifications?",
		"answer": [
			"Organic compound"
		],
		"function": "none",
		"commonness": -15.775155317841211,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "chemistry.chemical_classification",
					"class": "chemistry.chemical_classification",
					"friendly_name": "Chemical Classification",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.vitamin",
					"class": "chemistry.chemical_classification",
					"friendly_name": "Vitamin",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "chemistry.chemical_classification.lower_classifications",
					"friendly_name": "Lower Classifications"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :chemistry.chemical_classification . \nVALUES ?x1 { :en.vitamin } \n?x0 :chemistry.chemical_classification.lower_classifications ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 59000101,
		"question": "vitamins is included in what chemical classifications?",
		"answer": [
			"Organic compound"
		],
		"function": "none",
		"commonness": -15.775155317841211,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "chemistry.chemical_classification",
					"class": "chemistry.chemical_classification",
					"friendly_name": "Chemical Classification",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.vitamin",
					"class": "chemistry.chemical_classification",
					"friendly_name": "vitamins",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "chemistry.chemical_classification.lower_classifications",
					"friendly_name": "Lower Classifications"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :chemistry.chemical_classification . \nVALUES ?x1 { :en.vitamin } \n?x0 :chemistry.chemical_classification.lower_classifications ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 59000102,
		"question": "vitamine is included in what chemical classifications?",
		"answer": [
			"Organic compound"
		],
		"function": "none",
		"commonness": -15.775155317841211,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "chemistry.chemical_classification",
					"class": "chemistry.chemical_classification",
					"friendly_name": "Chemical Classification",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.vitamin",
					"class": "chemistry.chemical_classification",
					"friendly_name": "vitamine",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "chemistry.chemical_classification.lower_classifications",
					"friendly_name": "Lower Classifications"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :chemistry.chemical_classification . \nVALUES ?x1 { :en.vitamin } \n?x0 :chemistry.chemical_classification.lower_classifications ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 59000200,
		"question": "what chemical classifications include vitamin?",
		"answer": [
			"Organic compound"
		],
		"function": "none",
		"commonness": -15.775155317841211,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "chemistry.chemical_classification",
					"class": "chemistry.chemical_classification",
					"friendly_name": "Chemical Classification",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.vitamin",
					"class": "chemistry.chemical_classification",
					"friendly_name": "Vitamin",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "chemistry.chemical_classification.lower_classifications",
					"friendly_name": "Lower Classifications"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :chemistry.chemical_classification . \nVALUES ?x1 { :en.vitamin } \n?x0 :chemistry.chemical_classification.lower_classifications ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 59000201,
		"question": "what chemical classifications include vitamins?",
		"answer": [
			"Organic compound"
		],
		"function": "none",
		"commonness": -15.775155317841211,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "chemistry.chemical_classification",
					"class": "chemistry.chemical_classification",
					"friendly_name": "Chemical Classification",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.vitamin",
					"class": "chemistry.chemical_classification",
					"friendly_name": "vitamins",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "chemistry.chemical_classification.lower_classifications",
					"friendly_name": "Lower Classifications"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :chemistry.chemical_classification . \nVALUES ?x1 { :en.vitamin } \n?x0 :chemistry.chemical_classification.lower_classifications ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]