[
	{
		"qid": 30000101,
		"question": "which hang gliding and paragliding flying sites are located in the us?",
		"answer": [
			"Dunlap",
			"Yosemite National Park",
			"Slide Mountain"
		],
		"function": "none",
		"commonness": -8.325382642589407,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.bigsky.site",
					"class": "base.bigsky.site",
					"friendly_name": "Flying Site",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.location",
					"friendly_name": "us",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "location.location.containedby",
					"friendly_name": "Contained by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.bigsky.site . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :location.location.containedby ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 30000102,
		"question": "which hang gliding and paragliding flying sites are located in the united states?",
		"answer": [
			"Dunlap",
			"Yosemite National Park",
			"Slide Mountain"
		],
		"function": "none",
		"commonness": -8.325382642589407,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.bigsky.site",
					"class": "base.bigsky.site",
					"friendly_name": "Flying Site",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.location",
					"friendly_name": "united states",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "location.location.containedby",
					"friendly_name": "Contained by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.bigsky.site . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :location.location.containedby ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 30000200,
		"question": "which flying sites are in the united states of america?",
		"answer": [
			"Slide Mountain",
			"Yosemite National Park",
			"Dunlap"
		],
		"function": "none",
		"commonness": -8.325382642589407,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.bigsky.site",
					"class": "base.bigsky.site",
					"friendly_name": "Flying Site",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.location",
					"friendly_name": "United States of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "location.location.containedby",
					"friendly_name": "Contained by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.bigsky.site . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :location.location.containedby ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 31000000,
		"question": "where to see wicked?",
		"answer": [
			"Apollo Victoria Theatre"
		],
		"function": "none",
		"commonness": -17.747953270109736,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "theater.theater",
					"class": "theater.theater",
					"friendly_name": "Theater",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.05nl6wh",
					"class": "theater.theater_production",
					"friendly_name": "Wicked",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "theater.theater.theatrical_productions_staged_here",
					"friendly_name": "Theatrical productions staged here"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :theater.theater . \nVALUES ?x1 { :m.05nl6wh } \n?x0 :theater.theater.theatrical_productions_staged_here ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 31000100,
		"question": "wicked was staged by which theater?",
		"answer": [
			"Apollo Victoria Theatre"
		],
		"function": "none",
		"commonness": -17.747953270109736,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "theater.theater",
					"class": "theater.theater",
					"friendly_name": "Theater",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.05nl6wh",
					"class": "theater.theater_production",
					"friendly_name": "Wicked",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "theater.theater.theatrical_productions_staged_here",
					"friendly_name": "Theatrical productions staged here"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :theater.theater . \nVALUES ?x1 { :m.05nl6wh } \n?x0 :theater.theater.theatrical_productions_staged_here ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 31000200,
		"question": "where is wicked staged?",
		"answer": [
			"Apollo Victoria Theatre"
		],
		"function": "none",
		"commonness": -17.747953270109736,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "theater.theater",
					"class": "theater.theater",
					"friendly_name": "Theater",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.05nl6wh",
					"class": "theater.theater_production",
					"friendly_name": "Wicked",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "theater.theater.theatrical_productions_staged_here",
					"friendly_name": "Theatrical productions staged here"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :theater.theater . \nVALUES ?x1 { :m.05nl6wh } \n?x0 :theater.theater.theatrical_productions_staged_here ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 31000300,
		"question": "wicked was at which theater?",
		"answer": [
			"Apollo Victoria Theatre"
		],
		"function": "none",
		"commonness": -17.747953270109736,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "theater.theater",
					"class": "theater.theater",
					"friendly_name": "Theater",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.05nl6wh",
					"class": "theater.theater_production",
					"friendly_name": "Wicked",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "theater.theater.theatrical_productions_staged_here",
					"friendly_name": "Theatrical productions staged here"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :theater.theater . \nVALUES ?x1 { :m.05nl6wh } \n?x0 :theater.theater.theatrical_productions_staged_here ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 31000400,
		"question": "which theater staged wicked?",
		"answer": [
			"Apollo Victoria Theatre"
		],
		"function": "none",
		"commonness": -17.747953270109736,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "theater.theater",
					"class": "theater.theater",
					"friendly_name": "Theater",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.05nl6wh",
					"class": "theater.theater_production",
					"friendly_name": "Wicked",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "theater.theater.theatrical_productions_staged_here",
					"friendly_name": "Theatrical productions staged here"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :theater.theater . \nVALUES ?x1 { :m.05nl6wh } \n?x0 :theater.theater.theatrical_productions_staged_here ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 31000500,
		"question": "what theatrical venue put on a production of the play wicked?",
		"answer": [
			"Apollo Victoria Theatre"
		],
		"function": "none",
		"commonness": -17.747953270109736,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "theater.theater",
					"class": "theater.theater",
					"friendly_name": "Theater",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.05nl6wh",
					"class": "theater.theater_production",
					"friendly_name": "Wicked",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "theater.theater.theatrical_productions_staged_here",
					"friendly_name": "Theatrical productions staged here"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :theater.theater . \nVALUES ?x1 { :m.05nl6wh } \n?x0 :theater.theater.theatrical_productions_staged_here ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 32000000,
		"question": "what is the name of the cabinet position held by john kerry?",
		"answer": [
			"United States Secretary of State"
		],
		"function": "none",
		"commonness": -14.051315793667008,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.obamabase.cabinet_position",
					"class": "base.obamabase.cabinet_position",
					"friendly_name": "Cabinet position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.john_kerry",
					"class": "base.obamabase.possible_cabinet_member",
					"friendly_name": "John Kerry",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.obamabase.possible_cabinet_member.cabinet_position",
					"friendly_name": "Cabinet position"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.obamabase.cabinet_position . \nVALUES ?x1 { :en.john_kerry } \n?x1 :base.obamabase.possible_cabinet_member.cabinet_position ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 32000001,
		"question": "what is the name of the cabinet position held by john f. kerry?",
		"answer": [
			"United States Secretary of State"
		],
		"function": "none",
		"commonness": -14.051315793667008,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.obamabase.cabinet_position",
					"class": "base.obamabase.cabinet_position",
					"friendly_name": "Cabinet position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.john_kerry",
					"class": "base.obamabase.possible_cabinet_member",
					"friendly_name": "john f. kerry",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.obamabase.possible_cabinet_member.cabinet_position",
					"friendly_name": "Cabinet position"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.obamabase.cabinet_position . \nVALUES ?x1 { :en.john_kerry } \n?x1 :base.obamabase.possible_cabinet_member.cabinet_position ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 32000002,
		"question": "what is the name of the cabinet position held by john forbes kerry?",
		"answer": [
			"United States Secretary of State"
		],
		"function": "none",
		"commonness": -14.051315793667008,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.obamabase.cabinet_position",
					"class": "base.obamabase.cabinet_position",
					"friendly_name": "Cabinet position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.john_kerry",
					"class": "base.obamabase.possible_cabinet_member",
					"friendly_name": "john forbes kerry",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.obamabase.possible_cabinet_member.cabinet_position",
					"friendly_name": "Cabinet position"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.obamabase.cabinet_position . \nVALUES ?x1 { :en.john_kerry } \n?x1 :base.obamabase.possible_cabinet_member.cabinet_position ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 32000100,
		"question": "what position did john kerry hold in the cabinet?",
		"answer": [
			"United States Secretary of State"
		],
		"function": "none",
		"commonness": -14.051315793667008,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.obamabase.cabinet_position",
					"class": "base.obamabase.cabinet_position",
					"friendly_name": "Cabinet position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.john_kerry",
					"class": "base.obamabase.possible_cabinet_member",
					"friendly_name": "John Kerry",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.obamabase.possible_cabinet_member.cabinet_position",
					"friendly_name": "Cabinet position"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.obamabase.cabinet_position . \nVALUES ?x1 { :en.john_kerry } \n?x1 :base.obamabase.possible_cabinet_member.cabinet_position ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 32000101,
		"question": "what position did john f. kerry hold in the cabinet?",
		"answer": [
			"United States Secretary of State"
		],
		"function": "none",
		"commonness": -14.051315793667008,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.obamabase.cabinet_position",
					"class": "base.obamabase.cabinet_position",
					"friendly_name": "Cabinet position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.john_kerry",
					"class": "base.obamabase.possible_cabinet_member",
					"friendly_name": "john f. kerry",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.obamabase.possible_cabinet_member.cabinet_position",
					"friendly_name": "Cabinet position"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.obamabase.cabinet_position . \nVALUES ?x1 { :en.john_kerry } \n?x1 :base.obamabase.possible_cabinet_member.cabinet_position ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 32000102,
		"question": "what position did john forbes kerry hold in the cabinet?",
		"answer": [
			"United States Secretary of State"
		],
		"function": "none",
		"commonness": -14.051315793667008,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.obamabase.cabinet_position",
					"class": "base.obamabase.cabinet_position",
					"friendly_name": "Cabinet position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.john_kerry",
					"class": "base.obamabase.possible_cabinet_member",
					"friendly_name": "john forbes kerry",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.obamabase.possible_cabinet_member.cabinet_position",
					"friendly_name": "Cabinet position"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.obamabase.cabinet_position . \nVALUES ?x1 { :en.john_kerry } \n?x1 :base.obamabase.possible_cabinet_member.cabinet_position ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 32000200,
		"question": "what position in the administration does john kerry hold?",
		"answer": [
			"United States Secretary of State"
		],
		"function": "none",
		"commonness": -14.051315793667008,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.obamabase.cabinet_position",
					"class": "base.obamabase.cabinet_position",
					"friendly_name": "Cabinet position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.john_kerry",
					"class": "base.obamabase.possible_cabinet_member",
					"friendly_name": "John Kerry",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.obamabase.possible_cabinet_member.cabinet_position",
					"friendly_name": "Cabinet position"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.obamabase.cabinet_position . \nVALUES ?x1 { :en.john_kerry } \n?x1 :base.obamabase.possible_cabinet_member.cabinet_position ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 32000201,
		"question": "what position in the administration does john f. kerry hold?",
		"answer": [
			"United States Secretary of State"
		],
		"function": "none",
		"commonness": -14.051315793667008,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.obamabase.cabinet_position",
					"class": "base.obamabase.cabinet_position",
					"friendly_name": "Cabinet position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.john_kerry",
					"class": "base.obamabase.possible_cabinet_member",
					"friendly_name": "john f. kerry",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.obamabase.possible_cabinet_member.cabinet_position",
					"friendly_name": "Cabinet position"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.obamabase.cabinet_position . \nVALUES ?x1 { :en.john_kerry } \n?x1 :base.obamabase.possible_cabinet_member.cabinet_position ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 32000202,
		"question": "what position in the administration does john forbes kerry hold?",
		"answer": [
			"United States Secretary of State"
		],
		"function": "none",
		"commonness": -14.051315793667008,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.obamabase.cabinet_position",
					"class": "base.obamabase.cabinet_position",
					"friendly_name": "Cabinet position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.john_kerry",
					"class": "base.obamabase.possible_cabinet_member",
					"friendly_name": "john forbes kerry",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.obamabase.possible_cabinet_member.cabinet_position",
					"friendly_name": "Cabinet position"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.obamabase.cabinet_position . \nVALUES ?x1 { :en.john_kerry } \n?x1 :base.obamabase.possible_cabinet_member.cabinet_position ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 32000300,
		"question": "which cabinet position does john kerry hold?",
		"answer": [
			"United States Secretary of State"
		],
		"function": "none",
		"commonness": -14.051315793667008,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.obamabase.cabinet_position",
					"class": "base.obamabase.cabinet_position",
					"friendly_name": "Cabinet position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.john_kerry",
					"class": "base.obamabase.possible_cabinet_member",
					"friendly_name": "John Kerry",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.obamabase.possible_cabinet_member.cabinet_position",
					"friendly_name": "Cabinet position"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.obamabase.cabinet_position . \nVALUES ?x1 { :en.john_kerry } \n?x1 :base.obamabase.possible_cabinet_member.cabinet_position ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 32000301,
		"question": "which cabinet position does john f. kerry hold?",
		"answer": [
			"United States Secretary of State"
		],
		"function": "none",
		"commonness": -14.051315793667008,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.obamabase.cabinet_position",
					"class": "base.obamabase.cabinet_position",
					"friendly_name": "Cabinet position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.john_kerry",
					"class": "base.obamabase.possible_cabinet_member",
					"friendly_name": "john f. kerry",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.obamabase.possible_cabinet_member.cabinet_position",
					"friendly_name": "Cabinet position"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.obamabase.cabinet_position . \nVALUES ?x1 { :en.john_kerry } \n?x1 :base.obamabase.possible_cabinet_member.cabinet_position ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 32000302,
		"question": "which cabinet position does john forbes kerry hold?",
		"answer": [
			"United States Secretary of State"
		],
		"function": "none",
		"commonness": -14.051315793667008,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.obamabase.cabinet_position",
					"class": "base.obamabase.cabinet_position",
					"friendly_name": "Cabinet position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.john_kerry",
					"class": "base.obamabase.possible_cabinet_member",
					"friendly_name": "john forbes kerry",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.obamabase.possible_cabinet_member.cabinet_position",
					"friendly_name": "Cabinet position"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.obamabase.cabinet_position . \nVALUES ?x1 { :en.john_kerry } \n?x1 :base.obamabase.possible_cabinet_member.cabinet_position ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 32000400,
		"question": "what is the cabinet position of john kerry?",
		"answer": [
			"United States Secretary of State"
		],
		"function": "none",
		"commonness": -14.051315793667008,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.obamabase.cabinet_position",
					"class": "base.obamabase.cabinet_position",
					"friendly_name": "Cabinet position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.john_kerry",
					"class": "base.obamabase.possible_cabinet_member",
					"friendly_name": "John Kerry",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.obamabase.possible_cabinet_member.cabinet_position",
					"friendly_name": "Cabinet position"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.obamabase.cabinet_position . \nVALUES ?x1 { :en.john_kerry } \n?x1 :base.obamabase.possible_cabinet_member.cabinet_position ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 32000402,
		"question": "what is the cabinet position of john forbes kerry?",
		"answer": [
			"United States Secretary of State"
		],
		"function": "none",
		"commonness": -14.051315793667008,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.obamabase.cabinet_position",
					"class": "base.obamabase.cabinet_position",
					"friendly_name": "Cabinet position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.john_kerry",
					"class": "base.obamabase.possible_cabinet_member",
					"friendly_name": "john forbes kerry",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.obamabase.possible_cabinet_member.cabinet_position",
					"friendly_name": "Cabinet position"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.obamabase.cabinet_position . \nVALUES ?x1 { :en.john_kerry } \n?x1 :base.obamabase.possible_cabinet_member.cabinet_position ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 33000000,
		"question": "how are leghorn chickens primarily used?",
		"answer": [
			"Egg"
		],
		"function": "none",
		"commonness": -18.89437526231366,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.petbreeds.chicken_primary_use",
					"class": "base.petbreeds.chicken_primary_use",
					"friendly_name": "Chicken Primary Use",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.leghorn_chicken",
					"class": "base.petbreeds.chicken_breed",
					"friendly_name": "Leghorn",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.petbreeds.chicken_breed.primary_use",
					"friendly_name": "Primary Use"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.petbreeds.chicken_primary_use . \nVALUES ?x1 { :en.leghorn_chicken } \n?x1 :base.petbreeds.chicken_breed.primary_use ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]