[
	{
		"qid": 98000101,
		"question": "how many different forms of martial arts are there in martial art?",
		"answer": [
			"7"
		],
		"function": "count",
		"commonness": -15.070323464425178,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "martial_arts.martial_art",
					"class": "martial_arts.martial_art",
					"friendly_name": "Martial Art",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.04xsv",
					"class": "martial_arts.martial_art_category",
					"friendly_name": "martial art",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "martial_arts.martial_art_category.martial_arts",
					"friendly_name": "Martial arts"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :martial_arts.martial_art . \nVALUES ?x1 { :m.04xsv } \n?x1 :martial_arts.martial_art_category.martial_arts ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 98000200,
		"question": "the martial arts category comprises how many different styles?",
		"answer": [
			"7"
		],
		"function": "count",
		"commonness": -15.070323464425178,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "martial_arts.martial_art",
					"class": "martial_arts.martial_art",
					"friendly_name": "Martial Art",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.04xsv",
					"class": "martial_arts.martial_art_category",
					"friendly_name": "Martial arts",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "martial_arts.martial_art_category.martial_arts",
					"friendly_name": "Martial arts"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :martial_arts.martial_art . \nVALUES ?x1 { :m.04xsv } \n?x1 :martial_arts.martial_art_category.martial_arts ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 98000201,
		"question": "the martial art category comprises how many different styles?",
		"answer": [
			"7"
		],
		"function": "count",
		"commonness": -15.070323464425178,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "martial_arts.martial_art",
					"class": "martial_arts.martial_art",
					"friendly_name": "Martial Art",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.04xsv",
					"class": "martial_arts.martial_art_category",
					"friendly_name": "martial art",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "martial_arts.martial_art_category.martial_arts",
					"friendly_name": "Martial arts"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :martial_arts.martial_art . \nVALUES ?x1 { :m.04xsv } \n?x1 :martial_arts.martial_art_category.martial_arts ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 98000300,
		"question": "how many different types of martial arts are there?",
		"answer": [
			"7"
		],
		"function": "count",
		"commonness": -15.070323464425178,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "martial_arts.martial_art",
					"class": "martial_arts.martial_art",
					"friendly_name": "Martial Art",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.04xsv",
					"class": "martial_arts.martial_art_category",
					"friendly_name": "Martial arts",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "martial_arts.martial_art_category.martial_arts",
					"friendly_name": "Martial arts"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :martial_arts.martial_art . \nVALUES ?x1 { :m.04xsv } \n?x1 :martial_arts.martial_art_category.martial_arts ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 98000301,
		"question": "how many different types of martial art are there?",
		"answer": [
			"7"
		],
		"function": "count",
		"commonness": -15.070323464425178,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "martial_arts.martial_art",
					"class": "martial_arts.martial_art",
					"friendly_name": "Martial Art",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.04xsv",
					"class": "martial_arts.martial_art_category",
					"friendly_name": "martial art",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "martial_arts.martial_art_category.martial_arts",
					"friendly_name": "Martial arts"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :martial_arts.martial_art . \nVALUES ?x1 { :m.04xsv } \n?x1 :martial_arts.martial_art_category.martial_arts ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 98000400,
		"question": "how many martial arts can be found in the category martial arts?",
		"answer": [
			"7"
		],
		"function": "count",
		"commonness": -15.070323464425178,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "martial_arts.martial_art",
					"class": "martial_arts.martial_art",
					"friendly_name": "Martial Art",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.04xsv",
					"class": "martial_arts.martial_art_category",
					"friendly_name": "Martial arts",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "martial_arts.martial_art_category.martial_arts",
					"friendly_name": "Martial arts"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :martial_arts.martial_art . \nVALUES ?x1 { :m.04xsv } \n?x1 :martial_arts.martial_art_category.martial_arts ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 98000401,
		"question": "how many martial arts can be found in the category martial art?",
		"answer": [
			"7"
		],
		"function": "count",
		"commonness": -15.070323464425178,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "martial_arts.martial_art",
					"class": "martial_arts.martial_art",
					"friendly_name": "Martial Art",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.04xsv",
					"class": "martial_arts.martial_art_category",
					"friendly_name": "martial art",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "martial_arts.martial_art_category.martial_arts",
					"friendly_name": "Martial arts"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :martial_arts.martial_art . \nVALUES ?x1 { :m.04xsv } \n?x1 :martial_arts.martial_art_category.martial_arts ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 99000001,
		"question": "how many product categories does coke belong to?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -13.311399141276048,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "business.product_category",
					"class": "business.product_category",
					"friendly_name": "Product category",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.coca-cola",
					"class": "business.consumer_product",
					"friendly_name": "coke",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "business.consumer_product.category",
					"friendly_name": "Category"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :business.product_category . \nVALUES ?x1 { :en.coca-cola } \n?x1 :business.consumer_product.category ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 99000100,
		"question": "how many product categories is coca-cola in?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -13.311399141276048,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "business.product_category",
					"class": "business.product_category",
					"friendly_name": "Product category",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.coca-cola",
					"class": "business.consumer_product",
					"friendly_name": "Coca-Cola",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "business.consumer_product.category",
					"friendly_name": "Category"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :business.product_category . \nVALUES ?x1 { :en.coca-cola } \n?x1 :business.consumer_product.category ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 99000101,
		"question": "how many product categories is coke in?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -13.311399141276048,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "business.product_category",
					"class": "business.product_category",
					"friendly_name": "Product category",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.coca-cola",
					"class": "business.consumer_product",
					"friendly_name": "coke",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "business.consumer_product.category",
					"friendly_name": "Category"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :business.product_category . \nVALUES ?x1 { :en.coca-cola } \n?x1 :business.consumer_product.category ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 99000200,
		"question": "coca-cola can be classified in how many consumer product categories?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -13.311399141276048,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "business.product_category",
					"class": "business.product_category",
					"friendly_name": "Product category",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.coca-cola",
					"class": "business.consumer_product",
					"friendly_name": "Coca-Cola",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "business.consumer_product.category",
					"friendly_name": "Category"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :business.product_category . \nVALUES ?x1 { :en.coca-cola } \n?x1 :business.consumer_product.category ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 99000201,
		"question": "coke can be classified in how many consumer product categories?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -13.311399141276048,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "business.product_category",
					"class": "business.product_category",
					"friendly_name": "Product category",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.coca-cola",
					"class": "business.consumer_product",
					"friendly_name": "coke",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "business.consumer_product.category",
					"friendly_name": "Category"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :business.product_category . \nVALUES ?x1 { :en.coca-cola } \n?x1 :business.consumer_product.category ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 100000000,
		"question": "on the cover of tintin in the land of the soviets, how many different characters have appeared?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -17.52806146680889,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_character",
					"class": "comic_books.comic_book_character",
					"friendly_name": "Comic Book Character",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.tintin_in_the_land_of_the_soviets",
					"class": "comic_books.comic_book_issue",
					"friendly_name": "Tintin in the Land of the Soviets",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "comic_books.comic_book_character.cover_appearances",
					"friendly_name": "Cover Appearances"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_character . \nVALUES ?x1 { :en.tintin_in_the_land_of_the_soviets } \n?x0 :comic_books.comic_book_character.cover_appearances ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 100000100,
		"question": "how many characters were pictured on the cover of tintin in the land of the soviets?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -17.52806146680889,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_character",
					"class": "comic_books.comic_book_character",
					"friendly_name": "Comic Book Character",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.tintin_in_the_land_of_the_soviets",
					"class": "comic_books.comic_book_issue",
					"friendly_name": "Tintin in the Land of the Soviets",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "comic_books.comic_book_character.cover_appearances",
					"friendly_name": "Cover Appearances"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_character . \nVALUES ?x1 { :en.tintin_in_the_land_of_the_soviets } \n?x0 :comic_books.comic_book_character.cover_appearances ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 100000200,
		"question": "the covers of tintin in the land of the soviets have featured how many different characters on them?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -17.52806146680889,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_character",
					"class": "comic_books.comic_book_character",
					"friendly_name": "Comic Book Character",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.tintin_in_the_land_of_the_soviets",
					"class": "comic_books.comic_book_issue",
					"friendly_name": "Tintin in the Land of the Soviets",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "comic_books.comic_book_character.cover_appearances",
					"friendly_name": "Cover Appearances"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_character . \nVALUES ?x1 { :en.tintin_in_the_land_of_the_soviets } \n?x0 :comic_books.comic_book_character.cover_appearances ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 100000300,
		"question": "how many different characters have appeared on the cover of tintin in the land of the soviets?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -17.52806146680889,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_character",
					"class": "comic_books.comic_book_character",
					"friendly_name": "Comic Book Character",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.tintin_in_the_land_of_the_soviets",
					"class": "comic_books.comic_book_issue",
					"friendly_name": "Tintin in the Land of the Soviets",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "comic_books.comic_book_character.cover_appearances",
					"friendly_name": "Cover Appearances"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_character . \nVALUES ?x1 { :en.tintin_in_the_land_of_the_soviets } \n?x0 :comic_books.comic_book_character.cover_appearances ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 100000400,
		"question": "in tintin in the land of the soviets how many characters have been featured on the cover?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -17.52806146680889,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_character",
					"class": "comic_books.comic_book_character",
					"friendly_name": "Comic Book Character",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.tintin_in_the_land_of_the_soviets",
					"class": "comic_books.comic_book_issue",
					"friendly_name": "Tintin in the Land of the Soviets",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "comic_books.comic_book_character.cover_appearances",
					"friendly_name": "Cover Appearances"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_character . \nVALUES ?x1 { :en.tintin_in_the_land_of_the_soviets } \n?x0 :comic_books.comic_book_character.cover_appearances ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 101000000,
		"question": "which infrastructure power outage got more than 4000 people affected?",
		"answer": [
			"Northeast blackout of 1965",
			"2003 Italy blackout"
		],
		"function": ">",
		"commonness": -20.218359963538155,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.infrastructure.power_outage",
					"class": "base.infrastructure.power_outage",
					"friendly_name": "Power outage",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "4000^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "4000",
					"question_node": 0,
					"function": ">"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.infrastructure.power_outage.affected_people",
					"friendly_name": "Affected people"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.infrastructure.power_outage . \nFILTER (?x1 > 4000)\n?x0 :base.infrastructure.power_outage.affected_people ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 101000100,
		"question": "which infrustructure power outages affected more than 4000 people?",
		"answer": [
			"2003 Italy blackout",
			"Northeast blackout of 1965"
		],
		"function": ">",
		"commonness": -20.218359963538155,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.infrastructure.power_outage",
					"class": "base.infrastructure.power_outage",
					"friendly_name": "Power outage",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "4000^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "4000",
					"question_node": 0,
					"function": ">"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.infrastructure.power_outage.affected_people",
					"friendly_name": "Affected people"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.infrastructure.power_outage . \nFILTER (?x1 > 4000)\n?x0 :base.infrastructure.power_outage.affected_people ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 101000200,
		"question": "what is the infrastructure power outage that had an effect on over 4000 people?",
		"answer": [
			"Northeast blackout of 1965",
			"2003 Italy blackout"
		],
		"function": ">",
		"commonness": -20.218359963538155,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.infrastructure.power_outage",
					"class": "base.infrastructure.power_outage",
					"friendly_name": "Power outage",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "4000^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "4000",
					"question_node": 0,
					"function": ">"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.infrastructure.power_outage.affected_people",
					"friendly_name": "Affected people"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.infrastructure.power_outage . \nFILTER (?x1 > 4000)\n?x0 :base.infrastructure.power_outage.affected_people ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 101000300,
		"question": "the major power outage that affected more than 4000 people took place where and in what year?",
		"answer": [
			"Northeast blackout of 1965",
			"2003 Italy blackout"
		],
		"function": ">",
		"commonness": -20.218359963538155,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.infrastructure.power_outage",
					"class": "base.infrastructure.power_outage",
					"friendly_name": "Power outage",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "4000^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "4000",
					"question_node": 0,
					"function": ">"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.infrastructure.power_outage.affected_people",
					"friendly_name": "Affected people"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.infrastructure.power_outage . \nFILTER (?x1 > 4000)\n?x0 :base.infrastructure.power_outage.affected_people ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 101000400,
		"question": "more than 4000 people were affected in which infrastructure power outages?",
		"answer": [
			"Northeast blackout of 1965",
			"2003 Italy blackout"
		],
		"function": ">",
		"commonness": -20.218359963538155,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.infrastructure.power_outage",
					"class": "base.infrastructure.power_outage",
					"friendly_name": "Power outage",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "4000^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "4000",
					"question_node": 0,
					"function": ">"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.infrastructure.power_outage.affected_people",
					"friendly_name": "Affected people"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.infrastructure.power_outage . \nFILTER (?x1 > 4000)\n?x0 :base.infrastructure.power_outage.affected_people ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 101000500,
		"question": "in which events of power outage over 4000 people are affected?",
		"answer": [
			"2003 Italy blackout",
			"Northeast blackout of 1965"
		],
		"function": ">",
		"commonness": -20.218359963538155,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.infrastructure.power_outage",
					"class": "base.infrastructure.power_outage",
					"friendly_name": "Power outage",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "4000^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "4000",
					"question_node": 0,
					"function": ">"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.infrastructure.power_outage.affected_people",
					"friendly_name": "Affected people"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.infrastructure.power_outage . \nFILTER (?x1 > 4000)\n?x0 :base.infrastructure.power_outage.affected_people ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 102000000,
		"question": "which wrecked ship is the largest in terms of displacement?",
		"answer": [
			"RMS Titanic"
		],
		"function": "argmax",
		"commonness": -16.262269650587,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.disaster2.wrecked_ship",
					"class": "base.disaster2.wrecked_ship",
					"friendly_name": "Wrecked ship",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "366.0^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "366.0",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "boats.ship.displacement",
					"friendly_name": "Displacement"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.disaster2.wrecked_ship . \n{\nSELECT (MAX(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :base.disaster2.wrecked_ship . \n?y0 :boats.ship.displacement ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :boats.ship.displacement ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]