[
	{
		"qid": 221000000,
		"question": "what are the audio equipments with a weight of at most 31.7 kg that are manufactured in the united states of america?",
		"answer": [
			"Martin-Logan Preface",
			"Revel Concerta F12",
			"Revel Performa M22",
			"Zu Audio Druid",
			"Martin-Logan Source",
			"Revel Ultima Gem2",
			"Revel Concerta M12",
			"Revel Performa F32",
			"Martin-Logan Purity",
			"Martin-Logan Vantage",
			"Martin-Logan Spire",
			"Martin-Logan Vignette",
			"Bel Canto e.One Dac3",
			"Zu Audio Essence",
			"Zu Audio Druid Credenza",
			"Wilson Audio Duette",
			"KEF Reference 201/2",
			"Martin-Logan Vista"
		],
		"function": "<=",
		"commonness": -26.730049215528396,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.audiobase.audio_equipment",
					"class": "base.audiobase.audio_equipment",
					"friendly_name": "Audio Equipment",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "31.7^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "31.7",
					"question_node": 0,
					"function": "<="
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.country",
					"friendly_name": "United States of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.audiobase.audio_equipment.weight",
					"friendly_name": "Weight"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.audiobase.audio_equipment.country_of_manufacture",
					"friendly_name": "Country of Manufacture"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.audiobase.audio_equipment . \nFILTER (?x1 <= 31.7)\nVALUES ?x2 { :en.united_states_of_america } \n?x0 :base.audiobase.audio_equipment.weight ?x1 . \n?x0 :base.audiobase.audio_equipment.country_of_manufacture ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 221000001,
		"question": "what are the audio equipments with a weight of at most 31.7 kg that are manufactured in the us?",
		"answer": [
			"Martin-Logan Vantage",
			"Bel Canto e.One Dac3",
			"Zu Audio Druid Credenza",
			"KEF Reference 201/2",
			"Martin-Logan Purity",
			"Martin-Logan Preface",
			"Martin-Logan Vignette",
			"Martin-Logan Spire",
			"Revel Performa F32",
			"Martin-Logan Vista",
			"Revel Concerta F12",
			"Revel Ultima Gem2",
			"Revel Performa M22",
			"Zu Audio Druid",
			"Revel Concerta M12",
			"Zu Audio Essence",
			"Wilson Audio Duette",
			"Martin-Logan Source"
		],
		"function": "<=",
		"commonness": -26.730049215528396,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.audiobase.audio_equipment",
					"class": "base.audiobase.audio_equipment",
					"friendly_name": "Audio Equipment",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "31.7^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "31.7",
					"question_node": 0,
					"function": "<="
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.country",
					"friendly_name": "us",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.audiobase.audio_equipment.weight",
					"friendly_name": "Weight"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.audiobase.audio_equipment.country_of_manufacture",
					"friendly_name": "Country of Manufacture"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.audiobase.audio_equipment . \nFILTER (?x1 <= 31.7)\nVALUES ?x2 { :en.united_states_of_america } \n?x0 :base.audiobase.audio_equipment.weight ?x1 . \n?x0 :base.audiobase.audio_equipment.country_of_manufacture ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 221000002,
		"question": "what are the audio equipments with a weight of at most 31.7 kg that are manufactured in the united states?",
		"answer": [
			"Revel Concerta M12",
			"Bel Canto e.One Dac3",
			"Revel Concerta F12",
			"Zu Audio Essence",
			"KEF Reference 201/2",
			"Zu Audio Druid",
			"Martin-Logan Spire",
			"Zu Audio Druid Credenza",
			"Revel Ultima Gem2",
			"Martin-Logan Vignette",
			"Revel Performa F32",
			"Martin-Logan Source",
			"Revel Performa M22",
			"Martin-Logan Purity",
			"Martin-Logan Vista",
			"Martin-Logan Vantage",
			"Martin-Logan Preface",
			"Wilson Audio Duette"
		],
		"function": "<=",
		"commonness": -26.730049215528396,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.audiobase.audio_equipment",
					"class": "base.audiobase.audio_equipment",
					"friendly_name": "Audio Equipment",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "31.7^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "31.7",
					"question_node": 0,
					"function": "<="
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.country",
					"friendly_name": "united states",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.audiobase.audio_equipment.weight",
					"friendly_name": "Weight"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.audiobase.audio_equipment.country_of_manufacture",
					"friendly_name": "Country of Manufacture"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.audiobase.audio_equipment . \nFILTER (?x1 <= 31.7)\nVALUES ?x2 { :en.united_states_of_america } \n?x0 :base.audiobase.audio_equipment.weight ?x1 . \n?x0 :base.audiobase.audio_equipment.country_of_manufacture ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 221000200,
		"question": "what audio equipment manufactured in the united states of america weighs at most 31.7 kg?",
		"answer": [
			"KEF Reference 201/2",
			"Revel Concerta F12",
			"Martin-Logan Source",
			"Martin-Logan Purity",
			"Zu Audio Druid",
			"Martin-Logan Vista",
			"Revel Ultima Gem2",
			"Martin-Logan Vignette",
			"Zu Audio Druid Credenza",
			"Martin-Logan Vantage",
			"Bel Canto e.One Dac3",
			"Revel Performa M22",
			"Revel Performa F32",
			"Revel Concerta M12",
			"Zu Audio Essence",
			"Wilson Audio Duette",
			"Martin-Logan Preface",
			"Martin-Logan Spire"
		],
		"function": "<=",
		"commonness": -26.730049215528396,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.audiobase.audio_equipment",
					"class": "base.audiobase.audio_equipment",
					"friendly_name": "Audio Equipment",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "31.7^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "31.7",
					"question_node": 0,
					"function": "<="
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.country",
					"friendly_name": "United States of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.audiobase.audio_equipment.weight",
					"friendly_name": "Weight"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.audiobase.audio_equipment.country_of_manufacture",
					"friendly_name": "Country of Manufacture"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.audiobase.audio_equipment . \nFILTER (?x1 <= 31.7)\nVALUES ?x2 { :en.united_states_of_america } \n?x0 :base.audiobase.audio_equipment.weight ?x1 . \n?x0 :base.audiobase.audio_equipment.country_of_manufacture ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 221000201,
		"question": "what audio equipment manufactured in the us weighs at most 31.7 kg?",
		"answer": [
			"Martin-Logan Vignette",
			"Zu Audio Druid",
			"Martin-Logan Vista",
			"Revel Performa F32",
			"Martin-Logan Source",
			"KEF Reference 201/2",
			"Zu Audio Druid Credenza",
			"Martin-Logan Purity",
			"Bel Canto e.One Dac3",
			"Zu Audio Essence",
			"Revel Performa M22",
			"Martin-Logan Spire",
			"Martin-Logan Vantage",
			"Revel Concerta F12",
			"Martin-Logan Preface",
			"Wilson Audio Duette",
			"Revel Concerta M12",
			"Revel Ultima Gem2"
		],
		"function": "<=",
		"commonness": -26.730049215528396,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.audiobase.audio_equipment",
					"class": "base.audiobase.audio_equipment",
					"friendly_name": "Audio Equipment",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "31.7^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "31.7",
					"question_node": 0,
					"function": "<="
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.country",
					"friendly_name": "us",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.audiobase.audio_equipment.weight",
					"friendly_name": "Weight"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.audiobase.audio_equipment.country_of_manufacture",
					"friendly_name": "Country of Manufacture"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.audiobase.audio_equipment . \nFILTER (?x1 <= 31.7)\nVALUES ?x2 { :en.united_states_of_america } \n?x0 :base.audiobase.audio_equipment.weight ?x1 . \n?x0 :base.audiobase.audio_equipment.country_of_manufacture ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 221000202,
		"question": "what audio equipment manufactured in the united states weighs at most 31.7 kg?",
		"answer": [
			"Martin-Logan Vista",
			"Revel Performa F32",
			"Bel Canto e.One Dac3",
			"Revel Performa M22",
			"Zu Audio Druid Credenza",
			"Martin-Logan Vignette",
			"KEF Reference 201/2",
			"Revel Concerta F12",
			"Revel Ultima Gem2",
			"Zu Audio Essence",
			"Martin-Logan Spire",
			"Martin-Logan Source",
			"Zu Audio Druid",
			"Wilson Audio Duette",
			"Revel Concerta M12",
			"Martin-Logan Purity",
			"Martin-Logan Vantage",
			"Martin-Logan Preface"
		],
		"function": "<=",
		"commonness": -26.730049215528396,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.audiobase.audio_equipment",
					"class": "base.audiobase.audio_equipment",
					"friendly_name": "Audio Equipment",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "31.7^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "31.7",
					"question_node": 0,
					"function": "<="
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.country",
					"friendly_name": "united states",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.audiobase.audio_equipment.weight",
					"friendly_name": "Weight"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.audiobase.audio_equipment.country_of_manufacture",
					"friendly_name": "Country of Manufacture"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.audiobase.audio_equipment . \nFILTER (?x1 <= 31.7)\nVALUES ?x2 { :en.united_states_of_america } \n?x0 :base.audiobase.audio_equipment.weight ?x1 . \n?x0 :base.audiobase.audio_equipment.country_of_manufacture ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 222000000,
		"question": "find the designer of the rocket engine with the strongest thrust at sea level.",
		"answer": [
			"KBKHA (KB Khimavtomatiki)"
		],
		"function": "argmax",
		"commonness": -30.03505371928707,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_engine_designer",
					"class": "spaceflight.rocket_engine_designer",
					"friendly_name": "Rocket engine designer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "spaceflight.rocket_engine",
					"class": "spaceflight.rocket_engine",
					"friendly_name": "Rocket engine",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "778120.0^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "778120.0",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.rocket_engine.designed_by",
					"friendly_name": "Designed by"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "spaceflight.rocket_engine.thrust_sea_level",
					"friendly_name": "Thrust (sea level)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_engine_designer . \n?x1 :type.object.type :spaceflight.rocket_engine . \n{\nSELECT (MAX(?y2) AS ?x2)  WHERE { \n?y0 :type.object.type :spaceflight.rocket_engine_designer . \n?y1 :type.object.type :spaceflight.rocket_engine . \n?y1 :spaceflight.rocket_engine.designed_by ?y0 . \n?y1 :spaceflight.rocket_engine.thrust_sea_level ?y2 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y1 != ?y2  )\n}\n}\n?x1 :spaceflight.rocket_engine.designed_by ?x0 . \n?x1 :spaceflight.rocket_engine.thrust_sea_level ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 222000100,
		"question": "who designed the rocket engine with the highest sea level thrust?",
		"answer": [
			"KBKHA (KB Khimavtomatiki)"
		],
		"function": "argmax",
		"commonness": -30.03505371928707,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_engine_designer",
					"class": "spaceflight.rocket_engine_designer",
					"friendly_name": "Rocket engine designer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "spaceflight.rocket_engine",
					"class": "spaceflight.rocket_engine",
					"friendly_name": "Rocket engine",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "778120.0^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "778120.0",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.rocket_engine.designed_by",
					"friendly_name": "Designed by"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "spaceflight.rocket_engine.thrust_sea_level",
					"friendly_name": "Thrust (sea level)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_engine_designer . \n?x1 :type.object.type :spaceflight.rocket_engine . \n{\nSELECT (MAX(?y2) AS ?x2)  WHERE { \n?y0 :type.object.type :spaceflight.rocket_engine_designer . \n?y1 :type.object.type :spaceflight.rocket_engine . \n?y1 :spaceflight.rocket_engine.designed_by ?y0 . \n?y1 :spaceflight.rocket_engine.thrust_sea_level ?y2 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y1 != ?y2  )\n}\n}\n?x1 :spaceflight.rocket_engine.designed_by ?x0 . \n?x1 :spaceflight.rocket_engine.thrust_sea_level ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 222000200,
		"question": "who came up with the rocket engine that has the highest sea level thrust?",
		"answer": [
			"KBKHA (KB Khimavtomatiki)"
		],
		"function": "argmax",
		"commonness": -30.03505371928707,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_engine_designer",
					"class": "spaceflight.rocket_engine_designer",
					"friendly_name": "Rocket engine designer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "spaceflight.rocket_engine",
					"class": "spaceflight.rocket_engine",
					"friendly_name": "Rocket engine",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "778120.0^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "778120.0",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.rocket_engine.designed_by",
					"friendly_name": "Designed by"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "spaceflight.rocket_engine.thrust_sea_level",
					"friendly_name": "Thrust (sea level)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_engine_designer . \n?x1 :type.object.type :spaceflight.rocket_engine . \n{\nSELECT (MAX(?y2) AS ?x2)  WHERE { \n?y0 :type.object.type :spaceflight.rocket_engine_designer . \n?y1 :type.object.type :spaceflight.rocket_engine . \n?y1 :spaceflight.rocket_engine.designed_by ?y0 . \n?y1 :spaceflight.rocket_engine.thrust_sea_level ?y2 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y1 != ?y2  )\n}\n}\n?x1 :spaceflight.rocket_engine.designed_by ?x0 . \n?x1 :spaceflight.rocket_engine.thrust_sea_level ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 222000300,
		"question": "who was the designer of the rocket engine that had the highest sea level thrust?",
		"answer": [
			"KBKHA (KB Khimavtomatiki)"
		],
		"function": "argmax",
		"commonness": -30.03505371928707,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_engine_designer",
					"class": "spaceflight.rocket_engine_designer",
					"friendly_name": "Rocket engine designer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "spaceflight.rocket_engine",
					"class": "spaceflight.rocket_engine",
					"friendly_name": "Rocket engine",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "778120.0^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "778120.0",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.rocket_engine.designed_by",
					"friendly_name": "Designed by"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "spaceflight.rocket_engine.thrust_sea_level",
					"friendly_name": "Thrust (sea level)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_engine_designer . \n?x1 :type.object.type :spaceflight.rocket_engine . \n{\nSELECT (MAX(?y2) AS ?x2)  WHERE { \n?y0 :type.object.type :spaceflight.rocket_engine_designer . \n?y1 :type.object.type :spaceflight.rocket_engine . \n?y1 :spaceflight.rocket_engine.designed_by ?y0 . \n?y1 :spaceflight.rocket_engine.thrust_sea_level ?y2 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y1 != ?y2  )\n}\n}\n?x1 :spaceflight.rocket_engine.designed_by ?x0 . \n?x1 :spaceflight.rocket_engine.thrust_sea_level ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 222000400,
		"question": "the highest sea level thrust from a rocket comes from which designer?",
		"answer": [
			"KBKHA (KB Khimavtomatiki)"
		],
		"function": "argmax",
		"commonness": -30.03505371928707,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_engine_designer",
					"class": "spaceflight.rocket_engine_designer",
					"friendly_name": "Rocket engine designer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "spaceflight.rocket_engine",
					"class": "spaceflight.rocket_engine",
					"friendly_name": "Rocket engine",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "778120.0^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "778120.0",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.rocket_engine.designed_by",
					"friendly_name": "Designed by"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "spaceflight.rocket_engine.thrust_sea_level",
					"friendly_name": "Thrust (sea level)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_engine_designer . \n?x1 :type.object.type :spaceflight.rocket_engine . \n{\nSELECT (MAX(?y2) AS ?x2)  WHERE { \n?y0 :type.object.type :spaceflight.rocket_engine_designer . \n?y1 :type.object.type :spaceflight.rocket_engine . \n?y1 :spaceflight.rocket_engine.designed_by ?y0 . \n?y1 :spaceflight.rocket_engine.thrust_sea_level ?y2 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y1 != ?y2  )\n}\n}\n?x1 :spaceflight.rocket_engine.designed_by ?x0 . \n?x1 :spaceflight.rocket_engine.thrust_sea_level ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 223000000,
		"question": "frank miller created which series of comic books starring batman",
		"answer": [
			"Batman: The Dark Knight Returns"
		],
		"function": "none",
		"commonness": -21.89634449799579,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_series",
					"class": "comic_books.comic_book_series",
					"friendly_name": "Comic Book Series",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.frank_miller",
					"class": "comic_books.comic_book_creator",
					"friendly_name": "Frank Miller",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.batman",
					"class": "comic_books.comic_book_character",
					"friendly_name": "Batman",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "comic_books.comic_book_creator.series_created",
					"friendly_name": "Series Created"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "comic_books.comic_book_series.featured_characters",
					"friendly_name": "Featured Characters"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_series . \nVALUES ?x1 { :en.frank_miller } \nVALUES ?x2 { :en.batman } \n?x1 :comic_books.comic_book_creator.series_created ?x0 . \n?x0 :comic_books.comic_book_series.featured_characters ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 223000100,
		"question": "batman is featured in which frank miller comic book series?",
		"answer": [
			"Batman: The Dark Knight Returns"
		],
		"function": "none",
		"commonness": -21.89634449799579,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_series",
					"class": "comic_books.comic_book_series",
					"friendly_name": "Comic Book Series",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.frank_miller",
					"class": "comic_books.comic_book_creator",
					"friendly_name": "Frank Miller",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.batman",
					"class": "comic_books.comic_book_character",
					"friendly_name": "Batman",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "comic_books.comic_book_creator.series_created",
					"friendly_name": "Series Created"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "comic_books.comic_book_series.featured_characters",
					"friendly_name": "Featured Characters"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_series . \nVALUES ?x1 { :en.frank_miller } \nVALUES ?x2 { :en.batman } \n?x1 :comic_books.comic_book_creator.series_created ?x0 . \n?x0 :comic_books.comic_book_series.featured_characters ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 223000101,
		"question": "bruce wayne is featured in which frank miller comic book series?",
		"answer": [
			"Batman: The Dark Knight Returns"
		],
		"function": "none",
		"commonness": -21.89634449799579,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_series",
					"class": "comic_books.comic_book_series",
					"friendly_name": "Comic Book Series",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.frank_miller",
					"class": "comic_books.comic_book_creator",
					"friendly_name": "Frank Miller",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.batman",
					"class": "comic_books.comic_book_character",
					"friendly_name": "bruce wayne",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "comic_books.comic_book_creator.series_created",
					"friendly_name": "Series Created"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "comic_books.comic_book_series.featured_characters",
					"friendly_name": "Featured Characters"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_series . \nVALUES ?x1 { :en.frank_miller } \nVALUES ?x2 { :en.batman } \n?x1 :comic_books.comic_book_creator.series_created ?x0 . \n?x0 :comic_books.comic_book_series.featured_characters ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 223000102,
		"question": "batman is featured in which miller comic book series?",
		"answer": [
			"Batman: The Dark Knight Returns"
		],
		"function": "none",
		"commonness": -21.89634449799579,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_series",
					"class": "comic_books.comic_book_series",
					"friendly_name": "Comic Book Series",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.frank_miller",
					"class": "comic_books.comic_book_creator",
					"friendly_name": "miller",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.batman",
					"class": "comic_books.comic_book_character",
					"friendly_name": "Batman",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "comic_books.comic_book_creator.series_created",
					"friendly_name": "Series Created"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "comic_books.comic_book_series.featured_characters",
					"friendly_name": "Featured Characters"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_series . \nVALUES ?x1 { :en.frank_miller } \nVALUES ?x2 { :en.batman } \n?x1 :comic_books.comic_book_creator.series_created ?x0 . \n?x0 :comic_books.comic_book_series.featured_characters ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	}
]