[
	{
		"qid": 194000602,
		"question": "what collectable items were released in 1984 and part of the star war collection?",
		"answer": [
			"1984 Lumat action figure"
		],
		"function": "none",
		"commonness": -25.053423614903828,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "interests.collectable_item",
					"class": "interests.collectable_item",
					"friendly_name": "Collectable item",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.star_wars",
					"class": "interests.collection_category",
					"friendly_name": "star war",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "1984^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "1984",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "interests.collectable_item.collection_category",
					"friendly_name": "Collection category"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "interests.collectable_item.release_date",
					"friendly_name": "Release date"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :interests.collectable_item . \nVALUES ?x1 { :en.star_wars } \nVALUES ?x2 { \"1984\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?x0 :interests.collectable_item.collection_category ?x1 . \n?x0 :interests.collectable_item.release_date ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 195000000,
		"question": "what are the snl seasons that tina fey is in the cast?",
		"answer": [
			"Saturday Night Live - Season 31",
			"Saturday Night Live - Season 30"
		],
		"function": "none",
		"commonness": -31.334357186793028,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.saturdaynightlive.snl_season",
					"class": "base.saturdaynightlive.snl_season",
					"friendly_name": "SNL season",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.saturdaynightlive.snl_season_tenure",
					"class": "base.saturdaynightlive.snl_season_tenure",
					"friendly_name": "SNL season tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.tina_fey",
					"class": "base.saturdaynightlive.snl_cast_member",
					"friendly_name": "Tina Fey",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.saturdaynightlive.snl_season.cast",
					"friendly_name": "Cast"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.saturdaynightlive.snl_season_tenure.cast_members",
					"friendly_name": "Cast members"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.saturdaynightlive.snl_season . \n?x1 :type.object.type :base.saturdaynightlive.snl_season_tenure . \nVALUES ?x2 { :en.tina_fey } \n?x0 :base.saturdaynightlive.snl_season.cast ?x1 . \n?x1 :base.saturdaynightlive.snl_season_tenure.cast_members ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 195000001,
		"question": "what are the snl seasons that elizabeth stamatina fey is in the cast?",
		"answer": [
			"Saturday Night Live - Season 30",
			"Saturday Night Live - Season 31"
		],
		"function": "none",
		"commonness": -31.334357186793028,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.saturdaynightlive.snl_season",
					"class": "base.saturdaynightlive.snl_season",
					"friendly_name": "SNL season",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.saturdaynightlive.snl_season_tenure",
					"class": "base.saturdaynightlive.snl_season_tenure",
					"friendly_name": "SNL season tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.tina_fey",
					"class": "base.saturdaynightlive.snl_cast_member",
					"friendly_name": "elizabeth stamatina fey",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.saturdaynightlive.snl_season.cast",
					"friendly_name": "Cast"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.saturdaynightlive.snl_season_tenure.cast_members",
					"friendly_name": "Cast members"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.saturdaynightlive.snl_season . \n?x1 :type.object.type :base.saturdaynightlive.snl_season_tenure . \nVALUES ?x2 { :en.tina_fey } \n?x0 :base.saturdaynightlive.snl_season.cast ?x1 . \n?x1 :base.saturdaynightlive.snl_season_tenure.cast_members ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 195000100,
		"question": "in which snl seasons has tina fey appeared?",
		"answer": [
			"Saturday Night Live - Season 31",
			"Saturday Night Live - Season 30"
		],
		"function": "none",
		"commonness": -31.334357186793028,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.saturdaynightlive.snl_season",
					"class": "base.saturdaynightlive.snl_season",
					"friendly_name": "SNL season",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.saturdaynightlive.snl_season_tenure",
					"class": "base.saturdaynightlive.snl_season_tenure",
					"friendly_name": "SNL season tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.tina_fey",
					"class": "base.saturdaynightlive.snl_cast_member",
					"friendly_name": "Tina Fey",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.saturdaynightlive.snl_season.cast",
					"friendly_name": "Cast"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.saturdaynightlive.snl_season_tenure.cast_members",
					"friendly_name": "Cast members"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.saturdaynightlive.snl_season . \n?x1 :type.object.type :base.saturdaynightlive.snl_season_tenure . \nVALUES ?x2 { :en.tina_fey } \n?x0 :base.saturdaynightlive.snl_season.cast ?x1 . \n?x1 :base.saturdaynightlive.snl_season_tenure.cast_members ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 195000101,
		"question": "in which snl seasons has elizabeth stamatina fey appeared?",
		"answer": [
			"Saturday Night Live - Season 31",
			"Saturday Night Live - Season 30"
		],
		"function": "none",
		"commonness": -31.334357186793028,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.saturdaynightlive.snl_season",
					"class": "base.saturdaynightlive.snl_season",
					"friendly_name": "SNL season",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.saturdaynightlive.snl_season_tenure",
					"class": "base.saturdaynightlive.snl_season_tenure",
					"friendly_name": "SNL season tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.tina_fey",
					"class": "base.saturdaynightlive.snl_cast_member",
					"friendly_name": "elizabeth stamatina fey",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.saturdaynightlive.snl_season.cast",
					"friendly_name": "Cast"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.saturdaynightlive.snl_season_tenure.cast_members",
					"friendly_name": "Cast members"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.saturdaynightlive.snl_season . \n?x1 :type.object.type :base.saturdaynightlive.snl_season_tenure . \nVALUES ?x2 { :en.tina_fey } \n?x0 :base.saturdaynightlive.snl_season.cast ?x1 . \n?x1 :base.saturdaynightlive.snl_season_tenure.cast_members ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 195000200,
		"question": "what season of snl did tina fey play in?",
		"answer": [
			"Saturday Night Live - Season 31",
			"Saturday Night Live - Season 30"
		],
		"function": "none",
		"commonness": -31.334357186793028,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.saturdaynightlive.snl_season",
					"class": "base.saturdaynightlive.snl_season",
					"friendly_name": "SNL season",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.saturdaynightlive.snl_season_tenure",
					"class": "base.saturdaynightlive.snl_season_tenure",
					"friendly_name": "SNL season tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.tina_fey",
					"class": "base.saturdaynightlive.snl_cast_member",
					"friendly_name": "Tina Fey",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.saturdaynightlive.snl_season.cast",
					"friendly_name": "Cast"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.saturdaynightlive.snl_season_tenure.cast_members",
					"friendly_name": "Cast members"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.saturdaynightlive.snl_season . \n?x1 :type.object.type :base.saturdaynightlive.snl_season_tenure . \nVALUES ?x2 { :en.tina_fey } \n?x0 :base.saturdaynightlive.snl_season.cast ?x1 . \n?x1 :base.saturdaynightlive.snl_season_tenure.cast_members ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 195000201,
		"question": "what season of snl did elizabeth stamatina fey play in?",
		"answer": [
			"Saturday Night Live - Season 31",
			"Saturday Night Live - Season 30"
		],
		"function": "none",
		"commonness": -31.334357186793028,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.saturdaynightlive.snl_season",
					"class": "base.saturdaynightlive.snl_season",
					"friendly_name": "SNL season",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.saturdaynightlive.snl_season_tenure",
					"class": "base.saturdaynightlive.snl_season_tenure",
					"friendly_name": "SNL season tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.tina_fey",
					"class": "base.saturdaynightlive.snl_cast_member",
					"friendly_name": "elizabeth stamatina fey",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.saturdaynightlive.snl_season.cast",
					"friendly_name": "Cast"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.saturdaynightlive.snl_season_tenure.cast_members",
					"friendly_name": "Cast members"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.saturdaynightlive.snl_season . \n?x1 :type.object.type :base.saturdaynightlive.snl_season_tenure . \nVALUES ?x2 { :en.tina_fey } \n?x0 :base.saturdaynightlive.snl_season.cast ?x1 . \n?x1 :base.saturdaynightlive.snl_season_tenure.cast_members ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 195000300,
		"question": "tina fey appeared in which snl season?",
		"answer": [
			"Saturday Night Live - Season 31",
			"Saturday Night Live - Season 30"
		],
		"function": "none",
		"commonness": -31.334357186793028,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.saturdaynightlive.snl_season",
					"class": "base.saturdaynightlive.snl_season",
					"friendly_name": "SNL season",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.saturdaynightlive.snl_season_tenure",
					"class": "base.saturdaynightlive.snl_season_tenure",
					"friendly_name": "SNL season tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.tina_fey",
					"class": "base.saturdaynightlive.snl_cast_member",
					"friendly_name": "Tina Fey",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.saturdaynightlive.snl_season.cast",
					"friendly_name": "Cast"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.saturdaynightlive.snl_season_tenure.cast_members",
					"friendly_name": "Cast members"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.saturdaynightlive.snl_season . \n?x1 :type.object.type :base.saturdaynightlive.snl_season_tenure . \nVALUES ?x2 { :en.tina_fey } \n?x0 :base.saturdaynightlive.snl_season.cast ?x1 . \n?x1 :base.saturdaynightlive.snl_season_tenure.cast_members ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 195000301,
		"question": "elizabeth stamatina fey appeared in which snl season?",
		"answer": [
			"Saturday Night Live - Season 30",
			"Saturday Night Live - Season 31"
		],
		"function": "none",
		"commonness": -31.334357186793028,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.saturdaynightlive.snl_season",
					"class": "base.saturdaynightlive.snl_season",
					"friendly_name": "SNL season",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.saturdaynightlive.snl_season_tenure",
					"class": "base.saturdaynightlive.snl_season_tenure",
					"friendly_name": "SNL season tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.tina_fey",
					"class": "base.saturdaynightlive.snl_cast_member",
					"friendly_name": "elizabeth stamatina fey",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.saturdaynightlive.snl_season.cast",
					"friendly_name": "Cast"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.saturdaynightlive.snl_season_tenure.cast_members",
					"friendly_name": "Cast members"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.saturdaynightlive.snl_season . \n?x1 :type.object.type :base.saturdaynightlive.snl_season_tenure . \nVALUES ?x2 { :en.tina_fey } \n?x0 :base.saturdaynightlive.snl_season.cast ?x1 . \n?x1 :base.saturdaynightlive.snl_season_tenure.cast_members ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 195000400,
		"question": "which snl season did tina fey play in?",
		"answer": [
			"Saturday Night Live - Season 31",
			"Saturday Night Live - Season 30"
		],
		"function": "none",
		"commonness": -31.334357186793028,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.saturdaynightlive.snl_season",
					"class": "base.saturdaynightlive.snl_season",
					"friendly_name": "SNL season",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.saturdaynightlive.snl_season_tenure",
					"class": "base.saturdaynightlive.snl_season_tenure",
					"friendly_name": "SNL season tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.tina_fey",
					"class": "base.saturdaynightlive.snl_cast_member",
					"friendly_name": "Tina Fey",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.saturdaynightlive.snl_season.cast",
					"friendly_name": "Cast"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.saturdaynightlive.snl_season_tenure.cast_members",
					"friendly_name": "Cast members"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.saturdaynightlive.snl_season . \n?x1 :type.object.type :base.saturdaynightlive.snl_season_tenure . \nVALUES ?x2 { :en.tina_fey } \n?x0 :base.saturdaynightlive.snl_season.cast ?x1 . \n?x1 :base.saturdaynightlive.snl_season_tenure.cast_members ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 195000401,
		"question": "which snl season did elizabeth stamatina fey play in?",
		"answer": [
			"Saturday Night Live - Season 30",
			"Saturday Night Live - Season 31"
		],
		"function": "none",
		"commonness": -31.334357186793028,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.saturdaynightlive.snl_season",
					"class": "base.saturdaynightlive.snl_season",
					"friendly_name": "SNL season",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.saturdaynightlive.snl_season_tenure",
					"class": "base.saturdaynightlive.snl_season_tenure",
					"friendly_name": "SNL season tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.tina_fey",
					"class": "base.saturdaynightlive.snl_cast_member",
					"friendly_name": "elizabeth stamatina fey",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.saturdaynightlive.snl_season.cast",
					"friendly_name": "Cast"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.saturdaynightlive.snl_season_tenure.cast_members",
					"friendly_name": "Cast members"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.saturdaynightlive.snl_season . \n?x1 :type.object.type :base.saturdaynightlive.snl_season_tenure . \nVALUES ?x2 { :en.tina_fey } \n?x0 :base.saturdaynightlive.snl_season.cast ?x1 . \n?x1 :base.saturdaynightlive.snl_season_tenure.cast_members ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 195000500,
		"question": "which snl seasons starred tina fey?",
		"answer": [
			"Saturday Night Live - Season 30",
			"Saturday Night Live - Season 31"
		],
		"function": "none",
		"commonness": -31.334357186793028,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.saturdaynightlive.snl_season",
					"class": "base.saturdaynightlive.snl_season",
					"friendly_name": "SNL season",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.saturdaynightlive.snl_season_tenure",
					"class": "base.saturdaynightlive.snl_season_tenure",
					"friendly_name": "SNL season tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.tina_fey",
					"class": "base.saturdaynightlive.snl_cast_member",
					"friendly_name": "Tina Fey",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.saturdaynightlive.snl_season.cast",
					"friendly_name": "Cast"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.saturdaynightlive.snl_season_tenure.cast_members",
					"friendly_name": "Cast members"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.saturdaynightlive.snl_season . \n?x1 :type.object.type :base.saturdaynightlive.snl_season_tenure . \nVALUES ?x2 { :en.tina_fey } \n?x0 :base.saturdaynightlive.snl_season.cast ?x1 . \n?x1 :base.saturdaynightlive.snl_season_tenure.cast_members ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 195000501,
		"question": "which snl seasons starred elizabeth stamatina fey?",
		"answer": [
			"Saturday Night Live - Season 31",
			"Saturday Night Live - Season 30"
		],
		"function": "none",
		"commonness": -31.334357186793028,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.saturdaynightlive.snl_season",
					"class": "base.saturdaynightlive.snl_season",
					"friendly_name": "SNL season",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.saturdaynightlive.snl_season_tenure",
					"class": "base.saturdaynightlive.snl_season_tenure",
					"friendly_name": "SNL season tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.tina_fey",
					"class": "base.saturdaynightlive.snl_cast_member",
					"friendly_name": "elizabeth stamatina fey",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.saturdaynightlive.snl_season.cast",
					"friendly_name": "Cast"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.saturdaynightlive.snl_season_tenure.cast_members",
					"friendly_name": "Cast members"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.saturdaynightlive.snl_season . \n?x1 :type.object.type :base.saturdaynightlive.snl_season_tenure . \nVALUES ?x2 { :en.tina_fey } \n?x0 :base.saturdaynightlive.snl_season.cast ?x1 . \n?x1 :base.saturdaynightlive.snl_season_tenure.cast_members ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 196000000,
		"question": "what positions are available in new york yankees?",
		"answer": [
			"Hitting Coach",
			"Center fielder",
			"Middle relief pitcher",
			"Starting pitcher",
			"Outfielder",
			"Infielder",
			"Shortstop",
			"First baseman",
			"Third baseman",
			"Utility player",
			"Designated hitter",
			"Closer",
			"Catcher",
			"Second baseman",
			"Left fielder",
			"Pitcher",
			"Right fielder",
			"Relief pitcher",
			"Utility infielder",
			"Setup pitcher"
		],
		"function": "none",
		"commonness": -21.716341203072073,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.sports_position",
					"class": "sports.sports_position",
					"friendly_name": "Sports position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "sports.sport",
					"class": "sports.sport",
					"friendly_name": "Sport",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.new_york_yankees",
					"class": "sports.sports_team",
					"friendly_name": "New York Yankees",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "sports.sport.positions",
					"friendly_name": "Positions"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "sports.sport.teams",
					"friendly_name": "Teams"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.sports_position . \n?x1 :type.object.type :sports.sport . \nVALUES ?x2 { :en.new_york_yankees } \n?x1 :sports.sport.positions ?x0 . \n?x1 :sports.sport.teams ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 196000001,
		"question": "what positions are available in yankees?",
		"answer": [
			"Utility infielder",
			"Closer",
			"Right fielder",
			"Setup pitcher",
			"Relief pitcher",
			"Third baseman",
			"Left fielder",
			"Center fielder",
			"Outfielder",
			"Shortstop",
			"Starting pitcher",
			"Second baseman",
			"Infielder",
			"First baseman",
			"Utility player",
			"Catcher",
			"Middle relief pitcher",
			"Hitting Coach",
			"Pitcher",
			"Designated hitter"
		],
		"function": "none",
		"commonness": -21.716341203072073,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.sports_position",
					"class": "sports.sports_position",
					"friendly_name": "Sports position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "sports.sport",
					"class": "sports.sport",
					"friendly_name": "Sport",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.new_york_yankees",
					"class": "sports.sports_team",
					"friendly_name": "yankees",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "sports.sport.positions",
					"friendly_name": "Positions"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "sports.sport.teams",
					"friendly_name": "Teams"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.sports_position . \n?x1 :type.object.type :sports.sport . \nVALUES ?x2 { :en.new_york_yankees } \n?x1 :sports.sport.positions ?x0 . \n?x1 :sports.sport.teams ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 196000002,
		"question": "what positions are available in yankee?",
		"answer": [
			"Second baseman",
			"Pitcher",
			"Outfielder",
			"Utility player",
			"Middle relief pitcher",
			"Setup pitcher",
			"Shortstop",
			"Infielder",
			"Hitting Coach",
			"Catcher",
			"Designated hitter",
			"Third baseman",
			"First baseman",
			"Utility infielder",
			"Starting pitcher",
			"Center fielder",
			"Relief pitcher",
			"Closer",
			"Left fielder",
			"Right fielder"
		],
		"function": "none",
		"commonness": -21.716341203072073,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.sports_position",
					"class": "sports.sports_position",
					"friendly_name": "Sports position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "sports.sport",
					"class": "sports.sport",
					"friendly_name": "Sport",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.new_york_yankees",
					"class": "sports.sports_team",
					"friendly_name": "yankee",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "sports.sport.positions",
					"friendly_name": "Positions"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "sports.sport.teams",
					"friendly_name": "Teams"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.sports_position . \n?x1 :type.object.type :sports.sport . \nVALUES ?x2 { :en.new_york_yankees } \n?x1 :sports.sport.positions ?x0 . \n?x1 :sports.sport.teams ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	}
]