[
	{
		"qid": 204000102,
		"question": "which are the countries using top level domain sponsored by the roman see?",
		"answer": [
			"Vatican City"
		],
		"function": "none",
		"commonness": -21.702477186213052,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "location.country",
					"class": "location.country",
					"friendly_name": "Country",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "internet.top_level_domain",
					"class": "internet.top_level_domain",
					"friendly_name": "Top Level Domain",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.holy_see",
					"class": "internet.top_level_domain_sponsor",
					"friendly_name": "roman see",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "location.country.internet_tld",
					"friendly_name": "Internet TLD"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "internet.top_level_domain.sponsor",
					"friendly_name": "Sponsor"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :location.country . \n?x1 :type.object.type :internet.top_level_domain . \nVALUES ?x2 { :en.holy_see } \n?x0 :location.country.internet_tld ?x1 . \n?x1 :internet.top_level_domain.sponsor ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 204000200,
		"question": "what countries are currently using a top level domain that is sponsored by the holy see?",
		"answer": [
			"Vatican City"
		],
		"function": "none",
		"commonness": -21.702477186213052,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "location.country",
					"class": "location.country",
					"friendly_name": "Country",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "internet.top_level_domain",
					"class": "internet.top_level_domain",
					"friendly_name": "Top Level Domain",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.holy_see",
					"class": "internet.top_level_domain_sponsor",
					"friendly_name": "Holy See",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "location.country.internet_tld",
					"friendly_name": "Internet TLD"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "internet.top_level_domain.sponsor",
					"friendly_name": "Sponsor"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :location.country . \n?x1 :type.object.type :internet.top_level_domain . \nVALUES ?x2 { :en.holy_see } \n?x0 :location.country.internet_tld ?x1 . \n?x1 :internet.top_level_domain.sponsor ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 204000201,
		"question": "what countries are currently using a top level domain that is sponsored by the vatican?",
		"answer": [
			"Vatican City"
		],
		"function": "none",
		"commonness": -21.702477186213052,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "location.country",
					"class": "location.country",
					"friendly_name": "Country",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "internet.top_level_domain",
					"class": "internet.top_level_domain",
					"friendly_name": "Top Level Domain",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.holy_see",
					"class": "internet.top_level_domain_sponsor",
					"friendly_name": "vatican",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "location.country.internet_tld",
					"friendly_name": "Internet TLD"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "internet.top_level_domain.sponsor",
					"friendly_name": "Sponsor"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :location.country . \n?x1 :type.object.type :internet.top_level_domain . \nVALUES ?x2 { :en.holy_see } \n?x0 :location.country.internet_tld ?x1 . \n?x1 :internet.top_level_domain.sponsor ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 204000300,
		"question": "what countries use holy see sponsored top level domains?",
		"answer": [
			"Vatican City"
		],
		"function": "none",
		"commonness": -21.702477186213052,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "location.country",
					"class": "location.country",
					"friendly_name": "Country",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "internet.top_level_domain",
					"class": "internet.top_level_domain",
					"friendly_name": "Top Level Domain",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.holy_see",
					"class": "internet.top_level_domain_sponsor",
					"friendly_name": "Holy See",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "location.country.internet_tld",
					"friendly_name": "Internet TLD"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "internet.top_level_domain.sponsor",
					"friendly_name": "Sponsor"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :location.country . \n?x1 :type.object.type :internet.top_level_domain . \nVALUES ?x2 { :en.holy_see } \n?x0 :location.country.internet_tld ?x1 . \n?x1 :internet.top_level_domain.sponsor ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 204000301,
		"question": "what countries use vatican sponsored top level domains?",
		"answer": [
			"Vatican City"
		],
		"function": "none",
		"commonness": -21.702477186213052,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "location.country",
					"class": "location.country",
					"friendly_name": "Country",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "internet.top_level_domain",
					"class": "internet.top_level_domain",
					"friendly_name": "Top Level Domain",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.holy_see",
					"class": "internet.top_level_domain_sponsor",
					"friendly_name": "vatican",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "location.country.internet_tld",
					"friendly_name": "Internet TLD"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "internet.top_level_domain.sponsor",
					"friendly_name": "Sponsor"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :location.country . \n?x1 :type.object.type :internet.top_level_domain . \nVALUES ?x2 { :en.holy_see } \n?x0 :location.country.internet_tld ?x1 . \n?x1 :internet.top_level_domain.sponsor ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 204000302,
		"question": "what countries use roman see sponsored top level domains?",
		"answer": [
			"Vatican City"
		],
		"function": "none",
		"commonness": -21.702477186213052,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "location.country",
					"class": "location.country",
					"friendly_name": "Country",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "internet.top_level_domain",
					"class": "internet.top_level_domain",
					"friendly_name": "Top Level Domain",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.holy_see",
					"class": "internet.top_level_domain_sponsor",
					"friendly_name": "roman see",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "location.country.internet_tld",
					"friendly_name": "Internet TLD"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "internet.top_level_domain.sponsor",
					"friendly_name": "Sponsor"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :location.country . \n?x1 :type.object.type :internet.top_level_domain . \nVALUES ?x2 { :en.holy_see } \n?x0 :location.country.internet_tld ?x1 . \n?x1 :internet.top_level_domain.sponsor ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 205000000,
		"question": "visual paradigm for uml and magicdraw create which documentation?",
		"answer": [
			"HTML"
		],
		"function": "none",
		"commonness": -29.247633988326648,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.umltools.documentation_type",
					"class": "base.umltools.documentation_type",
					"friendly_name": "Documentation Type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.visual_paradigm_for_uml",
					"class": "base.umltools.uml_tool",
					"friendly_name": "Visual Paradigm for UML",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.magicdraw_uml",
					"class": "base.umltools.uml_tool",
					"friendly_name": "MagicDraw",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.umltools.documentation_type.tool",
					"friendly_name": "Tool"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.umltools.documentation_type.tool",
					"friendly_name": "Tool"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.umltools.documentation_type . \nVALUES ?x1 { :en.visual_paradigm_for_uml } \nVALUES ?x2 { :en.magicdraw_uml } \n?x0 :base.umltools.documentation_type.tool ?x1 . \n?x0 :base.umltools.documentation_type.tool ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 205000001,
		"question": "visual paradigm for uml and magicdraw uml create which documentation?",
		"answer": [
			"HTML"
		],
		"function": "none",
		"commonness": -29.247633988326648,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.umltools.documentation_type",
					"class": "base.umltools.documentation_type",
					"friendly_name": "Documentation Type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.visual_paradigm_for_uml",
					"class": "base.umltools.uml_tool",
					"friendly_name": "Visual Paradigm for UML",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.magicdraw_uml",
					"class": "base.umltools.uml_tool",
					"friendly_name": "magicdraw uml",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.umltools.documentation_type.tool",
					"friendly_name": "Tool"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.umltools.documentation_type.tool",
					"friendly_name": "Tool"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.umltools.documentation_type . \nVALUES ?x1 { :en.visual_paradigm_for_uml } \nVALUES ?x2 { :en.magicdraw_uml } \n?x0 :base.umltools.documentation_type.tool ?x1 . \n?x0 :base.umltools.documentation_type.tool ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 205000100,
		"question": "what documentation formats are supported by both visual paradigm for uml and magicdraw?",
		"answer": [
			"HTML"
		],
		"function": "none",
		"commonness": -29.247633988326648,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.umltools.documentation_type",
					"class": "base.umltools.documentation_type",
					"friendly_name": "Documentation Type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.visual_paradigm_for_uml",
					"class": "base.umltools.uml_tool",
					"friendly_name": "Visual Paradigm for UML",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.magicdraw_uml",
					"class": "base.umltools.uml_tool",
					"friendly_name": "MagicDraw",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.umltools.documentation_type.tool",
					"friendly_name": "Tool"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.umltools.documentation_type.tool",
					"friendly_name": "Tool"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.umltools.documentation_type . \nVALUES ?x1 { :en.visual_paradigm_for_uml } \nVALUES ?x2 { :en.magicdraw_uml } \n?x0 :base.umltools.documentation_type.tool ?x1 . \n?x0 :base.umltools.documentation_type.tool ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 205000101,
		"question": "what documentation formats are supported by both visual paradigm for uml and magicdraw uml?",
		"answer": [
			"HTML"
		],
		"function": "none",
		"commonness": -29.247633988326648,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.umltools.documentation_type",
					"class": "base.umltools.documentation_type",
					"friendly_name": "Documentation Type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.visual_paradigm_for_uml",
					"class": "base.umltools.uml_tool",
					"friendly_name": "Visual Paradigm for UML",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.magicdraw_uml",
					"class": "base.umltools.uml_tool",
					"friendly_name": "magicdraw uml",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.umltools.documentation_type.tool",
					"friendly_name": "Tool"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.umltools.documentation_type.tool",
					"friendly_name": "Tool"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.umltools.documentation_type . \nVALUES ?x1 { :en.visual_paradigm_for_uml } \nVALUES ?x2 { :en.magicdraw_uml } \n?x0 :base.umltools.documentation_type.tool ?x1 . \n?x0 :base.umltools.documentation_type.tool ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 205000200,
		"question": "using either visual paradigm for uml or magicdraw which documentation can be created?",
		"answer": [
			"HTML"
		],
		"function": "none",
		"commonness": -29.247633988326648,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.umltools.documentation_type",
					"class": "base.umltools.documentation_type",
					"friendly_name": "Documentation Type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.visual_paradigm_for_uml",
					"class": "base.umltools.uml_tool",
					"friendly_name": "Visual Paradigm for UML",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.magicdraw_uml",
					"class": "base.umltools.uml_tool",
					"friendly_name": "MagicDraw",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.umltools.documentation_type.tool",
					"friendly_name": "Tool"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.umltools.documentation_type.tool",
					"friendly_name": "Tool"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.umltools.documentation_type . \nVALUES ?x1 { :en.visual_paradigm_for_uml } \nVALUES ?x2 { :en.magicdraw_uml } \n?x0 :base.umltools.documentation_type.tool ?x1 . \n?x0 :base.umltools.documentation_type.tool ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 205000201,
		"question": "using either visual paradigm for uml or magicdraw uml which documentation can be created?",
		"answer": [
			"HTML"
		],
		"function": "none",
		"commonness": -29.247633988326648,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.umltools.documentation_type",
					"class": "base.umltools.documentation_type",
					"friendly_name": "Documentation Type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.visual_paradigm_for_uml",
					"class": "base.umltools.uml_tool",
					"friendly_name": "Visual Paradigm for UML",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.magicdraw_uml",
					"class": "base.umltools.uml_tool",
					"friendly_name": "magicdraw uml",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.umltools.documentation_type.tool",
					"friendly_name": "Tool"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.umltools.documentation_type.tool",
					"friendly_name": "Tool"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.umltools.documentation_type . \nVALUES ?x1 { :en.visual_paradigm_for_uml } \nVALUES ?x2 { :en.magicdraw_uml } \n?x0 :base.umltools.documentation_type.tool ?x1 . \n?x0 :base.umltools.documentation_type.tool ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 205000301,
		"question": "which documentation type can be created by both visual paradigm for uml and magicdraw uml?",
		"answer": [
			"HTML"
		],
		"function": "none",
		"commonness": -29.247633988326648,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.umltools.documentation_type",
					"class": "base.umltools.documentation_type",
					"friendly_name": "Documentation Type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.visual_paradigm_for_uml",
					"class": "base.umltools.uml_tool",
					"friendly_name": "Visual Paradigm for UML",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.magicdraw_uml",
					"class": "base.umltools.uml_tool",
					"friendly_name": "magicdraw uml",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.umltools.documentation_type.tool",
					"friendly_name": "Tool"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.umltools.documentation_type.tool",
					"friendly_name": "Tool"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.umltools.documentation_type . \nVALUES ?x1 { :en.visual_paradigm_for_uml } \nVALUES ?x2 { :en.magicdraw_uml } \n?x0 :base.umltools.documentation_type.tool ?x1 . \n?x0 :base.umltools.documentation_type.tool ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 206000000,
		"question": "what are the bicycle models that share the same bicycle type with specialized stumpjumper?",
		"answer": [
			"2003 Rocky Mountain Elevation",
			"Kona Cinder Cone",
			"S-Works Epic Carbon 29 XTR (2013)"
		],
		"function": "none",
		"commonness": -34.59754156299447,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "bicycles.bicycle_model",
					"class": "bicycles.bicycle_model",
					"friendly_name": "Bicycle model",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "bicycles.bicycle_type",
					"class": "bicycles.bicycle_type",
					"friendly_name": "Bicycle type",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.stumpjumper",
					"class": "bicycles.bicycle_model",
					"friendly_name": "Specialized Stumpjumper",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "bicycles.bicycle_type.bicycle_models_of_this_type",
					"friendly_name": "Bicycle models of this type"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "bicycles.bicycle_model.bicycle_type",
					"friendly_name": "Bicycle type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :bicycles.bicycle_model . \n?x1 :type.object.type :bicycles.bicycle_type . \nVALUES ?x2 { :en.stumpjumper } \n?x1 :bicycles.bicycle_type.bicycle_models_of_this_type ?x0 . \n?x2 :bicycles.bicycle_model.bicycle_type ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 206000100,
		"question": "which bicycle models are of the same type with specialized stumpjumper?",
		"answer": [
			"S-Works Epic Carbon 29 XTR (2013)",
			"Kona Cinder Cone",
			"2003 Rocky Mountain Elevation"
		],
		"function": "none",
		"commonness": -34.59754156299447,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "bicycles.bicycle_model",
					"class": "bicycles.bicycle_model",
					"friendly_name": "Bicycle model",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "bicycles.bicycle_type",
					"class": "bicycles.bicycle_type",
					"friendly_name": "Bicycle type",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.stumpjumper",
					"class": "bicycles.bicycle_model",
					"friendly_name": "Specialized Stumpjumper",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "bicycles.bicycle_type.bicycle_models_of_this_type",
					"friendly_name": "Bicycle models of this type"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "bicycles.bicycle_model.bicycle_type",
					"friendly_name": "Bicycle type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :bicycles.bicycle_model . \n?x1 :type.object.type :bicycles.bicycle_type . \nVALUES ?x2 { :en.stumpjumper } \n?x1 :bicycles.bicycle_type.bicycle_models_of_this_type ?x0 . \n?x2 :bicycles.bicycle_model.bicycle_type ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 207000000,
		"question": "in 1912 summer olympics and 2008 summer olympics which official games were contested?",
		"answer": [
			"Track and field athletics",
			"Rowing",
			"Shooting sport",
			"Artistic gymnastics"
		],
		"function": "none",
		"commonness": -25.10133091784399,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "olympics.olympic_sport",
					"class": "olympics.olympic_sport",
					"friendly_name": "Olympic discipline",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.1912_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "1912 Summer Olympics",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "2008 Summer Olympics",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "olympics.olympic_games.sports",
					"friendly_name": "Sports"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "olympics.olympic_sport.olympic_games_contested",
					"friendly_name": "Olympic games contested"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :olympics.olympic_sport . \nVALUES ?x1 { :en.1912_summer_olympics } \nVALUES ?x2 { :en.2008_summer_olympics } \n?x1 :olympics.olympic_games.sports ?x0 . \n?x0 :olympics.olympic_sport.olympic_games_contested ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 207000001,
		"question": "in 1912 summer olympics and beijing olympics which official games were contested?",
		"answer": [
			"Shooting sport",
			"Rowing",
			"Artistic gymnastics",
			"Track and field athletics"
		],
		"function": "none",
		"commonness": -25.10133091784399,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "olympics.olympic_sport",
					"class": "olympics.olympic_sport",
					"friendly_name": "Olympic discipline",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.1912_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "1912 Summer Olympics",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "beijing olympics",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "olympics.olympic_games.sports",
					"friendly_name": "Sports"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "olympics.olympic_sport.olympic_games_contested",
					"friendly_name": "Olympic games contested"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :olympics.olympic_sport . \nVALUES ?x1 { :en.1912_summer_olympics } \nVALUES ?x2 { :en.2008_summer_olympics } \n?x1 :olympics.olympic_games.sports ?x0 . \n?x0 :olympics.olympic_sport.olympic_games_contested ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	}
]