[
	{
		"qid": 90000400,
		"question": "what comet group does the great comet of 1843 fall under?",
		"answer": [
			"Kreutz Sungrazers"
		],
		"function": "none",
		"commonness": -23.410432544467408,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.comet_group",
					"class": "astronomy.comet_group",
					"friendly_name": "Comet group",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.great_comet_of_1843",
					"class": "astronomy.comet",
					"friendly_name": "Great Comet of 1843",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "astronomy.comet.comet_group",
					"friendly_name": "Comet group"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.comet_group . \nVALUES ?x1 { :en.great_comet_of_1843 } \n?x1 :astronomy.comet.comet_group ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 90000401,
		"question": "what comet group does the c/1843 d1 fall under?",
		"answer": [
			"Kreutz Sungrazers"
		],
		"function": "none",
		"commonness": -23.410432544467408,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.comet_group",
					"class": "astronomy.comet_group",
					"friendly_name": "Comet group",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.great_comet_of_1843",
					"class": "astronomy.comet",
					"friendly_name": "c/1843 d1",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "astronomy.comet.comet_group",
					"friendly_name": "Comet group"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.comet_group . \nVALUES ?x1 { :en.great_comet_of_1843 } \n?x1 :astronomy.comet.comet_group ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 90000402,
		"question": "what comet group does the great march comet of 1843 fall under?",
		"answer": [
			"Kreutz Sungrazers"
		],
		"function": "none",
		"commonness": -23.410432544467408,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.comet_group",
					"class": "astronomy.comet_group",
					"friendly_name": "Comet group",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.great_comet_of_1843",
					"class": "astronomy.comet",
					"friendly_name": "great march comet of 1843",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "astronomy.comet.comet_group",
					"friendly_name": "Comet group"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.comet_group . \nVALUES ?x1 { :en.great_comet_of_1843 } \n?x1 :astronomy.comet.comet_group ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 91000001,
		"question": "who appears in the story joker?",
		"answer": [
			"Judge Drake",
			"Dick Grayson",
			"Jay Wylde",
			"Batman",
			"Brute Nelson",
			"Henry Claridge",
			"Joker",
			"James Gordon"
		],
		"function": "none",
		"commonness": -14.244426718282405,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_character",
					"class": "comic_books.comic_book_character",
					"friendly_name": "Comic Book Character",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.030shcp",
					"class": "comic_books.comic_book_story",
					"friendly_name": "joker",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "comic_books.comic_book_character.story_specific_appearances",
					"friendly_name": "Story Specific Appearances"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_character . \nVALUES ?x1 { :m.030shcp } \n?x0 :comic_books.comic_book_character.story_specific_appearances ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 91000100,
		"question": "what characters are in the story the joker?",
		"answer": [
			"Joker",
			"Dick Grayson",
			"Brute Nelson",
			"Jay Wylde",
			"Judge Drake",
			"Henry Claridge",
			"James Gordon",
			"Batman"
		],
		"function": "none",
		"commonness": -14.244426718282405,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_character",
					"class": "comic_books.comic_book_character",
					"friendly_name": "Comic Book Character",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.030shcp",
					"class": "comic_books.comic_book_story",
					"friendly_name": "The Joker",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "comic_books.comic_book_character.story_specific_appearances",
					"friendly_name": "Story Specific Appearances"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_character . \nVALUES ?x1 { :m.030shcp } \n?x0 :comic_books.comic_book_character.story_specific_appearances ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 91000101,
		"question": "what characters are in the story joker?",
		"answer": [
			"Henry Claridge",
			"Judge Drake",
			"Jay Wylde",
			"Batman",
			"Dick Grayson",
			"Joker",
			"James Gordon",
			"Brute Nelson"
		],
		"function": "none",
		"commonness": -14.244426718282405,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_character",
					"class": "comic_books.comic_book_character",
					"friendly_name": "Comic Book Character",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.030shcp",
					"class": "comic_books.comic_book_story",
					"friendly_name": "joker",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "comic_books.comic_book_character.story_specific_appearances",
					"friendly_name": "Story Specific Appearances"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_character . \nVALUES ?x1 { :m.030shcp } \n?x0 :comic_books.comic_book_character.story_specific_appearances ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 91000200,
		"question": "what characters appear in the comic story the joker?",
		"answer": [
			"Judge Drake",
			"Dick Grayson",
			"Brute Nelson",
			"Jay Wylde",
			"Henry Claridge",
			"Joker",
			"Batman",
			"James Gordon"
		],
		"function": "none",
		"commonness": -14.244426718282405,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_character",
					"class": "comic_books.comic_book_character",
					"friendly_name": "Comic Book Character",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.030shcp",
					"class": "comic_books.comic_book_story",
					"friendly_name": "The Joker",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "comic_books.comic_book_character.story_specific_appearances",
					"friendly_name": "Story Specific Appearances"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_character . \nVALUES ?x1 { :m.030shcp } \n?x0 :comic_books.comic_book_character.story_specific_appearances ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 91000201,
		"question": "what characters appear in the comic story joker?",
		"answer": [
			"Judge Drake",
			"Henry Claridge",
			"Batman",
			"James Gordon",
			"Jay Wylde",
			"Dick Grayson",
			"Brute Nelson",
			"Joker"
		],
		"function": "none",
		"commonness": -14.244426718282405,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_character",
					"class": "comic_books.comic_book_character",
					"friendly_name": "Comic Book Character",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.030shcp",
					"class": "comic_books.comic_book_story",
					"friendly_name": "joker",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "comic_books.comic_book_character.story_specific_appearances",
					"friendly_name": "Story Specific Appearances"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_character . \nVALUES ?x1 { :m.030shcp } \n?x0 :comic_books.comic_book_character.story_specific_appearances ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 91000300,
		"question": "who are the characters that are in the story the joker?",
		"answer": [
			"Dick Grayson",
			"Brute Nelson",
			"Joker",
			"Jay Wylde",
			"Henry Claridge",
			"Batman",
			"Judge Drake",
			"James Gordon"
		],
		"function": "none",
		"commonness": -14.244426718282405,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_character",
					"class": "comic_books.comic_book_character",
					"friendly_name": "Comic Book Character",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.030shcp",
					"class": "comic_books.comic_book_story",
					"friendly_name": "The Joker",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "comic_books.comic_book_character.story_specific_appearances",
					"friendly_name": "Story Specific Appearances"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_character . \nVALUES ?x1 { :m.030shcp } \n?x0 :comic_books.comic_book_character.story_specific_appearances ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 91000301,
		"question": "who are the characters that are in the story joker?",
		"answer": [
			"Dick Grayson",
			"Brute Nelson",
			"Jay Wylde",
			"Joker",
			"Batman",
			"Judge Drake",
			"James Gordon",
			"Henry Claridge"
		],
		"function": "none",
		"commonness": -14.244426718282405,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_character",
					"class": "comic_books.comic_book_character",
					"friendly_name": "Comic Book Character",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.030shcp",
					"class": "comic_books.comic_book_story",
					"friendly_name": "joker",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "comic_books.comic_book_character.story_specific_appearances",
					"friendly_name": "Story Specific Appearances"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_character . \nVALUES ?x1 { :m.030shcp } \n?x0 :comic_books.comic_book_character.story_specific_appearances ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 91000400,
		"question": "which characters star in the story the joker?",
		"answer": [
			"Dick Grayson",
			"Henry Claridge",
			"Joker",
			"Judge Drake",
			"Brute Nelson",
			"Batman",
			"Jay Wylde",
			"James Gordon"
		],
		"function": "none",
		"commonness": -14.244426718282405,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_character",
					"class": "comic_books.comic_book_character",
					"friendly_name": "Comic Book Character",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.030shcp",
					"class": "comic_books.comic_book_story",
					"friendly_name": "The Joker",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "comic_books.comic_book_character.story_specific_appearances",
					"friendly_name": "Story Specific Appearances"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_character . \nVALUES ?x1 { :m.030shcp } \n?x0 :comic_books.comic_book_character.story_specific_appearances ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 91000401,
		"question": "which characters star in the story joker?",
		"answer": [
			"Brute Nelson",
			"Jay Wylde",
			"Batman",
			"Judge Drake",
			"James Gordon",
			"Joker",
			"Henry Claridge",
			"Dick Grayson"
		],
		"function": "none",
		"commonness": -14.244426718282405,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_character",
					"class": "comic_books.comic_book_character",
					"friendly_name": "Comic Book Character",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.030shcp",
					"class": "comic_books.comic_book_story",
					"friendly_name": "joker",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "comic_books.comic_book_character.story_specific_appearances",
					"friendly_name": "Story Specific Appearances"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_character . \nVALUES ?x1 { :m.030shcp } \n?x0 :comic_books.comic_book_character.story_specific_appearances ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 92000000,
		"question": "what are some soccer pitches available in england?",
		"answer": [
			"Wembley Stadium",
			"Wembley Stadium"
		],
		"function": "none",
		"commonness": -8.958977424702248,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "soccer.football_pitch",
					"class": "soccer.football_pitch",
					"friendly_name": "Football Pitch",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.england",
					"class": "location.location",
					"friendly_name": "England",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "location.location.containedby",
					"friendly_name": "Contained by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :soccer.football_pitch . \nVALUES ?x1 { :en.england } \n?x0 :location.location.containedby ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 92000100,
		"question": "where are the soccer pitches in england?",
		"answer": [
			"Wembley Stadium",
			"Wembley Stadium"
		],
		"function": "none",
		"commonness": -8.958977424702248,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "soccer.football_pitch",
					"class": "soccer.football_pitch",
					"friendly_name": "Football Pitch",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.england",
					"class": "location.location",
					"friendly_name": "England",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "location.location.containedby",
					"friendly_name": "Contained by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :soccer.football_pitch . \nVALUES ?x1 { :en.england } \n?x0 :location.location.containedby ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 93000000,
		"question": "what biological groupings include the venus flytrap?",
		"answer": [
			"Carnivorous plant"
		],
		"function": "none",
		"commonness": -17.043342741001418,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.informal_biological_grouping",
					"class": "biology.informal_biological_grouping",
					"friendly_name": "Informal biological grouping",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.venus_flytrap",
					"class": "biology.organism_classification",
					"friendly_name": "Venus flytrap",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.informal_biological_grouping.included_classifications",
					"friendly_name": "Included classifications"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.informal_biological_grouping . \nVALUES ?x1 { :en.venus_flytrap } \n?x0 :biology.informal_biological_grouping.included_classifications ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 93000002,
		"question": "what biological groupings include the venus flytraps?",
		"answer": [
			"Carnivorous plant"
		],
		"function": "none",
		"commonness": -17.043342741001418,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.informal_biological_grouping",
					"class": "biology.informal_biological_grouping",
					"friendly_name": "Informal biological grouping",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.venus_flytrap",
					"class": "biology.organism_classification",
					"friendly_name": "venus flytraps",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.informal_biological_grouping.included_classifications",
					"friendly_name": "Included classifications"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.informal_biological_grouping . \nVALUES ?x1 { :en.venus_flytrap } \n?x0 :biology.informal_biological_grouping.included_classifications ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 93000102,
		"question": "the venus flytraps is a member of which plant classification category?",
		"answer": [
			"Carnivorous plant"
		],
		"function": "none",
		"commonness": -17.043342741001418,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.informal_biological_grouping",
					"class": "biology.informal_biological_grouping",
					"friendly_name": "Informal biological grouping",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.venus_flytrap",
					"class": "biology.organism_classification",
					"friendly_name": "venus flytraps",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.informal_biological_grouping.included_classifications",
					"friendly_name": "Included classifications"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.informal_biological_grouping . \nVALUES ?x1 { :en.venus_flytrap } \n?x0 :biology.informal_biological_grouping.included_classifications ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 93000202,
		"question": "in what informal biological categories is the venus flytraps classified?",
		"answer": [
			"Carnivorous plant"
		],
		"function": "none",
		"commonness": -17.043342741001418,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.informal_biological_grouping",
					"class": "biology.informal_biological_grouping",
					"friendly_name": "Informal biological grouping",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.venus_flytrap",
					"class": "biology.organism_classification",
					"friendly_name": "venus flytraps",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.informal_biological_grouping.included_classifications",
					"friendly_name": "Included classifications"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.informal_biological_grouping . \nVALUES ?x1 { :en.venus_flytrap } \n?x0 :biology.informal_biological_grouping.included_classifications ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 93000300,
		"question": "how would the venus flytrap be categorized?",
		"answer": [
			"Carnivorous plant"
		],
		"function": "none",
		"commonness": -17.043342741001418,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.informal_biological_grouping",
					"class": "biology.informal_biological_grouping",
					"friendly_name": "Informal biological grouping",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.venus_flytrap",
					"class": "biology.organism_classification",
					"friendly_name": "Venus flytrap",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.informal_biological_grouping.included_classifications",
					"friendly_name": "Included classifications"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.informal_biological_grouping . \nVALUES ?x1 { :en.venus_flytrap } \n?x0 :biology.informal_biological_grouping.included_classifications ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 93000302,
		"question": "how would the venus flytraps be categorized?",
		"answer": [
			"Carnivorous plant"
		],
		"function": "none",
		"commonness": -17.043342741001418,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.informal_biological_grouping",
					"class": "biology.informal_biological_grouping",
					"friendly_name": "Informal biological grouping",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.venus_flytrap",
					"class": "biology.organism_classification",
					"friendly_name": "venus flytraps",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.informal_biological_grouping.included_classifications",
					"friendly_name": "Included classifications"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.informal_biological_grouping . \nVALUES ?x1 { :en.venus_flytrap } \n?x0 :biology.informal_biological_grouping.included_classifications ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 93000400,
		"question": "what category does the venus flytrap belong to?",
		"answer": [
			"Carnivorous plant"
		],
		"function": "none",
		"commonness": -17.043342741001418,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.informal_biological_grouping",
					"class": "biology.informal_biological_grouping",
					"friendly_name": "Informal biological grouping",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.venus_flytrap",
					"class": "biology.organism_classification",
					"friendly_name": "Venus flytrap",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.informal_biological_grouping.included_classifications",
					"friendly_name": "Included classifications"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.informal_biological_grouping . \nVALUES ?x1 { :en.venus_flytrap } \n?x0 :biology.informal_biological_grouping.included_classifications ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 93000402,
		"question": "what category does the venus flytraps belong to?",
		"answer": [
			"Carnivorous plant"
		],
		"function": "none",
		"commonness": -17.043342741001418,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.informal_biological_grouping",
					"class": "biology.informal_biological_grouping",
					"friendly_name": "Informal biological grouping",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.venus_flytrap",
					"class": "biology.organism_classification",
					"friendly_name": "venus flytraps",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.informal_biological_grouping.included_classifications",
					"friendly_name": "Included classifications"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.informal_biological_grouping . \nVALUES ?x1 { :en.venus_flytrap } \n?x0 :biology.informal_biological_grouping.included_classifications ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 94000000,
		"question": "find all the events of the electronic entertainment expo.",
		"answer": [
			"Electronic Entertainment Expo 2012",
			"Electronic Entertainment Expo 2009",
			"Electronic Entertainment Expo 2011",
			"Electronic Entertainment Expo 2010"
		],
		"function": "none",
		"commonness": -15.920868772774654,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "conferences.conference",
					"class": "conferences.conference",
					"friendly_name": "Conference event",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.e3",
					"class": "conferences.conference_series",
					"friendly_name": "Electronic Entertainment Expo",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "conferences.conference_series.conference",
					"friendly_name": "Conferences"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :conferences.conference . \nVALUES ?x1 { :en.e3 } \n?x1 :conferences.conference_series.conference ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]