[
	{
		"qid": 166000300,
		"question": "what's the name of the cancer center of massachusetts institute of technology?",
		"answer": [
			"David H. Koch Institute for Integrative Cancer Research at MIT"
		],
		"function": "none",
		"commonness": -14.64262530660993,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.cancer_center",
					"class": "medicine.cancer_center",
					"friendly_name": "Cancer Center",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.massachusetts_institute_of_technology",
					"class": "medicine.cancer_center_constituent",
					"friendly_name": "Massachusetts Institute of Technology",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.cancer_center.constituents",
					"friendly_name": "Constituents"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.cancer_center . \nVALUES ?x1 { :en.massachusetts_institute_of_technology } \n?x0 :medicine.cancer_center.constituents ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 166000301,
		"question": "what's the name of the cancer center of mit?",
		"answer": [
			"David H. Koch Institute for Integrative Cancer Research at MIT"
		],
		"function": "none",
		"commonness": -14.64262530660993,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.cancer_center",
					"class": "medicine.cancer_center",
					"friendly_name": "Cancer Center",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.massachusetts_institute_of_technology",
					"class": "medicine.cancer_center_constituent",
					"friendly_name": "mit",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.cancer_center.constituents",
					"friendly_name": "Constituents"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.cancer_center . \nVALUES ?x1 { :en.massachusetts_institute_of_technology } \n?x0 :medicine.cancer_center.constituents ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 166000400,
		"question": "what's the name of the center at massachusetts institute of technology that deals with cancer?",
		"answer": [
			"David H. Koch Institute for Integrative Cancer Research at MIT"
		],
		"function": "none",
		"commonness": -14.64262530660993,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.cancer_center",
					"class": "medicine.cancer_center",
					"friendly_name": "Cancer Center",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.massachusetts_institute_of_technology",
					"class": "medicine.cancer_center_constituent",
					"friendly_name": "Massachusetts Institute of Technology",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.cancer_center.constituents",
					"friendly_name": "Constituents"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.cancer_center . \nVALUES ?x1 { :en.massachusetts_institute_of_technology } \n?x0 :medicine.cancer_center.constituents ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 166000401,
		"question": "what's the name of the center at mit that deals with cancer?",
		"answer": [
			"David H. Koch Institute for Integrative Cancer Research at MIT"
		],
		"function": "none",
		"commonness": -14.64262530660993,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.cancer_center",
					"class": "medicine.cancer_center",
					"friendly_name": "Cancer Center",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.massachusetts_institute_of_technology",
					"class": "medicine.cancer_center_constituent",
					"friendly_name": "mit",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.cancer_center.constituents",
					"friendly_name": "Constituents"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.cancer_center . \nVALUES ?x1 { :en.massachusetts_institute_of_technology } \n?x0 :medicine.cancer_center.constituents ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 166000500,
		"question": "massachusetts institute of technology is home to what cancer center?",
		"answer": [
			"David H. Koch Institute for Integrative Cancer Research at MIT"
		],
		"function": "none",
		"commonness": -14.64262530660993,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.cancer_center",
					"class": "medicine.cancer_center",
					"friendly_name": "Cancer Center",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.massachusetts_institute_of_technology",
					"class": "medicine.cancer_center_constituent",
					"friendly_name": "Massachusetts Institute of Technology",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.cancer_center.constituents",
					"friendly_name": "Constituents"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.cancer_center . \nVALUES ?x1 { :en.massachusetts_institute_of_technology } \n?x0 :medicine.cancer_center.constituents ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 166000501,
		"question": "mit is home to what cancer center?",
		"answer": [
			"David H. Koch Institute for Integrative Cancer Research at MIT"
		],
		"function": "none",
		"commonness": -14.64262530660993,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.cancer_center",
					"class": "medicine.cancer_center",
					"friendly_name": "Cancer Center",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.massachusetts_institute_of_technology",
					"class": "medicine.cancer_center_constituent",
					"friendly_name": "mit",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.cancer_center.constituents",
					"friendly_name": "Constituents"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.cancer_center . \nVALUES ?x1 { :en.massachusetts_institute_of_technology } \n?x0 :medicine.cancer_center.constituents ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 167000000,
		"question": "which computer operating system was released on 2008-09-20?",
		"answer": [
			"Android"
		],
		"function": "none",
		"commonness": -14.431244262021593,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.operating_system",
					"class": "computer.operating_system",
					"friendly_name": "Operating System",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "2008-09-20^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "2008-09-20",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "computer.operating_system.release_date",
					"friendly_name": "Release Date"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.operating_system . \nVALUES ?x1 { \"2008-09-20\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?x0 :computer.operating_system.release_date ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 167000001,
		"question": "which computer operating system was released on sept. the 20th, 2008?",
		"answer": [
			"Android"
		],
		"function": "none",
		"commonness": -14.431244262021593,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.operating_system",
					"class": "computer.operating_system",
					"friendly_name": "Operating System",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "2008-09-20^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "Sept. the 20th, 2008",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "computer.operating_system.release_date",
					"friendly_name": "Release Date"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.operating_system . \nVALUES ?x1 { \"2008-09-20\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?x0 :computer.operating_system.release_date ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 167000002,
		"question": "which computer operating system was released on 09/20/2008?",
		"answer": [
			"Android"
		],
		"function": "none",
		"commonness": -14.431244262021593,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.operating_system",
					"class": "computer.operating_system",
					"friendly_name": "Operating System",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "2008-09-20^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "09/20/2008",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "computer.operating_system.release_date",
					"friendly_name": "Release Date"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.operating_system . \nVALUES ?x1 { \"2008-09-20\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?x0 :computer.operating_system.release_date ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 167000100,
		"question": "which computer operating system became available on 2008-09-20?",
		"answer": [
			"Android"
		],
		"function": "none",
		"commonness": -14.431244262021593,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.operating_system",
					"class": "computer.operating_system",
					"friendly_name": "Operating System",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "2008-09-20^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "2008-09-20",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "computer.operating_system.release_date",
					"friendly_name": "Release Date"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.operating_system . \nVALUES ?x1 { \"2008-09-20\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?x0 :computer.operating_system.release_date ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 167000101,
		"question": "which computer operating system became available on sept. the 20th, 2008?",
		"answer": [
			"Android"
		],
		"function": "none",
		"commonness": -14.431244262021593,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.operating_system",
					"class": "computer.operating_system",
					"friendly_name": "Operating System",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "2008-09-20^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "Sept. the 20th, 2008",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "computer.operating_system.release_date",
					"friendly_name": "Release Date"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.operating_system . \nVALUES ?x1 { \"2008-09-20\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?x0 :computer.operating_system.release_date ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 167000102,
		"question": "which computer operating system became available on 09/20/2008?",
		"answer": [
			"Android"
		],
		"function": "none",
		"commonness": -14.431244262021593,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.operating_system",
					"class": "computer.operating_system",
					"friendly_name": "Operating System",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "2008-09-20^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "09/20/2008",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "computer.operating_system.release_date",
					"friendly_name": "Release Date"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.operating_system . \nVALUES ?x1 { \"2008-09-20\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?x0 :computer.operating_system.release_date ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 167000200,
		"question": "which computer system was put out on 2008-09-20?",
		"answer": [
			"Android"
		],
		"function": "none",
		"commonness": -14.431244262021593,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.operating_system",
					"class": "computer.operating_system",
					"friendly_name": "Operating System",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "2008-09-20^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "2008-09-20",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "computer.operating_system.release_date",
					"friendly_name": "Release Date"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.operating_system . \nVALUES ?x1 { \"2008-09-20\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?x0 :computer.operating_system.release_date ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 167000201,
		"question": "which computer system was put out on sept. the 20th, 2008?",
		"answer": [
			"Android"
		],
		"function": "none",
		"commonness": -14.431244262021593,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.operating_system",
					"class": "computer.operating_system",
					"friendly_name": "Operating System",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "2008-09-20^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "Sept. the 20th, 2008",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "computer.operating_system.release_date",
					"friendly_name": "Release Date"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.operating_system . \nVALUES ?x1 { \"2008-09-20\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?x0 :computer.operating_system.release_date ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 167000202,
		"question": "which computer system was put out on 09/20/2008?",
		"answer": [
			"Android"
		],
		"function": "none",
		"commonness": -14.431244262021593,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.operating_system",
					"class": "computer.operating_system",
					"friendly_name": "Operating System",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "2008-09-20^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "09/20/2008",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "computer.operating_system.release_date",
					"friendly_name": "Release Date"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.operating_system . \nVALUES ?x1 { \"2008-09-20\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?x0 :computer.operating_system.release_date ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 167000300,
		"question": "on 2008-09-20 which computer operating system was released?",
		"answer": [
			"Android"
		],
		"function": "none",
		"commonness": -14.431244262021593,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.operating_system",
					"class": "computer.operating_system",
					"friendly_name": "Operating System",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "2008-09-20^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "2008-09-20",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "computer.operating_system.release_date",
					"friendly_name": "Release Date"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.operating_system . \nVALUES ?x1 { \"2008-09-20\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?x0 :computer.operating_system.release_date ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 167000301,
		"question": "on sept. the 20th, 2008 which computer operating system was released?",
		"answer": [
			"Android"
		],
		"function": "none",
		"commonness": -14.431244262021593,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.operating_system",
					"class": "computer.operating_system",
					"friendly_name": "Operating System",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "2008-09-20^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "Sept. the 20th, 2008",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "computer.operating_system.release_date",
					"friendly_name": "Release Date"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.operating_system . \nVALUES ?x1 { \"2008-09-20\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?x0 :computer.operating_system.release_date ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 167000302,
		"question": "on 09/20/2008 which computer operating system was released?",
		"answer": [
			"Android"
		],
		"function": "none",
		"commonness": -14.431244262021593,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.operating_system",
					"class": "computer.operating_system",
					"friendly_name": "Operating System",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "2008-09-20^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "09/20/2008",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "computer.operating_system.release_date",
					"friendly_name": "Release Date"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.operating_system . \nVALUES ?x1 { \"2008-09-20\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?x0 :computer.operating_system.release_date ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 168000000,
		"question": "sildenafil is made by what brand?",
		"answer": [
			"Viagra"
		],
		"function": "none",
		"commonness": -13.679433688410423,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.drug_brand",
					"class": "medicine.drug_brand",
					"friendly_name": "Drug brand",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.sildenafil",
					"class": "base.bioventurist.bv_therapeutic",
					"friendly_name": "Sildenafil",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "medicine.drug.canonical_brands",
					"friendly_name": "Canonical brands"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.drug_brand . \nVALUES ?x1 { :en.sildenafil } \n?x1 :medicine.drug.canonical_brands ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 168000001,
		"question": "viagra is made by what brand?",
		"answer": [
			"Viagra"
		],
		"function": "none",
		"commonness": -13.679433688410423,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.drug_brand",
					"class": "medicine.drug_brand",
					"friendly_name": "Drug brand",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.sildenafil",
					"class": "base.bioventurist.bv_therapeutic",
					"friendly_name": "viagra",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "medicine.drug.canonical_brands",
					"friendly_name": "Canonical brands"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.drug_brand . \nVALUES ?x1 { :en.sildenafil } \n?x1 :medicine.drug.canonical_brands ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 168000002,
		"question": "sildenafil citrate is made by what brand?",
		"answer": [
			"Viagra"
		],
		"function": "none",
		"commonness": -13.679433688410423,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.drug_brand",
					"class": "medicine.drug_brand",
					"friendly_name": "Drug brand",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.sildenafil",
					"class": "base.bioventurist.bv_therapeutic",
					"friendly_name": "sildenafil citrate",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "medicine.drug.canonical_brands",
					"friendly_name": "Canonical brands"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.drug_brand . \nVALUES ?x1 { :en.sildenafil } \n?x1 :medicine.drug.canonical_brands ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 168000100,
		"question": "in which drug brands are sildenafil available?",
		"answer": [
			"Viagra"
		],
		"function": "none",
		"commonness": -13.679433688410423,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.drug_brand",
					"class": "medicine.drug_brand",
					"friendly_name": "Drug brand",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.sildenafil",
					"class": "base.bioventurist.bv_therapeutic",
					"friendly_name": "Sildenafil",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "medicine.drug.canonical_brands",
					"friendly_name": "Canonical brands"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.drug_brand . \nVALUES ?x1 { :en.sildenafil } \n?x1 :medicine.drug.canonical_brands ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 168000101,
		"question": "in which drug brands are viagra available?",
		"answer": [
			"Viagra"
		],
		"function": "none",
		"commonness": -13.679433688410423,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.drug_brand",
					"class": "medicine.drug_brand",
					"friendly_name": "Drug brand",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.sildenafil",
					"class": "base.bioventurist.bv_therapeutic",
					"friendly_name": "viagra",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "medicine.drug.canonical_brands",
					"friendly_name": "Canonical brands"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.drug_brand . \nVALUES ?x1 { :en.sildenafil } \n?x1 :medicine.drug.canonical_brands ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 168000102,
		"question": "in which drug brands are sildenafil citrate available?",
		"answer": [
			"Viagra"
		],
		"function": "none",
		"commonness": -13.679433688410423,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.drug_brand",
					"class": "medicine.drug_brand",
					"friendly_name": "Drug brand",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.sildenafil",
					"class": "base.bioventurist.bv_therapeutic",
					"friendly_name": "sildenafil citrate",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "medicine.drug.canonical_brands",
					"friendly_name": "Canonical brands"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.drug_brand . \nVALUES ?x1 { :en.sildenafil } \n?x1 :medicine.drug.canonical_brands ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]