[
	{
		"qid": 216000101,
		"question": "how many tv stations does the owner of msnbc tv possess?",
		"answer": [
			"29"
		],
		"function": "count",
		"commonness": -22.171230393929925,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "broadcast.tv_station",
					"class": "broadcast.tv_station",
					"friendly_name": "TV Station",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "broadcast.tv_station_owner",
					"class": "broadcast.tv_station_owner",
					"friendly_name": "TV station owner",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.msnbc",
					"class": "broadcast.tv_station",
					"friendly_name": "msnbc tv",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.tv_station.owner",
					"friendly_name": "Owner"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "broadcast.tv_station_owner.tv_stations",
					"friendly_name": "TV stations owned"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :broadcast.tv_station . \n?x1 :type.object.type :broadcast.tv_station_owner . \nVALUES ?x2 { :en.msnbc } \n?x0 :broadcast.tv_station.owner ?x1 . \n?x1 :broadcast.tv_station_owner.tv_stations ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 216000200,
		"question": "how many tv stations are owned by the same company as msnbc?",
		"answer": [
			"29"
		],
		"function": "count",
		"commonness": -22.171230393929925,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "broadcast.tv_station",
					"class": "broadcast.tv_station",
					"friendly_name": "TV Station",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "broadcast.tv_station_owner",
					"class": "broadcast.tv_station_owner",
					"friendly_name": "TV station owner",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.msnbc",
					"class": "broadcast.tv_station",
					"friendly_name": "MSNBC",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.tv_station.owner",
					"friendly_name": "Owner"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "broadcast.tv_station_owner.tv_stations",
					"friendly_name": "TV stations owned"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :broadcast.tv_station . \n?x1 :type.object.type :broadcast.tv_station_owner . \nVALUES ?x2 { :en.msnbc } \n?x0 :broadcast.tv_station.owner ?x1 . \n?x1 :broadcast.tv_station_owner.tv_stations ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 216000201,
		"question": "how many tv stations are owned by the same company as msnbc tv?",
		"answer": [
			"29"
		],
		"function": "count",
		"commonness": -22.171230393929925,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "broadcast.tv_station",
					"class": "broadcast.tv_station",
					"friendly_name": "TV Station",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "broadcast.tv_station_owner",
					"class": "broadcast.tv_station_owner",
					"friendly_name": "TV station owner",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.msnbc",
					"class": "broadcast.tv_station",
					"friendly_name": "msnbc tv",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.tv_station.owner",
					"friendly_name": "Owner"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "broadcast.tv_station_owner.tv_stations",
					"friendly_name": "TV stations owned"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :broadcast.tv_station . \n?x1 :type.object.type :broadcast.tv_station_owner . \nVALUES ?x2 { :en.msnbc } \n?x0 :broadcast.tv_station.owner ?x1 . \n?x1 :broadcast.tv_station_owner.tv_stations ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 216000300,
		"question": "how many tv stations are under the control of the owner of msnbc?",
		"answer": [
			"29"
		],
		"function": "count",
		"commonness": -22.171230393929925,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "broadcast.tv_station",
					"class": "broadcast.tv_station",
					"friendly_name": "TV Station",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "broadcast.tv_station_owner",
					"class": "broadcast.tv_station_owner",
					"friendly_name": "TV station owner",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.msnbc",
					"class": "broadcast.tv_station",
					"friendly_name": "MSNBC",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.tv_station.owner",
					"friendly_name": "Owner"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "broadcast.tv_station_owner.tv_stations",
					"friendly_name": "TV stations owned"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :broadcast.tv_station . \n?x1 :type.object.type :broadcast.tv_station_owner . \nVALUES ?x2 { :en.msnbc } \n?x0 :broadcast.tv_station.owner ?x1 . \n?x1 :broadcast.tv_station_owner.tv_stations ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 216000301,
		"question": "how many tv stations are under the control of the owner of msnbc tv?",
		"answer": [
			"29"
		],
		"function": "count",
		"commonness": -22.171230393929925,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "broadcast.tv_station",
					"class": "broadcast.tv_station",
					"friendly_name": "TV Station",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "broadcast.tv_station_owner",
					"class": "broadcast.tv_station_owner",
					"friendly_name": "TV station owner",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.msnbc",
					"class": "broadcast.tv_station",
					"friendly_name": "msnbc tv",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.tv_station.owner",
					"friendly_name": "Owner"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "broadcast.tv_station_owner.tv_stations",
					"friendly_name": "TV stations owned"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :broadcast.tv_station . \n?x1 :type.object.type :broadcast.tv_station_owner . \nVALUES ?x2 { :en.msnbc } \n?x0 :broadcast.tv_station.owner ?x1 . \n?x1 :broadcast.tv_station_owner.tv_stations ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 217000000,
		"question": "how many other leagues are under the same system with scottish premier league?",
		"answer": [
			"10"
		],
		"function": "count",
		"commonness": -31.045224910951582,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "soccer.football_league",
					"class": "soccer.football_league",
					"friendly_name": "Football League",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "soccer.football_league_system",
					"class": "soccer.football_league_system",
					"friendly_name": "Football League System",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.scottish_premier_league",
					"class": "soccer.football_league",
					"friendly_name": "Scottish Premier League",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "soccer.football_league.league_system",
					"friendly_name": "League System"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "soccer.football_league.league_system",
					"friendly_name": "League System"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :soccer.football_league . \n?x1 :type.object.type :soccer.football_league_system . \nVALUES ?x2 { :en.scottish_premier_league } \n?x0 :soccer.football_league.league_system ?x1 . \n?x2 :soccer.football_league.league_system ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 217000001,
		"question": "how many other leagues are under the same system with spl?",
		"answer": [
			"10"
		],
		"function": "count",
		"commonness": -31.045224910951582,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "soccer.football_league",
					"class": "soccer.football_league",
					"friendly_name": "Football League",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "soccer.football_league_system",
					"class": "soccer.football_league_system",
					"friendly_name": "Football League System",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.scottish_premier_league",
					"class": "soccer.football_league",
					"friendly_name": "spl",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "soccer.football_league.league_system",
					"friendly_name": "League System"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "soccer.football_league.league_system",
					"friendly_name": "League System"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :soccer.football_league . \n?x1 :type.object.type :soccer.football_league_system . \nVALUES ?x2 { :en.scottish_premier_league } \n?x0 :soccer.football_league.league_system ?x1 . \n?x2 :soccer.football_league.league_system ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 217000002,
		"question": "how many other leagues are under the same system with clydesdale bank premier league?",
		"answer": [
			"10"
		],
		"function": "count",
		"commonness": -31.045224910951582,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "soccer.football_league",
					"class": "soccer.football_league",
					"friendly_name": "Football League",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "soccer.football_league_system",
					"class": "soccer.football_league_system",
					"friendly_name": "Football League System",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.scottish_premier_league",
					"class": "soccer.football_league",
					"friendly_name": "clydesdale bank premier league",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "soccer.football_league.league_system",
					"friendly_name": "League System"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "soccer.football_league.league_system",
					"friendly_name": "League System"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :soccer.football_league . \n?x1 :type.object.type :soccer.football_league_system . \nVALUES ?x2 { :en.scottish_premier_league } \n?x0 :soccer.football_league.league_system ?x1 . \n?x2 :soccer.football_league.league_system ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 218000000,
		"question": "which company manufactures the lowest lcd screen resolution cameras?",
		"answer": [
			"Olympus Corporation"
		],
		"function": "argmin",
		"commonness": -23.47736364216484,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "digicams.digital_camera_manufacturer",
					"class": "digicams.digital_camera_manufacturer",
					"friendly_name": "Digital Camera Brand",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "digicams.digital_camera",
					"class": "digicams.digital_camera",
					"friendly_name": "Digital Camera",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "922000.0^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "922000.0",
					"question_node": 0,
					"function": "argmin"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "digicams.digital_camera_manufacturer.cameras",
					"friendly_name": "Cameras"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "digicams.digital_camera.lcd_pixels",
					"friendly_name": "LCD screen resolution"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :digicams.digital_camera_manufacturer . \n?x1 :type.object.type :digicams.digital_camera . \n{\nSELECT (MIN(?y2) AS ?x2)  WHERE { \n?y0 :type.object.type :digicams.digital_camera_manufacturer . \n?y1 :type.object.type :digicams.digital_camera . \n?y0 :digicams.digital_camera_manufacturer.cameras ?y1 . \n?y1 :digicams.digital_camera.lcd_pixels ?y2 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y1 != ?y2  )\n}\n}\n?x0 :digicams.digital_camera_manufacturer.cameras ?x1 . \n?x1 :digicams.digital_camera.lcd_pixels ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 218000100,
		"question": "which digital camera brand is making the camera with the poorest lcd screen in terms of resolution?",
		"answer": [
			"Olympus Corporation"
		],
		"function": "argmin",
		"commonness": -23.47736364216484,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "digicams.digital_camera_manufacturer",
					"class": "digicams.digital_camera_manufacturer",
					"friendly_name": "Digital Camera Brand",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "digicams.digital_camera",
					"class": "digicams.digital_camera",
					"friendly_name": "Digital Camera",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "922000.0^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "922000.0",
					"question_node": 0,
					"function": "argmin"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "digicams.digital_camera_manufacturer.cameras",
					"friendly_name": "Cameras"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "digicams.digital_camera.lcd_pixels",
					"friendly_name": "LCD screen resolution"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :digicams.digital_camera_manufacturer . \n?x1 :type.object.type :digicams.digital_camera . \n{\nSELECT (MIN(?y2) AS ?x2)  WHERE { \n?y0 :type.object.type :digicams.digital_camera_manufacturer . \n?y1 :type.object.type :digicams.digital_camera . \n?y0 :digicams.digital_camera_manufacturer.cameras ?y1 . \n?y1 :digicams.digital_camera.lcd_pixels ?y2 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y1 != ?y2  )\n}\n}\n?x0 :digicams.digital_camera_manufacturer.cameras ?x1 . \n?x1 :digicams.digital_camera.lcd_pixels ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 219000000,
		"question": "name the origin of the dam of the racehorse secretariat.",
		"answer": [
			"United States of America"
		],
		"function": "none",
		"commonness": -23.988373848532063,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.thoroughbredracing.thoroughbred_racehorse_origin",
					"class": "base.thoroughbredracing.thoroughbred_racehorse_origin",
					"friendly_name": "Thoroughbred racehorse origin",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.thoroughbredracing.thoroughbred_racehorse",
					"class": "base.thoroughbredracing.thoroughbred_racehorse",
					"friendly_name": "Thoroughbred racehorse",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.secretariat",
					"class": "base.thoroughbredracing.thoroughbred_racehorse",
					"friendly_name": "Secretariat",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.thoroughbredracing.thoroughbred_racehorse_origin.horses_from_this_location",
					"friendly_name": "Horses from this location"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.thoroughbredracing.thoroughbred_racehorse.foal_if_this_horse_is_dam",
					"friendly_name": "Foal (if this horse is Dam)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.thoroughbredracing.thoroughbred_racehorse_origin . \n?x1 :type.object.type :base.thoroughbredracing.thoroughbred_racehorse . \nVALUES ?x2 { :en.secretariat } \n?x0 :base.thoroughbredracing.thoroughbred_racehorse_origin.horses_from_this_location ?x1 . \n?x1 :base.thoroughbredracing.thoroughbred_racehorse.foal_if_this_horse_is_dam ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 219000100,
		"question": "where did the mother of the racehorse secretariat come from?",
		"answer": [
			"United States of America"
		],
		"function": "none",
		"commonness": -23.988373848532063,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.thoroughbredracing.thoroughbred_racehorse_origin",
					"class": "base.thoroughbredracing.thoroughbred_racehorse_origin",
					"friendly_name": "Thoroughbred racehorse origin",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.thoroughbredracing.thoroughbred_racehorse",
					"class": "base.thoroughbredracing.thoroughbred_racehorse",
					"friendly_name": "Thoroughbred racehorse",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.secretariat",
					"class": "base.thoroughbredracing.thoroughbred_racehorse",
					"friendly_name": "Secretariat",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.thoroughbredracing.thoroughbred_racehorse_origin.horses_from_this_location",
					"friendly_name": "Horses from this location"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.thoroughbredracing.thoroughbred_racehorse.foal_if_this_horse_is_dam",
					"friendly_name": "Foal (if this horse is Dam)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.thoroughbredracing.thoroughbred_racehorse_origin . \n?x1 :type.object.type :base.thoroughbredracing.thoroughbred_racehorse . \nVALUES ?x2 { :en.secretariat } \n?x0 :base.thoroughbredracing.thoroughbred_racehorse_origin.horses_from_this_location ?x1 . \n?x1 :base.thoroughbredracing.thoroughbred_racehorse.foal_if_this_horse_is_dam ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 219000200,
		"question": "where was secretariat's dam from?",
		"answer": [
			"United States of America"
		],
		"function": "none",
		"commonness": -23.988373848532063,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.thoroughbredracing.thoroughbred_racehorse_origin",
					"class": "base.thoroughbredracing.thoroughbred_racehorse_origin",
					"friendly_name": "Thoroughbred racehorse origin",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.thoroughbredracing.thoroughbred_racehorse",
					"class": "base.thoroughbredracing.thoroughbred_racehorse",
					"friendly_name": "Thoroughbred racehorse",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.secretariat",
					"class": "base.thoroughbredracing.thoroughbred_racehorse",
					"friendly_name": "Secretariat",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.thoroughbredracing.thoroughbred_racehorse_origin.horses_from_this_location",
					"friendly_name": "Horses from this location"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.thoroughbredracing.thoroughbred_racehorse.foal_if_this_horse_is_dam",
					"friendly_name": "Foal (if this horse is Dam)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.thoroughbredracing.thoroughbred_racehorse_origin . \n?x1 :type.object.type :base.thoroughbredracing.thoroughbred_racehorse . \nVALUES ?x2 { :en.secretariat } \n?x0 :base.thoroughbredracing.thoroughbred_racehorse_origin.horses_from_this_location ?x1 . \n?x1 :base.thoroughbredracing.thoroughbred_racehorse.foal_if_this_horse_is_dam ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 219000300,
		"question": "the dam of the racehorse secretariat was from where?",
		"answer": [
			"United States of America"
		],
		"function": "none",
		"commonness": -23.988373848532063,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.thoroughbredracing.thoroughbred_racehorse_origin",
					"class": "base.thoroughbredracing.thoroughbred_racehorse_origin",
					"friendly_name": "Thoroughbred racehorse origin",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.thoroughbredracing.thoroughbred_racehorse",
					"class": "base.thoroughbredracing.thoroughbred_racehorse",
					"friendly_name": "Thoroughbred racehorse",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.secretariat",
					"class": "base.thoroughbredracing.thoroughbred_racehorse",
					"friendly_name": "Secretariat",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.thoroughbredracing.thoroughbred_racehorse_origin.horses_from_this_location",
					"friendly_name": "Horses from this location"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.thoroughbredracing.thoroughbred_racehorse.foal_if_this_horse_is_dam",
					"friendly_name": "Foal (if this horse is Dam)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.thoroughbredracing.thoroughbred_racehorse_origin . \n?x1 :type.object.type :base.thoroughbredracing.thoroughbred_racehorse . \nVALUES ?x2 { :en.secretariat } \n?x0 :base.thoroughbredracing.thoroughbred_racehorse_origin.horses_from_this_location ?x1 . \n?x1 :base.thoroughbredracing.thoroughbred_racehorse.foal_if_this_horse_is_dam ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 219000400,
		"question": "where was the dam of the racehorse secretariat from?",
		"answer": [
			"United States of America"
		],
		"function": "none",
		"commonness": -23.988373848532063,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.thoroughbredracing.thoroughbred_racehorse_origin",
					"class": "base.thoroughbredracing.thoroughbred_racehorse_origin",
					"friendly_name": "Thoroughbred racehorse origin",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.thoroughbredracing.thoroughbred_racehorse",
					"class": "base.thoroughbredracing.thoroughbred_racehorse",
					"friendly_name": "Thoroughbred racehorse",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.secretariat",
					"class": "base.thoroughbredracing.thoroughbred_racehorse",
					"friendly_name": "Secretariat",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.thoroughbredracing.thoroughbred_racehorse_origin.horses_from_this_location",
					"friendly_name": "Horses from this location"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.thoroughbredracing.thoroughbred_racehorse.foal_if_this_horse_is_dam",
					"friendly_name": "Foal (if this horse is Dam)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.thoroughbredracing.thoroughbred_racehorse_origin . \n?x1 :type.object.type :base.thoroughbredracing.thoroughbred_racehorse . \nVALUES ?x2 { :en.secretariat } \n?x0 :base.thoroughbredracing.thoroughbred_racehorse_origin.horses_from_this_location ?x1 . \n?x1 :base.thoroughbredracing.thoroughbred_racehorse.foal_if_this_horse_is_dam ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 219000500,
		"question": "what was the origin of secretariat's mother?",
		"answer": [
			"United States of America"
		],
		"function": "none",
		"commonness": -23.988373848532063,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.thoroughbredracing.thoroughbred_racehorse_origin",
					"class": "base.thoroughbredracing.thoroughbred_racehorse_origin",
					"friendly_name": "Thoroughbred racehorse origin",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.thoroughbredracing.thoroughbred_racehorse",
					"class": "base.thoroughbredracing.thoroughbred_racehorse",
					"friendly_name": "Thoroughbred racehorse",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.secretariat",
					"class": "base.thoroughbredracing.thoroughbred_racehorse",
					"friendly_name": "Secretariat",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.thoroughbredracing.thoroughbred_racehorse_origin.horses_from_this_location",
					"friendly_name": "Horses from this location"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.thoroughbredracing.thoroughbred_racehorse.foal_if_this_horse_is_dam",
					"friendly_name": "Foal (if this horse is Dam)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.thoroughbredracing.thoroughbred_racehorse_origin . \n?x1 :type.object.type :base.thoroughbredracing.thoroughbred_racehorse . \nVALUES ?x2 { :en.secretariat } \n?x0 :base.thoroughbredracing.thoroughbred_racehorse_origin.horses_from_this_location ?x1 . \n?x1 :base.thoroughbredracing.thoroughbred_racehorse.foal_if_this_horse_is_dam ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	}
]