[
	{
		"qid": 135000002,
		"question": "can you mention the number of video game versions developed on ms windows?",
		"answer": [
			"5977"
		],
		"function": "count",
		"commonness": -11.13681288636446,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "cvg.game_version",
					"class": "cvg.game_version",
					"friendly_name": "Video Game Version",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.microsoft_windows",
					"class": "cvg.cvg_platform",
					"friendly_name": "ms windows",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "cvg.game_version.platform",
					"friendly_name": "Platform"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :cvg.game_version . \nVALUES ?x1 { :en.microsoft_windows } \n?x0 :cvg.game_version.platform ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 135000100,
		"question": "what is the number of video game versions that are developed on the microsoft windows platform?",
		"answer": [
			"5977"
		],
		"function": "count",
		"commonness": -11.13681288636446,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "cvg.game_version",
					"class": "cvg.game_version",
					"friendly_name": "Video Game Version",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.microsoft_windows",
					"class": "cvg.cvg_platform",
					"friendly_name": "Microsoft Windows",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "cvg.game_version.platform",
					"friendly_name": "Platform"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :cvg.game_version . \nVALUES ?x1 { :en.microsoft_windows } \n?x0 :cvg.game_version.platform ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 135000101,
		"question": "what is the number of video game versions that are developed on the windows platform?",
		"answer": [
			"5977"
		],
		"function": "count",
		"commonness": -11.13681288636446,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "cvg.game_version",
					"class": "cvg.game_version",
					"friendly_name": "Video Game Version",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.microsoft_windows",
					"class": "cvg.cvg_platform",
					"friendly_name": "windows",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "cvg.game_version.platform",
					"friendly_name": "Platform"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :cvg.game_version . \nVALUES ?x1 { :en.microsoft_windows } \n?x0 :cvg.game_version.platform ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 135000102,
		"question": "what is the number of video game versions that are developed on the ms windows platform?",
		"answer": [
			"5977"
		],
		"function": "count",
		"commonness": -11.13681288636446,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "cvg.game_version",
					"class": "cvg.game_version",
					"friendly_name": "Video Game Version",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.microsoft_windows",
					"class": "cvg.cvg_platform",
					"friendly_name": "ms windows",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "cvg.game_version.platform",
					"friendly_name": "Platform"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :cvg.game_version . \nVALUES ?x1 { :en.microsoft_windows } \n?x0 :cvg.game_version.platform ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 135000200,
		"question": "what is the numer of video games made on microsoft windows?",
		"answer": [
			"5977"
		],
		"function": "count",
		"commonness": -11.13681288636446,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "cvg.game_version",
					"class": "cvg.game_version",
					"friendly_name": "Video Game Version",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.microsoft_windows",
					"class": "cvg.cvg_platform",
					"friendly_name": "Microsoft Windows",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "cvg.game_version.platform",
					"friendly_name": "Platform"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :cvg.game_version . \nVALUES ?x1 { :en.microsoft_windows } \n?x0 :cvg.game_version.platform ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 135000201,
		"question": "what is the numer of video games made on windows?",
		"answer": [
			"5977"
		],
		"function": "count",
		"commonness": -11.13681288636446,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "cvg.game_version",
					"class": "cvg.game_version",
					"friendly_name": "Video Game Version",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.microsoft_windows",
					"class": "cvg.cvg_platform",
					"friendly_name": "windows",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "cvg.game_version.platform",
					"friendly_name": "Platform"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :cvg.game_version . \nVALUES ?x1 { :en.microsoft_windows } \n?x0 :cvg.game_version.platform ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 135000202,
		"question": "what is the numer of video games made on ms windows?",
		"answer": [
			"5977"
		],
		"function": "count",
		"commonness": -11.13681288636446,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "cvg.game_version",
					"class": "cvg.game_version",
					"friendly_name": "Video Game Version",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.microsoft_windows",
					"class": "cvg.cvg_platform",
					"friendly_name": "ms windows",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "cvg.game_version.platform",
					"friendly_name": "Platform"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :cvg.game_version . \nVALUES ?x1 { :en.microsoft_windows } \n?x0 :cvg.game_version.platform ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 135000300,
		"question": "how many different versions of video games are developed on microsoft windows?",
		"answer": [
			"5977"
		],
		"function": "count",
		"commonness": -11.13681288636446,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "cvg.game_version",
					"class": "cvg.game_version",
					"friendly_name": "Video Game Version",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.microsoft_windows",
					"class": "cvg.cvg_platform",
					"friendly_name": "Microsoft Windows",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "cvg.game_version.platform",
					"friendly_name": "Platform"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :cvg.game_version . \nVALUES ?x1 { :en.microsoft_windows } \n?x0 :cvg.game_version.platform ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 135000301,
		"question": "how many different versions of video games are developed on windows?",
		"answer": [
			"5977"
		],
		"function": "count",
		"commonness": -11.13681288636446,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "cvg.game_version",
					"class": "cvg.game_version",
					"friendly_name": "Video Game Version",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.microsoft_windows",
					"class": "cvg.cvg_platform",
					"friendly_name": "windows",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "cvg.game_version.platform",
					"friendly_name": "Platform"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :cvg.game_version . \nVALUES ?x1 { :en.microsoft_windows } \n?x0 :cvg.game_version.platform ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 135000302,
		"question": "how many different versions of video games are developed on ms windows?",
		"answer": [
			"5977"
		],
		"function": "count",
		"commonness": -11.13681288636446,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "cvg.game_version",
					"class": "cvg.game_version",
					"friendly_name": "Video Game Version",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.microsoft_windows",
					"class": "cvg.cvg_platform",
					"friendly_name": "ms windows",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "cvg.game_version.platform",
					"friendly_name": "Platform"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :cvg.game_version . \nVALUES ?x1 { :en.microsoft_windows } \n?x0 :cvg.game_version.platform ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 135000400,
		"question": "microsoft windows has been used to develop how many different versions of video games?",
		"answer": [
			"5977"
		],
		"function": "count",
		"commonness": -11.13681288636446,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "cvg.game_version",
					"class": "cvg.game_version",
					"friendly_name": "Video Game Version",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.microsoft_windows",
					"class": "cvg.cvg_platform",
					"friendly_name": "Microsoft Windows",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "cvg.game_version.platform",
					"friendly_name": "Platform"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :cvg.game_version . \nVALUES ?x1 { :en.microsoft_windows } \n?x0 :cvg.game_version.platform ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 136000000,
		"question": "what are the number of different coat colors of a german shepherd dog?",
		"answer": [
			"9"
		],
		"function": "count",
		"commonness": -15.224960082952293,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.petbreeds.dog_coat_color",
					"class": "base.petbreeds.dog_coat_color",
					"friendly_name": "Dog Coat Color",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.east_german_shepherd_dog",
					"class": "base.petbreeds.dog_breed",
					"friendly_name": "German Shepherd Dog",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.petbreeds.dog_breed.color",
					"friendly_name": "Color"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.petbreeds.dog_coat_color . \nVALUES ?x1 { :en.east_german_shepherd_dog } \n?x1 :base.petbreeds.dog_breed.color ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 136000001,
		"question": "what are the number of different coat colors of a german shepherd?",
		"answer": [
			"9"
		],
		"function": "count",
		"commonness": -15.224960082952293,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.petbreeds.dog_coat_color",
					"class": "base.petbreeds.dog_coat_color",
					"friendly_name": "Dog Coat Color",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.east_german_shepherd_dog",
					"class": "base.petbreeds.dog_breed",
					"friendly_name": "german shepherd",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.petbreeds.dog_breed.color",
					"friendly_name": "Color"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.petbreeds.dog_coat_color . \nVALUES ?x1 { :en.east_german_shepherd_dog } \n?x1 :base.petbreeds.dog_breed.color ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 136000002,
		"question": "what are the number of different coat colors of a gsd?",
		"answer": [
			"9"
		],
		"function": "count",
		"commonness": -15.224960082952293,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.petbreeds.dog_coat_color",
					"class": "base.petbreeds.dog_coat_color",
					"friendly_name": "Dog Coat Color",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.east_german_shepherd_dog",
					"class": "base.petbreeds.dog_breed",
					"friendly_name": "gsd",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.petbreeds.dog_breed.color",
					"friendly_name": "Color"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.petbreeds.dog_coat_color . \nVALUES ?x1 { :en.east_german_shepherd_dog } \n?x1 :base.petbreeds.dog_breed.color ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 136000100,
		"question": "how many coat colors does german shepherd dog have?",
		"answer": [
			"9"
		],
		"function": "count",
		"commonness": -15.224960082952293,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.petbreeds.dog_coat_color",
					"class": "base.petbreeds.dog_coat_color",
					"friendly_name": "Dog Coat Color",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.east_german_shepherd_dog",
					"class": "base.petbreeds.dog_breed",
					"friendly_name": "German Shepherd Dog",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.petbreeds.dog_breed.color",
					"friendly_name": "Color"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.petbreeds.dog_coat_color . \nVALUES ?x1 { :en.east_german_shepherd_dog } \n?x1 :base.petbreeds.dog_breed.color ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 136000101,
		"question": "how many coat colors does german shepherd have?",
		"answer": [
			"9"
		],
		"function": "count",
		"commonness": -15.224960082952293,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.petbreeds.dog_coat_color",
					"class": "base.petbreeds.dog_coat_color",
					"friendly_name": "Dog Coat Color",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.east_german_shepherd_dog",
					"class": "base.petbreeds.dog_breed",
					"friendly_name": "german shepherd",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.petbreeds.dog_breed.color",
					"friendly_name": "Color"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.petbreeds.dog_coat_color . \nVALUES ?x1 { :en.east_german_shepherd_dog } \n?x1 :base.petbreeds.dog_breed.color ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 136000102,
		"question": "how many coat colors does gsd have?",
		"answer": [
			"9"
		],
		"function": "count",
		"commonness": -15.224960082952293,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.petbreeds.dog_coat_color",
					"class": "base.petbreeds.dog_coat_color",
					"friendly_name": "Dog Coat Color",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.east_german_shepherd_dog",
					"class": "base.petbreeds.dog_breed",
					"friendly_name": "gsd",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.petbreeds.dog_breed.color",
					"friendly_name": "Color"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.petbreeds.dog_coat_color . \nVALUES ?x1 { :en.east_german_shepherd_dog } \n?x1 :base.petbreeds.dog_breed.color ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 136000201,
		"question": "for the coat colors of a german shepherd, how many are there?",
		"answer": [
			"9"
		],
		"function": "count",
		"commonness": -15.224960082952293,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.petbreeds.dog_coat_color",
					"class": "base.petbreeds.dog_coat_color",
					"friendly_name": "Dog Coat Color",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.east_german_shepherd_dog",
					"class": "base.petbreeds.dog_breed",
					"friendly_name": "german shepherd",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.petbreeds.dog_breed.color",
					"friendly_name": "Color"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.petbreeds.dog_coat_color . \nVALUES ?x1 { :en.east_german_shepherd_dog } \n?x1 :base.petbreeds.dog_breed.color ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 136000202,
		"question": "for the coat colors of a gsd, how many are there?",
		"answer": [
			"9"
		],
		"function": "count",
		"commonness": -15.224960082952293,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.petbreeds.dog_coat_color",
					"class": "base.petbreeds.dog_coat_color",
					"friendly_name": "Dog Coat Color",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.east_german_shepherd_dog",
					"class": "base.petbreeds.dog_breed",
					"friendly_name": "gsd",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.petbreeds.dog_breed.color",
					"friendly_name": "Color"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.petbreeds.dog_coat_color . \nVALUES ?x1 { :en.east_german_shepherd_dog } \n?x1 :base.petbreeds.dog_breed.color ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 136000300,
		"question": "how many kinds of german shepherd dog with different coat color can be found?",
		"answer": [
			"9"
		],
		"function": "count",
		"commonness": -15.224960082952293,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.petbreeds.dog_coat_color",
					"class": "base.petbreeds.dog_coat_color",
					"friendly_name": "Dog Coat Color",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.east_german_shepherd_dog",
					"class": "base.petbreeds.dog_breed",
					"friendly_name": "German Shepherd Dog",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.petbreeds.dog_breed.color",
					"friendly_name": "Color"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.petbreeds.dog_coat_color . \nVALUES ?x1 { :en.east_german_shepherd_dog } \n?x1 :base.petbreeds.dog_breed.color ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 136000301,
		"question": "how many kinds of german shepherd with different coat color can be found?",
		"answer": [
			"9"
		],
		"function": "count",
		"commonness": -15.224960082952293,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.petbreeds.dog_coat_color",
					"class": "base.petbreeds.dog_coat_color",
					"friendly_name": "Dog Coat Color",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.east_german_shepherd_dog",
					"class": "base.petbreeds.dog_breed",
					"friendly_name": "german shepherd",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.petbreeds.dog_breed.color",
					"friendly_name": "Color"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.petbreeds.dog_coat_color . \nVALUES ?x1 { :en.east_german_shepherd_dog } \n?x1 :base.petbreeds.dog_breed.color ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 136000302,
		"question": "how many kinds of gsd with different coat color can be found?",
		"answer": [
			"9"
		],
		"function": "count",
		"commonness": -15.224960082952293,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.petbreeds.dog_coat_color",
					"class": "base.petbreeds.dog_coat_color",
					"friendly_name": "Dog Coat Color",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.east_german_shepherd_dog",
					"class": "base.petbreeds.dog_breed",
					"friendly_name": "gsd",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.petbreeds.dog_breed.color",
					"friendly_name": "Color"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.petbreeds.dog_coat_color . \nVALUES ?x1 { :en.east_german_shepherd_dog } \n?x1 :base.petbreeds.dog_breed.color ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 136000400,
		"question": "with a different coat color, how many kinds of german shepherd dog can be found?",
		"answer": [
			"9"
		],
		"function": "count",
		"commonness": -15.224960082952293,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.petbreeds.dog_coat_color",
					"class": "base.petbreeds.dog_coat_color",
					"friendly_name": "Dog Coat Color",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.east_german_shepherd_dog",
					"class": "base.petbreeds.dog_breed",
					"friendly_name": "German Shepherd Dog",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.petbreeds.dog_breed.color",
					"friendly_name": "Color"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.petbreeds.dog_coat_color . \nVALUES ?x1 { :en.east_german_shepherd_dog } \n?x1 :base.petbreeds.dog_breed.color ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 136000401,
		"question": "with a different coat color, how many kinds of german shepherd can be found?",
		"answer": [
			"9"
		],
		"function": "count",
		"commonness": -15.224960082952293,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.petbreeds.dog_coat_color",
					"class": "base.petbreeds.dog_coat_color",
					"friendly_name": "Dog Coat Color",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.east_german_shepherd_dog",
					"class": "base.petbreeds.dog_breed",
					"friendly_name": "german shepherd",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.petbreeds.dog_breed.color",
					"friendly_name": "Color"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.petbreeds.dog_coat_color . \nVALUES ?x1 { :en.east_german_shepherd_dog } \n?x1 :base.petbreeds.dog_breed.color ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 136000402,
		"question": "with a different coat color, how many kinds of gsd can be found?",
		"answer": [
			"9"
		],
		"function": "count",
		"commonness": -15.224960082952293,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.petbreeds.dog_coat_color",
					"class": "base.petbreeds.dog_coat_color",
					"friendly_name": "Dog Coat Color",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.east_german_shepherd_dog",
					"class": "base.petbreeds.dog_breed",
					"friendly_name": "gsd",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.petbreeds.dog_breed.color",
					"friendly_name": "Color"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.petbreeds.dog_coat_color . \nVALUES ?x1 { :en.east_german_shepherd_dog } \n?x1 :base.petbreeds.dog_breed.color ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]