[
	{
		"qid": 171000200,
		"question": "which roller coaster was opened and closed both in 2000?",
		"answer": [
			"Tom y Jerry"
		],
		"function": "none",
		"commonness": -22.39014663901147,
		"num_node": 2,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "amusement_parks.roller_coaster",
					"class": "amusement_parks.roller_coaster",
					"friendly_name": "Roller Coaster",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "2000^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "2000",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "amusement_parks.ride.closed",
					"friendly_name": "Closed"
				},
				{
					"start": 0,
					"end": 1,
					"relation": "amusement_parks.ride.opened",
					"friendly_name": "Opened"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :amusement_parks.roller_coaster . \nVALUES ?x1 { \"2000\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?x0 :amusement_parks.ride.closed ?x1 . \n?x0 :amusement_parks.ride.opened ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 171000300,
		"question": "which roller coaster opened in 2000 was closed in the same year?",
		"answer": [
			"Tom y Jerry"
		],
		"function": "none",
		"commonness": -22.39014663901147,
		"num_node": 2,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "amusement_parks.roller_coaster",
					"class": "amusement_parks.roller_coaster",
					"friendly_name": "Roller Coaster",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "2000^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "2000",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "amusement_parks.ride.closed",
					"friendly_name": "Closed"
				},
				{
					"start": 0,
					"end": 1,
					"relation": "amusement_parks.ride.opened",
					"friendly_name": "Opened"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :amusement_parks.roller_coaster . \nVALUES ?x1 { \"2000\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?x0 :amusement_parks.ride.closed ?x1 . \n?x0 :amusement_parks.ride.opened ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 171000400,
		"question": "in 2000 which roller coaster was opened and then closed?",
		"answer": [
			"Tom y Jerry"
		],
		"function": "none",
		"commonness": -22.39014663901147,
		"num_node": 2,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "amusement_parks.roller_coaster",
					"class": "amusement_parks.roller_coaster",
					"friendly_name": "Roller Coaster",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "2000^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "2000",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "amusement_parks.ride.closed",
					"friendly_name": "Closed"
				},
				{
					"start": 0,
					"end": 1,
					"relation": "amusement_parks.ride.opened",
					"friendly_name": "Opened"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :amusement_parks.roller_coaster . \nVALUES ?x1 { \"2000\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?x0 :amusement_parks.ride.closed ?x1 . \n?x0 :amusement_parks.ride.opened ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 172000000,
		"question": "who did joseph stiglitz share a nobel prize award with?",
		"answer": [
			"George Akerlof"
		],
		"function": "none",
		"commonness": -19.2903221770605,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.yalebase.nobel_prize_winner",
					"class": "base.yalebase.nobel_prize_winner",
					"friendly_name": "Nobel prize winner",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "award.award_honor",
					"class": "award.award_honor",
					"friendly_name": "Award Honor",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.joseph_e_stiglitz",
					"class": "award.award_winner",
					"friendly_name": "Joseph Stiglitz",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "award.award_honor.award_winner",
					"friendly_name": "Award winner"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "award.award_winner.awards_won",
					"friendly_name": "Awards Won"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.yalebase.nobel_prize_winner . \n?x1 :type.object.type :award.award_honor . \nVALUES ?x2 { :en.joseph_e_stiglitz } \n?x1 :award.award_honor.award_winner ?x0 . \n?x2 :award.award_winner.awards_won ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 172000001,
		"question": "who did stiglitz share a nobel prize award with?",
		"answer": [
			"George Akerlof"
		],
		"function": "none",
		"commonness": -19.2903221770605,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.yalebase.nobel_prize_winner",
					"class": "base.yalebase.nobel_prize_winner",
					"friendly_name": "Nobel prize winner",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "award.award_honor",
					"class": "award.award_honor",
					"friendly_name": "Award Honor",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.joseph_e_stiglitz",
					"class": "award.award_winner",
					"friendly_name": "stiglitz",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "award.award_honor.award_winner",
					"friendly_name": "Award winner"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "award.award_winner.awards_won",
					"friendly_name": "Awards Won"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.yalebase.nobel_prize_winner . \n?x1 :type.object.type :award.award_honor . \nVALUES ?x2 { :en.joseph_e_stiglitz } \n?x1 :award.award_honor.award_winner ?x0 . \n?x2 :award.award_winner.awards_won ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 172000002,
		"question": "who did joseph e. stiglitz share a nobel prize award with?",
		"answer": [
			"George Akerlof"
		],
		"function": "none",
		"commonness": -19.2903221770605,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.yalebase.nobel_prize_winner",
					"class": "base.yalebase.nobel_prize_winner",
					"friendly_name": "Nobel prize winner",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "award.award_honor",
					"class": "award.award_honor",
					"friendly_name": "Award Honor",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.joseph_e_stiglitz",
					"class": "award.award_winner",
					"friendly_name": "joseph e. stiglitz",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "award.award_honor.award_winner",
					"friendly_name": "Award winner"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "award.award_winner.awards_won",
					"friendly_name": "Awards Won"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.yalebase.nobel_prize_winner . \n?x1 :type.object.type :award.award_honor . \nVALUES ?x2 { :en.joseph_e_stiglitz } \n?x1 :award.award_honor.award_winner ?x0 . \n?x2 :award.award_winner.awards_won ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 172000100,
		"question": "who shared the nobel prize with joseph stiglitz?",
		"answer": [
			"George Akerlof"
		],
		"function": "none",
		"commonness": -19.2903221770605,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.yalebase.nobel_prize_winner",
					"class": "base.yalebase.nobel_prize_winner",
					"friendly_name": "Nobel prize winner",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "award.award_honor",
					"class": "award.award_honor",
					"friendly_name": "Award Honor",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.joseph_e_stiglitz",
					"class": "award.award_winner",
					"friendly_name": "Joseph Stiglitz",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "award.award_honor.award_winner",
					"friendly_name": "Award winner"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "award.award_winner.awards_won",
					"friendly_name": "Awards Won"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.yalebase.nobel_prize_winner . \n?x1 :type.object.type :award.award_honor . \nVALUES ?x2 { :en.joseph_e_stiglitz } \n?x1 :award.award_honor.award_winner ?x0 . \n?x2 :award.award_winner.awards_won ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 172000101,
		"question": "who shared the nobel prize with stiglitz?",
		"answer": [
			"George Akerlof"
		],
		"function": "none",
		"commonness": -19.2903221770605,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.yalebase.nobel_prize_winner",
					"class": "base.yalebase.nobel_prize_winner",
					"friendly_name": "Nobel prize winner",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "award.award_honor",
					"class": "award.award_honor",
					"friendly_name": "Award Honor",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.joseph_e_stiglitz",
					"class": "award.award_winner",
					"friendly_name": "stiglitz",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "award.award_honor.award_winner",
					"friendly_name": "Award winner"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "award.award_winner.awards_won",
					"friendly_name": "Awards Won"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.yalebase.nobel_prize_winner . \n?x1 :type.object.type :award.award_honor . \nVALUES ?x2 { :en.joseph_e_stiglitz } \n?x1 :award.award_honor.award_winner ?x0 . \n?x2 :award.award_winner.awards_won ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 172000102,
		"question": "who shared the nobel prize with joseph e. stiglitz?",
		"answer": [
			"George Akerlof"
		],
		"function": "none",
		"commonness": -19.2903221770605,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.yalebase.nobel_prize_winner",
					"class": "base.yalebase.nobel_prize_winner",
					"friendly_name": "Nobel prize winner",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "award.award_honor",
					"class": "award.award_honor",
					"friendly_name": "Award Honor",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.joseph_e_stiglitz",
					"class": "award.award_winner",
					"friendly_name": "joseph e. stiglitz",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "award.award_honor.award_winner",
					"friendly_name": "Award winner"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "award.award_winner.awards_won",
					"friendly_name": "Awards Won"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.yalebase.nobel_prize_winner . \n?x1 :type.object.type :award.award_honor . \nVALUES ?x2 { :en.joseph_e_stiglitz } \n?x1 :award.award_honor.award_winner ?x0 . \n?x2 :award.award_winner.awards_won ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 172000200,
		"question": "which nobel prize winner won an award together with joseph stiglitz?",
		"answer": [
			"George Akerlof"
		],
		"function": "none",
		"commonness": -19.2903221770605,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.yalebase.nobel_prize_winner",
					"class": "base.yalebase.nobel_prize_winner",
					"friendly_name": "Nobel prize winner",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "award.award_honor",
					"class": "award.award_honor",
					"friendly_name": "Award Honor",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.joseph_e_stiglitz",
					"class": "award.award_winner",
					"friendly_name": "Joseph Stiglitz",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "award.award_honor.award_winner",
					"friendly_name": "Award winner"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "award.award_winner.awards_won",
					"friendly_name": "Awards Won"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.yalebase.nobel_prize_winner . \n?x1 :type.object.type :award.award_honor . \nVALUES ?x2 { :en.joseph_e_stiglitz } \n?x1 :award.award_honor.award_winner ?x0 . \n?x2 :award.award_winner.awards_won ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 172000201,
		"question": "which nobel prize winner won an award together with stiglitz?",
		"answer": [
			"George Akerlof"
		],
		"function": "none",
		"commonness": -19.2903221770605,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.yalebase.nobel_prize_winner",
					"class": "base.yalebase.nobel_prize_winner",
					"friendly_name": "Nobel prize winner",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "award.award_honor",
					"class": "award.award_honor",
					"friendly_name": "Award Honor",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.joseph_e_stiglitz",
					"class": "award.award_winner",
					"friendly_name": "stiglitz",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "award.award_honor.award_winner",
					"friendly_name": "Award winner"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "award.award_winner.awards_won",
					"friendly_name": "Awards Won"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.yalebase.nobel_prize_winner . \n?x1 :type.object.type :award.award_honor . \nVALUES ?x2 { :en.joseph_e_stiglitz } \n?x1 :award.award_honor.award_winner ?x0 . \n?x2 :award.award_winner.awards_won ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 172000202,
		"question": "which nobel prize winner won an award together with joseph e. stiglitz?",
		"answer": [
			"George Akerlof"
		],
		"function": "none",
		"commonness": -19.2903221770605,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.yalebase.nobel_prize_winner",
					"class": "base.yalebase.nobel_prize_winner",
					"friendly_name": "Nobel prize winner",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "award.award_honor",
					"class": "award.award_honor",
					"friendly_name": "Award Honor",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.joseph_e_stiglitz",
					"class": "award.award_winner",
					"friendly_name": "joseph e. stiglitz",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "award.award_honor.award_winner",
					"friendly_name": "Award winner"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "award.award_winner.awards_won",
					"friendly_name": "Awards Won"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.yalebase.nobel_prize_winner . \n?x1 :type.object.type :award.award_honor . \nVALUES ?x2 { :en.joseph_e_stiglitz } \n?x1 :award.award_honor.award_winner ?x0 . \n?x2 :award.award_winner.awards_won ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 172000300,
		"question": "joseph stiglitz shared an award with which nobel prize winner?",
		"answer": [
			"George Akerlof"
		],
		"function": "none",
		"commonness": -19.2903221770605,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.yalebase.nobel_prize_winner",
					"class": "base.yalebase.nobel_prize_winner",
					"friendly_name": "Nobel prize winner",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "award.award_honor",
					"class": "award.award_honor",
					"friendly_name": "Award Honor",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.joseph_e_stiglitz",
					"class": "award.award_winner",
					"friendly_name": "Joseph Stiglitz",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "award.award_honor.award_winner",
					"friendly_name": "Award winner"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "award.award_winner.awards_won",
					"friendly_name": "Awards Won"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.yalebase.nobel_prize_winner . \n?x1 :type.object.type :award.award_honor . \nVALUES ?x2 { :en.joseph_e_stiglitz } \n?x1 :award.award_honor.award_winner ?x0 . \n?x2 :award.award_winner.awards_won ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 172000301,
		"question": "stiglitz shared an award with which nobel prize winner?",
		"answer": [
			"George Akerlof"
		],
		"function": "none",
		"commonness": -19.2903221770605,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.yalebase.nobel_prize_winner",
					"class": "base.yalebase.nobel_prize_winner",
					"friendly_name": "Nobel prize winner",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "award.award_honor",
					"class": "award.award_honor",
					"friendly_name": "Award Honor",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.joseph_e_stiglitz",
					"class": "award.award_winner",
					"friendly_name": "stiglitz",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "award.award_honor.award_winner",
					"friendly_name": "Award winner"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "award.award_winner.awards_won",
					"friendly_name": "Awards Won"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.yalebase.nobel_prize_winner . \n?x1 :type.object.type :award.award_honor . \nVALUES ?x2 { :en.joseph_e_stiglitz } \n?x1 :award.award_honor.award_winner ?x0 . \n?x2 :award.award_winner.awards_won ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 172000302,
		"question": "joseph e. stiglitz shared an award with which nobel prize winner?",
		"answer": [
			"George Akerlof"
		],
		"function": "none",
		"commonness": -19.2903221770605,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.yalebase.nobel_prize_winner",
					"class": "base.yalebase.nobel_prize_winner",
					"friendly_name": "Nobel prize winner",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "award.award_honor",
					"class": "award.award_honor",
					"friendly_name": "Award Honor",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.joseph_e_stiglitz",
					"class": "award.award_winner",
					"friendly_name": "joseph e. stiglitz",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "award.award_honor.award_winner",
					"friendly_name": "Award winner"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "award.award_winner.awards_won",
					"friendly_name": "Awards Won"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.yalebase.nobel_prize_winner . \n?x1 :type.object.type :award.award_honor . \nVALUES ?x2 { :en.joseph_e_stiglitz } \n?x1 :award.award_honor.award_winner ?x0 . \n?x2 :award.award_winner.awards_won ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 172000400,
		"question": "who else did joseph stiglitz share his nobel prize with?",
		"answer": [
			"George Akerlof"
		],
		"function": "none",
		"commonness": -19.2903221770605,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.yalebase.nobel_prize_winner",
					"class": "base.yalebase.nobel_prize_winner",
					"friendly_name": "Nobel prize winner",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "award.award_honor",
					"class": "award.award_honor",
					"friendly_name": "Award Honor",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.joseph_e_stiglitz",
					"class": "award.award_winner",
					"friendly_name": "Joseph Stiglitz",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "award.award_honor.award_winner",
					"friendly_name": "Award winner"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "award.award_winner.awards_won",
					"friendly_name": "Awards Won"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.yalebase.nobel_prize_winner . \n?x1 :type.object.type :award.award_honor . \nVALUES ?x2 { :en.joseph_e_stiglitz } \n?x1 :award.award_honor.award_winner ?x0 . \n?x2 :award.award_winner.awards_won ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 172000401,
		"question": "who else did stiglitz share his nobel prize with?",
		"answer": [
			"George Akerlof"
		],
		"function": "none",
		"commonness": -19.2903221770605,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.yalebase.nobel_prize_winner",
					"class": "base.yalebase.nobel_prize_winner",
					"friendly_name": "Nobel prize winner",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "award.award_honor",
					"class": "award.award_honor",
					"friendly_name": "Award Honor",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.joseph_e_stiglitz",
					"class": "award.award_winner",
					"friendly_name": "stiglitz",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "award.award_honor.award_winner",
					"friendly_name": "Award winner"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "award.award_winner.awards_won",
					"friendly_name": "Awards Won"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.yalebase.nobel_prize_winner . \n?x1 :type.object.type :award.award_honor . \nVALUES ?x2 { :en.joseph_e_stiglitz } \n?x1 :award.award_honor.award_winner ?x0 . \n?x2 :award.award_winner.awards_won ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 172000402,
		"question": "who else did joseph e. stiglitz share his nobel prize with?",
		"answer": [
			"George Akerlof"
		],
		"function": "none",
		"commonness": -19.2903221770605,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.yalebase.nobel_prize_winner",
					"class": "base.yalebase.nobel_prize_winner",
					"friendly_name": "Nobel prize winner",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "award.award_honor",
					"class": "award.award_honor",
					"friendly_name": "Award Honor",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.joseph_e_stiglitz",
					"class": "award.award_winner",
					"friendly_name": "joseph e. stiglitz",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "award.award_honor.award_winner",
					"friendly_name": "Award winner"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "award.award_winner.awards_won",
					"friendly_name": "Awards Won"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.yalebase.nobel_prize_winner . \n?x1 :type.object.type :award.award_honor . \nVALUES ?x2 { :en.joseph_e_stiglitz } \n?x1 :award.award_honor.award_winner ?x0 . \n?x2 :award.award_winner.awards_won ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	}
]