[
	{
		"qid": 225000202,
		"question": "what equipment is used in both scuba diving and bog snorkeling?",
		"answer": [
			"Swimfin"
		],
		"function": "none",
		"commonness": -27.779770259441403,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.sports_equipment",
					"class": "sports.sports_equipment",
					"friendly_name": "Sports Equipment",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.scuba_diving",
					"class": "sports.sport",
					"friendly_name": "Scuba diving",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.bog_snorkelling",
					"class": "sports.sport",
					"friendly_name": "bog snorkeling",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.sports_equipment.sport_used_for",
					"friendly_name": "Sport used for"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "sports.sports_equipment.sport_used_for",
					"friendly_name": "Sport used for"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.sports_equipment . \nVALUES ?x1 { :en.scuba_diving } \nVALUES ?x2 { :en.bog_snorkelling } \n?x0 :sports.sports_equipment.sport_used_for ?x1 . \n?x0 :sports.sports_equipment.sport_used_for ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 225000300,
		"question": "what equipments do scuba diving and bog snorkelling share?",
		"answer": [
			"Swimfin"
		],
		"function": "none",
		"commonness": -27.779770259441403,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.sports_equipment",
					"class": "sports.sports_equipment",
					"friendly_name": "Sports Equipment",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.scuba_diving",
					"class": "sports.sport",
					"friendly_name": "Scuba diving",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.bog_snorkelling",
					"class": "sports.sport",
					"friendly_name": "Bog snorkelling",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.sports_equipment.sport_used_for",
					"friendly_name": "Sport used for"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "sports.sports_equipment.sport_used_for",
					"friendly_name": "Sport used for"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.sports_equipment . \nVALUES ?x1 { :en.scuba_diving } \nVALUES ?x2 { :en.bog_snorkelling } \n?x0 :sports.sports_equipment.sport_used_for ?x1 . \n?x0 :sports.sports_equipment.sport_used_for ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 225000301,
		"question": "what equipments do scuba diving and world bog snorkelling championship share?",
		"answer": [
			"Swimfin"
		],
		"function": "none",
		"commonness": -27.779770259441403,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.sports_equipment",
					"class": "sports.sports_equipment",
					"friendly_name": "Sports Equipment",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.scuba_diving",
					"class": "sports.sport",
					"friendly_name": "Scuba diving",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.bog_snorkelling",
					"class": "sports.sport",
					"friendly_name": "world bog snorkelling championship",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.sports_equipment.sport_used_for",
					"friendly_name": "Sport used for"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "sports.sports_equipment.sport_used_for",
					"friendly_name": "Sport used for"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.sports_equipment . \nVALUES ?x1 { :en.scuba_diving } \nVALUES ?x2 { :en.bog_snorkelling } \n?x0 :sports.sports_equipment.sport_used_for ?x1 . \n?x0 :sports.sports_equipment.sport_used_for ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 225000302,
		"question": "what equipments do scuba diving and bog snorkeling share?",
		"answer": [
			"Swimfin"
		],
		"function": "none",
		"commonness": -27.779770259441403,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.sports_equipment",
					"class": "sports.sports_equipment",
					"friendly_name": "Sports Equipment",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.scuba_diving",
					"class": "sports.sport",
					"friendly_name": "Scuba diving",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.bog_snorkelling",
					"class": "sports.sport",
					"friendly_name": "bog snorkeling",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.sports_equipment.sport_used_for",
					"friendly_name": "Sport used for"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "sports.sports_equipment.sport_used_for",
					"friendly_name": "Sport used for"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.sports_equipment . \nVALUES ?x1 { :en.scuba_diving } \nVALUES ?x2 { :en.bog_snorkelling } \n?x0 :sports.sports_equipment.sport_used_for ?x1 . \n?x0 :sports.sports_equipment.sport_used_for ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 225000400,
		"question": "what equipments are scuba diving and bog snorkelling both using?",
		"answer": [
			"Swimfin"
		],
		"function": "none",
		"commonness": -27.779770259441403,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.sports_equipment",
					"class": "sports.sports_equipment",
					"friendly_name": "Sports Equipment",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.scuba_diving",
					"class": "sports.sport",
					"friendly_name": "Scuba diving",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.bog_snorkelling",
					"class": "sports.sport",
					"friendly_name": "Bog snorkelling",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.sports_equipment.sport_used_for",
					"friendly_name": "Sport used for"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "sports.sports_equipment.sport_used_for",
					"friendly_name": "Sport used for"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.sports_equipment . \nVALUES ?x1 { :en.scuba_diving } \nVALUES ?x2 { :en.bog_snorkelling } \n?x0 :sports.sports_equipment.sport_used_for ?x1 . \n?x0 :sports.sports_equipment.sport_used_for ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 225000401,
		"question": "what equipments are scuba diving and world bog snorkelling championship both using?",
		"answer": [
			"Swimfin"
		],
		"function": "none",
		"commonness": -27.779770259441403,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.sports_equipment",
					"class": "sports.sports_equipment",
					"friendly_name": "Sports Equipment",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.scuba_diving",
					"class": "sports.sport",
					"friendly_name": "Scuba diving",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.bog_snorkelling",
					"class": "sports.sport",
					"friendly_name": "world bog snorkelling championship",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.sports_equipment.sport_used_for",
					"friendly_name": "Sport used for"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "sports.sports_equipment.sport_used_for",
					"friendly_name": "Sport used for"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.sports_equipment . \nVALUES ?x1 { :en.scuba_diving } \nVALUES ?x2 { :en.bog_snorkelling } \n?x0 :sports.sports_equipment.sport_used_for ?x1 . \n?x0 :sports.sports_equipment.sport_used_for ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 225000402,
		"question": "what equipments are scuba diving and bog snorkeling both using?",
		"answer": [
			"Swimfin"
		],
		"function": "none",
		"commonness": -27.779770259441403,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.sports_equipment",
					"class": "sports.sports_equipment",
					"friendly_name": "Sports Equipment",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.scuba_diving",
					"class": "sports.sport",
					"friendly_name": "Scuba diving",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.bog_snorkelling",
					"class": "sports.sport",
					"friendly_name": "bog snorkeling",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.sports_equipment.sport_used_for",
					"friendly_name": "Sport used for"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "sports.sports_equipment.sport_used_for",
					"friendly_name": "Sport used for"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.sports_equipment . \nVALUES ?x1 { :en.scuba_diving } \nVALUES ?x2 { :en.bog_snorkelling } \n?x0 :sports.sports_equipment.sport_used_for ?x1 . \n?x0 :sports.sports_equipment.sport_used_for ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 226000000,
		"question": "find all games published by the same publisher of dungeons & dragons.",
		"answer": [
			"Gamma World",
			"Xiaolin Showdown Trading Card Game",
			"Dungeons & Dragons Expert Set",
			"Duel Masters Trading Card Game",
			"d20 System",
			"Axis & Allies: D-Day",
			"Dungeons & Dragons Basic Set",
			"Blood Wars",
			"Star Wars Trading Card Game",
			"Advanced Dungeons & Dragons 2nd Edition",
			"Hecatomb",
			"NBA Showdown",
			"The Simpsons Trading Card Game",
			"Codename: Kids Next Door Trading Card Game",
			"Dungeons & Dragons (3rd Edition)",
			"Netrunner",
			"RoboRally",
			"Magic: The Gathering",
			"Advanced Dungeons & Dragons",
			"Pokémon Trading Card Game",
			"Castle Ravenloft Board Game",
			"BattleTech Collectible Card Game",
			"Filthy Rich",
			"Dungeons & Dragons Basic Game",
			"Axis & Allies: Europe",
			"Neopets Trading Card Game",
			"Chainmail",
			"MLB Showdown",
			"Cavaliers and Roundheads",
			"d20 Modern",
			"Indiana Jones",
			"Pivot",
			"Doomtown",
			"Star Wars Miniatures",
			"Dreamblade",
			"Dungeons & Dragons (4th Edition)",
			"NFL Showdown",
			"Dune",
			"Dungeons & Dragons Miniatures Game"
		],
		"function": "none",
		"commonness": -22.65814471208033,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "games.game",
					"class": "games.game",
					"friendly_name": "Game",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "games.game_publisher",
					"class": "games.game_publisher",
					"friendly_name": "Game publisher",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.dungeons_dragons",
					"class": "games.game",
					"friendly_name": "Dungeons & Dragons",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "games.game.publisher",
					"friendly_name": "Publisher"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "games.game_publisher.games_published",
					"friendly_name": "Games published"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :games.game . \n?x1 :type.object.type :games.game_publisher . \nVALUES ?x2 { :en.dungeons_dragons } \n?x0 :games.game.publisher ?x1 . \n?x1 :games.game_publisher.games_published ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 226000200,
		"question": "could you find out all the games published by the same compony as dungeons & dragons?",
		"answer": [
			"Dungeons & Dragons Basic Set",
			"NFL Showdown",
			"Filthy Rich",
			"Codename: Kids Next Door Trading Card Game",
			"NBA Showdown",
			"Dungeons & Dragons Miniatures Game",
			"Chainmail",
			"MLB Showdown",
			"d20 Modern",
			"Magic: The Gathering",
			"RoboRally",
			"d20 System",
			"Indiana Jones",
			"Dungeons & Dragons (4th Edition)",
			"Dungeons & Dragons Expert Set",
			"BattleTech Collectible Card Game",
			"Neopets Trading Card Game",
			"Castle Ravenloft Board Game",
			"The Simpsons Trading Card Game",
			"Axis & Allies: D-Day",
			"Dune",
			"Gamma World",
			"Duel Masters Trading Card Game",
			"Cavaliers and Roundheads",
			"Star Wars Miniatures",
			"Advanced Dungeons & Dragons 2nd Edition",
			"Dungeons & Dragons (3rd Edition)",
			"Xiaolin Showdown Trading Card Game",
			"Axis & Allies: Europe",
			"Doomtown",
			"Hecatomb",
			"Advanced Dungeons & Dragons",
			"Dungeons & Dragons Basic Game",
			"Star Wars Trading Card Game",
			"Pivot",
			"Netrunner",
			"Blood Wars",
			"Pokémon Trading Card Game",
			"Dreamblade"
		],
		"function": "none",
		"commonness": -22.65814471208033,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "games.game",
					"class": "games.game",
					"friendly_name": "Game",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "games.game_publisher",
					"class": "games.game_publisher",
					"friendly_name": "Game publisher",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.dungeons_dragons",
					"class": "games.game",
					"friendly_name": "Dungeons & Dragons",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "games.game.publisher",
					"friendly_name": "Publisher"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "games.game_publisher.games_published",
					"friendly_name": "Games published"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :games.game . \n?x1 :type.object.type :games.game_publisher . \nVALUES ?x2 { :en.dungeons_dragons } \n?x0 :games.game.publisher ?x1 . \n?x1 :games.game_publisher.games_published ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 226000201,
		"question": "could you find out all the games published by the same compony as d&d?",
		"answer": [
			"Advanced Dungeons & Dragons",
			"Dungeons & Dragons (4th Edition)",
			"Castle Ravenloft Board Game",
			"Dungeons & Dragons Miniatures Game",
			"Dune",
			"Pivot",
			"Hecatomb",
			"NFL Showdown",
			"Cavaliers and Roundheads",
			"Xiaolin Showdown Trading Card Game",
			"Advanced Dungeons & Dragons 2nd Edition",
			"d20 System",
			"Pokémon Trading Card Game",
			"Blood Wars",
			"Axis & Allies: D-Day",
			"Star Wars Trading Card Game",
			"Duel Masters Trading Card Game",
			"Netrunner",
			"Dungeons & Dragons Expert Set",
			"Dungeons & Dragons Basic Set",
			"MLB Showdown",
			"Dungeons & Dragons (3rd Edition)",
			"d20 Modern",
			"Indiana Jones",
			"The Simpsons Trading Card Game",
			"Doomtown",
			"Star Wars Miniatures",
			"Dreamblade",
			"Filthy Rich",
			"Codename: Kids Next Door Trading Card Game",
			"Dungeons & Dragons Basic Game",
			"Neopets Trading Card Game",
			"Magic: The Gathering",
			"Gamma World",
			"NBA Showdown",
			"BattleTech Collectible Card Game",
			"Axis & Allies: Europe",
			"RoboRally",
			"Chainmail"
		],
		"function": "none",
		"commonness": -22.65814471208033,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "games.game",
					"class": "games.game",
					"friendly_name": "Game",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "games.game_publisher",
					"class": "games.game_publisher",
					"friendly_name": "Game publisher",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.dungeons_dragons",
					"class": "games.game",
					"friendly_name": "d&d",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "games.game.publisher",
					"friendly_name": "Publisher"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "games.game_publisher.games_published",
					"friendly_name": "Games published"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :games.game . \n?x1 :type.object.type :games.game_publisher . \nVALUES ?x2 { :en.dungeons_dragons } \n?x0 :games.game.publisher ?x1 . \n?x1 :games.game_publisher.games_published ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 226000202,
		"question": "could you find out all the games published by the same compony as dungeons and dragons?",
		"answer": [
			"Indiana Jones",
			"Dungeons & Dragons Basic Set",
			"Dungeons & Dragons (4th Edition)",
			"Xiaolin Showdown Trading Card Game",
			"Netrunner",
			"The Simpsons Trading Card Game",
			"Dungeons & Dragons (3rd Edition)",
			"Dungeons & Dragons Basic Game",
			"Pokémon Trading Card Game",
			"Chainmail",
			"Blood Wars",
			"Codename: Kids Next Door Trading Card Game",
			"Pivot",
			"BattleTech Collectible Card Game",
			"Cavaliers and Roundheads",
			"NFL Showdown",
			"Axis & Allies: D-Day",
			"Hecatomb",
			"Dreamblade",
			"Star Wars Miniatures",
			"MLB Showdown",
			"Axis & Allies: Europe",
			"Advanced Dungeons & Dragons",
			"Star Wars Trading Card Game",
			"Filthy Rich",
			"Advanced Dungeons & Dragons 2nd Edition",
			"Castle Ravenloft Board Game",
			"Neopets Trading Card Game",
			"Duel Masters Trading Card Game",
			"Magic: The Gathering",
			"Dune",
			"d20 System",
			"NBA Showdown",
			"Doomtown",
			"Gamma World",
			"RoboRally",
			"d20 Modern",
			"Dungeons & Dragons Expert Set",
			"Dungeons & Dragons Miniatures Game"
		],
		"function": "none",
		"commonness": -22.65814471208033,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "games.game",
					"class": "games.game",
					"friendly_name": "Game",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "games.game_publisher",
					"class": "games.game_publisher",
					"friendly_name": "Game publisher",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.dungeons_dragons",
					"class": "games.game",
					"friendly_name": "dungeons and dragons",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "games.game.publisher",
					"friendly_name": "Publisher"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "games.game_publisher.games_published",
					"friendly_name": "Games published"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :games.game . \n?x1 :type.object.type :games.game_publisher . \nVALUES ?x2 { :en.dungeons_dragons } \n?x0 :games.game.publisher ?x1 . \n?x1 :games.game_publisher.games_published ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 226000400,
		"question": "what games share common publishers with dungeons & dragons?",
		"answer": [
			"BattleTech Collectible Card Game",
			"Star Wars Trading Card Game",
			"Dreamblade",
			"Xiaolin Showdown Trading Card Game",
			"The Simpsons Trading Card Game",
			"Codename: Kids Next Door Trading Card Game",
			"Castle Ravenloft Board Game",
			"Duel Masters Trading Card Game",
			"MLB Showdown",
			"Dungeons & Dragons Basic Set",
			"Doomtown",
			"Pivot",
			"Dungeons & Dragons Basic Game",
			"Dungeons & Dragons (4th Edition)",
			"Gamma World",
			"Blood Wars",
			"Hecatomb",
			"RoboRally",
			"Cavaliers and Roundheads",
			"NFL Showdown",
			"Pokémon Trading Card Game",
			"NBA Showdown",
			"Dungeons & Dragons (3rd Edition)",
			"Dune",
			"Axis & Allies: Europe",
			"d20 Modern",
			"d20 System",
			"Dungeons & Dragons Expert Set",
			"Magic: The Gathering",
			"Axis & Allies: D-Day",
			"Filthy Rich",
			"Indiana Jones",
			"Advanced Dungeons & Dragons",
			"Star Wars Miniatures",
			"Neopets Trading Card Game",
			"Netrunner",
			"Chainmail",
			"Advanced Dungeons & Dragons 2nd Edition",
			"Dungeons & Dragons Miniatures Game"
		],
		"function": "none",
		"commonness": -22.65814471208033,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "games.game",
					"class": "games.game",
					"friendly_name": "Game",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "games.game_publisher",
					"class": "games.game_publisher",
					"friendly_name": "Game publisher",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.dungeons_dragons",
					"class": "games.game",
					"friendly_name": "Dungeons & Dragons",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "games.game.publisher",
					"friendly_name": "Publisher"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "games.game_publisher.games_published",
					"friendly_name": "Games published"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :games.game . \n?x1 :type.object.type :games.game_publisher . \nVALUES ?x2 { :en.dungeons_dragons } \n?x0 :games.game.publisher ?x1 . \n?x1 :games.game_publisher.games_published ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 226000401,
		"question": "what games share common publishers with d&d?",
		"answer": [
			"Chainmail",
			"Indiana Jones",
			"Dreamblade",
			"Star Wars Miniatures",
			"MLB Showdown",
			"Advanced Dungeons & Dragons 2nd Edition",
			"Dune",
			"Advanced Dungeons & Dragons",
			"Filthy Rich",
			"Xiaolin Showdown Trading Card Game",
			"Magic: The Gathering",
			"RoboRally",
			"Axis & Allies: D-Day",
			"Doomtown",
			"Hecatomb",
			"Neopets Trading Card Game",
			"Dungeons & Dragons (3rd Edition)",
			"Netrunner",
			"Pokémon Trading Card Game",
			"Castle Ravenloft Board Game",
			"d20 Modern",
			"Pivot",
			"Dungeons & Dragons Miniatures Game",
			"Blood Wars",
			"Dungeons & Dragons Expert Set",
			"NBA Showdown",
			"BattleTech Collectible Card Game",
			"Gamma World",
			"NFL Showdown",
			"Star Wars Trading Card Game",
			"d20 System",
			"Codename: Kids Next Door Trading Card Game",
			"Dungeons & Dragons Basic Game",
			"Dungeons & Dragons (4th Edition)",
			"Axis & Allies: Europe",
			"Duel Masters Trading Card Game",
			"Dungeons & Dragons Basic Set",
			"Cavaliers and Roundheads",
			"The Simpsons Trading Card Game"
		],
		"function": "none",
		"commonness": -22.65814471208033,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "games.game",
					"class": "games.game",
					"friendly_name": "Game",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "games.game_publisher",
					"class": "games.game_publisher",
					"friendly_name": "Game publisher",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.dungeons_dragons",
					"class": "games.game",
					"friendly_name": "d&d",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "games.game.publisher",
					"friendly_name": "Publisher"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "games.game_publisher.games_published",
					"friendly_name": "Games published"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :games.game . \n?x1 :type.object.type :games.game_publisher . \nVALUES ?x2 { :en.dungeons_dragons } \n?x0 :games.game.publisher ?x1 . \n?x1 :games.game_publisher.games_published ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 226000402,
		"question": "what games share common publishers with dungeons and dragons?",
		"answer": [
			"MLB Showdown",
			"Star Wars Trading Card Game",
			"Dungeons & Dragons Miniatures Game",
			"Doomtown",
			"Hecatomb",
			"Pivot",
			"Indiana Jones",
			"Dungeons & Dragons (3rd Edition)",
			"NFL Showdown",
			"d20 System",
			"Dungeons & Dragons Expert Set",
			"Advanced Dungeons & Dragons",
			"Gamma World",
			"Xiaolin Showdown Trading Card Game",
			"NBA Showdown",
			"Netrunner",
			"Castle Ravenloft Board Game",
			"Axis & Allies: Europe",
			"Filthy Rich",
			"The Simpsons Trading Card Game",
			"BattleTech Collectible Card Game",
			"Dungeons & Dragons (4th Edition)",
			"d20 Modern",
			"Axis & Allies: D-Day",
			"RoboRally",
			"Duel Masters Trading Card Game",
			"Cavaliers and Roundheads",
			"Dreamblade",
			"Pokémon Trading Card Game",
			"Star Wars Miniatures",
			"Magic: The Gathering",
			"Chainmail",
			"Codename: Kids Next Door Trading Card Game",
			"Neopets Trading Card Game",
			"Dune",
			"Advanced Dungeons & Dragons 2nd Edition",
			"Dungeons & Dragons Basic Game",
			"Dungeons & Dragons Basic Set",
			"Blood Wars"
		],
		"function": "none",
		"commonness": -22.65814471208033,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "games.game",
					"class": "games.game",
					"friendly_name": "Game",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "games.game_publisher",
					"class": "games.game_publisher",
					"friendly_name": "Game publisher",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.dungeons_dragons",
					"class": "games.game",
					"friendly_name": "dungeons and dragons",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "games.game.publisher",
					"friendly_name": "Publisher"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "games.game_publisher.games_published",
					"friendly_name": "Games published"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :games.game . \n?x1 :type.object.type :games.game_publisher . \nVALUES ?x2 { :en.dungeons_dragons } \n?x0 :games.game.publisher ?x1 . \n?x1 :games.game_publisher.games_published ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	}
]