[
	{
		"qid": 165000000,
		"question": "the point montara light is of what shape?",
		"answer": [
			"Conical"
		],
		"function": "none",
		"commonness": -22.066595221884075,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.tower_shape",
					"class": "architecture.tower_shape",
					"friendly_name": "Tower shape",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.point_montara_light",
					"class": "architecture.lighthouse",
					"friendly_name": "Point Montara Light",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.tower_shape.lighthouse_has_shape",
					"friendly_name": "Lighthouse having shape"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.tower_shape . \nVALUES ?x1 { :en.point_montara_light } \n?x0 :architecture.tower_shape.lighthouse_has_shape ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 165000001,
		"question": "the point montara lighthouse is of what shape?",
		"answer": [
			"Conical"
		],
		"function": "none",
		"commonness": -22.066595221884075,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.tower_shape",
					"class": "architecture.tower_shape",
					"friendly_name": "Tower shape",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.point_montara_light",
					"class": "architecture.lighthouse",
					"friendly_name": "point montara lighthouse",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.tower_shape.lighthouse_has_shape",
					"friendly_name": "Lighthouse having shape"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.tower_shape . \nVALUES ?x1 { :en.point_montara_light } \n?x0 :architecture.tower_shape.lighthouse_has_shape ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 165000002,
		"question": "the point montara light station is of what shape?",
		"answer": [
			"Conical"
		],
		"function": "none",
		"commonness": -22.066595221884075,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.tower_shape",
					"class": "architecture.tower_shape",
					"friendly_name": "Tower shape",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.point_montara_light",
					"class": "architecture.lighthouse",
					"friendly_name": "point montara light station",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.tower_shape.lighthouse_has_shape",
					"friendly_name": "Lighthouse having shape"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.tower_shape . \nVALUES ?x1 { :en.point_montara_light } \n?x0 :architecture.tower_shape.lighthouse_has_shape ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 165000100,
		"question": "in which shape was the point montara light built?",
		"answer": [
			"Conical"
		],
		"function": "none",
		"commonness": -22.066595221884075,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.tower_shape",
					"class": "architecture.tower_shape",
					"friendly_name": "Tower shape",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.point_montara_light",
					"class": "architecture.lighthouse",
					"friendly_name": "Point Montara Light",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.tower_shape.lighthouse_has_shape",
					"friendly_name": "Lighthouse having shape"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.tower_shape . \nVALUES ?x1 { :en.point_montara_light } \n?x0 :architecture.tower_shape.lighthouse_has_shape ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 165000101,
		"question": "in which shape was the point montara lighthouse built?",
		"answer": [
			"Conical"
		],
		"function": "none",
		"commonness": -22.066595221884075,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.tower_shape",
					"class": "architecture.tower_shape",
					"friendly_name": "Tower shape",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.point_montara_light",
					"class": "architecture.lighthouse",
					"friendly_name": "point montara lighthouse",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.tower_shape.lighthouse_has_shape",
					"friendly_name": "Lighthouse having shape"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.tower_shape . \nVALUES ?x1 { :en.point_montara_light } \n?x0 :architecture.tower_shape.lighthouse_has_shape ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 165000102,
		"question": "in which shape was the point montara light station built?",
		"answer": [
			"Conical"
		],
		"function": "none",
		"commonness": -22.066595221884075,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.tower_shape",
					"class": "architecture.tower_shape",
					"friendly_name": "Tower shape",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.point_montara_light",
					"class": "architecture.lighthouse",
					"friendly_name": "point montara light station",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.tower_shape.lighthouse_has_shape",
					"friendly_name": "Lighthouse having shape"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.tower_shape . \nVALUES ?x1 { :en.point_montara_light } \n?x0 :architecture.tower_shape.lighthouse_has_shape ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 165000200,
		"question": "what shape is the point montara light?",
		"answer": [
			"Conical"
		],
		"function": "none",
		"commonness": -22.066595221884075,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.tower_shape",
					"class": "architecture.tower_shape",
					"friendly_name": "Tower shape",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.point_montara_light",
					"class": "architecture.lighthouse",
					"friendly_name": "Point Montara Light",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.tower_shape.lighthouse_has_shape",
					"friendly_name": "Lighthouse having shape"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.tower_shape . \nVALUES ?x1 { :en.point_montara_light } \n?x0 :architecture.tower_shape.lighthouse_has_shape ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 165000201,
		"question": "what shape is the point montara lighthouse?",
		"answer": [
			"Conical"
		],
		"function": "none",
		"commonness": -22.066595221884075,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.tower_shape",
					"class": "architecture.tower_shape",
					"friendly_name": "Tower shape",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.point_montara_light",
					"class": "architecture.lighthouse",
					"friendly_name": "point montara lighthouse",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.tower_shape.lighthouse_has_shape",
					"friendly_name": "Lighthouse having shape"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.tower_shape . \nVALUES ?x1 { :en.point_montara_light } \n?x0 :architecture.tower_shape.lighthouse_has_shape ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 165000202,
		"question": "what shape is the point montara light station?",
		"answer": [
			"Conical"
		],
		"function": "none",
		"commonness": -22.066595221884075,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.tower_shape",
					"class": "architecture.tower_shape",
					"friendly_name": "Tower shape",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.point_montara_light",
					"class": "architecture.lighthouse",
					"friendly_name": "point montara light station",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.tower_shape.lighthouse_has_shape",
					"friendly_name": "Lighthouse having shape"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.tower_shape . \nVALUES ?x1 { :en.point_montara_light } \n?x0 :architecture.tower_shape.lighthouse_has_shape ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 165000300,
		"question": "the point montara light has which shape?",
		"answer": [
			"Conical"
		],
		"function": "none",
		"commonness": -22.066595221884075,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.tower_shape",
					"class": "architecture.tower_shape",
					"friendly_name": "Tower shape",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.point_montara_light",
					"class": "architecture.lighthouse",
					"friendly_name": "Point Montara Light",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.tower_shape.lighthouse_has_shape",
					"friendly_name": "Lighthouse having shape"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.tower_shape . \nVALUES ?x1 { :en.point_montara_light } \n?x0 :architecture.tower_shape.lighthouse_has_shape ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 165000301,
		"question": "the point montara lighthouse has which shape?",
		"answer": [
			"Conical"
		],
		"function": "none",
		"commonness": -22.066595221884075,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.tower_shape",
					"class": "architecture.tower_shape",
					"friendly_name": "Tower shape",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.point_montara_light",
					"class": "architecture.lighthouse",
					"friendly_name": "point montara lighthouse",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.tower_shape.lighthouse_has_shape",
					"friendly_name": "Lighthouse having shape"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.tower_shape . \nVALUES ?x1 { :en.point_montara_light } \n?x0 :architecture.tower_shape.lighthouse_has_shape ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 165000302,
		"question": "the point montara light station has which shape?",
		"answer": [
			"Conical"
		],
		"function": "none",
		"commonness": -22.066595221884075,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.tower_shape",
					"class": "architecture.tower_shape",
					"friendly_name": "Tower shape",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.point_montara_light",
					"class": "architecture.lighthouse",
					"friendly_name": "point montara light station",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.tower_shape.lighthouse_has_shape",
					"friendly_name": "Lighthouse having shape"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.tower_shape . \nVALUES ?x1 { :en.point_montara_light } \n?x0 :architecture.tower_shape.lighthouse_has_shape ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 165000400,
		"question": "what's the shape of the point montara light?",
		"answer": [
			"Conical"
		],
		"function": "none",
		"commonness": -22.066595221884075,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.tower_shape",
					"class": "architecture.tower_shape",
					"friendly_name": "Tower shape",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.point_montara_light",
					"class": "architecture.lighthouse",
					"friendly_name": "Point Montara Light",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.tower_shape.lighthouse_has_shape",
					"friendly_name": "Lighthouse having shape"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.tower_shape . \nVALUES ?x1 { :en.point_montara_light } \n?x0 :architecture.tower_shape.lighthouse_has_shape ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 165000401,
		"question": "what's the shape of the point montara lighthouse?",
		"answer": [
			"Conical"
		],
		"function": "none",
		"commonness": -22.066595221884075,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.tower_shape",
					"class": "architecture.tower_shape",
					"friendly_name": "Tower shape",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.point_montara_light",
					"class": "architecture.lighthouse",
					"friendly_name": "point montara lighthouse",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.tower_shape.lighthouse_has_shape",
					"friendly_name": "Lighthouse having shape"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.tower_shape . \nVALUES ?x1 { :en.point_montara_light } \n?x0 :architecture.tower_shape.lighthouse_has_shape ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 165000402,
		"question": "what's the shape of the point montara light station?",
		"answer": [
			"Conical"
		],
		"function": "none",
		"commonness": -22.066595221884075,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.tower_shape",
					"class": "architecture.tower_shape",
					"friendly_name": "Tower shape",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.point_montara_light",
					"class": "architecture.lighthouse",
					"friendly_name": "point montara light station",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.tower_shape.lighthouse_has_shape",
					"friendly_name": "Lighthouse having shape"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.tower_shape . \nVALUES ?x1 { :en.point_montara_light } \n?x0 :architecture.tower_shape.lighthouse_has_shape ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 165000500,
		"question": "the point montara light resembles which shape?",
		"answer": [
			"Conical"
		],
		"function": "none",
		"commonness": -22.066595221884075,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.tower_shape",
					"class": "architecture.tower_shape",
					"friendly_name": "Tower shape",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.point_montara_light",
					"class": "architecture.lighthouse",
					"friendly_name": "Point Montara Light",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.tower_shape.lighthouse_has_shape",
					"friendly_name": "Lighthouse having shape"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.tower_shape . \nVALUES ?x1 { :en.point_montara_light } \n?x0 :architecture.tower_shape.lighthouse_has_shape ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 165000501,
		"question": "the point montara lighthouse resembles which shape?",
		"answer": [
			"Conical"
		],
		"function": "none",
		"commonness": -22.066595221884075,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.tower_shape",
					"class": "architecture.tower_shape",
					"friendly_name": "Tower shape",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.point_montara_light",
					"class": "architecture.lighthouse",
					"friendly_name": "point montara lighthouse",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.tower_shape.lighthouse_has_shape",
					"friendly_name": "Lighthouse having shape"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.tower_shape . \nVALUES ?x1 { :en.point_montara_light } \n?x0 :architecture.tower_shape.lighthouse_has_shape ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 165000502,
		"question": "the point montara light station resembles which shape?",
		"answer": [
			"Conical"
		],
		"function": "none",
		"commonness": -22.066595221884075,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.tower_shape",
					"class": "architecture.tower_shape",
					"friendly_name": "Tower shape",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.point_montara_light",
					"class": "architecture.lighthouse",
					"friendly_name": "point montara light station",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.tower_shape.lighthouse_has_shape",
					"friendly_name": "Lighthouse having shape"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.tower_shape . \nVALUES ?x1 { :en.point_montara_light } \n?x0 :architecture.tower_shape.lighthouse_has_shape ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 166000000,
		"question": "which cancer center is located at massachusetts institute of technology?",
		"answer": [
			"David H. Koch Institute for Integrative Cancer Research at MIT"
		],
		"function": "none",
		"commonness": -14.64262530660993,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.cancer_center",
					"class": "medicine.cancer_center",
					"friendly_name": "Cancer Center",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.massachusetts_institute_of_technology",
					"class": "medicine.cancer_center_constituent",
					"friendly_name": "Massachusetts Institute of Technology",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.cancer_center.constituents",
					"friendly_name": "Constituents"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.cancer_center . \nVALUES ?x1 { :en.massachusetts_institute_of_technology } \n?x0 :medicine.cancer_center.constituents ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 166000001,
		"question": "which cancer center is located at mit?",
		"answer": [
			"David H. Koch Institute for Integrative Cancer Research at MIT"
		],
		"function": "none",
		"commonness": -14.64262530660993,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.cancer_center",
					"class": "medicine.cancer_center",
					"friendly_name": "Cancer Center",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.massachusetts_institute_of_technology",
					"class": "medicine.cancer_center_constituent",
					"friendly_name": "mit",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.cancer_center.constituents",
					"friendly_name": "Constituents"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.cancer_center . \nVALUES ?x1 { :en.massachusetts_institute_of_technology } \n?x0 :medicine.cancer_center.constituents ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 166000100,
		"question": "the cancer center at massachusetts institute of technology is known by which name?",
		"answer": [
			"David H. Koch Institute for Integrative Cancer Research at MIT"
		],
		"function": "none",
		"commonness": -14.64262530660993,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.cancer_center",
					"class": "medicine.cancer_center",
					"friendly_name": "Cancer Center",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.massachusetts_institute_of_technology",
					"class": "medicine.cancer_center_constituent",
					"friendly_name": "Massachusetts Institute of Technology",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.cancer_center.constituents",
					"friendly_name": "Constituents"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.cancer_center . \nVALUES ?x1 { :en.massachusetts_institute_of_technology } \n?x0 :medicine.cancer_center.constituents ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 166000101,
		"question": "the cancer center at mit is known by which name?",
		"answer": [
			"David H. Koch Institute for Integrative Cancer Research at MIT"
		],
		"function": "none",
		"commonness": -14.64262530660993,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.cancer_center",
					"class": "medicine.cancer_center",
					"friendly_name": "Cancer Center",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.massachusetts_institute_of_technology",
					"class": "medicine.cancer_center_constituent",
					"friendly_name": "mit",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.cancer_center.constituents",
					"friendly_name": "Constituents"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.cancer_center . \nVALUES ?x1 { :en.massachusetts_institute_of_technology } \n?x0 :medicine.cancer_center.constituents ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 166000200,
		"question": "what is the cancer center of the massachusetts institute of technology called?",
		"answer": [
			"David H. Koch Institute for Integrative Cancer Research at MIT"
		],
		"function": "none",
		"commonness": -14.64262530660993,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.cancer_center",
					"class": "medicine.cancer_center",
					"friendly_name": "Cancer Center",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.massachusetts_institute_of_technology",
					"class": "medicine.cancer_center_constituent",
					"friendly_name": "Massachusetts Institute of Technology",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.cancer_center.constituents",
					"friendly_name": "Constituents"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.cancer_center . \nVALUES ?x1 { :en.massachusetts_institute_of_technology } \n?x0 :medicine.cancer_center.constituents ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 166000201,
		"question": "what is the cancer center of the mit called?",
		"answer": [
			"David H. Koch Institute for Integrative Cancer Research at MIT"
		],
		"function": "none",
		"commonness": -14.64262530660993,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.cancer_center",
					"class": "medicine.cancer_center",
					"friendly_name": "Cancer Center",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.massachusetts_institute_of_technology",
					"class": "medicine.cancer_center_constituent",
					"friendly_name": "mit",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.cancer_center.constituents",
					"friendly_name": "Constituents"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.cancer_center . \nVALUES ?x1 { :en.massachusetts_institute_of_technology } \n?x0 :medicine.cancer_center.constituents ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]