[
	{
		"qid": 40000100,
		"question": "what casino has the most number of rooms?",
		"answer": [
			"Dunes"
		],
		"function": "argmax",
		"commonness": -15.67952353577434,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.casinos.casino",
					"class": "base.casinos.casino",
					"friendly_name": "Casino",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "0",
					"class": "type.int",
					"friendly_name": "0",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.casinos.casino.rooms",
					"friendly_name": "Rooms"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.casinos.casino . \n{\nSELECT (MAX(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :base.casinos.casino . \n?y0 :base.casinos.casino.rooms ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :base.casinos.casino.rooms ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 40000200,
		"question": "what is the name of the casino with the largest number of rooms?",
		"answer": [
			"Dunes"
		],
		"function": "argmax",
		"commonness": -15.67952353577434,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.casinos.casino",
					"class": "base.casinos.casino",
					"friendly_name": "Casino",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "0",
					"class": "type.int",
					"friendly_name": "0",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.casinos.casino.rooms",
					"friendly_name": "Rooms"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.casinos.casino . \n{\nSELECT (MAX(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :base.casinos.casino . \n?y0 :base.casinos.casino.rooms ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :base.casinos.casino.rooms ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 40000300,
		"question": "what is the name of the casino boasting the highest number of rooms?",
		"answer": [
			"Dunes"
		],
		"function": "argmax",
		"commonness": -15.67952353577434,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.casinos.casino",
					"class": "base.casinos.casino",
					"friendly_name": "Casino",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "0",
					"class": "type.int",
					"friendly_name": "0",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.casinos.casino.rooms",
					"friendly_name": "Rooms"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.casinos.casino . \n{\nSELECT (MAX(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :base.casinos.casino . \n?y0 :base.casinos.casino.rooms ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :base.casinos.casino.rooms ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 41000000,
		"question": "which exposure is most suitable for growing a niagara grape vine?",
		"answer": [
			"Full Sun"
		],
		"function": "none",
		"commonness": -24.221813150729638,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.horticulture.sun_coverage",
					"class": "base.horticulture.sun_coverage",
					"friendly_name": "Exposure",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.vitis_labrusca_niagara",
					"class": "base.horticulture.cultured_plant",
					"friendly_name": "Niagara grape",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.horticulture.cultured_plant.exposure",
					"friendly_name": "Exposure"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.horticulture.sun_coverage . \nVALUES ?x1 { :en.vitis_labrusca_niagara } \n?x1 :base.horticulture.cultured_plant.exposure ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 41000001,
		"question": "which exposure is most suitable for growing a niagara grapes vine?",
		"answer": [
			"Full Sun"
		],
		"function": "none",
		"commonness": -24.221813150729638,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.horticulture.sun_coverage",
					"class": "base.horticulture.sun_coverage",
					"friendly_name": "Exposure",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.vitis_labrusca_niagara",
					"class": "base.horticulture.cultured_plant",
					"friendly_name": "niagara grapes",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.horticulture.cultured_plant.exposure",
					"friendly_name": "Exposure"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.horticulture.sun_coverage . \nVALUES ?x1 { :en.vitis_labrusca_niagara } \n?x1 :base.horticulture.cultured_plant.exposure ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 41000100,
		"question": "how much sunlight should the niagara grape get?",
		"answer": [
			"Full Sun"
		],
		"function": "none",
		"commonness": -24.221813150729638,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.horticulture.sun_coverage",
					"class": "base.horticulture.sun_coverage",
					"friendly_name": "Exposure",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.vitis_labrusca_niagara",
					"class": "base.horticulture.cultured_plant",
					"friendly_name": "Niagara grape",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.horticulture.cultured_plant.exposure",
					"friendly_name": "Exposure"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.horticulture.sun_coverage . \nVALUES ?x1 { :en.vitis_labrusca_niagara } \n?x1 :base.horticulture.cultured_plant.exposure ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 41000101,
		"question": "how much sunlight should the niagara grapes get?",
		"answer": [
			"Full Sun"
		],
		"function": "none",
		"commonness": -24.221813150729638,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.horticulture.sun_coverage",
					"class": "base.horticulture.sun_coverage",
					"friendly_name": "Exposure",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.vitis_labrusca_niagara",
					"class": "base.horticulture.cultured_plant",
					"friendly_name": "niagara grapes",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.horticulture.cultured_plant.exposure",
					"friendly_name": "Exposure"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.horticulture.sun_coverage . \nVALUES ?x1 { :en.vitis_labrusca_niagara } \n?x1 :base.horticulture.cultured_plant.exposure ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 41000200,
		"question": "what is the best exposure of the niagara grape?",
		"answer": [
			"Full Sun"
		],
		"function": "none",
		"commonness": -24.221813150729638,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.horticulture.sun_coverage",
					"class": "base.horticulture.sun_coverage",
					"friendly_name": "Exposure",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.vitis_labrusca_niagara",
					"class": "base.horticulture.cultured_plant",
					"friendly_name": "Niagara grape",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.horticulture.cultured_plant.exposure",
					"friendly_name": "Exposure"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.horticulture.sun_coverage . \nVALUES ?x1 { :en.vitis_labrusca_niagara } \n?x1 :base.horticulture.cultured_plant.exposure ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 41000201,
		"question": "what is the best exposure of the niagara grapes?",
		"answer": [
			"Full Sun"
		],
		"function": "none",
		"commonness": -24.221813150729638,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.horticulture.sun_coverage",
					"class": "base.horticulture.sun_coverage",
					"friendly_name": "Exposure",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.vitis_labrusca_niagara",
					"class": "base.horticulture.cultured_plant",
					"friendly_name": "niagara grapes",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.horticulture.cultured_plant.exposure",
					"friendly_name": "Exposure"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.horticulture.sun_coverage . \nVALUES ?x1 { :en.vitis_labrusca_niagara } \n?x1 :base.horticulture.cultured_plant.exposure ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 42000000,
		"question": "what is the standard drinkware for margarita?",
		"answer": [
			"Margarita glass"
		],
		"function": "none",
		"commonness": -17.98626205464805,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.cocktails.cocktail_drinkware",
					"class": "base.cocktails.cocktail_drinkware",
					"friendly_name": "Cocktail Drinkware",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.margarita",
					"class": "base.cocktails.cocktail",
					"friendly_name": "Margarita",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.cocktails.cocktail.standard_drinkware",
					"friendly_name": "Standard drinkware"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.cocktails.cocktail_drinkware . \nVALUES ?x1 { :en.margarita } \n?x1 :base.cocktails.cocktail.standard_drinkware ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 42000001,
		"question": "what is the standard drinkware for margerita?",
		"answer": [
			"Margarita glass"
		],
		"function": "none",
		"commonness": -17.98626205464805,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.cocktails.cocktail_drinkware",
					"class": "base.cocktails.cocktail_drinkware",
					"friendly_name": "Cocktail Drinkware",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.margarita",
					"class": "base.cocktails.cocktail",
					"friendly_name": "margerita",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.cocktails.cocktail.standard_drinkware",
					"friendly_name": "Standard drinkware"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.cocktails.cocktail_drinkware . \nVALUES ?x1 { :en.margarita } \n?x1 :base.cocktails.cocktail.standard_drinkware ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 42000100,
		"question": "what do people usually use to drink margarita?",
		"answer": [
			"Margarita glass"
		],
		"function": "none",
		"commonness": -17.98626205464805,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.cocktails.cocktail_drinkware",
					"class": "base.cocktails.cocktail_drinkware",
					"friendly_name": "Cocktail Drinkware",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.margarita",
					"class": "base.cocktails.cocktail",
					"friendly_name": "Margarita",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.cocktails.cocktail.standard_drinkware",
					"friendly_name": "Standard drinkware"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.cocktails.cocktail_drinkware . \nVALUES ?x1 { :en.margarita } \n?x1 :base.cocktails.cocktail.standard_drinkware ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 42000101,
		"question": "what do people usually use to drink margerita?",
		"answer": [
			"Margarita glass"
		],
		"function": "none",
		"commonness": -17.98626205464805,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.cocktails.cocktail_drinkware",
					"class": "base.cocktails.cocktail_drinkware",
					"friendly_name": "Cocktail Drinkware",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.margarita",
					"class": "base.cocktails.cocktail",
					"friendly_name": "margerita",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.cocktails.cocktail.standard_drinkware",
					"friendly_name": "Standard drinkware"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.cocktails.cocktail_drinkware . \nVALUES ?x1 { :en.margarita } \n?x1 :base.cocktails.cocktail.standard_drinkware ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 42000200,
		"question": "what kind of drinkware do you use for a margarita?",
		"answer": [
			"Margarita glass"
		],
		"function": "none",
		"commonness": -17.98626205464805,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.cocktails.cocktail_drinkware",
					"class": "base.cocktails.cocktail_drinkware",
					"friendly_name": "Cocktail Drinkware",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.margarita",
					"class": "base.cocktails.cocktail",
					"friendly_name": "Margarita",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.cocktails.cocktail.standard_drinkware",
					"friendly_name": "Standard drinkware"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.cocktails.cocktail_drinkware . \nVALUES ?x1 { :en.margarita } \n?x1 :base.cocktails.cocktail.standard_drinkware ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 42000201,
		"question": "what kind of drinkware do you use for a margerita?",
		"answer": [
			"Margarita glass"
		],
		"function": "none",
		"commonness": -17.98626205464805,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.cocktails.cocktail_drinkware",
					"class": "base.cocktails.cocktail_drinkware",
					"friendly_name": "Cocktail Drinkware",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.margarita",
					"class": "base.cocktails.cocktail",
					"friendly_name": "margerita",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.cocktails.cocktail.standard_drinkware",
					"friendly_name": "Standard drinkware"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.cocktails.cocktail_drinkware . \nVALUES ?x1 { :en.margarita } \n?x1 :base.cocktails.cocktail.standard_drinkware ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 42000300,
		"question": "what is a margarita typically served in?",
		"answer": [
			"Margarita glass"
		],
		"function": "none",
		"commonness": -17.98626205464805,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.cocktails.cocktail_drinkware",
					"class": "base.cocktails.cocktail_drinkware",
					"friendly_name": "Cocktail Drinkware",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.margarita",
					"class": "base.cocktails.cocktail",
					"friendly_name": "Margarita",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.cocktails.cocktail.standard_drinkware",
					"friendly_name": "Standard drinkware"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.cocktails.cocktail_drinkware . \nVALUES ?x1 { :en.margarita } \n?x1 :base.cocktails.cocktail.standard_drinkware ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 42000301,
		"question": "what is a margerita typically served in?",
		"answer": [
			"Margarita glass"
		],
		"function": "none",
		"commonness": -17.98626205464805,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.cocktails.cocktail_drinkware",
					"class": "base.cocktails.cocktail_drinkware",
					"friendly_name": "Cocktail Drinkware",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.margarita",
					"class": "base.cocktails.cocktail",
					"friendly_name": "margerita",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.cocktails.cocktail.standard_drinkware",
					"friendly_name": "Standard drinkware"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.cocktails.cocktail_drinkware . \nVALUES ?x1 { :en.margarita } \n?x1 :base.cocktails.cocktail.standard_drinkware ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 42000400,
		"question": "how does one drink margarita?",
		"answer": [
			"Margarita glass"
		],
		"function": "none",
		"commonness": -17.98626205464805,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.cocktails.cocktail_drinkware",
					"class": "base.cocktails.cocktail_drinkware",
					"friendly_name": "Cocktail Drinkware",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.margarita",
					"class": "base.cocktails.cocktail",
					"friendly_name": "Margarita",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.cocktails.cocktail.standard_drinkware",
					"friendly_name": "Standard drinkware"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.cocktails.cocktail_drinkware . \nVALUES ?x1 { :en.margarita } \n?x1 :base.cocktails.cocktail.standard_drinkware ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 42000401,
		"question": "how does one drink margerita?",
		"answer": [
			"Margarita glass"
		],
		"function": "none",
		"commonness": -17.98626205464805,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.cocktails.cocktail_drinkware",
					"class": "base.cocktails.cocktail_drinkware",
					"friendly_name": "Cocktail Drinkware",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.margarita",
					"class": "base.cocktails.cocktail",
					"friendly_name": "margerita",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.cocktails.cocktail.standard_drinkware",
					"friendly_name": "Standard drinkware"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.cocktails.cocktail_drinkware . \nVALUES ?x1 { :en.margarita } \n?x1 :base.cocktails.cocktail.standard_drinkware ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 42000500,
		"question": "what is the name of the cocktail glassware used for a margarita?",
		"answer": [
			"Margarita glass"
		],
		"function": "none",
		"commonness": -17.98626205464805,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.cocktails.cocktail_drinkware",
					"class": "base.cocktails.cocktail_drinkware",
					"friendly_name": "Cocktail Drinkware",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.margarita",
					"class": "base.cocktails.cocktail",
					"friendly_name": "Margarita",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.cocktails.cocktail.standard_drinkware",
					"friendly_name": "Standard drinkware"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.cocktails.cocktail_drinkware . \nVALUES ?x1 { :en.margarita } \n?x1 :base.cocktails.cocktail.standard_drinkware ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 42000501,
		"question": "what is the name of the cocktail glassware used for a margerita?",
		"answer": [
			"Margarita glass"
		],
		"function": "none",
		"commonness": -17.98626205464805,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.cocktails.cocktail_drinkware",
					"class": "base.cocktails.cocktail_drinkware",
					"friendly_name": "Cocktail Drinkware",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.margarita",
					"class": "base.cocktails.cocktail",
					"friendly_name": "margerita",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.cocktails.cocktail.standard_drinkware",
					"friendly_name": "Standard drinkware"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.cocktails.cocktail_drinkware . \nVALUES ?x1 { :en.margarita } \n?x1 :base.cocktails.cocktail.standard_drinkware ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 43000000,
		"question": "what episodes about united states army are broadcasted in a radio?",
		"answer": [
			"Mental Anguish and the Military"
		],
		"function": "none",
		"commonness": -18.730993072803155,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "radio.radio_program_episode",
					"class": "radio.radio_program_episode",
					"friendly_name": "Radio program episode",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.u_army",
					"class": "radio.radio_subject",
					"friendly_name": "United States Army",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "radio.radio_subject.episodes_with_this_subject",
					"friendly_name": "Episodes with this subject"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :radio.radio_program_episode . \nVALUES ?x1 { :en.u_army } \n?x1 :radio.radio_subject.episodes_with_this_subject ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 43000001,
		"question": "what episodes about army are broadcasted in a radio?",
		"answer": [
			"Mental Anguish and the Military"
		],
		"function": "none",
		"commonness": -18.730993072803155,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "radio.radio_program_episode",
					"class": "radio.radio_program_episode",
					"friendly_name": "Radio program episode",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.u_army",
					"class": "radio.radio_subject",
					"friendly_name": "army",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "radio.radio_subject.episodes_with_this_subject",
					"friendly_name": "Episodes with this subject"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :radio.radio_program_episode . \nVALUES ?x1 { :en.u_army } \n?x1 :radio.radio_subject.episodes_with_this_subject ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 43000002,
		"question": "what episodes about us army are broadcasted in a radio?",
		"answer": [
			"Mental Anguish and the Military"
		],
		"function": "none",
		"commonness": -18.730993072803155,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "radio.radio_program_episode",
					"class": "radio.radio_program_episode",
					"friendly_name": "Radio program episode",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.u_army",
					"class": "radio.radio_subject",
					"friendly_name": "us army",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "radio.radio_subject.episodes_with_this_subject",
					"friendly_name": "Episodes with this subject"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :radio.radio_program_episode . \nVALUES ?x1 { :en.u_army } \n?x1 :radio.radio_subject.episodes_with_this_subject ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]