[
	{
		"qid": 172000500,
		"question": "which nobel prize winner shared an award with joseph stiglitz?",
		"answer": [
			"George Akerlof"
		],
		"function": "none",
		"commonness": -19.2903221770605,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.yalebase.nobel_prize_winner",
					"class": "base.yalebase.nobel_prize_winner",
					"friendly_name": "Nobel prize winner",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "award.award_honor",
					"class": "award.award_honor",
					"friendly_name": "Award Honor",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.joseph_e_stiglitz",
					"class": "award.award_winner",
					"friendly_name": "Joseph Stiglitz",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "award.award_honor.award_winner",
					"friendly_name": "Award winner"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "award.award_winner.awards_won",
					"friendly_name": "Awards Won"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.yalebase.nobel_prize_winner . \n?x1 :type.object.type :award.award_honor . \nVALUES ?x2 { :en.joseph_e_stiglitz } \n?x1 :award.award_honor.award_winner ?x0 . \n?x2 :award.award_winner.awards_won ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 172000501,
		"question": "which nobel prize winner shared an award with stiglitz?",
		"answer": [
			"George Akerlof"
		],
		"function": "none",
		"commonness": -19.2903221770605,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.yalebase.nobel_prize_winner",
					"class": "base.yalebase.nobel_prize_winner",
					"friendly_name": "Nobel prize winner",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "award.award_honor",
					"class": "award.award_honor",
					"friendly_name": "Award Honor",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.joseph_e_stiglitz",
					"class": "award.award_winner",
					"friendly_name": "stiglitz",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "award.award_honor.award_winner",
					"friendly_name": "Award winner"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "award.award_winner.awards_won",
					"friendly_name": "Awards Won"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.yalebase.nobel_prize_winner . \n?x1 :type.object.type :award.award_honor . \nVALUES ?x2 { :en.joseph_e_stiglitz } \n?x1 :award.award_honor.award_winner ?x0 . \n?x2 :award.award_winner.awards_won ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 172000502,
		"question": "which nobel prize winner shared an award with joseph e. stiglitz?",
		"answer": [
			"George Akerlof"
		],
		"function": "none",
		"commonness": -19.2903221770605,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.yalebase.nobel_prize_winner",
					"class": "base.yalebase.nobel_prize_winner",
					"friendly_name": "Nobel prize winner",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "award.award_honor",
					"class": "award.award_honor",
					"friendly_name": "Award Honor",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.joseph_e_stiglitz",
					"class": "award.award_winner",
					"friendly_name": "joseph e. stiglitz",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "award.award_honor.award_winner",
					"friendly_name": "Award winner"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "award.award_winner.awards_won",
					"friendly_name": "Awards Won"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.yalebase.nobel_prize_winner . \n?x1 :type.object.type :award.award_honor . \nVALUES ?x2 { :en.joseph_e_stiglitz } \n?x1 :award.award_honor.award_winner ?x0 . \n?x2 :award.award_winner.awards_won ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 173000000,
		"question": "who is the manufacturer of both ares i and saturn v?",
		"answer": [
			"Boeing"
		],
		"function": "none",
		"commonness": -26.108725625543638,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_manufacturer",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "Rocket Manufacturer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ares_i",
					"class": "spaceflight.rocket",
					"friendly_name": "Ares I",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.saturn_v",
					"class": "spaceflight.rocket",
					"friendly_name": "Saturn V",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "spaceflight.rocket.manufacturer",
					"friendly_name": "Manufacturer"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_manufacturer . \nVALUES ?x1 { :en.ares_i } \nVALUES ?x2 { :en.saturn_v } \n?x0 :spaceflight.rocket_manufacturer.rockets_manufactured ?x1 . \n?x2 :spaceflight.rocket.manufacturer ?x0 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 173000001,
		"question": "who is the manufacturer of both ares i and saturn 5?",
		"answer": [
			"Boeing"
		],
		"function": "none",
		"commonness": -26.108725625543638,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_manufacturer",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "Rocket Manufacturer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ares_i",
					"class": "spaceflight.rocket",
					"friendly_name": "Ares I",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.saturn_v",
					"class": "spaceflight.rocket",
					"friendly_name": "saturn 5",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "spaceflight.rocket.manufacturer",
					"friendly_name": "Manufacturer"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_manufacturer . \nVALUES ?x1 { :en.ares_i } \nVALUES ?x2 { :en.saturn_v } \n?x0 :spaceflight.rocket_manufacturer.rockets_manufactured ?x1 . \n?x2 :spaceflight.rocket.manufacturer ?x0 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 173000100,
		"question": "which organizations constructed both ares i and saturn v?",
		"answer": [
			"Boeing"
		],
		"function": "none",
		"commonness": -26.108725625543638,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_manufacturer",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "Rocket Manufacturer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ares_i",
					"class": "spaceflight.rocket",
					"friendly_name": "Ares I",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.saturn_v",
					"class": "spaceflight.rocket",
					"friendly_name": "Saturn V",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "spaceflight.rocket.manufacturer",
					"friendly_name": "Manufacturer"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_manufacturer . \nVALUES ?x1 { :en.ares_i } \nVALUES ?x2 { :en.saturn_v } \n?x0 :spaceflight.rocket_manufacturer.rockets_manufactured ?x1 . \n?x2 :spaceflight.rocket.manufacturer ?x0 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 173000200,
		"question": "who made ares i and saturn v?",
		"answer": [
			"Boeing"
		],
		"function": "none",
		"commonness": -26.108725625543638,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_manufacturer",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "Rocket Manufacturer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ares_i",
					"class": "spaceflight.rocket",
					"friendly_name": "Ares I",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.saturn_v",
					"class": "spaceflight.rocket",
					"friendly_name": "Saturn V",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "spaceflight.rocket.manufacturer",
					"friendly_name": "Manufacturer"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_manufacturer . \nVALUES ?x1 { :en.ares_i } \nVALUES ?x2 { :en.saturn_v } \n?x0 :spaceflight.rocket_manufacturer.rockets_manufactured ?x1 . \n?x2 :spaceflight.rocket.manufacturer ?x0 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 173000201,
		"question": "who made ares i and saturn 5?",
		"answer": [
			"Boeing"
		],
		"function": "none",
		"commonness": -26.108725625543638,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_manufacturer",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "Rocket Manufacturer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ares_i",
					"class": "spaceflight.rocket",
					"friendly_name": "Ares I",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.saturn_v",
					"class": "spaceflight.rocket",
					"friendly_name": "saturn 5",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "spaceflight.rocket.manufacturer",
					"friendly_name": "Manufacturer"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_manufacturer . \nVALUES ?x1 { :en.ares_i } \nVALUES ?x2 { :en.saturn_v } \n?x0 :spaceflight.rocket_manufacturer.rockets_manufactured ?x1 . \n?x2 :spaceflight.rocket.manufacturer ?x0 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 173000300,
		"question": "who was the creator of ares i and saturn v?",
		"answer": [
			"Boeing"
		],
		"function": "none",
		"commonness": -26.108725625543638,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_manufacturer",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "Rocket Manufacturer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ares_i",
					"class": "spaceflight.rocket",
					"friendly_name": "Ares I",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.saturn_v",
					"class": "spaceflight.rocket",
					"friendly_name": "Saturn V",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "spaceflight.rocket.manufacturer",
					"friendly_name": "Manufacturer"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_manufacturer . \nVALUES ?x1 { :en.ares_i } \nVALUES ?x2 { :en.saturn_v } \n?x0 :spaceflight.rocket_manufacturer.rockets_manufactured ?x1 . \n?x2 :spaceflight.rocket.manufacturer ?x0 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 173000301,
		"question": "who was the creator of ares i and saturn 5?",
		"answer": [
			"Boeing"
		],
		"function": "none",
		"commonness": -26.108725625543638,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_manufacturer",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "Rocket Manufacturer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ares_i",
					"class": "spaceflight.rocket",
					"friendly_name": "Ares I",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.saturn_v",
					"class": "spaceflight.rocket",
					"friendly_name": "saturn 5",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "spaceflight.rocket.manufacturer",
					"friendly_name": "Manufacturer"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_manufacturer . \nVALUES ?x1 { :en.ares_i } \nVALUES ?x2 { :en.saturn_v } \n?x0 :spaceflight.rocket_manufacturer.rockets_manufactured ?x1 . \n?x2 :spaceflight.rocket.manufacturer ?x0 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 173000400,
		"question": "what company manufactured both ares i and saturn v?",
		"answer": [
			"Boeing"
		],
		"function": "none",
		"commonness": -26.108725625543638,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_manufacturer",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "Rocket Manufacturer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ares_i",
					"class": "spaceflight.rocket",
					"friendly_name": "Ares I",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.saturn_v",
					"class": "spaceflight.rocket",
					"friendly_name": "Saturn V",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "spaceflight.rocket.manufacturer",
					"friendly_name": "Manufacturer"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_manufacturer . \nVALUES ?x1 { :en.ares_i } \nVALUES ?x2 { :en.saturn_v } \n?x0 :spaceflight.rocket_manufacturer.rockets_manufactured ?x1 . \n?x2 :spaceflight.rocket.manufacturer ?x0 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 173000401,
		"question": "what company manufactured both ares i and saturn 5?",
		"answer": [
			"Boeing"
		],
		"function": "none",
		"commonness": -26.108725625543638,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_manufacturer",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "Rocket Manufacturer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ares_i",
					"class": "spaceflight.rocket",
					"friendly_name": "Ares I",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.saturn_v",
					"class": "spaceflight.rocket",
					"friendly_name": "saturn 5",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "spaceflight.rocket.manufacturer",
					"friendly_name": "Manufacturer"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_manufacturer . \nVALUES ?x1 { :en.ares_i } \nVALUES ?x2 { :en.saturn_v } \n?x0 :spaceflight.rocket_manufacturer.rockets_manufactured ?x1 . \n?x2 :spaceflight.rocket.manufacturer ?x0 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 173000500,
		"question": "the rockets ares i and saturn v are made by who?",
		"answer": [
			"Boeing"
		],
		"function": "none",
		"commonness": -26.108725625543638,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_manufacturer",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "Rocket Manufacturer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ares_i",
					"class": "spaceflight.rocket",
					"friendly_name": "Ares I",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.saturn_v",
					"class": "spaceflight.rocket",
					"friendly_name": "Saturn V",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "spaceflight.rocket.manufacturer",
					"friendly_name": "Manufacturer"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_manufacturer . \nVALUES ?x1 { :en.ares_i } \nVALUES ?x2 { :en.saturn_v } \n?x0 :spaceflight.rocket_manufacturer.rockets_manufactured ?x1 . \n?x2 :spaceflight.rocket.manufacturer ?x0 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 173000501,
		"question": "the rockets ares i and saturn 5 are made by who?",
		"answer": [
			"Boeing"
		],
		"function": "none",
		"commonness": -26.108725625543638,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_manufacturer",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "Rocket Manufacturer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ares_i",
					"class": "spaceflight.rocket",
					"friendly_name": "Ares I",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.saturn_v",
					"class": "spaceflight.rocket",
					"friendly_name": "saturn 5",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "spaceflight.rocket.manufacturer",
					"friendly_name": "Manufacturer"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_manufacturer . \nVALUES ?x1 { :en.ares_i } \nVALUES ?x2 { :en.saturn_v } \n?x0 :spaceflight.rocket_manufacturer.rockets_manufactured ?x1 . \n?x2 :spaceflight.rocket.manufacturer ?x0 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 173000600,
		"question": "which rocket manufacturer made the ares i and saturn v?",
		"answer": [
			"Boeing"
		],
		"function": "none",
		"commonness": -26.108725625543638,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_manufacturer",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "Rocket Manufacturer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ares_i",
					"class": "spaceflight.rocket",
					"friendly_name": "Ares I",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.saturn_v",
					"class": "spaceflight.rocket",
					"friendly_name": "Saturn V",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "spaceflight.rocket.manufacturer",
					"friendly_name": "Manufacturer"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_manufacturer . \nVALUES ?x1 { :en.ares_i } \nVALUES ?x2 { :en.saturn_v } \n?x0 :spaceflight.rocket_manufacturer.rockets_manufactured ?x1 . \n?x2 :spaceflight.rocket.manufacturer ?x0 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 173000601,
		"question": "which rocket manufacturer made the ares i and saturn 5?",
		"answer": [
			"Boeing"
		],
		"function": "none",
		"commonness": -26.108725625543638,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_manufacturer",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "Rocket Manufacturer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ares_i",
					"class": "spaceflight.rocket",
					"friendly_name": "Ares I",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.saturn_v",
					"class": "spaceflight.rocket",
					"friendly_name": "saturn 5",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "spaceflight.rocket.manufacturer",
					"friendly_name": "Manufacturer"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_manufacturer . \nVALUES ?x1 { :en.ares_i } \nVALUES ?x2 { :en.saturn_v } \n?x0 :spaceflight.rocket_manufacturer.rockets_manufactured ?x1 . \n?x2 :spaceflight.rocket.manufacturer ?x0 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 174000000,
		"question": "zuko has similar ranks with what dead characters?",
		"answer": [
			"Troilus",
			"Vegeta"
		],
		"function": "none",
		"commonness": -23.94775446705927,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.fictionaluniverse.deceased_fictional_character",
					"class": "base.fictionaluniverse.deceased_fictional_character",
					"friendly_name": "Deceased Fictional Character",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "fictional_universe.character_rank",
					"class": "fictional_universe.character_rank",
					"friendly_name": "Character Rank",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.prince_zuko",
					"class": "fictional_universe.fictional_character",
					"friendly_name": "Zuko",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "fictional_universe.character_rank.characters_of_this_rank",
					"friendly_name": "Characters of This Rank"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "fictional_universe.fictional_character.rank",
					"friendly_name": "Rank"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.fictionaluniverse.deceased_fictional_character . \n?x1 :type.object.type :fictional_universe.character_rank . \nVALUES ?x2 { :en.prince_zuko } \n?x1 :fictional_universe.character_rank.characters_of_this_rank ?x0 . \n?x2 :fictional_universe.fictional_character.rank ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 174000001,
		"question": "prince zuko has similar ranks with what dead characters?",
		"answer": [
			"Troilus",
			"Vegeta"
		],
		"function": "none",
		"commonness": -23.94775446705927,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.fictionaluniverse.deceased_fictional_character",
					"class": "base.fictionaluniverse.deceased_fictional_character",
					"friendly_name": "Deceased Fictional Character",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "fictional_universe.character_rank",
					"class": "fictional_universe.character_rank",
					"friendly_name": "Character Rank",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.prince_zuko",
					"class": "fictional_universe.fictional_character",
					"friendly_name": "prince zuko",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "fictional_universe.character_rank.characters_of_this_rank",
					"friendly_name": "Characters of This Rank"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "fictional_universe.fictional_character.rank",
					"friendly_name": "Rank"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.fictionaluniverse.deceased_fictional_character . \n?x1 :type.object.type :fictional_universe.character_rank . \nVALUES ?x2 { :en.prince_zuko } \n?x1 :fictional_universe.character_rank.characters_of_this_rank ?x0 . \n?x2 :fictional_universe.fictional_character.rank ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	}
]