[
	{
		"qid": 162000501,
		"question": "how many co-founders of google inc are there?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -7.274886300832824,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "organization.organization_founder",
					"class": "organization.organization_founder",
					"friendly_name": "Organization founder",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.google",
					"class": "organization.organization",
					"friendly_name": "google inc",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "organization.organization_founder.organizations_founded",
					"friendly_name": "Organizations founded"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :organization.organization_founder . \nVALUES ?x1 { :en.google } \n?x0 :organization.organization_founder.organizations_founded ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 163000000,
		"question": "what branches does the new york public library system have?",
		"answer": [
			"New York Public Library Main Branch",
			"Schomburg Center for Research in Black Culture"
		],
		"function": "none",
		"commonness": -15.15155046132745,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "library.public_library",
					"class": "library.public_library",
					"friendly_name": "Public Library",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.new_york_public_library",
					"class": "library.public_library_system",
					"friendly_name": "New York Public Library",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "library.public_library_system.branches",
					"friendly_name": "Branch Libraries"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :library.public_library . \nVALUES ?x1 { :en.new_york_public_library } \n?x1 :library.public_library_system.branches ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 163000001,
		"question": "what branches does the nypl system have?",
		"answer": [
			"New York Public Library Main Branch",
			"Schomburg Center for Research in Black Culture"
		],
		"function": "none",
		"commonness": -15.15155046132745,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "library.public_library",
					"class": "library.public_library",
					"friendly_name": "Public Library",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.new_york_public_library",
					"class": "library.public_library_system",
					"friendly_name": "nypl",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "library.public_library_system.branches",
					"friendly_name": "Branch Libraries"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :library.public_library . \nVALUES ?x1 { :en.new_york_public_library } \n?x1 :library.public_library_system.branches ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 163000002,
		"question": "what branches does the new york library system have?",
		"answer": [
			"New York Public Library Main Branch",
			"Schomburg Center for Research in Black Culture"
		],
		"function": "none",
		"commonness": -15.15155046132745,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "library.public_library",
					"class": "library.public_library",
					"friendly_name": "Public Library",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.new_york_public_library",
					"class": "library.public_library_system",
					"friendly_name": "new york library",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "library.public_library_system.branches",
					"friendly_name": "Branch Libraries"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :library.public_library . \nVALUES ?x1 { :en.new_york_public_library } \n?x1 :library.public_library_system.branches ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 163000200,
		"question": "new york public library includes which branches?",
		"answer": [
			"Schomburg Center for Research in Black Culture",
			"New York Public Library Main Branch"
		],
		"function": "none",
		"commonness": -15.15155046132745,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "library.public_library",
					"class": "library.public_library",
					"friendly_name": "Public Library",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.new_york_public_library",
					"class": "library.public_library_system",
					"friendly_name": "New York Public Library",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "library.public_library_system.branches",
					"friendly_name": "Branch Libraries"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :library.public_library . \nVALUES ?x1 { :en.new_york_public_library } \n?x1 :library.public_library_system.branches ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 163000201,
		"question": "nypl includes which branches?",
		"answer": [
			"Schomburg Center for Research in Black Culture",
			"New York Public Library Main Branch"
		],
		"function": "none",
		"commonness": -15.15155046132745,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "library.public_library",
					"class": "library.public_library",
					"friendly_name": "Public Library",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.new_york_public_library",
					"class": "library.public_library_system",
					"friendly_name": "nypl",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "library.public_library_system.branches",
					"friendly_name": "Branch Libraries"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :library.public_library . \nVALUES ?x1 { :en.new_york_public_library } \n?x1 :library.public_library_system.branches ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 163000202,
		"question": "new york library includes which branches?",
		"answer": [
			"New York Public Library Main Branch",
			"Schomburg Center for Research in Black Culture"
		],
		"function": "none",
		"commonness": -15.15155046132745,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "library.public_library",
					"class": "library.public_library",
					"friendly_name": "Public Library",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.new_york_public_library",
					"class": "library.public_library_system",
					"friendly_name": "new york library",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "library.public_library_system.branches",
					"friendly_name": "Branch Libraries"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :library.public_library . \nVALUES ?x1 { :en.new_york_public_library } \n?x1 :library.public_library_system.branches ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 163000300,
		"question": "what are the branch libraries of the new york public library?",
		"answer": [
			"Schomburg Center for Research in Black Culture",
			"New York Public Library Main Branch"
		],
		"function": "none",
		"commonness": -15.15155046132745,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "library.public_library",
					"class": "library.public_library",
					"friendly_name": "Public Library",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.new_york_public_library",
					"class": "library.public_library_system",
					"friendly_name": "New York Public Library",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "library.public_library_system.branches",
					"friendly_name": "Branch Libraries"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :library.public_library . \nVALUES ?x1 { :en.new_york_public_library } \n?x1 :library.public_library_system.branches ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 163000301,
		"question": "what are the branch libraries of the nypl?",
		"answer": [
			"Schomburg Center for Research in Black Culture",
			"New York Public Library Main Branch"
		],
		"function": "none",
		"commonness": -15.15155046132745,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "library.public_library",
					"class": "library.public_library",
					"friendly_name": "Public Library",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.new_york_public_library",
					"class": "library.public_library_system",
					"friendly_name": "nypl",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "library.public_library_system.branches",
					"friendly_name": "Branch Libraries"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :library.public_library . \nVALUES ?x1 { :en.new_york_public_library } \n?x1 :library.public_library_system.branches ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 163000302,
		"question": "what are the branch libraries of the new york library?",
		"answer": [
			"New York Public Library Main Branch",
			"Schomburg Center for Research in Black Culture"
		],
		"function": "none",
		"commonness": -15.15155046132745,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "library.public_library",
					"class": "library.public_library",
					"friendly_name": "Public Library",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.new_york_public_library",
					"class": "library.public_library_system",
					"friendly_name": "new york library",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "library.public_library_system.branches",
					"friendly_name": "Branch Libraries"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :library.public_library . \nVALUES ?x1 { :en.new_york_public_library } \n?x1 :library.public_library_system.branches ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 164000000,
		"question": "celine dion has performed how many film songs?",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -14.252318701819185,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.film_featured_song",
					"class": "film.film_featured_song",
					"friendly_name": "Film featured song",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.celine_dion",
					"class": "music.artist",
					"friendly_name": "Celine Dion",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "film.film_featured_song.performed_by",
					"friendly_name": "Performed by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.film_featured_song . \nVALUES ?x1 { :en.celine_dion } \n?x0 :film.film_featured_song.performed_by ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 164000001,
		"question": "dion has performed how many film songs?",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -14.252318701819185,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.film_featured_song",
					"class": "film.film_featured_song",
					"friendly_name": "Film featured song",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.celine_dion",
					"class": "music.artist",
					"friendly_name": "dion",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "film.film_featured_song.performed_by",
					"friendly_name": "Performed by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.film_featured_song . \nVALUES ?x1 { :en.celine_dion } \n?x0 :film.film_featured_song.performed_by ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 164000002,
		"question": "celine has performed how many film songs?",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -14.252318701819185,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.film_featured_song",
					"class": "film.film_featured_song",
					"friendly_name": "Film featured song",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.celine_dion",
					"class": "music.artist",
					"friendly_name": "celine",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "film.film_featured_song.performed_by",
					"friendly_name": "Performed by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.film_featured_song . \nVALUES ?x1 { :en.celine_dion } \n?x0 :film.film_featured_song.performed_by ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 164000100,
		"question": "how many songs has celine dion performed for films?",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -14.252318701819185,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.film_featured_song",
					"class": "film.film_featured_song",
					"friendly_name": "Film featured song",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.celine_dion",
					"class": "music.artist",
					"friendly_name": "Celine Dion",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "film.film_featured_song.performed_by",
					"friendly_name": "Performed by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.film_featured_song . \nVALUES ?x1 { :en.celine_dion } \n?x0 :film.film_featured_song.performed_by ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 164000101,
		"question": "how many songs has dion performed for films?",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -14.252318701819185,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.film_featured_song",
					"class": "film.film_featured_song",
					"friendly_name": "Film featured song",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.celine_dion",
					"class": "music.artist",
					"friendly_name": "dion",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "film.film_featured_song.performed_by",
					"friendly_name": "Performed by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.film_featured_song . \nVALUES ?x1 { :en.celine_dion } \n?x0 :film.film_featured_song.performed_by ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 164000102,
		"question": "how many songs has celine performed for films?",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -14.252318701819185,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.film_featured_song",
					"class": "film.film_featured_song",
					"friendly_name": "Film featured song",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.celine_dion",
					"class": "music.artist",
					"friendly_name": "celine",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "film.film_featured_song.performed_by",
					"friendly_name": "Performed by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.film_featured_song . \nVALUES ?x1 { :en.celine_dion } \n?x0 :film.film_featured_song.performed_by ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 164000201,
		"question": "how many film songs has dion performed?",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -14.252318701819185,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.film_featured_song",
					"class": "film.film_featured_song",
					"friendly_name": "Film featured song",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.celine_dion",
					"class": "music.artist",
					"friendly_name": "dion",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "film.film_featured_song.performed_by",
					"friendly_name": "Performed by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.film_featured_song . \nVALUES ?x1 { :en.celine_dion } \n?x0 :film.film_featured_song.performed_by ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 164000202,
		"question": "how many film songs has celine performed?",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -14.252318701819185,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.film_featured_song",
					"class": "film.film_featured_song",
					"friendly_name": "Film featured song",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.celine_dion",
					"class": "music.artist",
					"friendly_name": "celine",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "film.film_featured_song.performed_by",
					"friendly_name": "Performed by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.film_featured_song . \nVALUES ?x1 { :en.celine_dion } \n?x0 :film.film_featured_song.performed_by ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 164000300,
		"question": "how many film songs were performed by celine dion?",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -14.252318701819185,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.film_featured_song",
					"class": "film.film_featured_song",
					"friendly_name": "Film featured song",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.celine_dion",
					"class": "music.artist",
					"friendly_name": "Celine Dion",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "film.film_featured_song.performed_by",
					"friendly_name": "Performed by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.film_featured_song . \nVALUES ?x1 { :en.celine_dion } \n?x0 :film.film_featured_song.performed_by ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 164000301,
		"question": "how many film songs were performed by dion?",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -14.252318701819185,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.film_featured_song",
					"class": "film.film_featured_song",
					"friendly_name": "Film featured song",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.celine_dion",
					"class": "music.artist",
					"friendly_name": "dion",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "film.film_featured_song.performed_by",
					"friendly_name": "Performed by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.film_featured_song . \nVALUES ?x1 { :en.celine_dion } \n?x0 :film.film_featured_song.performed_by ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 164000302,
		"question": "how many film songs were performed by celine?",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -14.252318701819185,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.film_featured_song",
					"class": "film.film_featured_song",
					"friendly_name": "Film featured song",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.celine_dion",
					"class": "music.artist",
					"friendly_name": "celine",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "film.film_featured_song.performed_by",
					"friendly_name": "Performed by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.film_featured_song . \nVALUES ?x1 { :en.celine_dion } \n?x0 :film.film_featured_song.performed_by ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 164000400,
		"question": "how many songs performed by celine dion were featured in films?",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -14.252318701819185,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.film_featured_song",
					"class": "film.film_featured_song",
					"friendly_name": "Film featured song",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.celine_dion",
					"class": "music.artist",
					"friendly_name": "Celine Dion",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "film.film_featured_song.performed_by",
					"friendly_name": "Performed by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.film_featured_song . \nVALUES ?x1 { :en.celine_dion } \n?x0 :film.film_featured_song.performed_by ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 164000401,
		"question": "how many songs performed by dion were featured in films?",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -14.252318701819185,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.film_featured_song",
					"class": "film.film_featured_song",
					"friendly_name": "Film featured song",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.celine_dion",
					"class": "music.artist",
					"friendly_name": "dion",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "film.film_featured_song.performed_by",
					"friendly_name": "Performed by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.film_featured_song . \nVALUES ?x1 { :en.celine_dion } \n?x0 :film.film_featured_song.performed_by ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 164000402,
		"question": "how many songs performed by celine were featured in films?",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -14.252318701819185,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.film_featured_song",
					"class": "film.film_featured_song",
					"friendly_name": "Film featured song",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.celine_dion",
					"class": "music.artist",
					"friendly_name": "celine",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "film.film_featured_song.performed_by",
					"friendly_name": "Performed by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.film_featured_song . \nVALUES ?x1 { :en.celine_dion } \n?x0 :film.film_featured_song.performed_by ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]