[
	{
		"qid": 228000400,
		"question": "who employed batman?",
		"answer": [
			"Wayne Enterprises"
		],
		"function": "none",
		"commonness": -20.258084186000367,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.fictional_employer",
					"class": "fictional_universe.fictional_employer",
					"friendly_name": "Employer in fiction",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "fictional_universe.fictional_employment_tenure",
					"class": "fictional_universe.fictional_employment_tenure",
					"friendly_name": "Fictional employment tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.batman",
					"class": "fictional_universe.fictional_character",
					"friendly_name": "Batman",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "fictional_universe.fictional_employer.employees",
					"friendly_name": "Employees"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "fictional_universe.fictional_character.employers",
					"friendly_name": "Employers"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.fictional_employer . \n?x1 :type.object.type :fictional_universe.fictional_employment_tenure . \nVALUES ?x2 { :en.batman } \n?x0 :fictional_universe.fictional_employer.employees ?x1 . \n?x2 :fictional_universe.fictional_character.employers ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 228000401,
		"question": "who employed bruce wayne?",
		"answer": [
			"Wayne Enterprises"
		],
		"function": "none",
		"commonness": -20.258084186000367,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.fictional_employer",
					"class": "fictional_universe.fictional_employer",
					"friendly_name": "Employer in fiction",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "fictional_universe.fictional_employment_tenure",
					"class": "fictional_universe.fictional_employment_tenure",
					"friendly_name": "Fictional employment tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.batman",
					"class": "fictional_universe.fictional_character",
					"friendly_name": "bruce wayne",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "fictional_universe.fictional_employer.employees",
					"friendly_name": "Employees"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "fictional_universe.fictional_character.employers",
					"friendly_name": "Employers"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.fictional_employer . \n?x1 :type.object.type :fictional_universe.fictional_employment_tenure . \nVALUES ?x2 { :en.batman } \n?x0 :fictional_universe.fictional_employer.employees ?x1 . \n?x2 :fictional_universe.fictional_character.employers ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 228000501,
		"question": "who hires bruce wayne?",
		"answer": [
			"Wayne Enterprises"
		],
		"function": "none",
		"commonness": -20.258084186000367,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.fictional_employer",
					"class": "fictional_universe.fictional_employer",
					"friendly_name": "Employer in fiction",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "fictional_universe.fictional_employment_tenure",
					"class": "fictional_universe.fictional_employment_tenure",
					"friendly_name": "Fictional employment tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.batman",
					"class": "fictional_universe.fictional_character",
					"friendly_name": "bruce wayne",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "fictional_universe.fictional_employer.employees",
					"friendly_name": "Employees"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "fictional_universe.fictional_character.employers",
					"friendly_name": "Employers"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.fictional_employer . \n?x1 :type.object.type :fictional_universe.fictional_employment_tenure . \nVALUES ?x2 { :en.batman } \n?x0 :fictional_universe.fictional_employer.employees ?x1 . \n?x2 :fictional_universe.fictional_character.employers ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 228000600,
		"question": "what company does batman work for?",
		"answer": [
			"Wayne Enterprises"
		],
		"function": "none",
		"commonness": -20.258084186000367,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.fictional_employer",
					"class": "fictional_universe.fictional_employer",
					"friendly_name": "Employer in fiction",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "fictional_universe.fictional_employment_tenure",
					"class": "fictional_universe.fictional_employment_tenure",
					"friendly_name": "Fictional employment tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.batman",
					"class": "fictional_universe.fictional_character",
					"friendly_name": "Batman",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "fictional_universe.fictional_employer.employees",
					"friendly_name": "Employees"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "fictional_universe.fictional_character.employers",
					"friendly_name": "Employers"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.fictional_employer . \n?x1 :type.object.type :fictional_universe.fictional_employment_tenure . \nVALUES ?x2 { :en.batman } \n?x0 :fictional_universe.fictional_employer.employees ?x1 . \n?x2 :fictional_universe.fictional_character.employers ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 228000601,
		"question": "what company does bruce wayne work for?",
		"answer": [
			"Wayne Enterprises"
		],
		"function": "none",
		"commonness": -20.258084186000367,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.fictional_employer",
					"class": "fictional_universe.fictional_employer",
					"friendly_name": "Employer in fiction",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "fictional_universe.fictional_employment_tenure",
					"class": "fictional_universe.fictional_employment_tenure",
					"friendly_name": "Fictional employment tenure",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.batman",
					"class": "fictional_universe.fictional_character",
					"friendly_name": "bruce wayne",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "fictional_universe.fictional_employer.employees",
					"friendly_name": "Employees"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "fictional_universe.fictional_character.employers",
					"friendly_name": "Employers"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.fictional_employer . \n?x1 :type.object.type :fictional_universe.fictional_employment_tenure . \nVALUES ?x2 { :en.batman } \n?x0 :fictional_universe.fictional_employer.employees ?x1 . \n?x2 :fictional_universe.fictional_character.employers ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 229000000,
		"question": "who was the publisher of the alan moore comic books?",
		"answer": [
			"WildStorm",
			"Avatar Press",
			"Top Shelf Productions",
			"DC Comics",
			"Dark Horse Comics",
			"Vertigo"
		],
		"function": "none",
		"commonness": -22.0274509335855,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_publisher",
					"class": "comic_books.comic_book_publisher",
					"friendly_name": "Comic Book Publisher",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "comic_books.comic_book_series",
					"class": "comic_books.comic_book_series",
					"friendly_name": "Comic Book Series",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.alan_moore",
					"class": "comic_books.comic_book_creator",
					"friendly_name": "Alan Moore",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "comic_books.comic_book_publisher.comic_book_series_published",
					"friendly_name": "Comic Book Series Published"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "comic_books.comic_book_creator.series_created",
					"friendly_name": "Series Created"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_publisher . \n?x1 :type.object.type :comic_books.comic_book_series . \nVALUES ?x2 { :en.alan_moore } \n?x0 :comic_books.comic_book_publisher.comic_book_series_published ?x1 . \n?x2 :comic_books.comic_book_creator.series_created ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 229000001,
		"question": "who was the publisher of the alan oswald moore comic books?",
		"answer": [
			"WildStorm",
			"Dark Horse Comics",
			"Avatar Press",
			"Top Shelf Productions",
			"Vertigo",
			"DC Comics"
		],
		"function": "none",
		"commonness": -22.0274509335855,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_publisher",
					"class": "comic_books.comic_book_publisher",
					"friendly_name": "Comic Book Publisher",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "comic_books.comic_book_series",
					"class": "comic_books.comic_book_series",
					"friendly_name": "Comic Book Series",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.alan_moore",
					"class": "comic_books.comic_book_creator",
					"friendly_name": "alan oswald moore",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "comic_books.comic_book_publisher.comic_book_series_published",
					"friendly_name": "Comic Book Series Published"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "comic_books.comic_book_creator.series_created",
					"friendly_name": "Series Created"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_publisher . \n?x1 :type.object.type :comic_books.comic_book_series . \nVALUES ?x2 { :en.alan_moore } \n?x0 :comic_books.comic_book_publisher.comic_book_series_published ?x1 . \n?x2 :comic_books.comic_book_creator.series_created ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 229000100,
		"question": "which comic book publisher published alan moore's comic books?",
		"answer": [
			"WildStorm",
			"Avatar Press",
			"DC Comics",
			"Top Shelf Productions",
			"Vertigo",
			"Dark Horse Comics"
		],
		"function": "none",
		"commonness": -22.0274509335855,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_publisher",
					"class": "comic_books.comic_book_publisher",
					"friendly_name": "Comic Book Publisher",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "comic_books.comic_book_series",
					"class": "comic_books.comic_book_series",
					"friendly_name": "Comic Book Series",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.alan_moore",
					"class": "comic_books.comic_book_creator",
					"friendly_name": "Alan Moore",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "comic_books.comic_book_publisher.comic_book_series_published",
					"friendly_name": "Comic Book Series Published"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "comic_books.comic_book_creator.series_created",
					"friendly_name": "Series Created"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_publisher . \n?x1 :type.object.type :comic_books.comic_book_series . \nVALUES ?x2 { :en.alan_moore } \n?x0 :comic_books.comic_book_publisher.comic_book_series_published ?x1 . \n?x2 :comic_books.comic_book_creator.series_created ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 229000101,
		"question": "which comic book publisher published alan oswald moore's comic books?",
		"answer": [
			"Vertigo",
			"Top Shelf Productions",
			"Avatar Press",
			"DC Comics",
			"Dark Horse Comics",
			"WildStorm"
		],
		"function": "none",
		"commonness": -22.0274509335855,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_publisher",
					"class": "comic_books.comic_book_publisher",
					"friendly_name": "Comic Book Publisher",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "comic_books.comic_book_series",
					"class": "comic_books.comic_book_series",
					"friendly_name": "Comic Book Series",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.alan_moore",
					"class": "comic_books.comic_book_creator",
					"friendly_name": "alan oswald moore",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "comic_books.comic_book_publisher.comic_book_series_published",
					"friendly_name": "Comic Book Series Published"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "comic_books.comic_book_creator.series_created",
					"friendly_name": "Series Created"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_publisher . \n?x1 :type.object.type :comic_books.comic_book_series . \nVALUES ?x2 { :en.alan_moore } \n?x0 :comic_books.comic_book_publisher.comic_book_series_published ?x1 . \n?x2 :comic_books.comic_book_creator.series_created ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 229000200,
		"question": "who is the publisher of alan moore's comic books?",
		"answer": [
			"Top Shelf Productions",
			"Vertigo",
			"WildStorm",
			"DC Comics",
			"Dark Horse Comics",
			"Avatar Press"
		],
		"function": "none",
		"commonness": -22.0274509335855,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_publisher",
					"class": "comic_books.comic_book_publisher",
					"friendly_name": "Comic Book Publisher",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "comic_books.comic_book_series",
					"class": "comic_books.comic_book_series",
					"friendly_name": "Comic Book Series",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.alan_moore",
					"class": "comic_books.comic_book_creator",
					"friendly_name": "Alan Moore",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "comic_books.comic_book_publisher.comic_book_series_published",
					"friendly_name": "Comic Book Series Published"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "comic_books.comic_book_creator.series_created",
					"friendly_name": "Series Created"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_publisher . \n?x1 :type.object.type :comic_books.comic_book_series . \nVALUES ?x2 { :en.alan_moore } \n?x0 :comic_books.comic_book_publisher.comic_book_series_published ?x1 . \n?x2 :comic_books.comic_book_creator.series_created ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 229000201,
		"question": "who is the publisher of alan oswald moore's comic books?",
		"answer": [
			"WildStorm",
			"DC Comics",
			"Dark Horse Comics",
			"Top Shelf Productions",
			"Avatar Press",
			"Vertigo"
		],
		"function": "none",
		"commonness": -22.0274509335855,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_publisher",
					"class": "comic_books.comic_book_publisher",
					"friendly_name": "Comic Book Publisher",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "comic_books.comic_book_series",
					"class": "comic_books.comic_book_series",
					"friendly_name": "Comic Book Series",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.alan_moore",
					"class": "comic_books.comic_book_creator",
					"friendly_name": "alan oswald moore",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "comic_books.comic_book_publisher.comic_book_series_published",
					"friendly_name": "Comic Book Series Published"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "comic_books.comic_book_creator.series_created",
					"friendly_name": "Series Created"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_publisher . \n?x1 :type.object.type :comic_books.comic_book_series . \nVALUES ?x2 { :en.alan_moore } \n?x0 :comic_books.comic_book_publisher.comic_book_series_published ?x1 . \n?x2 :comic_books.comic_book_creator.series_created ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 229000300,
		"question": "which publishers did alan moore collaborate with?",
		"answer": [
			"Avatar Press",
			"Dark Horse Comics",
			"Top Shelf Productions",
			"Vertigo",
			"WildStorm",
			"DC Comics"
		],
		"function": "none",
		"commonness": -22.0274509335855,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_publisher",
					"class": "comic_books.comic_book_publisher",
					"friendly_name": "Comic Book Publisher",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "comic_books.comic_book_series",
					"class": "comic_books.comic_book_series",
					"friendly_name": "Comic Book Series",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.alan_moore",
					"class": "comic_books.comic_book_creator",
					"friendly_name": "Alan Moore",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "comic_books.comic_book_publisher.comic_book_series_published",
					"friendly_name": "Comic Book Series Published"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "comic_books.comic_book_creator.series_created",
					"friendly_name": "Series Created"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_publisher . \n?x1 :type.object.type :comic_books.comic_book_series . \nVALUES ?x2 { :en.alan_moore } \n?x0 :comic_books.comic_book_publisher.comic_book_series_published ?x1 . \n?x2 :comic_books.comic_book_creator.series_created ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 229000301,
		"question": "which publishers did alan oswald moore collaborate with?",
		"answer": [
			"WildStorm",
			"Vertigo",
			"Top Shelf Productions",
			"Dark Horse Comics",
			"Avatar Press",
			"DC Comics"
		],
		"function": "none",
		"commonness": -22.0274509335855,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_publisher",
					"class": "comic_books.comic_book_publisher",
					"friendly_name": "Comic Book Publisher",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "comic_books.comic_book_series",
					"class": "comic_books.comic_book_series",
					"friendly_name": "Comic Book Series",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.alan_moore",
					"class": "comic_books.comic_book_creator",
					"friendly_name": "alan oswald moore",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "comic_books.comic_book_publisher.comic_book_series_published",
					"friendly_name": "Comic Book Series Published"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "comic_books.comic_book_creator.series_created",
					"friendly_name": "Series Created"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_publisher . \n?x1 :type.object.type :comic_books.comic_book_series . \nVALUES ?x2 { :en.alan_moore } \n?x0 :comic_books.comic_book_publisher.comic_book_series_published ?x1 . \n?x2 :comic_books.comic_book_creator.series_created ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 229000400,
		"question": "who published the comic books of alan moore?",
		"answer": [
			"WildStorm",
			"DC Comics",
			"Top Shelf Productions",
			"Avatar Press",
			"Dark Horse Comics",
			"Vertigo"
		],
		"function": "none",
		"commonness": -22.0274509335855,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_publisher",
					"class": "comic_books.comic_book_publisher",
					"friendly_name": "Comic Book Publisher",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "comic_books.comic_book_series",
					"class": "comic_books.comic_book_series",
					"friendly_name": "Comic Book Series",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.alan_moore",
					"class": "comic_books.comic_book_creator",
					"friendly_name": "Alan Moore",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "comic_books.comic_book_publisher.comic_book_series_published",
					"friendly_name": "Comic Book Series Published"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "comic_books.comic_book_creator.series_created",
					"friendly_name": "Series Created"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_publisher . \n?x1 :type.object.type :comic_books.comic_book_series . \nVALUES ?x2 { :en.alan_moore } \n?x0 :comic_books.comic_book_publisher.comic_book_series_published ?x1 . \n?x2 :comic_books.comic_book_creator.series_created ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 229000401,
		"question": "who published the comic books of alan oswald moore?",
		"answer": [
			"Top Shelf Productions",
			"Avatar Press",
			"Dark Horse Comics",
			"Vertigo",
			"WildStorm",
			"DC Comics"
		],
		"function": "none",
		"commonness": -22.0274509335855,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_publisher",
					"class": "comic_books.comic_book_publisher",
					"friendly_name": "Comic Book Publisher",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "comic_books.comic_book_series",
					"class": "comic_books.comic_book_series",
					"friendly_name": "Comic Book Series",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.alan_moore",
					"class": "comic_books.comic_book_creator",
					"friendly_name": "alan oswald moore",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "comic_books.comic_book_publisher.comic_book_series_published",
					"friendly_name": "Comic Book Series Published"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "comic_books.comic_book_creator.series_created",
					"friendly_name": "Series Created"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_publisher . \n?x1 :type.object.type :comic_books.comic_book_series . \nVALUES ?x2 { :en.alan_moore } \n?x0 :comic_books.comic_book_publisher.comic_book_series_published ?x1 . \n?x2 :comic_books.comic_book_creator.series_created ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 229000500,
		"question": "who was the publisher of the comics books of alan moore?",
		"answer": [
			"WildStorm",
			"Avatar Press",
			"DC Comics",
			"Vertigo",
			"Top Shelf Productions",
			"Dark Horse Comics"
		],
		"function": "none",
		"commonness": -22.0274509335855,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_publisher",
					"class": "comic_books.comic_book_publisher",
					"friendly_name": "Comic Book Publisher",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "comic_books.comic_book_series",
					"class": "comic_books.comic_book_series",
					"friendly_name": "Comic Book Series",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.alan_moore",
					"class": "comic_books.comic_book_creator",
					"friendly_name": "Alan Moore",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "comic_books.comic_book_publisher.comic_book_series_published",
					"friendly_name": "Comic Book Series Published"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "comic_books.comic_book_creator.series_created",
					"friendly_name": "Series Created"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_publisher . \n?x1 :type.object.type :comic_books.comic_book_series . \nVALUES ?x2 { :en.alan_moore } \n?x0 :comic_books.comic_book_publisher.comic_book_series_published ?x1 . \n?x2 :comic_books.comic_book_creator.series_created ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	}
]