[
	{
		"qid": 139000301,
		"question": "how many moa stores are there?",
		"answer": [
			"327"
		],
		"function": "count",
		"commonness": -14.597041747608918,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "business.business_location",
					"class": "business.business_location",
					"friendly_name": "Organization Location",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mall_of_america",
					"class": "business.shopping_center",
					"friendly_name": "moa",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "business.shopping_center.store",
					"friendly_name": "Stores"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :business.business_location . \nVALUES ?x1 { :en.mall_of_america } \n?x1 :business.shopping_center.store ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 139000400,
		"question": "what is the number of stores of the mall of america?",
		"answer": [
			"327"
		],
		"function": "count",
		"commonness": -14.597041747608918,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "business.business_location",
					"class": "business.business_location",
					"friendly_name": "Organization Location",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mall_of_america",
					"class": "business.shopping_center",
					"friendly_name": "Mall of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "business.shopping_center.store",
					"friendly_name": "Stores"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :business.business_location . \nVALUES ?x1 { :en.mall_of_america } \n?x1 :business.shopping_center.store ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 139000401,
		"question": "what is the number of stores of the moa?",
		"answer": [
			"327"
		],
		"function": "count",
		"commonness": -14.597041747608918,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "business.business_location",
					"class": "business.business_location",
					"friendly_name": "Organization Location",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mall_of_america",
					"class": "business.shopping_center",
					"friendly_name": "moa",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "business.shopping_center.store",
					"friendly_name": "Stores"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :business.business_location . \nVALUES ?x1 { :en.mall_of_america } \n?x1 :business.shopping_center.store ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 141000000,
		"question": "how many of donald e. smith's children are actors?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -9.261689426535522,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.actor",
					"class": "film.actor",
					"friendly_name": "Film actor",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.0gyl0yc",
					"class": "people.person",
					"friendly_name": "Donald E. Smith",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.parents",
					"friendly_name": "Parents"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.actor . \nVALUES ?x1 { :m.0gyl0yc } \n?x0 :people.person.parents ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 141000100,
		"question": "how many children of donald e. smith are film actors?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -9.261689426535522,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.actor",
					"class": "film.actor",
					"friendly_name": "Film actor",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.0gyl0yc",
					"class": "people.person",
					"friendly_name": "Donald E. Smith",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.parents",
					"friendly_name": "Parents"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.actor . \nVALUES ?x1 { :m.0gyl0yc } \n?x0 :people.person.parents ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 141000200,
		"question": "how many children of donald e. smith have a career in acting?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -9.261689426535522,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.actor",
					"class": "film.actor",
					"friendly_name": "Film actor",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.0gyl0yc",
					"class": "people.person",
					"friendly_name": "Donald E. Smith",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.parents",
					"friendly_name": "Parents"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.actor . \nVALUES ?x1 { :m.0gyl0yc } \n?x0 :people.person.parents ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 141000300,
		"question": "what is the total number of film actor children of donald e. smith?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -9.261689426535522,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.actor",
					"class": "film.actor",
					"friendly_name": "Film actor",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.0gyl0yc",
					"class": "people.person",
					"friendly_name": "Donald E. Smith",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.parents",
					"friendly_name": "Parents"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.actor . \nVALUES ?x1 { :m.0gyl0yc } \n?x0 :people.person.parents ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 141000400,
		"question": "donald e. smith has how many children that are film actors?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -9.261689426535522,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.actor",
					"class": "film.actor",
					"friendly_name": "Film actor",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.0gyl0yc",
					"class": "people.person",
					"friendly_name": "Donald E. Smith",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.parents",
					"friendly_name": "Parents"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.actor . \nVALUES ?x1 { :m.0gyl0yc } \n?x0 :people.person.parents ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 141000500,
		"question": "donald e. smith has how many children that are actors in film?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -9.261689426535522,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.actor",
					"class": "film.actor",
					"friendly_name": "Film actor",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.0gyl0yc",
					"class": "people.person",
					"friendly_name": "Donald E. Smith",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.parents",
					"friendly_name": "Parents"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.actor . \nVALUES ?x1 { :m.0gyl0yc } \n?x0 :people.person.parents ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 144000000,
		"question": "how many jewish people are tv directors?",
		"answer": [
			"117"
		],
		"function": "count",
		"commonness": -9.79194816124496,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "tv.tv_director",
					"class": "tv.tv_director",
					"friendly_name": "TV Director",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.jew",
					"class": "people.ethnicity",
					"friendly_name": "Jewish people",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "people.ethnicity.people",
					"friendly_name": "People of this ethnicity"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :tv.tv_director . \nVALUES ?x1 { :en.jew } \n?x1 :people.ethnicity.people ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 144000001,
		"question": "how many jewish are tv directors?",
		"answer": [
			"117"
		],
		"function": "count",
		"commonness": -9.79194816124496,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "tv.tv_director",
					"class": "tv.tv_director",
					"friendly_name": "TV Director",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.jew",
					"class": "people.ethnicity",
					"friendly_name": "jewish",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "people.ethnicity.people",
					"friendly_name": "People of this ethnicity"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :tv.tv_director . \nVALUES ?x1 { :en.jew } \n?x1 :people.ethnicity.people ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 144000002,
		"question": "how many jews are tv directors?",
		"answer": [
			"117"
		],
		"function": "count",
		"commonness": -9.79194816124496,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "tv.tv_director",
					"class": "tv.tv_director",
					"friendly_name": "TV Director",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.jew",
					"class": "people.ethnicity",
					"friendly_name": "jews",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "people.ethnicity.people",
					"friendly_name": "People of this ethnicity"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :tv.tv_director . \nVALUES ?x1 { :en.jew } \n?x1 :people.ethnicity.people ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 144000100,
		"question": "how many tv directors are jewish people?",
		"answer": [
			"117"
		],
		"function": "count",
		"commonness": -9.79194816124496,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "tv.tv_director",
					"class": "tv.tv_director",
					"friendly_name": "TV Director",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.jew",
					"class": "people.ethnicity",
					"friendly_name": "Jewish people",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "people.ethnicity.people",
					"friendly_name": "People of this ethnicity"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :tv.tv_director . \nVALUES ?x1 { :en.jew } \n?x1 :people.ethnicity.people ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 144000101,
		"question": "how many tv directors are jewish?",
		"answer": [
			"117"
		],
		"function": "count",
		"commonness": -9.79194816124496,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "tv.tv_director",
					"class": "tv.tv_director",
					"friendly_name": "TV Director",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.jew",
					"class": "people.ethnicity",
					"friendly_name": "jewish",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "people.ethnicity.people",
					"friendly_name": "People of this ethnicity"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :tv.tv_director . \nVALUES ?x1 { :en.jew } \n?x1 :people.ethnicity.people ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 144000200,
		"question": "what is the number of tv directors that are jewish people?",
		"answer": [
			"117"
		],
		"function": "count",
		"commonness": -9.79194816124496,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "tv.tv_director",
					"class": "tv.tv_director",
					"friendly_name": "TV Director",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.jew",
					"class": "people.ethnicity",
					"friendly_name": "Jewish people",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "people.ethnicity.people",
					"friendly_name": "People of this ethnicity"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :tv.tv_director . \nVALUES ?x1 { :en.jew } \n?x1 :people.ethnicity.people ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 144000201,
		"question": "what is the number of tv directors that are jewish?",
		"answer": [
			"117"
		],
		"function": "count",
		"commonness": -9.79194816124496,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "tv.tv_director",
					"class": "tv.tv_director",
					"friendly_name": "TV Director",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.jew",
					"class": "people.ethnicity",
					"friendly_name": "jewish",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "people.ethnicity.people",
					"friendly_name": "People of this ethnicity"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :tv.tv_director . \nVALUES ?x1 { :en.jew } \n?x1 :people.ethnicity.people ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 144000202,
		"question": "what is the number of tv directors that are jews?",
		"answer": [
			"117"
		],
		"function": "count",
		"commonness": -9.79194816124496,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "tv.tv_director",
					"class": "tv.tv_director",
					"friendly_name": "TV Director",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.jew",
					"class": "people.ethnicity",
					"friendly_name": "jews",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "people.ethnicity.people",
					"friendly_name": "People of this ethnicity"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :tv.tv_director . \nVALUES ?x1 { :en.jew } \n?x1 :people.ethnicity.people ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 145000000,
		"question": "what is the number of dublin area rapid transit alternative lines?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -17.518221396394555,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "metropolitan_transit.transit_line",
					"class": "metropolitan_transit.transit_line",
					"friendly_name": "Transit Line",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.dublin_area_rapid_transit",
					"class": "metropolitan_transit.transit_line",
					"friendly_name": "Dublin Area Rapid Transit",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "metropolitan_transit.transit_line.primary_line",
					"friendly_name": "Alternate Of Primary Line"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :metropolitan_transit.transit_line . \nVALUES ?x1 { :en.dublin_area_rapid_transit } \n?x0 :metropolitan_transit.transit_line.primary_line ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 145000001,
		"question": "what is the number of dart alternative lines?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -17.518221396394555,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "metropolitan_transit.transit_line",
					"class": "metropolitan_transit.transit_line",
					"friendly_name": "Transit Line",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.dublin_area_rapid_transit",
					"class": "metropolitan_transit.transit_line",
					"friendly_name": "dart",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "metropolitan_transit.transit_line.primary_line",
					"friendly_name": "Alternate Of Primary Line"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :metropolitan_transit.transit_line . \nVALUES ?x1 { :en.dublin_area_rapid_transit } \n?x0 :metropolitan_transit.transit_line.primary_line ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 145000002,
		"question": "what is the number of dart station alternative lines?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -17.518221396394555,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "metropolitan_transit.transit_line",
					"class": "metropolitan_transit.transit_line",
					"friendly_name": "Transit Line",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.dublin_area_rapid_transit",
					"class": "metropolitan_transit.transit_line",
					"friendly_name": "dart station",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "metropolitan_transit.transit_line.primary_line",
					"friendly_name": "Alternate Of Primary Line"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :metropolitan_transit.transit_line . \nVALUES ?x1 { :en.dublin_area_rapid_transit } \n?x0 :metropolitan_transit.transit_line.primary_line ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 145000100,
		"question": "the dublin area rapid transit has how many alternative lines?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -17.518221396394555,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "metropolitan_transit.transit_line",
					"class": "metropolitan_transit.transit_line",
					"friendly_name": "Transit Line",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.dublin_area_rapid_transit",
					"class": "metropolitan_transit.transit_line",
					"friendly_name": "Dublin Area Rapid Transit",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "metropolitan_transit.transit_line.primary_line",
					"friendly_name": "Alternate Of Primary Line"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :metropolitan_transit.transit_line . \nVALUES ?x1 { :en.dublin_area_rapid_transit } \n?x0 :metropolitan_transit.transit_line.primary_line ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 145000101,
		"question": "the dart has how many alternative lines?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -17.518221396394555,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "metropolitan_transit.transit_line",
					"class": "metropolitan_transit.transit_line",
					"friendly_name": "Transit Line",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.dublin_area_rapid_transit",
					"class": "metropolitan_transit.transit_line",
					"friendly_name": "dart",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "metropolitan_transit.transit_line.primary_line",
					"friendly_name": "Alternate Of Primary Line"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :metropolitan_transit.transit_line . \nVALUES ?x1 { :en.dublin_area_rapid_transit } \n?x0 :metropolitan_transit.transit_line.primary_line ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 145000102,
		"question": "the dart station has how many alternative lines?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -17.518221396394555,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "metropolitan_transit.transit_line",
					"class": "metropolitan_transit.transit_line",
					"friendly_name": "Transit Line",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.dublin_area_rapid_transit",
					"class": "metropolitan_transit.transit_line",
					"friendly_name": "dart station",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "metropolitan_transit.transit_line.primary_line",
					"friendly_name": "Alternate Of Primary Line"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :metropolitan_transit.transit_line . \nVALUES ?x1 { :en.dublin_area_rapid_transit } \n?x0 :metropolitan_transit.transit_line.primary_line ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 145000200,
		"question": "how many alternative lines does the dublin area rapid transit have?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -17.518221396394555,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "metropolitan_transit.transit_line",
					"class": "metropolitan_transit.transit_line",
					"friendly_name": "Transit Line",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.dublin_area_rapid_transit",
					"class": "metropolitan_transit.transit_line",
					"friendly_name": "Dublin Area Rapid Transit",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "metropolitan_transit.transit_line.primary_line",
					"friendly_name": "Alternate Of Primary Line"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :metropolitan_transit.transit_line . \nVALUES ?x1 { :en.dublin_area_rapid_transit } \n?x0 :metropolitan_transit.transit_line.primary_line ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 145000201,
		"question": "how many alternative lines does the dart have?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -17.518221396394555,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "metropolitan_transit.transit_line",
					"class": "metropolitan_transit.transit_line",
					"friendly_name": "Transit Line",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.dublin_area_rapid_transit",
					"class": "metropolitan_transit.transit_line",
					"friendly_name": "dart",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "metropolitan_transit.transit_line.primary_line",
					"friendly_name": "Alternate Of Primary Line"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :metropolitan_transit.transit_line . \nVALUES ?x1 { :en.dublin_area_rapid_transit } \n?x0 :metropolitan_transit.transit_line.primary_line ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]