[
	{
		"qid": 192000001,
		"question": "united provides which mode of transportation?",
		"answer": [
			"Air travel"
		],
		"function": "none",
		"commonness": -19.613355269160756,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "travel.transportation_mode",
					"class": "travel.transportation_mode",
					"friendly_name": "Transportation mode",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "travel.transportation",
					"class": "travel.transportation",
					"friendly_name": "Transportation",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_airlines",
					"class": "travel.transport_operator",
					"friendly_name": "united",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "travel.transportation.mode_of_transportation",
					"friendly_name": "Mode of transportation"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "travel.transportation.transport_operator",
					"friendly_name": "Transport operator"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :travel.transportation_mode . \n?x1 :type.object.type :travel.transportation . \nVALUES ?x2 { :en.united_airlines } \n?x1 :travel.transportation.mode_of_transportation ?x0 . \n?x1 :travel.transportation.transport_operator ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 192000002,
		"question": "ual provides which mode of transportation?",
		"answer": [
			"Air travel"
		],
		"function": "none",
		"commonness": -19.613355269160756,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "travel.transportation_mode",
					"class": "travel.transportation_mode",
					"friendly_name": "Transportation mode",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "travel.transportation",
					"class": "travel.transportation",
					"friendly_name": "Transportation",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_airlines",
					"class": "travel.transport_operator",
					"friendly_name": "ual",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "travel.transportation.mode_of_transportation",
					"friendly_name": "Mode of transportation"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "travel.transportation.transport_operator",
					"friendly_name": "Transport operator"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :travel.transportation_mode . \n?x1 :type.object.type :travel.transportation . \nVALUES ?x2 { :en.united_airlines } \n?x1 :travel.transportation.mode_of_transportation ?x0 . \n?x1 :travel.transportation.transport_operator ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 192000100,
		"question": "what type of transportation is provided by united airlines?",
		"answer": [
			"Air travel"
		],
		"function": "none",
		"commonness": -19.613355269160756,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "travel.transportation_mode",
					"class": "travel.transportation_mode",
					"friendly_name": "Transportation mode",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "travel.transportation",
					"class": "travel.transportation",
					"friendly_name": "Transportation",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_airlines",
					"class": "travel.transport_operator",
					"friendly_name": "United Airlines",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "travel.transportation.mode_of_transportation",
					"friendly_name": "Mode of transportation"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "travel.transportation.transport_operator",
					"friendly_name": "Transport operator"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :travel.transportation_mode . \n?x1 :type.object.type :travel.transportation . \nVALUES ?x2 { :en.united_airlines } \n?x1 :travel.transportation.mode_of_transportation ?x0 . \n?x1 :travel.transportation.transport_operator ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 192000101,
		"question": "what type of transportation is provided by united?",
		"answer": [
			"Air travel"
		],
		"function": "none",
		"commonness": -19.613355269160756,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "travel.transportation_mode",
					"class": "travel.transportation_mode",
					"friendly_name": "Transportation mode",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "travel.transportation",
					"class": "travel.transportation",
					"friendly_name": "Transportation",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_airlines",
					"class": "travel.transport_operator",
					"friendly_name": "united",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "travel.transportation.mode_of_transportation",
					"friendly_name": "Mode of transportation"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "travel.transportation.transport_operator",
					"friendly_name": "Transport operator"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :travel.transportation_mode . \n?x1 :type.object.type :travel.transportation . \nVALUES ?x2 { :en.united_airlines } \n?x1 :travel.transportation.mode_of_transportation ?x0 . \n?x1 :travel.transportation.transport_operator ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 192000102,
		"question": "what type of transportation is provided by ual?",
		"answer": [
			"Air travel"
		],
		"function": "none",
		"commonness": -19.613355269160756,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "travel.transportation_mode",
					"class": "travel.transportation_mode",
					"friendly_name": "Transportation mode",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "travel.transportation",
					"class": "travel.transportation",
					"friendly_name": "Transportation",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_airlines",
					"class": "travel.transport_operator",
					"friendly_name": "ual",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "travel.transportation.mode_of_transportation",
					"friendly_name": "Mode of transportation"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "travel.transportation.transport_operator",
					"friendly_name": "Transport operator"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :travel.transportation_mode . \n?x1 :type.object.type :travel.transportation . \nVALUES ?x2 { :en.united_airlines } \n?x1 :travel.transportation.mode_of_transportation ?x0 . \n?x1 :travel.transportation.transport_operator ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 192000200,
		"question": "what mode of transportation does united airlines provide?",
		"answer": [
			"Air travel"
		],
		"function": "none",
		"commonness": -19.613355269160756,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "travel.transportation_mode",
					"class": "travel.transportation_mode",
					"friendly_name": "Transportation mode",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "travel.transportation",
					"class": "travel.transportation",
					"friendly_name": "Transportation",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_airlines",
					"class": "travel.transport_operator",
					"friendly_name": "United Airlines",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "travel.transportation.mode_of_transportation",
					"friendly_name": "Mode of transportation"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "travel.transportation.transport_operator",
					"friendly_name": "Transport operator"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :travel.transportation_mode . \n?x1 :type.object.type :travel.transportation . \nVALUES ?x2 { :en.united_airlines } \n?x1 :travel.transportation.mode_of_transportation ?x0 . \n?x1 :travel.transportation.transport_operator ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 192000201,
		"question": "what mode of transportation does united provide?",
		"answer": [
			"Air travel"
		],
		"function": "none",
		"commonness": -19.613355269160756,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "travel.transportation_mode",
					"class": "travel.transportation_mode",
					"friendly_name": "Transportation mode",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "travel.transportation",
					"class": "travel.transportation",
					"friendly_name": "Transportation",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_airlines",
					"class": "travel.transport_operator",
					"friendly_name": "united",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "travel.transportation.mode_of_transportation",
					"friendly_name": "Mode of transportation"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "travel.transportation.transport_operator",
					"friendly_name": "Transport operator"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :travel.transportation_mode . \n?x1 :type.object.type :travel.transportation . \nVALUES ?x2 { :en.united_airlines } \n?x1 :travel.transportation.mode_of_transportation ?x0 . \n?x1 :travel.transportation.transport_operator ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 192000202,
		"question": "what mode of transportation does ual provide?",
		"answer": [
			"Air travel"
		],
		"function": "none",
		"commonness": -19.613355269160756,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "travel.transportation_mode",
					"class": "travel.transportation_mode",
					"friendly_name": "Transportation mode",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "travel.transportation",
					"class": "travel.transportation",
					"friendly_name": "Transportation",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_airlines",
					"class": "travel.transport_operator",
					"friendly_name": "ual",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "travel.transportation.mode_of_transportation",
					"friendly_name": "Mode of transportation"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "travel.transportation.transport_operator",
					"friendly_name": "Transport operator"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :travel.transportation_mode . \n?x1 :type.object.type :travel.transportation . \nVALUES ?x2 { :en.united_airlines } \n?x1 :travel.transportation.mode_of_transportation ?x0 . \n?x1 :travel.transportation.transport_operator ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 193000000,
		"question": "what kind of cpu do computers supporting the wii remote use?",
		"answer": [
			"PowerPC"
		],
		"function": "none",
		"commonness": -22.67361534912766,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.computer_processor",
					"class": "computer.computer_processor",
					"friendly_name": "Computer Processor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "computer.computer",
					"class": "computer.computer",
					"friendly_name": "Computer",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.wii_remote",
					"class": "computer.computer_peripheral",
					"friendly_name": "Wii Remote",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "computer.computer.processor",
					"friendly_name": "Processor"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "computer.computer.peripherals",
					"friendly_name": "Peripherals"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.computer_processor . \n?x1 :type.object.type :computer.computer . \nVALUES ?x2 { :en.wii_remote } \n?x1 :computer.computer.processor ?x0 . \n?x1 :computer.computer.peripherals ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 193000001,
		"question": "what kind of cpu do computers supporting the wiimote use?",
		"answer": [
			"PowerPC"
		],
		"function": "none",
		"commonness": -22.67361534912766,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.computer_processor",
					"class": "computer.computer_processor",
					"friendly_name": "Computer Processor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "computer.computer",
					"class": "computer.computer",
					"friendly_name": "Computer",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.wii_remote",
					"class": "computer.computer_peripheral",
					"friendly_name": "wiimote",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "computer.computer.processor",
					"friendly_name": "Processor"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "computer.computer.peripherals",
					"friendly_name": "Peripherals"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.computer_processor . \n?x1 :type.object.type :computer.computer . \nVALUES ?x2 { :en.wii_remote } \n?x1 :computer.computer.processor ?x0 . \n?x1 :computer.computer.peripherals ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 193000002,
		"question": "what kind of cpu do computers supporting the wii use?",
		"answer": [
			"PowerPC"
		],
		"function": "none",
		"commonness": -22.67361534912766,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.computer_processor",
					"class": "computer.computer_processor",
					"friendly_name": "Computer Processor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "computer.computer",
					"class": "computer.computer",
					"friendly_name": "Computer",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.wii_remote",
					"class": "computer.computer_peripheral",
					"friendly_name": "wii",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "computer.computer.processor",
					"friendly_name": "Processor"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "computer.computer.peripherals",
					"friendly_name": "Peripherals"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.computer_processor . \n?x1 :type.object.type :computer.computer . \nVALUES ?x2 { :en.wii_remote } \n?x1 :computer.computer.processor ?x0 . \n?x1 :computer.computer.peripherals ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 193000100,
		"question": "computers supporting wii remote are equiped with what kind of cpu?",
		"answer": [
			"PowerPC"
		],
		"function": "none",
		"commonness": -22.67361534912766,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.computer_processor",
					"class": "computer.computer_processor",
					"friendly_name": "Computer Processor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "computer.computer",
					"class": "computer.computer",
					"friendly_name": "Computer",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.wii_remote",
					"class": "computer.computer_peripheral",
					"friendly_name": "Wii Remote",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "computer.computer.processor",
					"friendly_name": "Processor"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "computer.computer.peripherals",
					"friendly_name": "Peripherals"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.computer_processor . \n?x1 :type.object.type :computer.computer . \nVALUES ?x2 { :en.wii_remote } \n?x1 :computer.computer.processor ?x0 . \n?x1 :computer.computer.peripherals ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 193000101,
		"question": "computers supporting wiimote are equiped with what kind of cpu?",
		"answer": [
			"PowerPC"
		],
		"function": "none",
		"commonness": -22.67361534912766,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.computer_processor",
					"class": "computer.computer_processor",
					"friendly_name": "Computer Processor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "computer.computer",
					"class": "computer.computer",
					"friendly_name": "Computer",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.wii_remote",
					"class": "computer.computer_peripheral",
					"friendly_name": "wiimote",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "computer.computer.processor",
					"friendly_name": "Processor"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "computer.computer.peripherals",
					"friendly_name": "Peripherals"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.computer_processor . \n?x1 :type.object.type :computer.computer . \nVALUES ?x2 { :en.wii_remote } \n?x1 :computer.computer.processor ?x0 . \n?x1 :computer.computer.peripherals ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 193000102,
		"question": "computers supporting wii are equiped with what kind of cpu?",
		"answer": [
			"PowerPC"
		],
		"function": "none",
		"commonness": -22.67361534912766,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.computer_processor",
					"class": "computer.computer_processor",
					"friendly_name": "Computer Processor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "computer.computer",
					"class": "computer.computer",
					"friendly_name": "Computer",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.wii_remote",
					"class": "computer.computer_peripheral",
					"friendly_name": "wii",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "computer.computer.processor",
					"friendly_name": "Processor"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "computer.computer.peripherals",
					"friendly_name": "Peripherals"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.computer_processor . \n?x1 :type.object.type :computer.computer . \nVALUES ?x2 { :en.wii_remote } \n?x1 :computer.computer.processor ?x0 . \n?x1 :computer.computer.peripherals ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 193000200,
		"question": "what processors are used in computers with wii remote?",
		"answer": [
			"PowerPC"
		],
		"function": "none",
		"commonness": -22.67361534912766,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.computer_processor",
					"class": "computer.computer_processor",
					"friendly_name": "Computer Processor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "computer.computer",
					"class": "computer.computer",
					"friendly_name": "Computer",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.wii_remote",
					"class": "computer.computer_peripheral",
					"friendly_name": "Wii Remote",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "computer.computer.processor",
					"friendly_name": "Processor"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "computer.computer.peripherals",
					"friendly_name": "Peripherals"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.computer_processor . \n?x1 :type.object.type :computer.computer . \nVALUES ?x2 { :en.wii_remote } \n?x1 :computer.computer.processor ?x0 . \n?x1 :computer.computer.peripherals ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 193000201,
		"question": "what processors are used in computers with wiimote?",
		"answer": [
			"PowerPC"
		],
		"function": "none",
		"commonness": -22.67361534912766,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.computer_processor",
					"class": "computer.computer_processor",
					"friendly_name": "Computer Processor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "computer.computer",
					"class": "computer.computer",
					"friendly_name": "Computer",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.wii_remote",
					"class": "computer.computer_peripheral",
					"friendly_name": "wiimote",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "computer.computer.processor",
					"friendly_name": "Processor"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "computer.computer.peripherals",
					"friendly_name": "Peripherals"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.computer_processor . \n?x1 :type.object.type :computer.computer . \nVALUES ?x2 { :en.wii_remote } \n?x1 :computer.computer.processor ?x0 . \n?x1 :computer.computer.peripherals ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 193000202,
		"question": "what processors are used in computers with wii?",
		"answer": [
			"PowerPC"
		],
		"function": "none",
		"commonness": -22.67361534912766,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.computer_processor",
					"class": "computer.computer_processor",
					"friendly_name": "Computer Processor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "computer.computer",
					"class": "computer.computer",
					"friendly_name": "Computer",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.wii_remote",
					"class": "computer.computer_peripheral",
					"friendly_name": "wii",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "computer.computer.processor",
					"friendly_name": "Processor"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "computer.computer.peripherals",
					"friendly_name": "Peripherals"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.computer_processor . \n?x1 :type.object.type :computer.computer . \nVALUES ?x2 { :en.wii_remote } \n?x1 :computer.computer.processor ?x0 . \n?x1 :computer.computer.peripherals ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 193000300,
		"question": "what kind of cpu is in computers that support wii remote?",
		"answer": [
			"PowerPC"
		],
		"function": "none",
		"commonness": -22.67361534912766,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.computer_processor",
					"class": "computer.computer_processor",
					"friendly_name": "Computer Processor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "computer.computer",
					"class": "computer.computer",
					"friendly_name": "Computer",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.wii_remote",
					"class": "computer.computer_peripheral",
					"friendly_name": "Wii Remote",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "computer.computer.processor",
					"friendly_name": "Processor"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "computer.computer.peripherals",
					"friendly_name": "Peripherals"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.computer_processor . \n?x1 :type.object.type :computer.computer . \nVALUES ?x2 { :en.wii_remote } \n?x1 :computer.computer.processor ?x0 . \n?x1 :computer.computer.peripherals ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	}
]