[
	{
		"qid": 208000100,
		"question": "find the periodic table block that contains chemical elements with covalent radius 160.0 pm.",
		"answer": [
			"d-block"
		],
		"function": "none",
		"commonness": -30.66769738687801,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "chemistry.periodic_table_block",
					"class": "chemistry.periodic_table_block",
					"friendly_name": "Periodic table block",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "chemistry.chemical_element",
					"class": "chemistry.chemical_element",
					"friendly_name": "Chemical Element",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "160.0^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "160.0",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "chemistry.periodic_table_block.elements",
					"friendly_name": "Elements"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "chemistry.chemical_element.covalent_radius",
					"friendly_name": "Covalent radius"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :chemistry.periodic_table_block . \n?x1 :type.object.type :chemistry.chemical_element . \nVALUES ?x2 { \"160.0\"^^<http://www.w3.org/2001/XMLSchema#int> \"160.0\"^^<http://www.w3.org/2001/XMLSchema#integer> \"160.0\"^^<http://www.w3.org/2001/XMLSchema#double> } \n?x0 :chemistry.periodic_table_block.elements ?x1 . \n?x1 :chemistry.chemical_element.covalent_radius ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 208000200,
		"question": "the covalent radius of 160.0 pm describes an element in which periodic table block?",
		"answer": [
			"d-block"
		],
		"function": "none",
		"commonness": -30.66769738687801,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "chemistry.periodic_table_block",
					"class": "chemistry.periodic_table_block",
					"friendly_name": "Periodic table block",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "chemistry.chemical_element",
					"class": "chemistry.chemical_element",
					"friendly_name": "Chemical Element",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "160.0^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "160.0",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "chemistry.periodic_table_block.elements",
					"friendly_name": "Elements"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "chemistry.chemical_element.covalent_radius",
					"friendly_name": "Covalent radius"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :chemistry.periodic_table_block . \n?x1 :type.object.type :chemistry.chemical_element . \nVALUES ?x2 { \"160.0\"^^<http://www.w3.org/2001/XMLSchema#int> \"160.0\"^^<http://www.w3.org/2001/XMLSchema#integer> \"160.0\"^^<http://www.w3.org/2001/XMLSchema#double> } \n?x0 :chemistry.periodic_table_block.elements ?x1 . \n?x1 :chemistry.chemical_element.covalent_radius ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 208000300,
		"question": "which periodic table block contains an element whose covalent radius is 160.0 pm?",
		"answer": [
			"d-block"
		],
		"function": "none",
		"commonness": -30.66769738687801,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "chemistry.periodic_table_block",
					"class": "chemistry.periodic_table_block",
					"friendly_name": "Periodic table block",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "chemistry.chemical_element",
					"class": "chemistry.chemical_element",
					"friendly_name": "Chemical Element",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "160.0^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "160.0",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "chemistry.periodic_table_block.elements",
					"friendly_name": "Elements"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "chemistry.chemical_element.covalent_radius",
					"friendly_name": "Covalent radius"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :chemistry.periodic_table_block . \n?x1 :type.object.type :chemistry.chemical_element . \nVALUES ?x2 { \"160.0\"^^<http://www.w3.org/2001/XMLSchema#int> \"160.0\"^^<http://www.w3.org/2001/XMLSchema#integer> \"160.0\"^^<http://www.w3.org/2001/XMLSchema#double> } \n?x0 :chemistry.periodic_table_block.elements ?x1 . \n?x1 :chemistry.chemical_element.covalent_radius ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 208000400,
		"question": "in the periodic table, which block has an element with a covalent radius of 160.0 pm?",
		"answer": [
			"d-block"
		],
		"function": "none",
		"commonness": -30.66769738687801,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "chemistry.periodic_table_block",
					"class": "chemistry.periodic_table_block",
					"friendly_name": "Periodic table block",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "chemistry.chemical_element",
					"class": "chemistry.chemical_element",
					"friendly_name": "Chemical Element",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "160.0^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "160.0",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "chemistry.periodic_table_block.elements",
					"friendly_name": "Elements"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "chemistry.chemical_element.covalent_radius",
					"friendly_name": "Covalent radius"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :chemistry.periodic_table_block . \n?x1 :type.object.type :chemistry.chemical_element . \nVALUES ?x2 { \"160.0\"^^<http://www.w3.org/2001/XMLSchema#int> \"160.0\"^^<http://www.w3.org/2001/XMLSchema#integer> \"160.0\"^^<http://www.w3.org/2001/XMLSchema#double> } \n?x0 :chemistry.periodic_table_block.elements ?x1 . \n?x1 :chemistry.chemical_element.covalent_radius ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 209000000,
		"question": "the asteroid with the smallest absolute magnitude belongs to which group?",
		"answer": [
			"Asteroid belt"
		],
		"function": "argmin",
		"commonness": -27.666969789936328,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.asteroid_group",
					"class": "astronomy.asteroid_group",
					"friendly_name": "Asteroid Group",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "astronomy.asteroid",
					"class": "astronomy.asteroid",
					"friendly_name": "Asteroid",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "14.3^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "14.3",
					"question_node": 0,
					"function": "argmin"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "astronomy.asteroid.member_of_asteroid_group",
					"friendly_name": "Member of Asteroid Group"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "astronomy.celestial_object.absolute_magnitude",
					"friendly_name": "Absolute Magnitude"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.asteroid_group . \n?x1 :type.object.type :astronomy.asteroid . \n{\nSELECT (MIN(?y2) AS ?x2)  WHERE { \n?y0 :type.object.type :astronomy.asteroid_group . \n?y1 :type.object.type :astronomy.asteroid . \n?y1 :astronomy.asteroid.member_of_asteroid_group ?y0 . \n?y1 :astronomy.celestial_object.absolute_magnitude ?y2 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y1 != ?y2  )\n}\n}\n?x1 :astronomy.asteroid.member_of_asteroid_group ?x0 . \n?x1 :astronomy.celestial_object.absolute_magnitude ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 209000100,
		"question": "what group does the darkest asteroid belong to?",
		"answer": [
			"Asteroid belt"
		],
		"function": "argmin",
		"commonness": -27.666969789936328,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.asteroid_group",
					"class": "astronomy.asteroid_group",
					"friendly_name": "Asteroid Group",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "astronomy.asteroid",
					"class": "astronomy.asteroid",
					"friendly_name": "Asteroid",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "14.3^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "14.3",
					"question_node": 0,
					"function": "argmin"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "astronomy.asteroid.member_of_asteroid_group",
					"friendly_name": "Member of Asteroid Group"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "astronomy.celestial_object.absolute_magnitude",
					"friendly_name": "Absolute Magnitude"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.asteroid_group . \n?x1 :type.object.type :astronomy.asteroid . \n{\nSELECT (MIN(?y2) AS ?x2)  WHERE { \n?y0 :type.object.type :astronomy.asteroid_group . \n?y1 :type.object.type :astronomy.asteroid . \n?y1 :astronomy.asteroid.member_of_asteroid_group ?y0 . \n?y1 :astronomy.celestial_object.absolute_magnitude ?y2 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y1 != ?y2  )\n}\n}\n?x1 :astronomy.asteroid.member_of_asteroid_group ?x0 . \n?x1 :astronomy.celestial_object.absolute_magnitude ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 209000200,
		"question": "which group does the smallest asteroid by magnitude belong to?",
		"answer": [
			"Asteroid belt"
		],
		"function": "argmin",
		"commonness": -27.666969789936328,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.asteroid_group",
					"class": "astronomy.asteroid_group",
					"friendly_name": "Asteroid Group",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "astronomy.asteroid",
					"class": "astronomy.asteroid",
					"friendly_name": "Asteroid",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "14.3^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "14.3",
					"question_node": 0,
					"function": "argmin"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "astronomy.asteroid.member_of_asteroid_group",
					"friendly_name": "Member of Asteroid Group"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "astronomy.celestial_object.absolute_magnitude",
					"friendly_name": "Absolute Magnitude"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.asteroid_group . \n?x1 :type.object.type :astronomy.asteroid . \n{\nSELECT (MIN(?y2) AS ?x2)  WHERE { \n?y0 :type.object.type :astronomy.asteroid_group . \n?y1 :type.object.type :astronomy.asteroid . \n?y1 :astronomy.asteroid.member_of_asteroid_group ?y0 . \n?y1 :astronomy.celestial_object.absolute_magnitude ?y2 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y1 != ?y2  )\n}\n}\n?x1 :astronomy.asteroid.member_of_asteroid_group ?x0 . \n?x1 :astronomy.celestial_object.absolute_magnitude ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 209000300,
		"question": "what group does the asteroid with the smallest absolute magnitude belong to?",
		"answer": [
			"Asteroid belt"
		],
		"function": "argmin",
		"commonness": -27.666969789936328,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.asteroid_group",
					"class": "astronomy.asteroid_group",
					"friendly_name": "Asteroid Group",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "astronomy.asteroid",
					"class": "astronomy.asteroid",
					"friendly_name": "Asteroid",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "14.3^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "14.3",
					"question_node": 0,
					"function": "argmin"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "astronomy.asteroid.member_of_asteroid_group",
					"friendly_name": "Member of Asteroid Group"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "astronomy.celestial_object.absolute_magnitude",
					"friendly_name": "Absolute Magnitude"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.asteroid_group . \n?x1 :type.object.type :astronomy.asteroid . \n{\nSELECT (MIN(?y2) AS ?x2)  WHERE { \n?y0 :type.object.type :astronomy.asteroid_group . \n?y1 :type.object.type :astronomy.asteroid . \n?y1 :astronomy.asteroid.member_of_asteroid_group ?y0 . \n?y1 :astronomy.celestial_object.absolute_magnitude ?y2 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y1 != ?y2  )\n}\n}\n?x1 :astronomy.asteroid.member_of_asteroid_group ?x0 . \n?x1 :astronomy.celestial_object.absolute_magnitude ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 209000400,
		"question": "what's the group of the darkest asteroid?",
		"answer": [
			"Asteroid belt"
		],
		"function": "argmin",
		"commonness": -27.666969789936328,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.asteroid_group",
					"class": "astronomy.asteroid_group",
					"friendly_name": "Asteroid Group",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "astronomy.asteroid",
					"class": "astronomy.asteroid",
					"friendly_name": "Asteroid",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "14.3^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "14.3",
					"question_node": 0,
					"function": "argmin"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "astronomy.asteroid.member_of_asteroid_group",
					"friendly_name": "Member of Asteroid Group"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "astronomy.celestial_object.absolute_magnitude",
					"friendly_name": "Absolute Magnitude"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.asteroid_group . \n?x1 :type.object.type :astronomy.asteroid . \n{\nSELECT (MIN(?y2) AS ?x2)  WHERE { \n?y0 :type.object.type :astronomy.asteroid_group . \n?y1 :type.object.type :astronomy.asteroid . \n?y1 :astronomy.asteroid.member_of_asteroid_group ?y0 . \n?y1 :astronomy.celestial_object.absolute_magnitude ?y2 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y1 != ?y2  )\n}\n}\n?x1 :astronomy.asteroid.member_of_asteroid_group ?x0 . \n?x1 :astronomy.celestial_object.absolute_magnitude ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 210000001,
		"question": "how many cities made a bid for the beijing olympics?",
		"answer": [
			"5"
		],
		"function": "count",
		"commonness": -21.34560336979508,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "olympics.olympic_bidding_city",
					"class": "olympics.olympic_bidding_city",
					"friendly_name": "Olympic bidding city",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "olympics.olympic_city_bid",
					"class": "olympics.olympic_city_bid",
					"friendly_name": "Olympic city bid",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "beijing olympics",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "olympics.olympic_bidding_city.olympics_bid_on",
					"friendly_name": "Olympics bid on"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "olympics.olympic_city_bid.olympic_games",
					"friendly_name": "Olympic games"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :olympics.olympic_bidding_city . \n?x1 :type.object.type :olympics.olympic_city_bid . \nVALUES ?x2 { :en.2008_summer_olympics } \n?x0 :olympics.olympic_bidding_city.olympics_bid_on ?x1 . \n?x1 :olympics.olympic_city_bid.olympic_games ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 210000002,
		"question": "how many cities made a bid for the 2008 olympic games?",
		"answer": [
			"5"
		],
		"function": "count",
		"commonness": -21.34560336979508,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "olympics.olympic_bidding_city",
					"class": "olympics.olympic_bidding_city",
					"friendly_name": "Olympic bidding city",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "olympics.olympic_city_bid",
					"class": "olympics.olympic_city_bid",
					"friendly_name": "Olympic city bid",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "2008 olympic games",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "olympics.olympic_bidding_city.olympics_bid_on",
					"friendly_name": "Olympics bid on"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "olympics.olympic_city_bid.olympic_games",
					"friendly_name": "Olympic games"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :olympics.olympic_bidding_city . \n?x1 :type.object.type :olympics.olympic_city_bid . \nVALUES ?x2 { :en.2008_summer_olympics } \n?x0 :olympics.olympic_bidding_city.olympics_bid_on ?x1 . \n?x1 :olympics.olympic_city_bid.olympic_games ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 210000101,
		"question": "how many bids from cities did the beijing olympics have?",
		"answer": [
			"5"
		],
		"function": "count",
		"commonness": -21.34560336979508,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "olympics.olympic_bidding_city",
					"class": "olympics.olympic_bidding_city",
					"friendly_name": "Olympic bidding city",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "olympics.olympic_city_bid",
					"class": "olympics.olympic_city_bid",
					"friendly_name": "Olympic city bid",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "beijing olympics",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "olympics.olympic_bidding_city.olympics_bid_on",
					"friendly_name": "Olympics bid on"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "olympics.olympic_city_bid.olympic_games",
					"friendly_name": "Olympic games"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :olympics.olympic_bidding_city . \n?x1 :type.object.type :olympics.olympic_city_bid . \nVALUES ?x2 { :en.2008_summer_olympics } \n?x0 :olympics.olympic_bidding_city.olympics_bid_on ?x1 . \n?x1 :olympics.olympic_city_bid.olympic_games ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 210000102,
		"question": "how many bids from cities did the 2008 olympic games have?",
		"answer": [
			"5"
		],
		"function": "count",
		"commonness": -21.34560336979508,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "olympics.olympic_bidding_city",
					"class": "olympics.olympic_bidding_city",
					"friendly_name": "Olympic bidding city",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "olympics.olympic_city_bid",
					"class": "olympics.olympic_city_bid",
					"friendly_name": "Olympic city bid",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "2008 olympic games",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "olympics.olympic_bidding_city.olympics_bid_on",
					"friendly_name": "Olympics bid on"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "olympics.olympic_city_bid.olympic_games",
					"friendly_name": "Olympic games"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :olympics.olympic_bidding_city . \n?x1 :type.object.type :olympics.olympic_city_bid . \nVALUES ?x2 { :en.2008_summer_olympics } \n?x0 :olympics.olympic_bidding_city.olympics_bid_on ?x1 . \n?x1 :olympics.olympic_city_bid.olympic_games ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 210000200,
		"question": "what number of cities bid to host the 2008 summer olympics?",
		"answer": [
			"5"
		],
		"function": "count",
		"commonness": -21.34560336979508,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "olympics.olympic_bidding_city",
					"class": "olympics.olympic_bidding_city",
					"friendly_name": "Olympic bidding city",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "olympics.olympic_city_bid",
					"class": "olympics.olympic_city_bid",
					"friendly_name": "Olympic city bid",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "2008 Summer Olympics",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "olympics.olympic_bidding_city.olympics_bid_on",
					"friendly_name": "Olympics bid on"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "olympics.olympic_city_bid.olympic_games",
					"friendly_name": "Olympic games"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :olympics.olympic_bidding_city . \n?x1 :type.object.type :olympics.olympic_city_bid . \nVALUES ?x2 { :en.2008_summer_olympics } \n?x0 :olympics.olympic_bidding_city.olympics_bid_on ?x1 . \n?x1 :olympics.olympic_city_bid.olympic_games ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 210000300,
		"question": "how many cities placed a bid on hosting the 2008 summer olympics?",
		"answer": [
			"5"
		],
		"function": "count",
		"commonness": -21.34560336979508,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "olympics.olympic_bidding_city",
					"class": "olympics.olympic_bidding_city",
					"friendly_name": "Olympic bidding city",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "olympics.olympic_city_bid",
					"class": "olympics.olympic_city_bid",
					"friendly_name": "Olympic city bid",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "2008 Summer Olympics",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "olympics.olympic_bidding_city.olympics_bid_on",
					"friendly_name": "Olympics bid on"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "olympics.olympic_city_bid.olympic_games",
					"friendly_name": "Olympic games"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :olympics.olympic_bidding_city . \n?x1 :type.object.type :olympics.olympic_city_bid . \nVALUES ?x2 { :en.2008_summer_olympics } \n?x0 :olympics.olympic_bidding_city.olympics_bid_on ?x1 . \n?x1 :olympics.olympic_city_bid.olympic_games ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 210000301,
		"question": "how many cities placed a bid on hosting the beijing olympics?",
		"answer": [
			"5"
		],
		"function": "count",
		"commonness": -21.34560336979508,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "olympics.olympic_bidding_city",
					"class": "olympics.olympic_bidding_city",
					"friendly_name": "Olympic bidding city",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "olympics.olympic_city_bid",
					"class": "olympics.olympic_city_bid",
					"friendly_name": "Olympic city bid",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "beijing olympics",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "olympics.olympic_bidding_city.olympics_bid_on",
					"friendly_name": "Olympics bid on"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "olympics.olympic_city_bid.olympic_games",
					"friendly_name": "Olympic games"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :olympics.olympic_bidding_city . \n?x1 :type.object.type :olympics.olympic_city_bid . \nVALUES ?x2 { :en.2008_summer_olympics } \n?x0 :olympics.olympic_bidding_city.olympics_bid_on ?x1 . \n?x1 :olympics.olympic_city_bid.olympic_games ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	}
]