[
	{
		"qid": 224000000,
		"question": "what news-reporting organizations reported the 2008 summer olympics?",
		"answer": [
			"British Broadcasting Corporation"
		],
		"function": "none",
		"commonness": -20.36633159288857,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.newsevents.news_reporting_organisation",
					"class": "base.newsevents.news_reporting_organisation",
					"friendly_name": "News-reporting organisation",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.newsevents.news_report",
					"class": "base.newsevents.news_report",
					"friendly_name": "News-report",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "base.newsevents.news_reported_event",
					"friendly_name": "2008 Summer Olympics",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.newsevents.news_report.news_reporting_organisation",
					"friendly_name": "News-reporting organisation"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.newsevents.news_report.event",
					"friendly_name": "Event"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.newsevents.news_reporting_organisation . \n?x1 :type.object.type :base.newsevents.news_report . \nVALUES ?x2 { :en.2008_summer_olympics } \n?x1 :base.newsevents.news_report.news_reporting_organisation ?x0 . \n?x1 :base.newsevents.news_report.event ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 224000001,
		"question": "what news-reporting organizations reported the beijing olympics?",
		"answer": [
			"British Broadcasting Corporation"
		],
		"function": "none",
		"commonness": -20.36633159288857,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.newsevents.news_reporting_organisation",
					"class": "base.newsevents.news_reporting_organisation",
					"friendly_name": "News-reporting organisation",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.newsevents.news_report",
					"class": "base.newsevents.news_report",
					"friendly_name": "News-report",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "base.newsevents.news_reported_event",
					"friendly_name": "beijing olympics",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.newsevents.news_report.news_reporting_organisation",
					"friendly_name": "News-reporting organisation"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.newsevents.news_report.event",
					"friendly_name": "Event"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.newsevents.news_reporting_organisation . \n?x1 :type.object.type :base.newsevents.news_report . \nVALUES ?x2 { :en.2008_summer_olympics } \n?x1 :base.newsevents.news_report.news_reporting_organisation ?x0 . \n?x1 :base.newsevents.news_report.event ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 224000002,
		"question": "what news-reporting organizations reported the 2008 olympic games?",
		"answer": [
			"British Broadcasting Corporation"
		],
		"function": "none",
		"commonness": -20.36633159288857,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.newsevents.news_reporting_organisation",
					"class": "base.newsevents.news_reporting_organisation",
					"friendly_name": "News-reporting organisation",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.newsevents.news_report",
					"class": "base.newsevents.news_report",
					"friendly_name": "News-report",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "base.newsevents.news_reported_event",
					"friendly_name": "2008 olympic games",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.newsevents.news_report.news_reporting_organisation",
					"friendly_name": "News-reporting organisation"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.newsevents.news_report.event",
					"friendly_name": "Event"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.newsevents.news_reporting_organisation . \n?x1 :type.object.type :base.newsevents.news_report . \nVALUES ?x2 { :en.2008_summer_olympics } \n?x1 :base.newsevents.news_report.news_reporting_organisation ?x0 . \n?x1 :base.newsevents.news_report.event ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 224000200,
		"question": "which news organizations reported on the 2008 summer olympics?",
		"answer": [
			"British Broadcasting Corporation"
		],
		"function": "none",
		"commonness": -20.36633159288857,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.newsevents.news_reporting_organisation",
					"class": "base.newsevents.news_reporting_organisation",
					"friendly_name": "News-reporting organisation",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.newsevents.news_report",
					"class": "base.newsevents.news_report",
					"friendly_name": "News-report",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "base.newsevents.news_reported_event",
					"friendly_name": "2008 Summer Olympics",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.newsevents.news_report.news_reporting_organisation",
					"friendly_name": "News-reporting organisation"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.newsevents.news_report.event",
					"friendly_name": "Event"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.newsevents.news_reporting_organisation . \n?x1 :type.object.type :base.newsevents.news_report . \nVALUES ?x2 { :en.2008_summer_olympics } \n?x1 :base.newsevents.news_report.news_reporting_organisation ?x0 . \n?x1 :base.newsevents.news_report.event ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 224000201,
		"question": "which news organizations reported on the beijing olympics?",
		"answer": [
			"British Broadcasting Corporation"
		],
		"function": "none",
		"commonness": -20.36633159288857,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.newsevents.news_reporting_organisation",
					"class": "base.newsevents.news_reporting_organisation",
					"friendly_name": "News-reporting organisation",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.newsevents.news_report",
					"class": "base.newsevents.news_report",
					"friendly_name": "News-report",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "base.newsevents.news_reported_event",
					"friendly_name": "beijing olympics",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.newsevents.news_report.news_reporting_organisation",
					"friendly_name": "News-reporting organisation"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.newsevents.news_report.event",
					"friendly_name": "Event"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.newsevents.news_reporting_organisation . \n?x1 :type.object.type :base.newsevents.news_report . \nVALUES ?x2 { :en.2008_summer_olympics } \n?x1 :base.newsevents.news_report.news_reporting_organisation ?x0 . \n?x1 :base.newsevents.news_report.event ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 224000202,
		"question": "which news organizations reported on the 2008 olympic games?",
		"answer": [
			"British Broadcasting Corporation"
		],
		"function": "none",
		"commonness": -20.36633159288857,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.newsevents.news_reporting_organisation",
					"class": "base.newsevents.news_reporting_organisation",
					"friendly_name": "News-reporting organisation",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.newsevents.news_report",
					"class": "base.newsevents.news_report",
					"friendly_name": "News-report",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "base.newsevents.news_reported_event",
					"friendly_name": "2008 olympic games",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.newsevents.news_report.news_reporting_organisation",
					"friendly_name": "News-reporting organisation"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.newsevents.news_report.event",
					"friendly_name": "Event"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.newsevents.news_reporting_organisation . \n?x1 :type.object.type :base.newsevents.news_report . \nVALUES ?x2 { :en.2008_summer_olympics } \n?x1 :base.newsevents.news_report.news_reporting_organisation ?x0 . \n?x1 :base.newsevents.news_report.event ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 224000300,
		"question": "what news organizations participated in the 2008 summer olympics?",
		"answer": [
			"British Broadcasting Corporation"
		],
		"function": "none",
		"commonness": -20.36633159288857,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.newsevents.news_reporting_organisation",
					"class": "base.newsevents.news_reporting_organisation",
					"friendly_name": "News-reporting organisation",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.newsevents.news_report",
					"class": "base.newsevents.news_report",
					"friendly_name": "News-report",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "base.newsevents.news_reported_event",
					"friendly_name": "2008 Summer Olympics",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.newsevents.news_report.news_reporting_organisation",
					"friendly_name": "News-reporting organisation"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.newsevents.news_report.event",
					"friendly_name": "Event"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.newsevents.news_reporting_organisation . \n?x1 :type.object.type :base.newsevents.news_report . \nVALUES ?x2 { :en.2008_summer_olympics } \n?x1 :base.newsevents.news_report.news_reporting_organisation ?x0 . \n?x1 :base.newsevents.news_report.event ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 224000301,
		"question": "what news organizations participated in the beijing olympics?",
		"answer": [
			"British Broadcasting Corporation"
		],
		"function": "none",
		"commonness": -20.36633159288857,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.newsevents.news_reporting_organisation",
					"class": "base.newsevents.news_reporting_organisation",
					"friendly_name": "News-reporting organisation",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.newsevents.news_report",
					"class": "base.newsevents.news_report",
					"friendly_name": "News-report",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "base.newsevents.news_reported_event",
					"friendly_name": "beijing olympics",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.newsevents.news_report.news_reporting_organisation",
					"friendly_name": "News-reporting organisation"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.newsevents.news_report.event",
					"friendly_name": "Event"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.newsevents.news_reporting_organisation . \n?x1 :type.object.type :base.newsevents.news_report . \nVALUES ?x2 { :en.2008_summer_olympics } \n?x1 :base.newsevents.news_report.news_reporting_organisation ?x0 . \n?x1 :base.newsevents.news_report.event ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 224000302,
		"question": "what news organizations participated in the 2008 olympic games?",
		"answer": [
			"British Broadcasting Corporation"
		],
		"function": "none",
		"commonness": -20.36633159288857,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.newsevents.news_reporting_organisation",
					"class": "base.newsevents.news_reporting_organisation",
					"friendly_name": "News-reporting organisation",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.newsevents.news_report",
					"class": "base.newsevents.news_report",
					"friendly_name": "News-report",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "base.newsevents.news_reported_event",
					"friendly_name": "2008 olympic games",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.newsevents.news_report.news_reporting_organisation",
					"friendly_name": "News-reporting organisation"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.newsevents.news_report.event",
					"friendly_name": "Event"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.newsevents.news_reporting_organisation . \n?x1 :type.object.type :base.newsevents.news_report . \nVALUES ?x2 { :en.2008_summer_olympics } \n?x1 :base.newsevents.news_report.news_reporting_organisation ?x0 . \n?x1 :base.newsevents.news_report.event ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 225000000,
		"question": "what equipment is used to play both scuba diving and bog snorkelling?",
		"answer": [
			"Swimfin"
		],
		"function": "none",
		"commonness": -27.779770259441403,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.sports_equipment",
					"class": "sports.sports_equipment",
					"friendly_name": "Sports Equipment",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.scuba_diving",
					"class": "sports.sport",
					"friendly_name": "Scuba diving",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.bog_snorkelling",
					"class": "sports.sport",
					"friendly_name": "Bog snorkelling",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.sports_equipment.sport_used_for",
					"friendly_name": "Sport used for"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "sports.sports_equipment.sport_used_for",
					"friendly_name": "Sport used for"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.sports_equipment . \nVALUES ?x1 { :en.scuba_diving } \nVALUES ?x2 { :en.bog_snorkelling } \n?x0 :sports.sports_equipment.sport_used_for ?x1 . \n?x0 :sports.sports_equipment.sport_used_for ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 225000001,
		"question": "what equipment is used to play both scuba diving and world bog snorkelling championship?",
		"answer": [
			"Swimfin"
		],
		"function": "none",
		"commonness": -27.779770259441403,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.sports_equipment",
					"class": "sports.sports_equipment",
					"friendly_name": "Sports Equipment",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.scuba_diving",
					"class": "sports.sport",
					"friendly_name": "Scuba diving",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.bog_snorkelling",
					"class": "sports.sport",
					"friendly_name": "world bog snorkelling championship",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.sports_equipment.sport_used_for",
					"friendly_name": "Sport used for"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "sports.sports_equipment.sport_used_for",
					"friendly_name": "Sport used for"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.sports_equipment . \nVALUES ?x1 { :en.scuba_diving } \nVALUES ?x2 { :en.bog_snorkelling } \n?x0 :sports.sports_equipment.sport_used_for ?x1 . \n?x0 :sports.sports_equipment.sport_used_for ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 225000002,
		"question": "what equipment is used to play both scuba diving and bog snorkeling?",
		"answer": [
			"Swimfin"
		],
		"function": "none",
		"commonness": -27.779770259441403,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.sports_equipment",
					"class": "sports.sports_equipment",
					"friendly_name": "Sports Equipment",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.scuba_diving",
					"class": "sports.sport",
					"friendly_name": "Scuba diving",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.bog_snorkelling",
					"class": "sports.sport",
					"friendly_name": "bog snorkeling",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.sports_equipment.sport_used_for",
					"friendly_name": "Sport used for"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "sports.sports_equipment.sport_used_for",
					"friendly_name": "Sport used for"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.sports_equipment . \nVALUES ?x1 { :en.scuba_diving } \nVALUES ?x2 { :en.bog_snorkelling } \n?x0 :sports.sports_equipment.sport_used_for ?x1 . \n?x0 :sports.sports_equipment.sport_used_for ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 225000100,
		"question": "what equipment, if any, are used in both scuba diving and bog snorkelling?",
		"answer": [
			"Swimfin"
		],
		"function": "none",
		"commonness": -27.779770259441403,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.sports_equipment",
					"class": "sports.sports_equipment",
					"friendly_name": "Sports Equipment",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.scuba_diving",
					"class": "sports.sport",
					"friendly_name": "Scuba diving",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.bog_snorkelling",
					"class": "sports.sport",
					"friendly_name": "Bog snorkelling",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.sports_equipment.sport_used_for",
					"friendly_name": "Sport used for"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "sports.sports_equipment.sport_used_for",
					"friendly_name": "Sport used for"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.sports_equipment . \nVALUES ?x1 { :en.scuba_diving } \nVALUES ?x2 { :en.bog_snorkelling } \n?x0 :sports.sports_equipment.sport_used_for ?x1 . \n?x0 :sports.sports_equipment.sport_used_for ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 225000101,
		"question": "what equipment, if any, are used in both scuba diving and world bog snorkelling championship?",
		"answer": [
			"Swimfin"
		],
		"function": "none",
		"commonness": -27.779770259441403,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.sports_equipment",
					"class": "sports.sports_equipment",
					"friendly_name": "Sports Equipment",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.scuba_diving",
					"class": "sports.sport",
					"friendly_name": "Scuba diving",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.bog_snorkelling",
					"class": "sports.sport",
					"friendly_name": "world bog snorkelling championship",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.sports_equipment.sport_used_for",
					"friendly_name": "Sport used for"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "sports.sports_equipment.sport_used_for",
					"friendly_name": "Sport used for"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.sports_equipment . \nVALUES ?x1 { :en.scuba_diving } \nVALUES ?x2 { :en.bog_snorkelling } \n?x0 :sports.sports_equipment.sport_used_for ?x1 . \n?x0 :sports.sports_equipment.sport_used_for ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 225000102,
		"question": "what equipment, if any, are used in both scuba diving and bog snorkeling?",
		"answer": [
			"Swimfin"
		],
		"function": "none",
		"commonness": -27.779770259441403,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.sports_equipment",
					"class": "sports.sports_equipment",
					"friendly_name": "Sports Equipment",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.scuba_diving",
					"class": "sports.sport",
					"friendly_name": "Scuba diving",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.bog_snorkelling",
					"class": "sports.sport",
					"friendly_name": "bog snorkeling",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.sports_equipment.sport_used_for",
					"friendly_name": "Sport used for"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "sports.sports_equipment.sport_used_for",
					"friendly_name": "Sport used for"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.sports_equipment . \nVALUES ?x1 { :en.scuba_diving } \nVALUES ?x2 { :en.bog_snorkelling } \n?x0 :sports.sports_equipment.sport_used_for ?x1 . \n?x0 :sports.sports_equipment.sport_used_for ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 225000200,
		"question": "what equipment is used in both scuba diving and bog snorkelling?",
		"answer": [
			"Swimfin"
		],
		"function": "none",
		"commonness": -27.779770259441403,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.sports_equipment",
					"class": "sports.sports_equipment",
					"friendly_name": "Sports Equipment",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.scuba_diving",
					"class": "sports.sport",
					"friendly_name": "Scuba diving",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.bog_snorkelling",
					"class": "sports.sport",
					"friendly_name": "Bog snorkelling",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.sports_equipment.sport_used_for",
					"friendly_name": "Sport used for"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "sports.sports_equipment.sport_used_for",
					"friendly_name": "Sport used for"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.sports_equipment . \nVALUES ?x1 { :en.scuba_diving } \nVALUES ?x2 { :en.bog_snorkelling } \n?x0 :sports.sports_equipment.sport_used_for ?x1 . \n?x0 :sports.sports_equipment.sport_used_for ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 225000201,
		"question": "what equipment is used in both scuba diving and world bog snorkelling championship?",
		"answer": [
			"Swimfin"
		],
		"function": "none",
		"commonness": -27.779770259441403,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.sports_equipment",
					"class": "sports.sports_equipment",
					"friendly_name": "Sports Equipment",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.scuba_diving",
					"class": "sports.sport",
					"friendly_name": "Scuba diving",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.bog_snorkelling",
					"class": "sports.sport",
					"friendly_name": "world bog snorkelling championship",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.sports_equipment.sport_used_for",
					"friendly_name": "Sport used for"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "sports.sports_equipment.sport_used_for",
					"friendly_name": "Sport used for"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.sports_equipment . \nVALUES ?x1 { :en.scuba_diving } \nVALUES ?x2 { :en.bog_snorkelling } \n?x0 :sports.sports_equipment.sport_used_for ?x1 . \n?x0 :sports.sports_equipment.sport_used_for ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	}
]