[
	{
		"qid": 27000201,
		"question": "what are activism issues that address nazi?",
		"answer": [
			"Racism",
			"Anti-communism",
			"Militarism",
			"Totalitarianism",
			"Antisemitism",
			"Nationalism",
			"Anti-parliamentarism",
			"Fascism",
			"Collectivism"
		],
		"function": "none",
		"commonness": -12.075511593165825,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.activism.activism_issue",
					"class": "base.activism.activism_issue",
					"friendly_name": "Activism issue",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nazism",
					"class": "base.activism.activism_issue",
					"friendly_name": "nazi",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.activism.activism_issue.includes_issues",
					"friendly_name": "Includes issues"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.activism.activism_issue . \nVALUES ?x1 { :en.nazism } \n?x0 :base.activism.activism_issue.includes_issues ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 27000202,
		"question": "what are activism issues that address nazis?",
		"answer": [
			"Racism",
			"Totalitarianism",
			"Antisemitism",
			"Anti-communism",
			"Nationalism",
			"Collectivism",
			"Militarism",
			"Fascism",
			"Anti-parliamentarism"
		],
		"function": "none",
		"commonness": -12.075511593165825,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.activism.activism_issue",
					"class": "base.activism.activism_issue",
					"friendly_name": "Activism issue",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nazism",
					"class": "base.activism.activism_issue",
					"friendly_name": "nazis",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.activism.activism_issue.includes_issues",
					"friendly_name": "Includes issues"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.activism.activism_issue . \nVALUES ?x1 { :en.nazism } \n?x0 :base.activism.activism_issue.includes_issues ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 28000000,
		"question": "the ipad is classified as what type of gadget?",
		"answer": [
			"Internet tablet"
		],
		"function": "none",
		"commonness": -14.038101775072624,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gadgets.gadget_category",
					"class": "base.gadgets.gadget_category",
					"friendly_name": "Gadget Category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ipad",
					"class": "base.gadgets.gadget",
					"friendly_name": "iPad",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.gadgets.gadget.category",
					"friendly_name": "Category"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gadgets.gadget_category . \nVALUES ?x1 { :en.ipad } \n?x1 :base.gadgets.gadget.category ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 28000001,
		"question": "the apple ipad is classified as what type of gadget?",
		"answer": [
			"Internet tablet"
		],
		"function": "none",
		"commonness": -14.038101775072624,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gadgets.gadget_category",
					"class": "base.gadgets.gadget_category",
					"friendly_name": "Gadget Category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ipad",
					"class": "base.gadgets.gadget",
					"friendly_name": "apple ipad",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.gadgets.gadget.category",
					"friendly_name": "Category"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gadgets.gadget_category . \nVALUES ?x1 { :en.ipad } \n?x1 :base.gadgets.gadget.category ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 28000100,
		"question": "what kind of gadget is ipad?",
		"answer": [
			"Internet tablet"
		],
		"function": "none",
		"commonness": -14.038101775072624,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gadgets.gadget_category",
					"class": "base.gadgets.gadget_category",
					"friendly_name": "Gadget Category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ipad",
					"class": "base.gadgets.gadget",
					"friendly_name": "iPad",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.gadgets.gadget.category",
					"friendly_name": "Category"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gadgets.gadget_category . \nVALUES ?x1 { :en.ipad } \n?x1 :base.gadgets.gadget.category ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 28000101,
		"question": "what kind of gadget is apple ipad?",
		"answer": [
			"Internet tablet"
		],
		"function": "none",
		"commonness": -14.038101775072624,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gadgets.gadget_category",
					"class": "base.gadgets.gadget_category",
					"friendly_name": "Gadget Category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ipad",
					"class": "base.gadgets.gadget",
					"friendly_name": "apple ipad",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.gadgets.gadget.category",
					"friendly_name": "Category"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gadgets.gadget_category . \nVALUES ?x1 { :en.ipad } \n?x1 :base.gadgets.gadget.category ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 28000200,
		"question": "what is the ipad classified as?",
		"answer": [
			"Internet tablet"
		],
		"function": "none",
		"commonness": -14.038101775072624,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gadgets.gadget_category",
					"class": "base.gadgets.gadget_category",
					"friendly_name": "Gadget Category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ipad",
					"class": "base.gadgets.gadget",
					"friendly_name": "iPad",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.gadgets.gadget.category",
					"friendly_name": "Category"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gadgets.gadget_category . \nVALUES ?x1 { :en.ipad } \n?x1 :base.gadgets.gadget.category ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 28000201,
		"question": "what is the apple ipad classified as?",
		"answer": [
			"Internet tablet"
		],
		"function": "none",
		"commonness": -14.038101775072624,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gadgets.gadget_category",
					"class": "base.gadgets.gadget_category",
					"friendly_name": "Gadget Category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ipad",
					"class": "base.gadgets.gadget",
					"friendly_name": "apple ipad",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.gadgets.gadget.category",
					"friendly_name": "Category"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gadgets.gadget_category . \nVALUES ?x1 { :en.ipad } \n?x1 :base.gadgets.gadget.category ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 28000300,
		"question": "which gadget category does ipad belong to?",
		"answer": [
			"Internet tablet"
		],
		"function": "none",
		"commonness": -14.038101775072624,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gadgets.gadget_category",
					"class": "base.gadgets.gadget_category",
					"friendly_name": "Gadget Category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ipad",
					"class": "base.gadgets.gadget",
					"friendly_name": "iPad",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.gadgets.gadget.category",
					"friendly_name": "Category"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gadgets.gadget_category . \nVALUES ?x1 { :en.ipad } \n?x1 :base.gadgets.gadget.category ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 28000301,
		"question": "which gadget category does apple ipad belong to?",
		"answer": [
			"Internet tablet"
		],
		"function": "none",
		"commonness": -14.038101775072624,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gadgets.gadget_category",
					"class": "base.gadgets.gadget_category",
					"friendly_name": "Gadget Category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ipad",
					"class": "base.gadgets.gadget",
					"friendly_name": "apple ipad",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.gadgets.gadget.category",
					"friendly_name": "Category"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gadgets.gadget_category . \nVALUES ?x1 { :en.ipad } \n?x1 :base.gadgets.gadget.category ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 28000400,
		"question": "what gadget category does ipad fall into?",
		"answer": [
			"Internet tablet"
		],
		"function": "none",
		"commonness": -14.038101775072624,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gadgets.gadget_category",
					"class": "base.gadgets.gadget_category",
					"friendly_name": "Gadget Category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ipad",
					"class": "base.gadgets.gadget",
					"friendly_name": "iPad",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.gadgets.gadget.category",
					"friendly_name": "Category"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gadgets.gadget_category . \nVALUES ?x1 { :en.ipad } \n?x1 :base.gadgets.gadget.category ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 28000401,
		"question": "what gadget category does apple ipad fall into?",
		"answer": [
			"Internet tablet"
		],
		"function": "none",
		"commonness": -14.038101775072624,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gadgets.gadget_category",
					"class": "base.gadgets.gadget_category",
					"friendly_name": "Gadget Category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ipad",
					"class": "base.gadgets.gadget",
					"friendly_name": "apple ipad",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.gadgets.gadget.category",
					"friendly_name": "Category"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gadgets.gadget_category . \nVALUES ?x1 { :en.ipad } \n?x1 :base.gadgets.gadget.category ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 29000000,
		"question": "which company makes the ipod?",
		"answer": [
			"Apple"
		],
		"function": "none",
		"commonness": -12.135613916614275,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gadgets.brand",
					"class": "base.gadgets.brand",
					"friendly_name": "Brand",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ipod",
					"class": "base.gadgets.gadget",
					"friendly_name": "iPod",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.gadgets.gadget.brand",
					"friendly_name": "Brand"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gadgets.brand . \nVALUES ?x1 { :en.ipod } \n?x1 :base.gadgets.gadget.brand ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 29000001,
		"question": "which company makes the apple ipod?",
		"answer": [
			"Apple"
		],
		"function": "none",
		"commonness": -12.135613916614275,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gadgets.brand",
					"class": "base.gadgets.brand",
					"friendly_name": "Brand",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ipod",
					"class": "base.gadgets.gadget",
					"friendly_name": "apple ipod",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.gadgets.gadget.brand",
					"friendly_name": "Brand"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gadgets.brand . \nVALUES ?x1 { :en.ipod } \n?x1 :base.gadgets.gadget.brand ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 29000200,
		"question": "which commercial brand is associated with the ipod?",
		"answer": [
			"Apple"
		],
		"function": "none",
		"commonness": -12.135613916614275,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gadgets.brand",
					"class": "base.gadgets.brand",
					"friendly_name": "Brand",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ipod",
					"class": "base.gadgets.gadget",
					"friendly_name": "iPod",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.gadgets.gadget.brand",
					"friendly_name": "Brand"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gadgets.brand . \nVALUES ?x1 { :en.ipod } \n?x1 :base.gadgets.gadget.brand ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 29000201,
		"question": "which commercial brand is associated with the apple ipod?",
		"answer": [
			"Apple"
		],
		"function": "none",
		"commonness": -12.135613916614275,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gadgets.brand",
					"class": "base.gadgets.brand",
					"friendly_name": "Brand",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ipod",
					"class": "base.gadgets.gadget",
					"friendly_name": "apple ipod",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.gadgets.gadget.brand",
					"friendly_name": "Brand"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gadgets.brand . \nVALUES ?x1 { :en.ipod } \n?x1 :base.gadgets.gadget.brand ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 29000300,
		"question": "name the ipod brand?",
		"answer": [
			"Apple"
		],
		"function": "none",
		"commonness": -12.135613916614275,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gadgets.brand",
					"class": "base.gadgets.brand",
					"friendly_name": "Brand",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ipod",
					"class": "base.gadgets.gadget",
					"friendly_name": "iPod",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.gadgets.gadget.brand",
					"friendly_name": "Brand"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gadgets.brand . \nVALUES ?x1 { :en.ipod } \n?x1 :base.gadgets.gadget.brand ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 29000301,
		"question": "name the apple ipod brand?",
		"answer": [
			"Apple"
		],
		"function": "none",
		"commonness": -12.135613916614275,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gadgets.brand",
					"class": "base.gadgets.brand",
					"friendly_name": "Brand",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ipod",
					"class": "base.gadgets.gadget",
					"friendly_name": "apple ipod",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.gadgets.gadget.brand",
					"friendly_name": "Brand"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gadgets.brand . \nVALUES ?x1 { :en.ipod } \n?x1 :base.gadgets.gadget.brand ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 29000400,
		"question": "what is the brand of ipod?",
		"answer": [
			"Apple"
		],
		"function": "none",
		"commonness": -12.135613916614275,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gadgets.brand",
					"class": "base.gadgets.brand",
					"friendly_name": "Brand",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ipod",
					"class": "base.gadgets.gadget",
					"friendly_name": "iPod",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.gadgets.gadget.brand",
					"friendly_name": "Brand"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gadgets.brand . \nVALUES ?x1 { :en.ipod } \n?x1 :base.gadgets.gadget.brand ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 29000401,
		"question": "what is the brand of apple ipod?",
		"answer": [
			"Apple"
		],
		"function": "none",
		"commonness": -12.135613916614275,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gadgets.brand",
					"class": "base.gadgets.brand",
					"friendly_name": "Brand",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ipod",
					"class": "base.gadgets.gadget",
					"friendly_name": "apple ipod",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.gadgets.gadget.brand",
					"friendly_name": "Brand"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gadgets.brand . \nVALUES ?x1 { :en.ipod } \n?x1 :base.gadgets.gadget.brand ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 29000500,
		"question": "which brand owns ipod?",
		"answer": [
			"Apple"
		],
		"function": "none",
		"commonness": -12.135613916614275,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gadgets.brand",
					"class": "base.gadgets.brand",
					"friendly_name": "Brand",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ipod",
					"class": "base.gadgets.gadget",
					"friendly_name": "iPod",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.gadgets.gadget.brand",
					"friendly_name": "Brand"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gadgets.brand . \nVALUES ?x1 { :en.ipod } \n?x1 :base.gadgets.gadget.brand ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 29000501,
		"question": "which brand owns apple ipod?",
		"answer": [
			"Apple"
		],
		"function": "none",
		"commonness": -12.135613916614275,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gadgets.brand",
					"class": "base.gadgets.brand",
					"friendly_name": "Brand",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ipod",
					"class": "base.gadgets.gadget",
					"friendly_name": "apple ipod",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.gadgets.gadget.brand",
					"friendly_name": "Brand"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gadgets.brand . \nVALUES ?x1 { :en.ipod } \n?x1 :base.gadgets.gadget.brand ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 30000000,
		"question": "which flying sites can be found in the united states of america?",
		"answer": [
			"Dunlap",
			"Yosemite National Park",
			"Slide Mountain"
		],
		"function": "none",
		"commonness": -8.325382642589407,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.bigsky.site",
					"class": "base.bigsky.site",
					"friendly_name": "Flying Site",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.location",
					"friendly_name": "United States of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "location.location.containedby",
					"friendly_name": "Contained by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.bigsky.site . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :location.location.containedby ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 30000001,
		"question": "which flying sites can be found in the us?",
		"answer": [
			"Yosemite National Park",
			"Slide Mountain",
			"Dunlap"
		],
		"function": "none",
		"commonness": -8.325382642589407,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.bigsky.site",
					"class": "base.bigsky.site",
					"friendly_name": "Flying Site",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.location",
					"friendly_name": "us",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "location.location.containedby",
					"friendly_name": "Contained by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.bigsky.site . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :location.location.containedby ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 30000002,
		"question": "which flying sites can be found in the united states?",
		"answer": [
			"Dunlap",
			"Yosemite National Park",
			"Slide Mountain"
		],
		"function": "none",
		"commonness": -8.325382642589407,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.bigsky.site",
					"class": "base.bigsky.site",
					"friendly_name": "Flying Site",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.location",
					"friendly_name": "united states",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "location.location.containedby",
					"friendly_name": "Contained by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.bigsky.site . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :location.location.containedby ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 30000100,
		"question": "which hang gliding and paragliding flying sites are located in the united states of america?",
		"answer": [
			"Yosemite National Park",
			"Slide Mountain",
			"Dunlap"
		],
		"function": "none",
		"commonness": -8.325382642589407,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.bigsky.site",
					"class": "base.bigsky.site",
					"friendly_name": "Flying Site",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.location",
					"friendly_name": "United States of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "location.location.containedby",
					"friendly_name": "Contained by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.bigsky.site . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :location.location.containedby ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]