[
	{
		"qid": 24000002,
		"question": "what's the name of team csc's general manager?",
		"answer": [
			"Bjarne Riis"
		],
		"function": "none",
		"commonness": -18.42626988711012,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.peleton.cycling_team_staff",
					"class": "base.peleton.cycling_team_staff",
					"friendly_name": "Cycling Team Staff",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.team_csc",
					"class": "base.peleton.cycling_team_professional",
					"friendly_name": "team csc",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.peleton.cycling_team_professional.general_manager",
					"friendly_name": "General Manager"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.peleton.cycling_team_staff . \nVALUES ?x1 { :en.team_csc } \n?x1 :base.peleton.cycling_team_professional.general_manager ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 24000100,
		"question": "who is the general manager of team saxo bank-sungard?",
		"answer": [
			"Bjarne Riis"
		],
		"function": "none",
		"commonness": -18.42626988711012,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.peleton.cycling_team_staff",
					"class": "base.peleton.cycling_team_staff",
					"friendly_name": "Cycling Team Staff",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.team_csc",
					"class": "base.peleton.cycling_team_professional",
					"friendly_name": "Team Saxo Bank-SunGard",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.peleton.cycling_team_professional.general_manager",
					"friendly_name": "General Manager"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.peleton.cycling_team_staff . \nVALUES ?x1 { :en.team_csc } \n?x1 :base.peleton.cycling_team_professional.general_manager ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 24000101,
		"question": "who is the general manager of csc?",
		"answer": [
			"Bjarne Riis"
		],
		"function": "none",
		"commonness": -18.42626988711012,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.peleton.cycling_team_staff",
					"class": "base.peleton.cycling_team_staff",
					"friendly_name": "Cycling Team Staff",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.team_csc",
					"class": "base.peleton.cycling_team_professional",
					"friendly_name": "csc",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.peleton.cycling_team_professional.general_manager",
					"friendly_name": "General Manager"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.peleton.cycling_team_staff . \nVALUES ?x1 { :en.team_csc } \n?x1 :base.peleton.cycling_team_professional.general_manager ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 24000102,
		"question": "who is the general manager of team csc?",
		"answer": [
			"Bjarne Riis"
		],
		"function": "none",
		"commonness": -18.42626988711012,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.peleton.cycling_team_staff",
					"class": "base.peleton.cycling_team_staff",
					"friendly_name": "Cycling Team Staff",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.team_csc",
					"class": "base.peleton.cycling_team_professional",
					"friendly_name": "team csc",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.peleton.cycling_team_professional.general_manager",
					"friendly_name": "General Manager"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.peleton.cycling_team_staff . \nVALUES ?x1 { :en.team_csc } \n?x1 :base.peleton.cycling_team_professional.general_manager ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 24000200,
		"question": "team saxo bank-sungard is managed by whom?",
		"answer": [
			"Bjarne Riis"
		],
		"function": "none",
		"commonness": -18.42626988711012,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.peleton.cycling_team_staff",
					"class": "base.peleton.cycling_team_staff",
					"friendly_name": "Cycling Team Staff",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.team_csc",
					"class": "base.peleton.cycling_team_professional",
					"friendly_name": "Team Saxo Bank-SunGard",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.peleton.cycling_team_professional.general_manager",
					"friendly_name": "General Manager"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.peleton.cycling_team_staff . \nVALUES ?x1 { :en.team_csc } \n?x1 :base.peleton.cycling_team_professional.general_manager ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 24000201,
		"question": "csc is managed by whom?",
		"answer": [
			"Bjarne Riis"
		],
		"function": "none",
		"commonness": -18.42626988711012,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.peleton.cycling_team_staff",
					"class": "base.peleton.cycling_team_staff",
					"friendly_name": "Cycling Team Staff",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.team_csc",
					"class": "base.peleton.cycling_team_professional",
					"friendly_name": "csc",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.peleton.cycling_team_professional.general_manager",
					"friendly_name": "General Manager"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.peleton.cycling_team_staff . \nVALUES ?x1 { :en.team_csc } \n?x1 :base.peleton.cycling_team_professional.general_manager ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 24000202,
		"question": "team csc is managed by whom?",
		"answer": [
			"Bjarne Riis"
		],
		"function": "none",
		"commonness": -18.42626988711012,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.peleton.cycling_team_staff",
					"class": "base.peleton.cycling_team_staff",
					"friendly_name": "Cycling Team Staff",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.team_csc",
					"class": "base.peleton.cycling_team_professional",
					"friendly_name": "team csc",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.peleton.cycling_team_professional.general_manager",
					"friendly_name": "General Manager"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.peleton.cycling_team_staff . \nVALUES ?x1 { :en.team_csc } \n?x1 :base.peleton.cycling_team_professional.general_manager ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 24000301,
		"question": "csc's general manager is who?",
		"answer": [
			"Bjarne Riis"
		],
		"function": "none",
		"commonness": -18.42626988711012,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.peleton.cycling_team_staff",
					"class": "base.peleton.cycling_team_staff",
					"friendly_name": "Cycling Team Staff",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.team_csc",
					"class": "base.peleton.cycling_team_professional",
					"friendly_name": "csc",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.peleton.cycling_team_professional.general_manager",
					"friendly_name": "General Manager"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.peleton.cycling_team_staff . \nVALUES ?x1 { :en.team_csc } \n?x1 :base.peleton.cycling_team_professional.general_manager ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 24000302,
		"question": "team csc's general manager is who?",
		"answer": [
			"Bjarne Riis"
		],
		"function": "none",
		"commonness": -18.42626988711012,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.peleton.cycling_team_staff",
					"class": "base.peleton.cycling_team_staff",
					"friendly_name": "Cycling Team Staff",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.team_csc",
					"class": "base.peleton.cycling_team_professional",
					"friendly_name": "team csc",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.peleton.cycling_team_professional.general_manager",
					"friendly_name": "General Manager"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.peleton.cycling_team_staff . \nVALUES ?x1 { :en.team_csc } \n?x1 :base.peleton.cycling_team_professional.general_manager ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 25000000,
		"question": "what botanical gardens are located in washington, d.c.?",
		"answer": [
			"United States Botanic Garden"
		],
		"function": "none",
		"commonness": -14.241838854470409,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.greatgardens.botanical_garden",
					"class": "base.greatgardens.botanical_garden",
					"friendly_name": "Botanical garden",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.washington_united_states",
					"class": "location.location",
					"friendly_name": "Washington, D.C.",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.greatgardens.botanical_garden.location",
					"friendly_name": "Location"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.greatgardens.botanical_garden . \nVALUES ?x1 { :en.washington_united_states } \n?x0 :base.greatgardens.botanical_garden.location ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 25000100,
		"question": "what botanical gardens are there in washington, d.c.?",
		"answer": [
			"United States Botanic Garden"
		],
		"function": "none",
		"commonness": -14.241838854470409,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.greatgardens.botanical_garden",
					"class": "base.greatgardens.botanical_garden",
					"friendly_name": "Botanical garden",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.washington_united_states",
					"class": "location.location",
					"friendly_name": "Washington, D.C.",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.greatgardens.botanical_garden.location",
					"friendly_name": "Location"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.greatgardens.botanical_garden . \nVALUES ?x1 { :en.washington_united_states } \n?x0 :base.greatgardens.botanical_garden.location ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 25000101,
		"question": "what botanical gardens are there in washington?",
		"answer": [
			"United States Botanic Garden"
		],
		"function": "none",
		"commonness": -14.241838854470409,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.greatgardens.botanical_garden",
					"class": "base.greatgardens.botanical_garden",
					"friendly_name": "Botanical garden",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.washington_united_states",
					"class": "location.location",
					"friendly_name": "washington",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.greatgardens.botanical_garden.location",
					"friendly_name": "Location"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.greatgardens.botanical_garden . \nVALUES ?x1 { :en.washington_united_states } \n?x0 :base.greatgardens.botanical_garden.location ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 25000200,
		"question": "what botanical gardens to visit in washington, d.c.?",
		"answer": [
			"United States Botanic Garden"
		],
		"function": "none",
		"commonness": -14.241838854470409,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.greatgardens.botanical_garden",
					"class": "base.greatgardens.botanical_garden",
					"friendly_name": "Botanical garden",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.washington_united_states",
					"class": "location.location",
					"friendly_name": "Washington, D.C.",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.greatgardens.botanical_garden.location",
					"friendly_name": "Location"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.greatgardens.botanical_garden . \nVALUES ?x1 { :en.washington_united_states } \n?x0 :base.greatgardens.botanical_garden.location ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 25000201,
		"question": "what botanical gardens to visit in washington?",
		"answer": [
			"United States Botanic Garden"
		],
		"function": "none",
		"commonness": -14.241838854470409,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.greatgardens.botanical_garden",
					"class": "base.greatgardens.botanical_garden",
					"friendly_name": "Botanical garden",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.washington_united_states",
					"class": "location.location",
					"friendly_name": "washington",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.greatgardens.botanical_garden.location",
					"friendly_name": "Location"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.greatgardens.botanical_garden . \nVALUES ?x1 { :en.washington_united_states } \n?x0 :base.greatgardens.botanical_garden.location ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 25000300,
		"question": "where are botanical gardens located in washington, d.c.?",
		"answer": [
			"United States Botanic Garden"
		],
		"function": "none",
		"commonness": -14.241838854470409,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.greatgardens.botanical_garden",
					"class": "base.greatgardens.botanical_garden",
					"friendly_name": "Botanical garden",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.washington_united_states",
					"class": "location.location",
					"friendly_name": "Washington, D.C.",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.greatgardens.botanical_garden.location",
					"friendly_name": "Location"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.greatgardens.botanical_garden . \nVALUES ?x1 { :en.washington_united_states } \n?x0 :base.greatgardens.botanical_garden.location ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 25000301,
		"question": "where are botanical gardens located in washington?",
		"answer": [
			"United States Botanic Garden"
		],
		"function": "none",
		"commonness": -14.241838854470409,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.greatgardens.botanical_garden",
					"class": "base.greatgardens.botanical_garden",
					"friendly_name": "Botanical garden",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.washington_united_states",
					"class": "location.location",
					"friendly_name": "washington",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.greatgardens.botanical_garden.location",
					"friendly_name": "Location"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.greatgardens.botanical_garden . \nVALUES ?x1 { :en.washington_united_states } \n?x0 :base.greatgardens.botanical_garden.location ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 26000000,
		"question": "george bush has been impersonated by which impressionists?",
		"answer": [
			"Rich Little",
			"Chris Parnell",
			"Will Ferrell",
			"Dana Carvey"
		],
		"function": "none",
		"commonness": -13.583295838679394,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.celebrity_impressionist",
					"class": "base.americancomedy.celebrity_impressionist",
					"friendly_name": "Celebrity impressionist",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.george_w_bush",
					"class": "base.americancomedy.impersonated_celebrity",
					"friendly_name": "George Bush",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.americancomedy.celebrity_impressionist.celebrities_impersonated",
					"friendly_name": "Celebrities impersonated"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.celebrity_impressionist . \nVALUES ?x1 { :en.george_w_bush } \n?x0 :base.americancomedy.celebrity_impressionist.celebrities_impersonated ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 26000001,
		"question": "bush has been impersonated by which impressionists?",
		"answer": [
			"Dana Carvey",
			"Chris Parnell",
			"Rich Little",
			"Will Ferrell"
		],
		"function": "none",
		"commonness": -13.583295838679394,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.celebrity_impressionist",
					"class": "base.americancomedy.celebrity_impressionist",
					"friendly_name": "Celebrity impressionist",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.george_w_bush",
					"class": "base.americancomedy.impersonated_celebrity",
					"friendly_name": "bush",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.americancomedy.celebrity_impressionist.celebrities_impersonated",
					"friendly_name": "Celebrities impersonated"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.celebrity_impressionist . \nVALUES ?x1 { :en.george_w_bush } \n?x0 :base.americancomedy.celebrity_impressionist.celebrities_impersonated ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 26000002,
		"question": "george w. bush has been impersonated by which impressionists?",
		"answer": [
			"Rich Little",
			"Chris Parnell",
			"Dana Carvey",
			"Will Ferrell"
		],
		"function": "none",
		"commonness": -13.583295838679394,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.celebrity_impressionist",
					"class": "base.americancomedy.celebrity_impressionist",
					"friendly_name": "Celebrity impressionist",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.george_w_bush",
					"class": "base.americancomedy.impersonated_celebrity",
					"friendly_name": "george w. bush",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.americancomedy.celebrity_impressionist.celebrities_impersonated",
					"friendly_name": "Celebrities impersonated"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.celebrity_impressionist . \nVALUES ?x1 { :en.george_w_bush } \n?x0 :base.americancomedy.celebrity_impressionist.celebrities_impersonated ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 26000100,
		"question": "which impressionists ever impersonated george bush?",
		"answer": [
			"Chris Parnell",
			"Dana Carvey",
			"Will Ferrell",
			"Rich Little"
		],
		"function": "none",
		"commonness": -13.583295838679394,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.celebrity_impressionist",
					"class": "base.americancomedy.celebrity_impressionist",
					"friendly_name": "Celebrity impressionist",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.george_w_bush",
					"class": "base.americancomedy.impersonated_celebrity",
					"friendly_name": "George Bush",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.americancomedy.celebrity_impressionist.celebrities_impersonated",
					"friendly_name": "Celebrities impersonated"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.celebrity_impressionist . \nVALUES ?x1 { :en.george_w_bush } \n?x0 :base.americancomedy.celebrity_impressionist.celebrities_impersonated ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 26000101,
		"question": "which impressionists ever impersonated bush?",
		"answer": [
			"Chris Parnell",
			"Will Ferrell",
			"Dana Carvey",
			"Rich Little"
		],
		"function": "none",
		"commonness": -13.583295838679394,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.celebrity_impressionist",
					"class": "base.americancomedy.celebrity_impressionist",
					"friendly_name": "Celebrity impressionist",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.george_w_bush",
					"class": "base.americancomedy.impersonated_celebrity",
					"friendly_name": "bush",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.americancomedy.celebrity_impressionist.celebrities_impersonated",
					"friendly_name": "Celebrities impersonated"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.celebrity_impressionist . \nVALUES ?x1 { :en.george_w_bush } \n?x0 :base.americancomedy.celebrity_impressionist.celebrities_impersonated ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 26000102,
		"question": "which impressionists ever impersonated george w. bush?",
		"answer": [
			"Dana Carvey",
			"Rich Little",
			"Will Ferrell",
			"Chris Parnell"
		],
		"function": "none",
		"commonness": -13.583295838679394,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.celebrity_impressionist",
					"class": "base.americancomedy.celebrity_impressionist",
					"friendly_name": "Celebrity impressionist",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.george_w_bush",
					"class": "base.americancomedy.impersonated_celebrity",
					"friendly_name": "george w. bush",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.americancomedy.celebrity_impressionist.celebrities_impersonated",
					"friendly_name": "Celebrities impersonated"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.celebrity_impressionist . \nVALUES ?x1 { :en.george_w_bush } \n?x0 :base.americancomedy.celebrity_impressionist.celebrities_impersonated ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 26000200,
		"question": "which impressionist does the george bush impression?",
		"answer": [
			"Chris Parnell",
			"Will Ferrell",
			"Dana Carvey",
			"Rich Little"
		],
		"function": "none",
		"commonness": -13.583295838679394,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.celebrity_impressionist",
					"class": "base.americancomedy.celebrity_impressionist",
					"friendly_name": "Celebrity impressionist",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.george_w_bush",
					"class": "base.americancomedy.impersonated_celebrity",
					"friendly_name": "George Bush",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.americancomedy.celebrity_impressionist.celebrities_impersonated",
					"friendly_name": "Celebrities impersonated"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.celebrity_impressionist . \nVALUES ?x1 { :en.george_w_bush } \n?x0 :base.americancomedy.celebrity_impressionist.celebrities_impersonated ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]