[
	{
		"qid": 182000500,
		"question": "what amenities are available at the restaurant of chef avi bikszer?",
		"answer": [
			"Kid Friendly",
			"Take-out food"
		],
		"function": "none",
		"commonness": -39.363870110303736,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.services.restaurant_amenities",
					"class": "base.services.restaurant_amenities",
					"friendly_name": "Restaurant amenities",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.services.restaurant_additions",
					"class": "base.services.restaurant_additions",
					"friendly_name": "Restaurant",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "m.0dl9dd6",
					"class": "dining.chef",
					"friendly_name": "Avi Bikszer",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.services.restaurant_amenities.restaurants_with_amenity",
					"friendly_name": "Restaurants"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.services.restaurant_additions.chef",
					"friendly_name": "Chef"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.services.restaurant_amenities . \n?x1 :type.object.type :base.services.restaurant_additions . \nVALUES ?x2 { :m.0dl9dd6 } \n?x0 :base.services.restaurant_amenities.restaurants_with_amenity ?x1 . \n?x1 :base.services.restaurant_additions.chef ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 183000000,
		"question": "what nutrients are contained in coca-cola?",
		"answer": [
			"Betaine",
			"Lipid",
			"Ash",
			"Sugar",
			"Water",
			"Protein",
			"Caffeine",
			"Choline",
			"Calcium",
			"Sodium",
			"Carbohydrate",
			"Copper",
			"Iron",
			"Potassium",
			"Phosphorus",
			"Selenium",
			"Zinc",
			"Fluoride",
			"Manganese"
		],
		"function": "none",
		"commonness": -18.343663156106537,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.nutrient",
					"class": "food.nutrient",
					"friendly_name": "Nutrient",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "food.nutrition_fact",
					"class": "food.nutrition_fact",
					"friendly_name": "Nutrition Fact",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.coca-cola",
					"class": "food.food",
					"friendly_name": "Coca-Cola",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "food.nutrition_fact.nutrient",
					"friendly_name": "Nutrient"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "food.nutrition_fact.food",
					"friendly_name": "Food"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.nutrient . \n?x1 :type.object.type :food.nutrition_fact . \nVALUES ?x2 { :en.coca-cola } \n?x1 :food.nutrition_fact.nutrient ?x0 . \n?x1 :food.nutrition_fact.food ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 183000100,
		"question": "which nutrient is found in coca-cola?",
		"answer": [
			"Caffeine",
			"Sodium",
			"Fluoride",
			"Water",
			"Zinc",
			"Selenium",
			"Phosphorus",
			"Sugar",
			"Lipid",
			"Betaine",
			"Manganese",
			"Copper",
			"Potassium",
			"Calcium",
			"Iron",
			"Ash",
			"Carbohydrate",
			"Protein",
			"Choline"
		],
		"function": "none",
		"commonness": -18.343663156106537,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.nutrient",
					"class": "food.nutrient",
					"friendly_name": "Nutrient",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "food.nutrition_fact",
					"class": "food.nutrition_fact",
					"friendly_name": "Nutrition Fact",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.coca-cola",
					"class": "food.food",
					"friendly_name": "Coca-Cola",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "food.nutrition_fact.nutrient",
					"friendly_name": "Nutrient"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "food.nutrition_fact.food",
					"friendly_name": "Food"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.nutrient . \n?x1 :type.object.type :food.nutrition_fact . \nVALUES ?x2 { :en.coca-cola } \n?x1 :food.nutrition_fact.nutrient ?x0 . \n?x1 :food.nutrition_fact.food ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 183000101,
		"question": "which nutrient is found in coke?",
		"answer": [
			"Potassium",
			"Caffeine",
			"Sodium",
			"Sugar",
			"Selenium",
			"Manganese",
			"Phosphorus",
			"Ash",
			"Carbohydrate",
			"Fluoride",
			"Betaine",
			"Copper",
			"Choline",
			"Protein",
			"Calcium",
			"Lipid",
			"Iron",
			"Zinc",
			"Water"
		],
		"function": "none",
		"commonness": -18.343663156106537,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.nutrient",
					"class": "food.nutrient",
					"friendly_name": "Nutrient",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "food.nutrition_fact",
					"class": "food.nutrition_fact",
					"friendly_name": "Nutrition Fact",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.coca-cola",
					"class": "food.food",
					"friendly_name": "coke",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "food.nutrition_fact.nutrient",
					"friendly_name": "Nutrient"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "food.nutrition_fact.food",
					"friendly_name": "Food"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.nutrient . \n?x1 :type.object.type :food.nutrition_fact . \nVALUES ?x2 { :en.coca-cola } \n?x1 :food.nutrition_fact.nutrient ?x0 . \n?x1 :food.nutrition_fact.food ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 183000200,
		"question": "what is the nutritional composition of coca-cola soda?",
		"answer": [
			"Carbohydrate",
			"Sodium",
			"Lipid",
			"Water",
			"Protein",
			"Caffeine",
			"Fluoride",
			"Iron",
			"Phosphorus",
			"Choline",
			"Potassium",
			"Betaine",
			"Selenium",
			"Copper",
			"Zinc",
			"Sugar",
			"Ash",
			"Manganese",
			"Calcium"
		],
		"function": "none",
		"commonness": -18.343663156106537,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.nutrient",
					"class": "food.nutrient",
					"friendly_name": "Nutrient",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "food.nutrition_fact",
					"class": "food.nutrition_fact",
					"friendly_name": "Nutrition Fact",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.coca-cola",
					"class": "food.food",
					"friendly_name": "Coca-Cola",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "food.nutrition_fact.nutrient",
					"friendly_name": "Nutrient"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "food.nutrition_fact.food",
					"friendly_name": "Food"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.nutrient . \n?x1 :type.object.type :food.nutrition_fact . \nVALUES ?x2 { :en.coca-cola } \n?x1 :food.nutrition_fact.nutrient ?x0 . \n?x1 :food.nutrition_fact.food ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 183000301,
		"question": "what is the supplement information for coke?",
		"answer": [
			"Copper",
			"Manganese",
			"Zinc",
			"Ash",
			"Fluoride",
			"Potassium",
			"Iron",
			"Betaine",
			"Calcium",
			"Choline",
			"Caffeine",
			"Carbohydrate",
			"Protein",
			"Sugar",
			"Sodium",
			"Selenium",
			"Phosphorus",
			"Water",
			"Lipid"
		],
		"function": "none",
		"commonness": -18.343663156106537,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.nutrient",
					"class": "food.nutrient",
					"friendly_name": "Nutrient",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "food.nutrition_fact",
					"class": "food.nutrition_fact",
					"friendly_name": "Nutrition Fact",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.coca-cola",
					"class": "food.food",
					"friendly_name": "coke",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "food.nutrition_fact.nutrient",
					"friendly_name": "Nutrient"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "food.nutrition_fact.food",
					"friendly_name": "Food"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.nutrient . \n?x1 :type.object.type :food.nutrition_fact . \nVALUES ?x2 { :en.coca-cola } \n?x1 :food.nutrition_fact.nutrient ?x0 . \n?x1 :food.nutrition_fact.food ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 183000400,
		"question": "what are the nourishing substances which coca-cola consists of ?",
		"answer": [
			"Selenium",
			"Protein",
			"Caffeine",
			"Sugar",
			"Betaine",
			"Potassium",
			"Sodium",
			"Ash",
			"Carbohydrate",
			"Copper",
			"Zinc",
			"Choline",
			"Iron",
			"Phosphorus",
			"Lipid",
			"Manganese",
			"Water",
			"Calcium",
			"Fluoride"
		],
		"function": "none",
		"commonness": -18.343663156106537,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.nutrient",
					"class": "food.nutrient",
					"friendly_name": "Nutrient",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "food.nutrition_fact",
					"class": "food.nutrition_fact",
					"friendly_name": "Nutrition Fact",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.coca-cola",
					"class": "food.food",
					"friendly_name": "Coca-Cola",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "food.nutrition_fact.nutrient",
					"friendly_name": "Nutrient"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "food.nutrition_fact.food",
					"friendly_name": "Food"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.nutrient . \n?x1 :type.object.type :food.nutrition_fact . \nVALUES ?x2 { :en.coca-cola } \n?x1 :food.nutrition_fact.nutrient ?x0 . \n?x1 :food.nutrition_fact.food ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 183000401,
		"question": "what are the nourishing substances which coke consists of ?",
		"answer": [
			"Choline",
			"Selenium",
			"Sodium",
			"Sugar",
			"Water",
			"Caffeine",
			"Manganese",
			"Iron",
			"Potassium",
			"Calcium",
			"Carbohydrate",
			"Copper",
			"Lipid",
			"Fluoride",
			"Betaine",
			"Phosphorus",
			"Ash",
			"Zinc",
			"Protein"
		],
		"function": "none",
		"commonness": -18.343663156106537,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.nutrient",
					"class": "food.nutrient",
					"friendly_name": "Nutrient",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "food.nutrition_fact",
					"class": "food.nutrition_fact",
					"friendly_name": "Nutrition Fact",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.coca-cola",
					"class": "food.food",
					"friendly_name": "coke",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "food.nutrition_fact.nutrient",
					"friendly_name": "Nutrient"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "food.nutrition_fact.food",
					"friendly_name": "Food"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.nutrient . \n?x1 :type.object.type :food.nutrition_fact . \nVALUES ?x2 { :en.coca-cola } \n?x1 :food.nutrition_fact.nutrient ?x0 . \n?x1 :food.nutrition_fact.food ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 183000501,
		"question": "what kind of nutrient does coke have?",
		"answer": [
			"Potassium",
			"Iron",
			"Caffeine",
			"Choline",
			"Calcium",
			"Zinc",
			"Protein",
			"Lipid",
			"Selenium",
			"Ash",
			"Sugar",
			"Manganese",
			"Carbohydrate",
			"Fluoride",
			"Water",
			"Phosphorus",
			"Betaine",
			"Sodium",
			"Copper"
		],
		"function": "none",
		"commonness": -18.343663156106537,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.nutrient",
					"class": "food.nutrient",
					"friendly_name": "Nutrient",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "food.nutrition_fact",
					"class": "food.nutrition_fact",
					"friendly_name": "Nutrition Fact",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.coca-cola",
					"class": "food.food",
					"friendly_name": "coke",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "food.nutrition_fact.nutrient",
					"friendly_name": "Nutrient"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "food.nutrition_fact.food",
					"friendly_name": "Food"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.nutrient . \n?x1 :type.object.type :food.nutrition_fact . \nVALUES ?x2 { :en.coca-cola } \n?x1 :food.nutrition_fact.nutrient ?x0 . \n?x1 :food.nutrition_fact.food ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 183000600,
		"question": "what's the nutrient content of coca-cola?",
		"answer": [
			"Copper",
			"Manganese",
			"Sodium",
			"Choline",
			"Sugar",
			"Iron",
			"Carbohydrate",
			"Calcium",
			"Fluoride",
			"Potassium",
			"Protein",
			"Ash",
			"Water",
			"Lipid",
			"Phosphorus",
			"Caffeine",
			"Betaine",
			"Selenium",
			"Zinc"
		],
		"function": "none",
		"commonness": -18.343663156106537,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.nutrient",
					"class": "food.nutrient",
					"friendly_name": "Nutrient",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "food.nutrition_fact",
					"class": "food.nutrition_fact",
					"friendly_name": "Nutrition Fact",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.coca-cola",
					"class": "food.food",
					"friendly_name": "Coca-Cola",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "food.nutrition_fact.nutrient",
					"friendly_name": "Nutrient"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "food.nutrition_fact.food",
					"friendly_name": "Food"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.nutrient . \n?x1 :type.object.type :food.nutrition_fact . \nVALUES ?x2 { :en.coca-cola } \n?x1 :food.nutrition_fact.nutrient ?x0 . \n?x1 :food.nutrition_fact.food ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 183000601,
		"question": "what's the nutrient content of coke?",
		"answer": [
			"Caffeine",
			"Ash",
			"Fluoride",
			"Choline",
			"Calcium",
			"Zinc",
			"Sugar",
			"Iron",
			"Potassium",
			"Protein",
			"Manganese",
			"Water",
			"Sodium",
			"Selenium",
			"Betaine",
			"Copper",
			"Phosphorus",
			"Carbohydrate",
			"Lipid"
		],
		"function": "none",
		"commonness": -18.343663156106537,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.nutrient",
					"class": "food.nutrient",
					"friendly_name": "Nutrient",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "food.nutrition_fact",
					"class": "food.nutrition_fact",
					"friendly_name": "Nutrition Fact",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.coca-cola",
					"class": "food.food",
					"friendly_name": "coke",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "food.nutrition_fact.nutrient",
					"friendly_name": "Nutrient"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "food.nutrition_fact.food",
					"friendly_name": "Food"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.nutrient . \n?x1 :type.object.type :food.nutrition_fact . \nVALUES ?x2 { :en.coca-cola } \n?x1 :food.nutrition_fact.nutrient ?x0 . \n?x1 :food.nutrition_fact.food ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 183000701,
		"question": "coke has what nutrient?",
		"answer": [
			"Sodium",
			"Sugar",
			"Zinc",
			"Lipid",
			"Manganese",
			"Ash",
			"Caffeine",
			"Choline",
			"Iron",
			"Fluoride",
			"Protein",
			"Betaine",
			"Phosphorus",
			"Calcium",
			"Potassium",
			"Copper",
			"Water",
			"Selenium",
			"Carbohydrate"
		],
		"function": "none",
		"commonness": -18.343663156106537,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.nutrient",
					"class": "food.nutrient",
					"friendly_name": "Nutrient",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "food.nutrition_fact",
					"class": "food.nutrition_fact",
					"friendly_name": "Nutrition Fact",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.coca-cola",
					"class": "food.food",
					"friendly_name": "coke",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "food.nutrition_fact.nutrient",
					"friendly_name": "Nutrient"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "food.nutrition_fact.food",
					"friendly_name": "Food"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.nutrient . \n?x1 :type.object.type :food.nutrition_fact . \nVALUES ?x2 { :en.coca-cola } \n?x1 :food.nutrition_fact.nutrient ?x0 . \n?x1 :food.nutrition_fact.food ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 184000000,
		"question": "what concert role did queen frequently play?",
		"answer": [
			"Headlining Artist"
		],
		"function": "none",
		"commonness": -29.563229731414744,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.concert_performance_role",
					"class": "music.concert_performance_role",
					"friendly_name": "Concert Performance Role",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "music.concert_performance",
					"class": "music.concert_performance",
					"friendly_name": "Concert Performance",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.queen",
					"class": "music.artist",
					"friendly_name": "Queen",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "music.concert_performance_role.performances",
					"friendly_name": "Performances"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "music.artist.concerts",
					"friendly_name": "Concerts"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.concert_performance_role . \n?x1 :type.object.type :music.concert_performance . \nVALUES ?x2 { :en.queen } \n?x0 :music.concert_performance_role.performances ?x1 . \n?x2 :music.artist.concerts ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 184000100,
		"question": "what sort of part does queen play in concerts?",
		"answer": [
			"Headlining Artist"
		],
		"function": "none",
		"commonness": -29.563229731414744,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.concert_performance_role",
					"class": "music.concert_performance_role",
					"friendly_name": "Concert Performance Role",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "music.concert_performance",
					"class": "music.concert_performance",
					"friendly_name": "Concert Performance",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.queen",
					"class": "music.artist",
					"friendly_name": "Queen",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "music.concert_performance_role.performances",
					"friendly_name": "Performances"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "music.artist.concerts",
					"friendly_name": "Concerts"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.concert_performance_role . \n?x1 :type.object.type :music.concert_performance . \nVALUES ?x2 { :en.queen } \n?x0 :music.concert_performance_role.performances ?x1 . \n?x2 :music.artist.concerts ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 184000200,
		"question": "what kind of role does queen play in concerts?",
		"answer": [
			"Headlining Artist"
		],
		"function": "none",
		"commonness": -29.563229731414744,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.concert_performance_role",
					"class": "music.concert_performance_role",
					"friendly_name": "Concert Performance Role",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "music.concert_performance",
					"class": "music.concert_performance",
					"friendly_name": "Concert Performance",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.queen",
					"class": "music.artist",
					"friendly_name": "Queen",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "music.concert_performance_role.performances",
					"friendly_name": "Performances"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "music.artist.concerts",
					"friendly_name": "Concerts"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.concert_performance_role . \n?x1 :type.object.type :music.concert_performance . \nVALUES ?x2 { :en.queen } \n?x0 :music.concert_performance_role.performances ?x1 . \n?x2 :music.artist.concerts ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 185000000,
		"question": "christianity shows are broadcasted by which networks?",
		"answer": [
			"Dr. Gary and Barb Rosberg - Your Marriage Coaches - Podcast Feed",
			"Joy!Cast - Podcast Feed",
			"Grace Community Church Weekly Podcast - Podcast Feed",
			"Curbside Catastrophe - Podcast Feed",
			"The Way of Reason - An Infidel Guy Production - Podcast Feed",
			"1 Year Daily Audio Bible - Podcast Feed",
			"JT's Indie Christian Music Podcast - Podcast Feed",
			"the Neighborhood Podcast - Podcast Feed",
			"NOOMA - Podcast Feed",
			"St George's Anglican Church Sermon Podcast - Podcast Feed"
		],
		"function": "none",
		"commonness": -21.09855810615146,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "broadcast.broadcast",
					"class": "broadcast.broadcast",
					"friendly_name": "Broadcast",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "broadcast.content",
					"class": "broadcast.content",
					"friendly_name": "Broadcast Content",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.christianity",
					"class": "broadcast.genre",
					"friendly_name": "Christianity",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.broadcast.content",
					"friendly_name": "Content"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "broadcast.genre.content",
					"friendly_name": "Content"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :broadcast.broadcast . \n?x1 :type.object.type :broadcast.content . \nVALUES ?x2 { :en.christianity } \n?x0 :broadcast.broadcast.content ?x1 . \n?x2 :broadcast.genre.content ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 185000001,
		"question": "christian faith shows are broadcasted by which networks?",
		"answer": [
			"Joy!Cast - Podcast Feed",
			"Grace Community Church Weekly Podcast - Podcast Feed",
			"JT's Indie Christian Music Podcast - Podcast Feed",
			"St George's Anglican Church Sermon Podcast - Podcast Feed",
			"the Neighborhood Podcast - Podcast Feed",
			"Curbside Catastrophe - Podcast Feed",
			"The Way of Reason - An Infidel Guy Production - Podcast Feed",
			"1 Year Daily Audio Bible - Podcast Feed",
			"Dr. Gary and Barb Rosberg - Your Marriage Coaches - Podcast Feed",
			"NOOMA - Podcast Feed"
		],
		"function": "none",
		"commonness": -21.09855810615146,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "broadcast.broadcast",
					"class": "broadcast.broadcast",
					"friendly_name": "Broadcast",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "broadcast.content",
					"class": "broadcast.content",
					"friendly_name": "Broadcast Content",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.christianity",
					"class": "broadcast.genre",
					"friendly_name": "christian faith",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.broadcast.content",
					"friendly_name": "Content"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "broadcast.genre.content",
					"friendly_name": "Content"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :broadcast.broadcast . \n?x1 :type.object.type :broadcast.content . \nVALUES ?x2 { :en.christianity } \n?x0 :broadcast.broadcast.content ?x1 . \n?x2 :broadcast.genre.content ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	}
]