[
	{
		"qid": 78000301,
		"question": "what models of chevy are out there?",
		"answer": [
			"Chevrolet Cosworth Vega",
			"Chevrolet 150",
			"Chevrolet Captiva",
			"Chevrolet Beretta",
			"Chevrolet Impala",
			"Chevrolet S-10 Blazer",
			"Chevrolet Malibu",
			"Chevrolet Monza",
			"Chevrolet Colorado",
			"Corvette Mako Shark",
			"Chevrolet Tracker",
			"Chevrolet Apache",
			"Chevrolet Spark",
			"Chevrolet Uplander",
			"Geo Spectrum",
			"Chevrolet Citation",
			"Chevrolet Corvair 900 Monza",
			"Chevrolet Townsman",
			"Maruti Versa",
			"Chevrolet Impala SS",
			"Chevrolet Avalanche",
			"Chevrolet SSR",
			"Chevrolet Lumina APV",
			"Chevrolet Corvette",
			"Chevrolet Volt",
			"Chevrolet Trailblazer",
			"Chevrolet Nova SS",
			"Chevrolet Cruze",
			"Chevrolet 400",
			"Chevrolet Opala",
			"Chevrolet HHR",
			"Chevrolet Nomad",
			"Chevrolet Silverado",
			"Chevrolet Yeoman",
			"Chevrolet Impala",
			"General Motors Sequel",
			"Chevrolet Superior",
			"Chevrolet Beauville",
			"Chevrolet Suburban",
			"Yenko Camaro",
			"Chevrolet Bel Air",
			"Chevrolet Chevelle COPO 427",
			"Chevrolet Express",
			"Chevrolet El Camino",
			"Chevrolet Omega",
			"Geo Prizm",
			"Holden Caprice",
			"Corvair Monza GT",
			"Chevrolet Kadett",
			"Chevrolet Sequel",
			"Chevrolet Kingswood",
			"Chevrolet Agile",
			"Chevrolet Lumina",
			"Chevrolet Bruin",
			"Chevrolet Chevelle",
			"Chevrolet Caprice",
			"Geo Sprint",
			"Chevrolet 210",
			"Chevrolet Orlando",
			"Chevrolet Titan",
			"Chevrolet Monte Carlo",
			"Chevrolet Firenza CanAm",
			"Chevrolet Kodiak",
			"Chevrolet Tavera",
			"Chevrolet Parkwood",
			"Chevrolet Corvette C6 ZR1",
			"Chevrolet Celebrity",
			"Maruti Esteem",
			"Geo Metro",
			"Chevrolet Venture",
			"Chevrolet Lumina",
			"Chevrolet LUV",
			"Chevrolet Aveo",
			"Chevrolet Corvair",
			"Chevrolet Delray",
			"Chevrolet Vectra",
			"Chevrolet Sprint",
			"Chevrolet Cobalt SS",
			"Chevrolet Corsica",
			"Chevrolet Cobalt",
			"Chevrolet Fleetline",
			"Chevrolet Aerovette",
			"Chevrolet K5 Blazer",
			"Chevrolet Constantia",
			"Chevrolet Chevelle SS 454",
			"Chevrolet Task Force",
			"Chevrolet C/K",
			"Chevrolet Biscayne",
			"Chevrolet Marajó",
			"Chevrolet Corvair 500",
			"Chevy Spark EV",
			"Opel Vectra",
			"Cerv 1",
			"Chevrolet Caprice LS",
			"Chevrolet S-10",
			"Chevrolet Camaro",
			"Chevrolet Aveo",
			"Chevrolet Montana",
			"Chevrolet Sonic",
			"Chevrolet Greenbrier",
			"Chevrolet SS",
			"Saturn Astra",
			"Corvette Stingray",
			"Chevrolet Equinox",
			"Chevrolet Vega",
			"Chevrolet Chevy II / Nova",
			"Chevrolet Bison",
			"Chevrolet Corvette Convertible",
			"Chevrolet Celta",
			"Chevrolet Chevelle Laguna",
			"1957 Chevrolet",
			"Chevrolet SS",
			"Chevrolet Advance Design",
			"Chevrolet Cavalier",
			"Chevrolet Styleline",
			"Chevrolet Tahoe",
			"Chevrolet Traverse",
			"Chevrolet Lakewood",
			"Chevrolet S-10 EV",
			"Chevrolet Chevette",
			"Chevrolet Lumina Z34",
			"Chevrolet Astro"
		],
		"function": "none",
		"commonness": -11.69797241596795,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "automotive.model",
					"class": "automotive.model",
					"friendly_name": "Automobile Model",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.chevrolet",
					"class": "automotive.make",
					"friendly_name": "chevy",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "automotive.make.model_s",
					"friendly_name": "Model(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :automotive.model . \nVALUES ?x1 { :en.chevrolet } \n?x1 :automotive.make.model_s ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 78000302,
		"question": "what models of chevrolets are out there?",
		"answer": [
			"Chevrolet Suburban",
			"Corvette Mako Shark",
			"Chevrolet Impala",
			"Chevrolet Lakewood",
			"Chevrolet Chevelle",
			"Chevrolet SS",
			"Chevrolet Bison",
			"Chevrolet Sequel",
			"Chevrolet Corvair",
			"Chevrolet Celta",
			"Chevrolet Lumina",
			"Geo Spectrum",
			"Chevrolet Caprice LS",
			"Chevrolet Avalanche",
			"Chevrolet Parkwood",
			"Chevrolet Marajó",
			"Chevrolet Camaro",
			"Chevrolet Chevy II / Nova",
			"Chevrolet Bruin",
			"Chevrolet Yeoman",
			"Chevrolet Chevelle SS 454",
			"Chevrolet Equinox",
			"Chevrolet K5 Blazer",
			"Chevrolet HHR",
			"Chevrolet Volt",
			"Yenko Camaro",
			"Chevrolet Captiva",
			"Chevrolet Corvair 900 Monza",
			"Geo Prizm",
			"Chevrolet Sonic",
			"Chevrolet Impala SS",
			"Chevrolet Corvair 500",
			"Chevrolet Silverado",
			"Chevrolet Constantia",
			"Chevrolet Kodiak",
			"Chevrolet Kadett",
			"Chevrolet SS",
			"Chevrolet Astro",
			"Chevrolet Malibu",
			"Chevrolet Agile",
			"Chevrolet Corvette",
			"Chevrolet Firenza CanAm",
			"Chevrolet Cavalier",
			"Chevrolet Corvette Convertible",
			"Chevrolet Lumina Z34",
			"Chevrolet Nomad",
			"Corvair Monza GT",
			"Chevrolet Townsman",
			"Chevrolet Cobalt",
			"Chevrolet Traverse",
			"Chevrolet Aerovette",
			"Chevrolet Task Force",
			"Chevrolet Cosworth Vega",
			"Chevrolet Lumina APV",
			"Chevrolet Omega",
			"Chevrolet S-10 Blazer",
			"Geo Metro",
			"Chevrolet LUV",
			"Chevrolet Chevette",
			"Chevrolet Impala",
			"Chevrolet Citation",
			"Chevrolet Corvette C6 ZR1",
			"Chevrolet 150",
			"Saturn Astra",
			"Chevy Spark EV",
			"Holden Caprice",
			"Chevrolet Tavera",
			"Chevrolet Kingswood",
			"Chevrolet Montana",
			"Chevrolet Vectra",
			"Corvette Stingray",
			"Chevrolet Cruze",
			"Chevrolet Orlando",
			"Chevrolet Chevelle Laguna",
			"Chevrolet Aveo",
			"Chevrolet Superior",
			"Chevrolet Aveo",
			"Geo Sprint",
			"Chevrolet 400",
			"Chevrolet Tracker",
			"Chevrolet Vega",
			"Chevrolet Celebrity",
			"Cerv 1",
			"Chevrolet Biscayne",
			"Chevrolet Beauville",
			"Chevrolet Nova SS",
			"Chevrolet Apache",
			"Chevrolet El Camino",
			"Chevrolet Colorado",
			"Chevrolet Trailblazer",
			"Chevrolet Cobalt SS",
			"Chevrolet Express",
			"Chevrolet Spark",
			"Chevrolet Beretta",
			"Chevrolet Bel Air",
			"Chevrolet Advance Design",
			"Chevrolet 210",
			"Chevrolet Monza",
			"Chevrolet Uplander",
			"1957 Chevrolet",
			"Chevrolet Corsica",
			"Chevrolet Monte Carlo",
			"Chevrolet Lumina",
			"Maruti Esteem",
			"Chevrolet S-10",
			"General Motors Sequel",
			"Maruti Versa",
			"Opel Vectra",
			"Chevrolet Caprice",
			"Chevrolet Venture",
			"Chevrolet Sprint",
			"Chevrolet Tahoe",
			"Chevrolet SSR",
			"Chevrolet Fleetline",
			"Chevrolet Delray",
			"Chevrolet Titan",
			"Chevrolet S-10 EV",
			"Chevrolet C/K",
			"Chevrolet Greenbrier",
			"Chevrolet Chevelle COPO 427",
			"Chevrolet Styleline",
			"Chevrolet Opala"
		],
		"function": "none",
		"commonness": -11.69797241596795,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "automotive.model",
					"class": "automotive.model",
					"friendly_name": "Automobile Model",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.chevrolet",
					"class": "automotive.make",
					"friendly_name": "chevrolets",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "automotive.make.model_s",
					"friendly_name": "Model(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :automotive.model . \nVALUES ?x1 { :en.chevrolet } \n?x1 :automotive.make.model_s ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 79000000,
		"question": "find film festivals with a focus on poland.",
		"answer": [
			"Polish Film Festival in America"
		],
		"function": "none",
		"commonness": -14.122065316655178,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.film_festival",
					"class": "film.film_festival",
					"friendly_name": "Film festival",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.poland",
					"class": "film.film_festival_focus",
					"friendly_name": "Poland",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "film.film_festival_focus.festivals_with_this_focus",
					"friendly_name": "Festivals with this focus"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.film_festival . \nVALUES ?x1 { :en.poland } \n?x1 :film.film_festival_focus.festivals_with_this_focus ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 79000200,
		"question": "which film festivals are focused on poland?",
		"answer": [
			"Polish Film Festival in America"
		],
		"function": "none",
		"commonness": -14.122065316655178,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.film_festival",
					"class": "film.film_festival",
					"friendly_name": "Film festival",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.poland",
					"class": "film.film_festival_focus",
					"friendly_name": "Poland",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "film.film_festival_focus.festivals_with_this_focus",
					"friendly_name": "Festivals with this focus"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.film_festival . \nVALUES ?x1 { :en.poland } \n?x1 :film.film_festival_focus.festivals_with_this_focus ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 79000201,
		"question": "which film festivals are focused on republic of poland?",
		"answer": [
			"Polish Film Festival in America"
		],
		"function": "none",
		"commonness": -14.122065316655178,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.film_festival",
					"class": "film.film_festival",
					"friendly_name": "Film festival",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.poland",
					"class": "film.film_festival_focus",
					"friendly_name": "republic of poland",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "film.film_festival_focus.festivals_with_this_focus",
					"friendly_name": "Festivals with this focus"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.film_festival . \nVALUES ?x1 { :en.poland } \n?x1 :film.film_festival_focus.festivals_with_this_focus ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 79000202,
		"question": "which film festivals are focused on polen?",
		"answer": [
			"Polish Film Festival in America"
		],
		"function": "none",
		"commonness": -14.122065316655178,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.film_festival",
					"class": "film.film_festival",
					"friendly_name": "Film festival",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.poland",
					"class": "film.film_festival_focus",
					"friendly_name": "polen",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "film.film_festival_focus.festivals_with_this_focus",
					"friendly_name": "Festivals with this focus"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.film_festival . \nVALUES ?x1 { :en.poland } \n?x1 :film.film_festival_focus.festivals_with_this_focus ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 80000000,
		"question": "where was the trial place of the case roe v. wade?",
		"answer": [
			"Supreme Court of the United States"
		],
		"function": "none",
		"commonness": -12.82904050195403,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.court",
					"class": "law.court",
					"friendly_name": "Court",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.roe_v_wade",
					"class": "law.legal_case",
					"friendly_name": "Roe v. Wade",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.legal_case.court",
					"friendly_name": "Court"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.court . \nVALUES ?x1 { :en.roe_v_wade } \n?x1 :law.legal_case.court ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 80000001,
		"question": "where was the trial place of the case roe vs. wade?",
		"answer": [
			"Supreme Court of the United States"
		],
		"function": "none",
		"commonness": -12.82904050195403,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.court",
					"class": "law.court",
					"friendly_name": "Court",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.roe_v_wade",
					"class": "law.legal_case",
					"friendly_name": "roe vs. wade",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.legal_case.court",
					"friendly_name": "Court"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.court . \nVALUES ?x1 { :en.roe_v_wade } \n?x1 :law.legal_case.court ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 80000100,
		"question": "which court was the setting for the roe v. wade case?",
		"answer": [
			"Supreme Court of the United States"
		],
		"function": "none",
		"commonness": -12.82904050195403,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.court",
					"class": "law.court",
					"friendly_name": "Court",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.roe_v_wade",
					"class": "law.legal_case",
					"friendly_name": "Roe v. Wade",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.legal_case.court",
					"friendly_name": "Court"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.court . \nVALUES ?x1 { :en.roe_v_wade } \n?x1 :law.legal_case.court ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 80000101,
		"question": "which court was the setting for the roe vs. wade case?",
		"answer": [
			"Supreme Court of the United States"
		],
		"function": "none",
		"commonness": -12.82904050195403,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.court",
					"class": "law.court",
					"friendly_name": "Court",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.roe_v_wade",
					"class": "law.legal_case",
					"friendly_name": "roe vs. wade",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.legal_case.court",
					"friendly_name": "Court"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.court . \nVALUES ?x1 { :en.roe_v_wade } \n?x1 :law.legal_case.court ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 80000200,
		"question": "where was roe v. wade heard?",
		"answer": [
			"Supreme Court of the United States"
		],
		"function": "none",
		"commonness": -12.82904050195403,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.court",
					"class": "law.court",
					"friendly_name": "Court",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.roe_v_wade",
					"class": "law.legal_case",
					"friendly_name": "Roe v. Wade",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.legal_case.court",
					"friendly_name": "Court"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.court . \nVALUES ?x1 { :en.roe_v_wade } \n?x1 :law.legal_case.court ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 80000201,
		"question": "where was roe vs. wade heard?",
		"answer": [
			"Supreme Court of the United States"
		],
		"function": "none",
		"commonness": -12.82904050195403,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.court",
					"class": "law.court",
					"friendly_name": "Court",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.roe_v_wade",
					"class": "law.legal_case",
					"friendly_name": "roe vs. wade",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.legal_case.court",
					"friendly_name": "Court"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.court . \nVALUES ?x1 { :en.roe_v_wade } \n?x1 :law.legal_case.court ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 80000300,
		"question": "what is the name of the court in which the roe v. wade trial was heard?",
		"answer": [
			"Supreme Court of the United States"
		],
		"function": "none",
		"commonness": -12.82904050195403,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.court",
					"class": "law.court",
					"friendly_name": "Court",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.roe_v_wade",
					"class": "law.legal_case",
					"friendly_name": "Roe v. Wade",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.legal_case.court",
					"friendly_name": "Court"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.court . \nVALUES ?x1 { :en.roe_v_wade } \n?x1 :law.legal_case.court ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 80000301,
		"question": "what is the name of the court in which the roe vs. wade trial was heard?",
		"answer": [
			"Supreme Court of the United States"
		],
		"function": "none",
		"commonness": -12.82904050195403,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.court",
					"class": "law.court",
					"friendly_name": "Court",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.roe_v_wade",
					"class": "law.legal_case",
					"friendly_name": "roe vs. wade",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.legal_case.court",
					"friendly_name": "Court"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.court . \nVALUES ?x1 { :en.roe_v_wade } \n?x1 :law.legal_case.court ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 80000400,
		"question": "the case known as roe v. wade was heard in which court?",
		"answer": [
			"Supreme Court of the United States"
		],
		"function": "none",
		"commonness": -12.82904050195403,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.court",
					"class": "law.court",
					"friendly_name": "Court",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.roe_v_wade",
					"class": "law.legal_case",
					"friendly_name": "Roe v. Wade",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.legal_case.court",
					"friendly_name": "Court"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.court . \nVALUES ?x1 { :en.roe_v_wade } \n?x1 :law.legal_case.court ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 80000401,
		"question": "the case known as roe vs. wade was heard in which court?",
		"answer": [
			"Supreme Court of the United States"
		],
		"function": "none",
		"commonness": -12.82904050195403,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.court",
					"class": "law.court",
					"friendly_name": "Court",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.roe_v_wade",
					"class": "law.legal_case",
					"friendly_name": "roe vs. wade",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.legal_case.court",
					"friendly_name": "Court"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.court . \nVALUES ?x1 { :en.roe_v_wade } \n?x1 :law.legal_case.court ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 80000500,
		"question": "in which court was roe v. wade heard?",
		"answer": [
			"Supreme Court of the United States"
		],
		"function": "none",
		"commonness": -12.82904050195403,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.court",
					"class": "law.court",
					"friendly_name": "Court",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.roe_v_wade",
					"class": "law.legal_case",
					"friendly_name": "Roe v. Wade",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.legal_case.court",
					"friendly_name": "Court"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.court . \nVALUES ?x1 { :en.roe_v_wade } \n?x1 :law.legal_case.court ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 80000501,
		"question": "in which court was roe vs. wade heard?",
		"answer": [
			"Supreme Court of the United States"
		],
		"function": "none",
		"commonness": -12.82904050195403,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.court",
					"class": "law.court",
					"friendly_name": "Court",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.roe_v_wade",
					"class": "law.legal_case",
					"friendly_name": "roe vs. wade",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.legal_case.court",
					"friendly_name": "Court"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.court . \nVALUES ?x1 { :en.roe_v_wade } \n?x1 :law.legal_case.court ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 81000000,
		"question": "the exit glacier ends its flow into what type of terrain?",
		"answer": [
			"River",
			"Moraine"
		],
		"function": "none",
		"commonness": -19.63884055832049,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "geography.glacier_terminus",
					"class": "geography.glacier_terminus",
					"friendly_name": "Glacier terminus",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.exit_glacier",
					"class": "geography.glacier",
					"friendly_name": "Exit Glacier",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "geography.glacier.terminus",
					"friendly_name": "Terminus"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :geography.glacier_terminus . \nVALUES ?x1 { :en.exit_glacier } \n?x1 :geography.glacier.terminus ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 81000100,
		"question": "what type of landform is found at the foot of exit glacier?",
		"answer": [
			"Moraine",
			"River"
		],
		"function": "none",
		"commonness": -19.63884055832049,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "geography.glacier_terminus",
					"class": "geography.glacier_terminus",
					"friendly_name": "Glacier terminus",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.exit_glacier",
					"class": "geography.glacier",
					"friendly_name": "Exit Glacier",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "geography.glacier.terminus",
					"friendly_name": "Terminus"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :geography.glacier_terminus . \nVALUES ?x1 { :en.exit_glacier } \n?x1 :geography.glacier.terminus ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 81000200,
		"question": "the exit glacier flows into what type of terrain?",
		"answer": [
			"Moraine",
			"River"
		],
		"function": "none",
		"commonness": -19.63884055832049,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "geography.glacier_terminus",
					"class": "geography.glacier_terminus",
					"friendly_name": "Glacier terminus",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.exit_glacier",
					"class": "geography.glacier",
					"friendly_name": "Exit Glacier",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "geography.glacier.terminus",
					"friendly_name": "Terminus"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :geography.glacier_terminus . \nVALUES ?x1 { :en.exit_glacier } \n?x1 :geography.glacier.terminus ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]