[
	{
		"qid": 249000002,
		"question": "which of jack william nicklaus's 2003 golf courses has the highest number of par?",
		"answer": [
			"Longview Golf Course",
			"Bull Golf Course",
			"The Sagamore Golf Course"
		],
		"function": "argmax",
		"commonness": -36.10002195245568,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.golf_course",
					"class": "sports.golf_course",
					"friendly_name": "Golf Course",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.jack_nicklaus",
					"class": "sports.golf_course_designer",
					"friendly_name": "jack william nicklaus",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "2003^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "2003",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "literal",
					"id": "0",
					"class": "type.int",
					"friendly_name": "0",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "sports.golf_course_designer.golf_courses",
					"friendly_name": "Golf Courses Designed"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "sports.golf_course.year_built",
					"friendly_name": "Year Built"
				},
				{
					"start": 0,
					"end": 3,
					"relation": "sports.golf_course.par",
					"friendly_name": "Par"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.golf_course . \nVALUES ?x1 { :en.jack_nicklaus } \nVALUES ?x2 { \"2003\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n{\nSELECT (MAX(?y3) AS ?x3)  WHERE { \n?y0 :type.object.type :sports.golf_course . \nVALUES ?y1 { :en.jack_nicklaus } \nVALUES ?y2 { \"2003\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?y1 :sports.golf_course_designer.golf_courses ?y0 . \n?y0 :sports.golf_course.year_built ?y2 . \n?y0 :sports.golf_course.par ?y3 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y0 != ?y3 && ?y1 != ?y2 && ?y1 != ?y3 && ?y2 != ?y3  )\n}\n}\n?x1 :sports.golf_course_designer.golf_courses ?x0 . \n?x0 :sports.golf_course.year_built ?x2 . \n?x0 :sports.golf_course.par ?x3 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 249000100,
		"question": "which golf course designed by jack nicklaus in 2003 has the largest number of par?",
		"answer": [
			"Bull Golf Course",
			"Longview Golf Course",
			"The Sagamore Golf Course"
		],
		"function": "argmax",
		"commonness": -36.10002195245568,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.golf_course",
					"class": "sports.golf_course",
					"friendly_name": "Golf Course",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.jack_nicklaus",
					"class": "sports.golf_course_designer",
					"friendly_name": "Jack Nicklaus",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "2003^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "2003",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "literal",
					"id": "0",
					"class": "type.int",
					"friendly_name": "0",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "sports.golf_course_designer.golf_courses",
					"friendly_name": "Golf Courses Designed"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "sports.golf_course.year_built",
					"friendly_name": "Year Built"
				},
				{
					"start": 0,
					"end": 3,
					"relation": "sports.golf_course.par",
					"friendly_name": "Par"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.golf_course . \nVALUES ?x1 { :en.jack_nicklaus } \nVALUES ?x2 { \"2003\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n{\nSELECT (MAX(?y3) AS ?x3)  WHERE { \n?y0 :type.object.type :sports.golf_course . \nVALUES ?y1 { :en.jack_nicklaus } \nVALUES ?y2 { \"2003\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?y1 :sports.golf_course_designer.golf_courses ?y0 . \n?y0 :sports.golf_course.year_built ?y2 . \n?y0 :sports.golf_course.par ?y3 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y0 != ?y3 && ?y1 != ?y2 && ?y1 != ?y3 && ?y2 != ?y3  )\n}\n}\n?x1 :sports.golf_course_designer.golf_courses ?x0 . \n?x0 :sports.golf_course.year_built ?x2 . \n?x0 :sports.golf_course.par ?x3 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 249000101,
		"question": "which golf course designed by nicklaus in 2003 has the largest number of par?",
		"answer": [
			"Bull Golf Course",
			"Longview Golf Course",
			"The Sagamore Golf Course"
		],
		"function": "argmax",
		"commonness": -36.10002195245568,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.golf_course",
					"class": "sports.golf_course",
					"friendly_name": "Golf Course",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.jack_nicklaus",
					"class": "sports.golf_course_designer",
					"friendly_name": "nicklaus",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "2003^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "2003",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "literal",
					"id": "0",
					"class": "type.int",
					"friendly_name": "0",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "sports.golf_course_designer.golf_courses",
					"friendly_name": "Golf Courses Designed"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "sports.golf_course.year_built",
					"friendly_name": "Year Built"
				},
				{
					"start": 0,
					"end": 3,
					"relation": "sports.golf_course.par",
					"friendly_name": "Par"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.golf_course . \nVALUES ?x1 { :en.jack_nicklaus } \nVALUES ?x2 { \"2003\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n{\nSELECT (MAX(?y3) AS ?x3)  WHERE { \n?y0 :type.object.type :sports.golf_course . \nVALUES ?y1 { :en.jack_nicklaus } \nVALUES ?y2 { \"2003\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?y1 :sports.golf_course_designer.golf_courses ?y0 . \n?y0 :sports.golf_course.year_built ?y2 . \n?y0 :sports.golf_course.par ?y3 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y0 != ?y3 && ?y1 != ?y2 && ?y1 != ?y3 && ?y2 != ?y3  )\n}\n}\n?x1 :sports.golf_course_designer.golf_courses ?x0 . \n?x0 :sports.golf_course.year_built ?x2 . \n?x0 :sports.golf_course.par ?x3 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 249000102,
		"question": "which golf course designed by jack william nicklaus in 2003 has the largest number of par?",
		"answer": [
			"Bull Golf Course",
			"Longview Golf Course",
			"The Sagamore Golf Course"
		],
		"function": "argmax",
		"commonness": -36.10002195245568,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.golf_course",
					"class": "sports.golf_course",
					"friendly_name": "Golf Course",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.jack_nicklaus",
					"class": "sports.golf_course_designer",
					"friendly_name": "jack william nicklaus",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "2003^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "2003",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "literal",
					"id": "0",
					"class": "type.int",
					"friendly_name": "0",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "sports.golf_course_designer.golf_courses",
					"friendly_name": "Golf Courses Designed"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "sports.golf_course.year_built",
					"friendly_name": "Year Built"
				},
				{
					"start": 0,
					"end": 3,
					"relation": "sports.golf_course.par",
					"friendly_name": "Par"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.golf_course . \nVALUES ?x1 { :en.jack_nicklaus } \nVALUES ?x2 { \"2003\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n{\nSELECT (MAX(?y3) AS ?x3)  WHERE { \n?y0 :type.object.type :sports.golf_course . \nVALUES ?y1 { :en.jack_nicklaus } \nVALUES ?y2 { \"2003\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?y1 :sports.golf_course_designer.golf_courses ?y0 . \n?y0 :sports.golf_course.year_built ?y2 . \n?y0 :sports.golf_course.par ?y3 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y0 != ?y3 && ?y1 != ?y2 && ?y1 != ?y3 && ?y2 != ?y3  )\n}\n}\n?x1 :sports.golf_course_designer.golf_courses ?x0 . \n?x0 :sports.golf_course.year_built ?x2 . \n?x0 :sports.golf_course.par ?x3 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 249000200,
		"question": "which golf course designed by jack nicklaus in 2003 has the highest score for par?",
		"answer": [
			"The Sagamore Golf Course",
			"Longview Golf Course",
			"Bull Golf Course"
		],
		"function": "argmax",
		"commonness": -36.10002195245568,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.golf_course",
					"class": "sports.golf_course",
					"friendly_name": "Golf Course",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.jack_nicklaus",
					"class": "sports.golf_course_designer",
					"friendly_name": "Jack Nicklaus",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "2003^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "2003",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "literal",
					"id": "0",
					"class": "type.int",
					"friendly_name": "0",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "sports.golf_course_designer.golf_courses",
					"friendly_name": "Golf Courses Designed"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "sports.golf_course.year_built",
					"friendly_name": "Year Built"
				},
				{
					"start": 0,
					"end": 3,
					"relation": "sports.golf_course.par",
					"friendly_name": "Par"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.golf_course . \nVALUES ?x1 { :en.jack_nicklaus } \nVALUES ?x2 { \"2003\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n{\nSELECT (MAX(?y3) AS ?x3)  WHERE { \n?y0 :type.object.type :sports.golf_course . \nVALUES ?y1 { :en.jack_nicklaus } \nVALUES ?y2 { \"2003\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?y1 :sports.golf_course_designer.golf_courses ?y0 . \n?y0 :sports.golf_course.year_built ?y2 . \n?y0 :sports.golf_course.par ?y3 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y0 != ?y3 && ?y1 != ?y2 && ?y1 != ?y3 && ?y2 != ?y3  )\n}\n}\n?x1 :sports.golf_course_designer.golf_courses ?x0 . \n?x0 :sports.golf_course.year_built ?x2 . \n?x0 :sports.golf_course.par ?x3 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 249000201,
		"question": "which golf course designed by nicklaus in 2003 has the highest score for par?",
		"answer": [
			"Bull Golf Course",
			"Longview Golf Course",
			"The Sagamore Golf Course"
		],
		"function": "argmax",
		"commonness": -36.10002195245568,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.golf_course",
					"class": "sports.golf_course",
					"friendly_name": "Golf Course",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.jack_nicklaus",
					"class": "sports.golf_course_designer",
					"friendly_name": "nicklaus",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "2003^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "2003",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "literal",
					"id": "0",
					"class": "type.int",
					"friendly_name": "0",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "sports.golf_course_designer.golf_courses",
					"friendly_name": "Golf Courses Designed"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "sports.golf_course.year_built",
					"friendly_name": "Year Built"
				},
				{
					"start": 0,
					"end": 3,
					"relation": "sports.golf_course.par",
					"friendly_name": "Par"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.golf_course . \nVALUES ?x1 { :en.jack_nicklaus } \nVALUES ?x2 { \"2003\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n{\nSELECT (MAX(?y3) AS ?x3)  WHERE { \n?y0 :type.object.type :sports.golf_course . \nVALUES ?y1 { :en.jack_nicklaus } \nVALUES ?y2 { \"2003\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?y1 :sports.golf_course_designer.golf_courses ?y0 . \n?y0 :sports.golf_course.year_built ?y2 . \n?y0 :sports.golf_course.par ?y3 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y0 != ?y3 && ?y1 != ?y2 && ?y1 != ?y3 && ?y2 != ?y3  )\n}\n}\n?x1 :sports.golf_course_designer.golf_courses ?x0 . \n?x0 :sports.golf_course.year_built ?x2 . \n?x0 :sports.golf_course.par ?x3 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 249000202,
		"question": "which golf course designed by jack william nicklaus in 2003 has the highest score for par?",
		"answer": [
			"Bull Golf Course",
			"Longview Golf Course",
			"The Sagamore Golf Course"
		],
		"function": "argmax",
		"commonness": -36.10002195245568,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.golf_course",
					"class": "sports.golf_course",
					"friendly_name": "Golf Course",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.jack_nicklaus",
					"class": "sports.golf_course_designer",
					"friendly_name": "jack william nicklaus",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "2003^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "2003",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "literal",
					"id": "0",
					"class": "type.int",
					"friendly_name": "0",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "sports.golf_course_designer.golf_courses",
					"friendly_name": "Golf Courses Designed"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "sports.golf_course.year_built",
					"friendly_name": "Year Built"
				},
				{
					"start": 0,
					"end": 3,
					"relation": "sports.golf_course.par",
					"friendly_name": "Par"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.golf_course . \nVALUES ?x1 { :en.jack_nicklaus } \nVALUES ?x2 { \"2003\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n{\nSELECT (MAX(?y3) AS ?x3)  WHERE { \n?y0 :type.object.type :sports.golf_course . \nVALUES ?y1 { :en.jack_nicklaus } \nVALUES ?y2 { \"2003\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?y1 :sports.golf_course_designer.golf_courses ?y0 . \n?y0 :sports.golf_course.year_built ?y2 . \n?y0 :sports.golf_course.par ?y3 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y0 != ?y3 && ?y1 != ?y2 && ?y1 != ?y3 && ?y2 != ?y3  )\n}\n}\n?x1 :sports.golf_course_designer.golf_courses ?x0 . \n?x0 :sports.golf_course.year_built ?x2 . \n?x0 :sports.golf_course.par ?x3 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 249000300,
		"question": "jack nicklaus had created a few golf courses in 2003, which of them has the largest number of par?",
		"answer": [
			"Bull Golf Course",
			"Longview Golf Course",
			"The Sagamore Golf Course"
		],
		"function": "argmax",
		"commonness": -36.10002195245568,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.golf_course",
					"class": "sports.golf_course",
					"friendly_name": "Golf Course",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.jack_nicklaus",
					"class": "sports.golf_course_designer",
					"friendly_name": "Jack Nicklaus",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "2003^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "2003",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "literal",
					"id": "0",
					"class": "type.int",
					"friendly_name": "0",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "sports.golf_course_designer.golf_courses",
					"friendly_name": "Golf Courses Designed"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "sports.golf_course.year_built",
					"friendly_name": "Year Built"
				},
				{
					"start": 0,
					"end": 3,
					"relation": "sports.golf_course.par",
					"friendly_name": "Par"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.golf_course . \nVALUES ?x1 { :en.jack_nicklaus } \nVALUES ?x2 { \"2003\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n{\nSELECT (MAX(?y3) AS ?x3)  WHERE { \n?y0 :type.object.type :sports.golf_course . \nVALUES ?y1 { :en.jack_nicklaus } \nVALUES ?y2 { \"2003\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?y1 :sports.golf_course_designer.golf_courses ?y0 . \n?y0 :sports.golf_course.year_built ?y2 . \n?y0 :sports.golf_course.par ?y3 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y0 != ?y3 && ?y1 != ?y2 && ?y1 != ?y3 && ?y2 != ?y3  )\n}\n}\n?x1 :sports.golf_course_designer.golf_courses ?x0 . \n?x0 :sports.golf_course.year_built ?x2 . \n?x0 :sports.golf_course.par ?x3 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 249000400,
		"question": "designed by jack nicklaus in 2003, which golf course has the highest par?",
		"answer": [
			"Bull Golf Course",
			"The Sagamore Golf Course",
			"Longview Golf Course"
		],
		"function": "argmax",
		"commonness": -36.10002195245568,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.golf_course",
					"class": "sports.golf_course",
					"friendly_name": "Golf Course",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.jack_nicklaus",
					"class": "sports.golf_course_designer",
					"friendly_name": "Jack Nicklaus",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "2003^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "2003",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "literal",
					"id": "0",
					"class": "type.int",
					"friendly_name": "0",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "sports.golf_course_designer.golf_courses",
					"friendly_name": "Golf Courses Designed"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "sports.golf_course.year_built",
					"friendly_name": "Year Built"
				},
				{
					"start": 0,
					"end": 3,
					"relation": "sports.golf_course.par",
					"friendly_name": "Par"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.golf_course . \nVALUES ?x1 { :en.jack_nicklaus } \nVALUES ?x2 { \"2003\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n{\nSELECT (MAX(?y3) AS ?x3)  WHERE { \n?y0 :type.object.type :sports.golf_course . \nVALUES ?y1 { :en.jack_nicklaus } \nVALUES ?y2 { \"2003\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?y1 :sports.golf_course_designer.golf_courses ?y0 . \n?y0 :sports.golf_course.year_built ?y2 . \n?y0 :sports.golf_course.par ?y3 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y0 != ?y3 && ?y1 != ?y2 && ?y1 != ?y3 && ?y2 != ?y3  )\n}\n}\n?x1 :sports.golf_course_designer.golf_courses ?x0 . \n?x0 :sports.golf_course.year_built ?x2 . \n?x0 :sports.golf_course.par ?x3 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 249000401,
		"question": "designed by nicklaus in 2003, which golf course has the highest par?",
		"answer": [
			"Longview Golf Course",
			"Bull Golf Course",
			"The Sagamore Golf Course"
		],
		"function": "argmax",
		"commonness": -36.10002195245568,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.golf_course",
					"class": "sports.golf_course",
					"friendly_name": "Golf Course",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.jack_nicklaus",
					"class": "sports.golf_course_designer",
					"friendly_name": "nicklaus",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "2003^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "2003",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "literal",
					"id": "0",
					"class": "type.int",
					"friendly_name": "0",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "sports.golf_course_designer.golf_courses",
					"friendly_name": "Golf Courses Designed"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "sports.golf_course.year_built",
					"friendly_name": "Year Built"
				},
				{
					"start": 0,
					"end": 3,
					"relation": "sports.golf_course.par",
					"friendly_name": "Par"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.golf_course . \nVALUES ?x1 { :en.jack_nicklaus } \nVALUES ?x2 { \"2003\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n{\nSELECT (MAX(?y3) AS ?x3)  WHERE { \n?y0 :type.object.type :sports.golf_course . \nVALUES ?y1 { :en.jack_nicklaus } \nVALUES ?y2 { \"2003\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?y1 :sports.golf_course_designer.golf_courses ?y0 . \n?y0 :sports.golf_course.year_built ?y2 . \n?y0 :sports.golf_course.par ?y3 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y0 != ?y3 && ?y1 != ?y2 && ?y1 != ?y3 && ?y2 != ?y3  )\n}\n}\n?x1 :sports.golf_course_designer.golf_courses ?x0 . \n?x0 :sports.golf_course.year_built ?x2 . \n?x0 :sports.golf_course.par ?x3 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 249000402,
		"question": "designed by jack william nicklaus in 2003, which golf course has the highest par?",
		"answer": [
			"Longview Golf Course",
			"Bull Golf Course",
			"The Sagamore Golf Course"
		],
		"function": "argmax",
		"commonness": -36.10002195245568,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.golf_course",
					"class": "sports.golf_course",
					"friendly_name": "Golf Course",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.jack_nicklaus",
					"class": "sports.golf_course_designer",
					"friendly_name": "jack william nicklaus",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "2003^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "2003",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "literal",
					"id": "0",
					"class": "type.int",
					"friendly_name": "0",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "sports.golf_course_designer.golf_courses",
					"friendly_name": "Golf Courses Designed"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "sports.golf_course.year_built",
					"friendly_name": "Year Built"
				},
				{
					"start": 0,
					"end": 3,
					"relation": "sports.golf_course.par",
					"friendly_name": "Par"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.golf_course . \nVALUES ?x1 { :en.jack_nicklaus } \nVALUES ?x2 { \"2003\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n{\nSELECT (MAX(?y3) AS ?x3)  WHERE { \n?y0 :type.object.type :sports.golf_course . \nVALUES ?y1 { :en.jack_nicklaus } \nVALUES ?y2 { \"2003\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?y1 :sports.golf_course_designer.golf_courses ?y0 . \n?y0 :sports.golf_course.year_built ?y2 . \n?y0 :sports.golf_course.par ?y3 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y0 != ?y3 && ?y1 != ?y2 && ?y1 != ?y3 && ?y2 != ?y3  )\n}\n}\n?x1 :sports.golf_course_designer.golf_courses ?x0 . \n?x0 :sports.golf_course.year_built ?x2 . \n?x0 :sports.golf_course.par ?x3 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 249000500,
		"question": "of all golf courses designed by jack nicklaus in 2003, which has the largest number of par?",
		"answer": [
			"The Sagamore Golf Course",
			"Longview Golf Course",
			"Bull Golf Course"
		],
		"function": "argmax",
		"commonness": -36.10002195245568,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.golf_course",
					"class": "sports.golf_course",
					"friendly_name": "Golf Course",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.jack_nicklaus",
					"class": "sports.golf_course_designer",
					"friendly_name": "Jack Nicklaus",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "2003^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "2003",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "literal",
					"id": "0",
					"class": "type.int",
					"friendly_name": "0",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "sports.golf_course_designer.golf_courses",
					"friendly_name": "Golf Courses Designed"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "sports.golf_course.year_built",
					"friendly_name": "Year Built"
				},
				{
					"start": 0,
					"end": 3,
					"relation": "sports.golf_course.par",
					"friendly_name": "Par"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.golf_course . \nVALUES ?x1 { :en.jack_nicklaus } \nVALUES ?x2 { \"2003\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n{\nSELECT (MAX(?y3) AS ?x3)  WHERE { \n?y0 :type.object.type :sports.golf_course . \nVALUES ?y1 { :en.jack_nicklaus } \nVALUES ?y2 { \"2003\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?y1 :sports.golf_course_designer.golf_courses ?y0 . \n?y0 :sports.golf_course.year_built ?y2 . \n?y0 :sports.golf_course.par ?y3 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y0 != ?y3 && ?y1 != ?y2 && ?y1 != ?y3 && ?y2 != ?y3  )\n}\n}\n?x1 :sports.golf_course_designer.golf_courses ?x0 . \n?x0 :sports.golf_course.year_built ?x2 . \n?x0 :sports.golf_course.par ?x3 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	}
]