[
	{
		"qid": 1000000,
		"question": "find terrorist organizations involved in september 11 attacks.",
		"answer": [
			"al-Qaeda"
		],
		"function": "none",
		"commonness": -16.667819278902257,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.terrorism.terrorist_organization",
					"class": "base.terrorism.terrorist_organization",
					"friendly_name": "Terrorist organization",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.september_11_2001_attacks",
					"class": "base.terrorism.terrorist_attack",
					"friendly_name": "September 11 attacks",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.terrorism.terrorist_organization.involved_in_attacks",
					"friendly_name": "Involved in attacks"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.terrorism.terrorist_organization . \nVALUES ?x1 { :en.september_11_2001_attacks } \n?x0 :base.terrorism.terrorist_organization.involved_in_attacks ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 1000100,
		"question": "which terrorist organizations were involved in the september 11 attacks?",
		"answer": [
			"al-Qaeda"
		],
		"function": "none",
		"commonness": -16.667819278902257,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.terrorism.terrorist_organization",
					"class": "base.terrorism.terrorist_organization",
					"friendly_name": "Terrorist organization",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.september_11_2001_attacks",
					"class": "base.terrorism.terrorist_attack",
					"friendly_name": "September 11 attacks",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.terrorism.terrorist_organization.involved_in_attacks",
					"friendly_name": "Involved in attacks"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.terrorism.terrorist_organization . \nVALUES ?x1 { :en.september_11_2001_attacks } \n?x0 :base.terrorism.terrorist_organization.involved_in_attacks ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 1000101,
		"question": "which terrorist organizations were involved in the nine-eleven?",
		"answer": [
			"al-Qaeda"
		],
		"function": "none",
		"commonness": -16.667819278902257,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.terrorism.terrorist_organization",
					"class": "base.terrorism.terrorist_organization",
					"friendly_name": "Terrorist organization",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.september_11_2001_attacks",
					"class": "base.terrorism.terrorist_attack",
					"friendly_name": "nine-eleven",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.terrorism.terrorist_organization.involved_in_attacks",
					"friendly_name": "Involved in attacks"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.terrorism.terrorist_organization . \nVALUES ?x1 { :en.september_11_2001_attacks } \n?x0 :base.terrorism.terrorist_organization.involved_in_attacks ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 1000200,
		"question": "the september 11 attacks were carried out with the involvement of what terrorist organizations?",
		"answer": [
			"al-Qaeda"
		],
		"function": "none",
		"commonness": -16.667819278902257,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.terrorism.terrorist_organization",
					"class": "base.terrorism.terrorist_organization",
					"friendly_name": "Terrorist organization",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.september_11_2001_attacks",
					"class": "base.terrorism.terrorist_attack",
					"friendly_name": "September 11 attacks",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.terrorism.terrorist_organization.involved_in_attacks",
					"friendly_name": "Involved in attacks"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.terrorism.terrorist_organization . \nVALUES ?x1 { :en.september_11_2001_attacks } \n?x0 :base.terrorism.terrorist_organization.involved_in_attacks ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 1000400,
		"question": "who did september 11 attacks?",
		"answer": [
			"al-Qaeda"
		],
		"function": "none",
		"commonness": -16.667819278902257,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.terrorism.terrorist_organization",
					"class": "base.terrorism.terrorist_organization",
					"friendly_name": "Terrorist organization",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.september_11_2001_attacks",
					"class": "base.terrorism.terrorist_attack",
					"friendly_name": "September 11 attacks",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.terrorism.terrorist_organization.involved_in_attacks",
					"friendly_name": "Involved in attacks"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.terrorism.terrorist_organization . \nVALUES ?x1 { :en.september_11_2001_attacks } \n?x0 :base.terrorism.terrorist_organization.involved_in_attacks ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 1000401,
		"question": "who did nine-eleven?",
		"answer": [
			"al-Qaeda"
		],
		"function": "none",
		"commonness": -16.667819278902257,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.terrorism.terrorist_organization",
					"class": "base.terrorism.terrorist_organization",
					"friendly_name": "Terrorist organization",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.september_11_2001_attacks",
					"class": "base.terrorism.terrorist_attack",
					"friendly_name": "nine-eleven",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.terrorism.terrorist_organization.involved_in_attacks",
					"friendly_name": "Involved in attacks"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.terrorism.terrorist_organization . \nVALUES ?x1 { :en.september_11_2001_attacks } \n?x0 :base.terrorism.terrorist_organization.involved_in_attacks ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 2000000,
		"question": "who bred barbaro?",
		"answer": [
			"Lael Stables"
		],
		"function": "none",
		"commonness": -15.725646079343788,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.thoroughbredracing.thoroughbred_racehorse_breeder",
					"class": "base.thoroughbredracing.thoroughbred_racehorse_breeder",
					"friendly_name": "Thoroughbred racehorse breeder",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.barbaro",
					"class": "base.thoroughbredracing.thoroughbred_racehorse",
					"friendly_name": "Barbaro",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.thoroughbredracing.thoroughbred_racehorse_breeder.horses_bred",
					"friendly_name": "Horses bred"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.thoroughbredracing.thoroughbred_racehorse_breeder . \nVALUES ?x1 { :en.barbaro } \n?x0 :base.thoroughbredracing.thoroughbred_racehorse_breeder.horses_bred ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 2000001,
		"question": "who bred barbaro the horse?",
		"answer": [
			"Lael Stables"
		],
		"function": "none",
		"commonness": -15.725646079343788,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.thoroughbredracing.thoroughbred_racehorse_breeder",
					"class": "base.thoroughbredracing.thoroughbred_racehorse_breeder",
					"friendly_name": "Thoroughbred racehorse breeder",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.barbaro",
					"class": "base.thoroughbredracing.thoroughbred_racehorse",
					"friendly_name": "barbaro the horse",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.thoroughbredracing.thoroughbred_racehorse_breeder.horses_bred",
					"friendly_name": "Horses bred"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.thoroughbredracing.thoroughbred_racehorse_breeder . \nVALUES ?x1 { :en.barbaro } \n?x0 :base.thoroughbredracing.thoroughbred_racehorse_breeder.horses_bred ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 2000100,
		"question": "who was the breeder of barbaro?",
		"answer": [
			"Lael Stables"
		],
		"function": "none",
		"commonness": -15.725646079343788,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.thoroughbredracing.thoroughbred_racehorse_breeder",
					"class": "base.thoroughbredracing.thoroughbred_racehorse_breeder",
					"friendly_name": "Thoroughbred racehorse breeder",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.barbaro",
					"class": "base.thoroughbredracing.thoroughbred_racehorse",
					"friendly_name": "Barbaro",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.thoroughbredracing.thoroughbred_racehorse_breeder.horses_bred",
					"friendly_name": "Horses bred"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.thoroughbredracing.thoroughbred_racehorse_breeder . \nVALUES ?x1 { :en.barbaro } \n?x0 :base.thoroughbredracing.thoroughbred_racehorse_breeder.horses_bred ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 2000101,
		"question": "who was the breeder of barbaro the horse?",
		"answer": [
			"Lael Stables"
		],
		"function": "none",
		"commonness": -15.725646079343788,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.thoroughbredracing.thoroughbred_racehorse_breeder",
					"class": "base.thoroughbredracing.thoroughbred_racehorse_breeder",
					"friendly_name": "Thoroughbred racehorse breeder",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.barbaro",
					"class": "base.thoroughbredracing.thoroughbred_racehorse",
					"friendly_name": "barbaro the horse",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.thoroughbredracing.thoroughbred_racehorse_breeder.horses_bred",
					"friendly_name": "Horses bred"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.thoroughbredracing.thoroughbred_racehorse_breeder . \nVALUES ?x1 { :en.barbaro } \n?x0 :base.thoroughbredracing.thoroughbred_racehorse_breeder.horses_bred ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 2000300,
		"question": "at which stables was barbaro bred?",
		"answer": [
			"Lael Stables"
		],
		"function": "none",
		"commonness": -15.725646079343788,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.thoroughbredracing.thoroughbred_racehorse_breeder",
					"class": "base.thoroughbredracing.thoroughbred_racehorse_breeder",
					"friendly_name": "Thoroughbred racehorse breeder",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.barbaro",
					"class": "base.thoroughbredracing.thoroughbred_racehorse",
					"friendly_name": "Barbaro",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.thoroughbredracing.thoroughbred_racehorse_breeder.horses_bred",
					"friendly_name": "Horses bred"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.thoroughbredracing.thoroughbred_racehorse_breeder . \nVALUES ?x1 { :en.barbaro } \n?x0 :base.thoroughbredracing.thoroughbred_racehorse_breeder.horses_bred ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 2000301,
		"question": "at which stables was barbaro the horse bred?",
		"answer": [
			"Lael Stables"
		],
		"function": "none",
		"commonness": -15.725646079343788,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.thoroughbredracing.thoroughbred_racehorse_breeder",
					"class": "base.thoroughbredracing.thoroughbred_racehorse_breeder",
					"friendly_name": "Thoroughbred racehorse breeder",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.barbaro",
					"class": "base.thoroughbredracing.thoroughbred_racehorse",
					"friendly_name": "barbaro the horse",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.thoroughbredracing.thoroughbred_racehorse_breeder.horses_bred",
					"friendly_name": "Horses bred"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.thoroughbredracing.thoroughbred_racehorse_breeder . \nVALUES ?x1 { :en.barbaro } \n?x0 :base.thoroughbredracing.thoroughbred_racehorse_breeder.horses_bred ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 2000400,
		"question": "who bred the racehorse named barbaro?",
		"answer": [
			"Lael Stables"
		],
		"function": "none",
		"commonness": -15.725646079343788,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.thoroughbredracing.thoroughbred_racehorse_breeder",
					"class": "base.thoroughbredracing.thoroughbred_racehorse_breeder",
					"friendly_name": "Thoroughbred racehorse breeder",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.barbaro",
					"class": "base.thoroughbredracing.thoroughbred_racehorse",
					"friendly_name": "Barbaro",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.thoroughbredracing.thoroughbred_racehorse_breeder.horses_bred",
					"friendly_name": "Horses bred"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.thoroughbredracing.thoroughbred_racehorse_breeder . \nVALUES ?x1 { :en.barbaro } \n?x0 :base.thoroughbredracing.thoroughbred_racehorse_breeder.horses_bred ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 2000401,
		"question": "who bred the racehorse named barbaro the horse?",
		"answer": [
			"Lael Stables"
		],
		"function": "none",
		"commonness": -15.725646079343788,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.thoroughbredracing.thoroughbred_racehorse_breeder",
					"class": "base.thoroughbredracing.thoroughbred_racehorse_breeder",
					"friendly_name": "Thoroughbred racehorse breeder",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.barbaro",
					"class": "base.thoroughbredracing.thoroughbred_racehorse",
					"friendly_name": "barbaro the horse",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.thoroughbredracing.thoroughbred_racehorse_breeder.horses_bred",
					"friendly_name": "Horses bred"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.thoroughbredracing.thoroughbred_racehorse_breeder . \nVALUES ?x1 { :en.barbaro } \n?x0 :base.thoroughbredracing.thoroughbred_racehorse_breeder.horses_bred ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 2000500,
		"question": "what stable bred the racehorse barbaro?",
		"answer": [
			"Lael Stables"
		],
		"function": "none",
		"commonness": -15.725646079343788,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.thoroughbredracing.thoroughbred_racehorse_breeder",
					"class": "base.thoroughbredracing.thoroughbred_racehorse_breeder",
					"friendly_name": "Thoroughbred racehorse breeder",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.barbaro",
					"class": "base.thoroughbredracing.thoroughbred_racehorse",
					"friendly_name": "Barbaro",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.thoroughbredracing.thoroughbred_racehorse_breeder.horses_bred",
					"friendly_name": "Horses bred"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.thoroughbredracing.thoroughbred_racehorse_breeder . \nVALUES ?x1 { :en.barbaro } \n?x0 :base.thoroughbredracing.thoroughbred_racehorse_breeder.horses_bred ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 2000501,
		"question": "what stable bred the racehorse barbaro the horse?",
		"answer": [
			"Lael Stables"
		],
		"function": "none",
		"commonness": -15.725646079343788,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.thoroughbredracing.thoroughbred_racehorse_breeder",
					"class": "base.thoroughbredracing.thoroughbred_racehorse_breeder",
					"friendly_name": "Thoroughbred racehorse breeder",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.barbaro",
					"class": "base.thoroughbredracing.thoroughbred_racehorse",
					"friendly_name": "barbaro the horse",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.thoroughbredracing.thoroughbred_racehorse_breeder.horses_bred",
					"friendly_name": "Horses bred"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.thoroughbredracing.thoroughbred_racehorse_breeder . \nVALUES ?x1 { :en.barbaro } \n?x0 :base.thoroughbredracing.thoroughbred_racehorse_breeder.horses_bred ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 3000000,
		"question": "mewtwo is what kind of pokemon?",
		"answer": [
			"Psychic Pokémon"
		],
		"function": "none",
		"commonness": -21.248555286146384,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pokemon.pok_mon_type",
					"class": "base.pokemon.pok_mon_type",
					"friendly_name": "Pokémon type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mewtwo",
					"class": "base.pokemon.pok_mon",
					"friendly_name": "Mewtwo",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pokemon.pok_mon.pok_mon_type",
					"friendly_name": "Pokémon type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pokemon.pok_mon_type . \nVALUES ?x1 { :en.mewtwo } \n?x1 :base.pokemon.pok_mon.pok_mon_type ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 3000001,
		"question": "myuutsu is what kind of pokemon?",
		"answer": [
			"Psychic Pokémon"
		],
		"function": "none",
		"commonness": -21.248555286146384,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pokemon.pok_mon_type",
					"class": "base.pokemon.pok_mon_type",
					"friendly_name": "Pokémon type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mewtwo",
					"class": "base.pokemon.pok_mon",
					"friendly_name": "myuutsu",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pokemon.pok_mon.pok_mon_type",
					"friendly_name": "Pokémon type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pokemon.pok_mon_type . \nVALUES ?x1 { :en.mewtwo } \n?x1 :base.pokemon.pok_mon.pok_mon_type ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 3000002,
		"question": "myuutwo is what kind of pokemon?",
		"answer": [
			"Psychic Pokémon"
		],
		"function": "none",
		"commonness": -21.248555286146384,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pokemon.pok_mon_type",
					"class": "base.pokemon.pok_mon_type",
					"friendly_name": "Pokémon type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mewtwo",
					"class": "base.pokemon.pok_mon",
					"friendly_name": "myuutwo",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pokemon.pok_mon.pok_mon_type",
					"friendly_name": "Pokémon type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pokemon.pok_mon_type . \nVALUES ?x1 { :en.mewtwo } \n?x1 :base.pokemon.pok_mon.pok_mon_type ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 3000100,
		"question": "what type of pokemon is mewtwo?",
		"answer": [
			"Psychic Pokémon"
		],
		"function": "none",
		"commonness": -21.248555286146384,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pokemon.pok_mon_type",
					"class": "base.pokemon.pok_mon_type",
					"friendly_name": "Pokémon type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mewtwo",
					"class": "base.pokemon.pok_mon",
					"friendly_name": "Mewtwo",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pokemon.pok_mon.pok_mon_type",
					"friendly_name": "Pokémon type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pokemon.pok_mon_type . \nVALUES ?x1 { :en.mewtwo } \n?x1 :base.pokemon.pok_mon.pok_mon_type ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 3000101,
		"question": "what type of pokemon is myuutsu?",
		"answer": [
			"Psychic Pokémon"
		],
		"function": "none",
		"commonness": -21.248555286146384,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pokemon.pok_mon_type",
					"class": "base.pokemon.pok_mon_type",
					"friendly_name": "Pokémon type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mewtwo",
					"class": "base.pokemon.pok_mon",
					"friendly_name": "myuutsu",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pokemon.pok_mon.pok_mon_type",
					"friendly_name": "Pokémon type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pokemon.pok_mon_type . \nVALUES ?x1 { :en.mewtwo } \n?x1 :base.pokemon.pok_mon.pok_mon_type ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 3000102,
		"question": "what type of pokemon is myuutwo?",
		"answer": [
			"Psychic Pokémon"
		],
		"function": "none",
		"commonness": -21.248555286146384,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pokemon.pok_mon_type",
					"class": "base.pokemon.pok_mon_type",
					"friendly_name": "Pokémon type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mewtwo",
					"class": "base.pokemon.pok_mon",
					"friendly_name": "myuutwo",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pokemon.pok_mon.pok_mon_type",
					"friendly_name": "Pokémon type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pokemon.pok_mon_type . \nVALUES ?x1 { :en.mewtwo } \n?x1 :base.pokemon.pok_mon.pok_mon_type ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 3000200,
		"question": "what is mewtwo's pokemon type?",
		"answer": [
			"Psychic Pokémon"
		],
		"function": "none",
		"commonness": -21.248555286146384,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pokemon.pok_mon_type",
					"class": "base.pokemon.pok_mon_type",
					"friendly_name": "Pokémon type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mewtwo",
					"class": "base.pokemon.pok_mon",
					"friendly_name": "Mewtwo",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pokemon.pok_mon.pok_mon_type",
					"friendly_name": "Pokémon type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pokemon.pok_mon_type . \nVALUES ?x1 { :en.mewtwo } \n?x1 :base.pokemon.pok_mon.pok_mon_type ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]