[
	{
		"qid": 87000101,
		"question": "the eit is being operated by whom?",
		"answer": [
			"NASA"
		],
		"function": "none",
		"commonness": -16.932916634611672,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.space_agency",
					"class": "spaceflight.space_agency",
					"friendly_name": "Space Agency",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.extreme_ultraviolet_imaging_telescope",
					"class": "base.virtualheliosphericobservatory.instrument",
					"friendly_name": "eit",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.virtualheliosphericobservatory.instrument.operating_organization",
					"friendly_name": "operating organization"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.space_agency . \nVALUES ?x1 { :en.extreme_ultraviolet_imaging_telescope } \n?x1 :base.virtualheliosphericobservatory.instrument.operating_organization ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 87000102,
		"question": "the nrl eit is being operated by whom?",
		"answer": [
			"NASA"
		],
		"function": "none",
		"commonness": -16.932916634611672,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.space_agency",
					"class": "spaceflight.space_agency",
					"friendly_name": "Space Agency",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.extreme_ultraviolet_imaging_telescope",
					"class": "base.virtualheliosphericobservatory.instrument",
					"friendly_name": "nrl eit",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.virtualheliosphericobservatory.instrument.operating_organization",
					"friendly_name": "operating organization"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.space_agency . \nVALUES ?x1 { :en.extreme_ultraviolet_imaging_telescope } \n?x1 :base.virtualheliosphericobservatory.instrument.operating_organization ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 88000000,
		"question": "steven spielberg edited which movies?",
		"answer": [
			"The Goonies"
		],
		"function": "none",
		"commonness": -13.224318035448787,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.movie",
					"class": "base.americancomedy.movie",
					"friendly_name": "Movie",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.steven_spielberg",
					"class": "film.editor",
					"friendly_name": "Steven Spielberg",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "film.editor.film",
					"friendly_name": "Films edited"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.movie . \nVALUES ?x1 { :en.steven_spielberg } \n?x1 :film.editor.film ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 88000001,
		"question": "spielberg edited which movies?",
		"answer": [
			"The Goonies"
		],
		"function": "none",
		"commonness": -13.224318035448787,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.movie",
					"class": "base.americancomedy.movie",
					"friendly_name": "Movie",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.steven_spielberg",
					"class": "film.editor",
					"friendly_name": "spielberg",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "film.editor.film",
					"friendly_name": "Films edited"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.movie . \nVALUES ?x1 { :en.steven_spielberg } \n?x1 :film.editor.film ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 88000002,
		"question": "stephen spielberg edited which movies?",
		"answer": [
			"The Goonies"
		],
		"function": "none",
		"commonness": -13.224318035448787,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.movie",
					"class": "base.americancomedy.movie",
					"friendly_name": "Movie",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.steven_spielberg",
					"class": "film.editor",
					"friendly_name": "stephen spielberg",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "film.editor.film",
					"friendly_name": "Films edited"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.movie . \nVALUES ?x1 { :en.steven_spielberg } \n?x1 :film.editor.film ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 88000100,
		"question": "steven spielberg was the film editor for which movies?",
		"answer": [
			"The Goonies"
		],
		"function": "none",
		"commonness": -13.224318035448787,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.movie",
					"class": "base.americancomedy.movie",
					"friendly_name": "Movie",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.steven_spielberg",
					"class": "film.editor",
					"friendly_name": "Steven Spielberg",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "film.editor.film",
					"friendly_name": "Films edited"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.movie . \nVALUES ?x1 { :en.steven_spielberg } \n?x1 :film.editor.film ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 88000101,
		"question": "spielberg was the film editor for which movies?",
		"answer": [
			"The Goonies"
		],
		"function": "none",
		"commonness": -13.224318035448787,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.movie",
					"class": "base.americancomedy.movie",
					"friendly_name": "Movie",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.steven_spielberg",
					"class": "film.editor",
					"friendly_name": "spielberg",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "film.editor.film",
					"friendly_name": "Films edited"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.movie . \nVALUES ?x1 { :en.steven_spielberg } \n?x1 :film.editor.film ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 88000102,
		"question": "stephen spielberg was the film editor for which movies?",
		"answer": [
			"The Goonies"
		],
		"function": "none",
		"commonness": -13.224318035448787,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.movie",
					"class": "base.americancomedy.movie",
					"friendly_name": "Movie",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.steven_spielberg",
					"class": "film.editor",
					"friendly_name": "stephen spielberg",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "film.editor.film",
					"friendly_name": "Films edited"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.movie . \nVALUES ?x1 { :en.steven_spielberg } \n?x1 :film.editor.film ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 88000200,
		"question": "what editing work has steven spielberg done in movies?",
		"answer": [
			"The Goonies"
		],
		"function": "none",
		"commonness": -13.224318035448787,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.movie",
					"class": "base.americancomedy.movie",
					"friendly_name": "Movie",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.steven_spielberg",
					"class": "film.editor",
					"friendly_name": "Steven Spielberg",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "film.editor.film",
					"friendly_name": "Films edited"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.movie . \nVALUES ?x1 { :en.steven_spielberg } \n?x1 :film.editor.film ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 88000201,
		"question": "what editing work has spielberg done in movies?",
		"answer": [
			"The Goonies"
		],
		"function": "none",
		"commonness": -13.224318035448787,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.movie",
					"class": "base.americancomedy.movie",
					"friendly_name": "Movie",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.steven_spielberg",
					"class": "film.editor",
					"friendly_name": "spielberg",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "film.editor.film",
					"friendly_name": "Films edited"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.movie . \nVALUES ?x1 { :en.steven_spielberg } \n?x1 :film.editor.film ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 88000202,
		"question": "what editing work has stephen spielberg done in movies?",
		"answer": [
			"The Goonies"
		],
		"function": "none",
		"commonness": -13.224318035448787,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.movie",
					"class": "base.americancomedy.movie",
					"friendly_name": "Movie",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.steven_spielberg",
					"class": "film.editor",
					"friendly_name": "stephen spielberg",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "film.editor.film",
					"friendly_name": "Films edited"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.movie . \nVALUES ?x1 { :en.steven_spielberg } \n?x1 :film.editor.film ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 88000300,
		"question": "what films did steven spielberg edit?",
		"answer": [
			"The Goonies"
		],
		"function": "none",
		"commonness": -13.224318035448787,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.movie",
					"class": "base.americancomedy.movie",
					"friendly_name": "Movie",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.steven_spielberg",
					"class": "film.editor",
					"friendly_name": "Steven Spielberg",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "film.editor.film",
					"friendly_name": "Films edited"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.movie . \nVALUES ?x1 { :en.steven_spielberg } \n?x1 :film.editor.film ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 88000301,
		"question": "what films did spielberg edit?",
		"answer": [
			"The Goonies"
		],
		"function": "none",
		"commonness": -13.224318035448787,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.movie",
					"class": "base.americancomedy.movie",
					"friendly_name": "Movie",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.steven_spielberg",
					"class": "film.editor",
					"friendly_name": "spielberg",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "film.editor.film",
					"friendly_name": "Films edited"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.movie . \nVALUES ?x1 { :en.steven_spielberg } \n?x1 :film.editor.film ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 88000302,
		"question": "what films did stephen spielberg edit?",
		"answer": [
			"The Goonies"
		],
		"function": "none",
		"commonness": -13.224318035448787,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.movie",
					"class": "base.americancomedy.movie",
					"friendly_name": "Movie",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.steven_spielberg",
					"class": "film.editor",
					"friendly_name": "stephen spielberg",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "film.editor.film",
					"friendly_name": "Films edited"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.movie . \nVALUES ?x1 { :en.steven_spielberg } \n?x1 :film.editor.film ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 88000400,
		"question": "what movies has steven spielberg been credited with editing?",
		"answer": [
			"The Goonies"
		],
		"function": "none",
		"commonness": -13.224318035448787,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.movie",
					"class": "base.americancomedy.movie",
					"friendly_name": "Movie",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.steven_spielberg",
					"class": "film.editor",
					"friendly_name": "Steven Spielberg",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "film.editor.film",
					"friendly_name": "Films edited"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.movie . \nVALUES ?x1 { :en.steven_spielberg } \n?x1 :film.editor.film ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 88000401,
		"question": "what movies has spielberg been credited with editing?",
		"answer": [
			"The Goonies"
		],
		"function": "none",
		"commonness": -13.224318035448787,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.movie",
					"class": "base.americancomedy.movie",
					"friendly_name": "Movie",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.steven_spielberg",
					"class": "film.editor",
					"friendly_name": "spielberg",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "film.editor.film",
					"friendly_name": "Films edited"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.movie . \nVALUES ?x1 { :en.steven_spielberg } \n?x1 :film.editor.film ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 88000402,
		"question": "what movies has stephen spielberg been credited with editing?",
		"answer": [
			"The Goonies"
		],
		"function": "none",
		"commonness": -13.224318035448787,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.movie",
					"class": "base.americancomedy.movie",
					"friendly_name": "Movie",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.steven_spielberg",
					"class": "film.editor",
					"friendly_name": "stephen spielberg",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "film.editor.film",
					"friendly_name": "Films edited"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.movie . \nVALUES ?x1 { :en.steven_spielberg } \n?x1 :film.editor.film ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 88000500,
		"question": "what movies were edited by steven spielberg?",
		"answer": [
			"The Goonies"
		],
		"function": "none",
		"commonness": -13.224318035448787,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.movie",
					"class": "base.americancomedy.movie",
					"friendly_name": "Movie",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.steven_spielberg",
					"class": "film.editor",
					"friendly_name": "Steven Spielberg",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "film.editor.film",
					"friendly_name": "Films edited"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.movie . \nVALUES ?x1 { :en.steven_spielberg } \n?x1 :film.editor.film ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 88000501,
		"question": "what movies were edited by spielberg?",
		"answer": [
			"The Goonies"
		],
		"function": "none",
		"commonness": -13.224318035448787,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.movie",
					"class": "base.americancomedy.movie",
					"friendly_name": "Movie",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.steven_spielberg",
					"class": "film.editor",
					"friendly_name": "spielberg",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "film.editor.film",
					"friendly_name": "Films edited"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.movie . \nVALUES ?x1 { :en.steven_spielberg } \n?x1 :film.editor.film ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 88000502,
		"question": "what movies were edited by stephen spielberg?",
		"answer": [
			"The Goonies"
		],
		"function": "none",
		"commonness": -13.224318035448787,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.movie",
					"class": "base.americancomedy.movie",
					"friendly_name": "Movie",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.steven_spielberg",
					"class": "film.editor",
					"friendly_name": "stephen spielberg",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "film.editor.film",
					"friendly_name": "Films edited"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.movie . \nVALUES ?x1 { :en.steven_spielberg } \n?x1 :film.editor.film ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 88000600,
		"question": "of which movies was steven spielberg the editor?",
		"answer": [
			"The Goonies"
		],
		"function": "none",
		"commonness": -13.224318035448787,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.movie",
					"class": "base.americancomedy.movie",
					"friendly_name": "Movie",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.steven_spielberg",
					"class": "film.editor",
					"friendly_name": "Steven Spielberg",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "film.editor.film",
					"friendly_name": "Films edited"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.movie . \nVALUES ?x1 { :en.steven_spielberg } \n?x1 :film.editor.film ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 88000601,
		"question": "of which movies was spielberg the editor?",
		"answer": [
			"The Goonies"
		],
		"function": "none",
		"commonness": -13.224318035448787,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.movie",
					"class": "base.americancomedy.movie",
					"friendly_name": "Movie",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.steven_spielberg",
					"class": "film.editor",
					"friendly_name": "spielberg",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "film.editor.film",
					"friendly_name": "Films edited"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.movie . \nVALUES ?x1 { :en.steven_spielberg } \n?x1 :film.editor.film ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 88000602,
		"question": "of which movies was stephen spielberg the editor?",
		"answer": [
			"The Goonies"
		],
		"function": "none",
		"commonness": -13.224318035448787,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.movie",
					"class": "base.americancomedy.movie",
					"friendly_name": "Movie",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.steven_spielberg",
					"class": "film.editor",
					"friendly_name": "stephen spielberg",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "film.editor.film",
					"friendly_name": "Films edited"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.movie . \nVALUES ?x1 { :en.steven_spielberg } \n?x1 :film.editor.film ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 89000000,
		"question": "what is the name of the buffalo sabres coach?",
		"answer": [
			"Ron Rolston"
		],
		"function": "none",
		"commonness": -15.280293643752703,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "ice_hockey.hockey_coach",
					"class": "ice_hockey.hockey_coach",
					"friendly_name": "Ice hockey coach",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.buffalo_sabres",
					"class": "ice_hockey.hockey_team",
					"friendly_name": "Buffalo Sabres",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "ice_hockey.hockey_coach.current_team",
					"friendly_name": "Current Team Coached"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :ice_hockey.hockey_coach . \nVALUES ?x1 { :en.buffalo_sabres } \n?x0 :ice_hockey.hockey_coach.current_team ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 89000001,
		"question": "what is the name of the buffalo coach?",
		"answer": [
			"Ron Rolston"
		],
		"function": "none",
		"commonness": -15.280293643752703,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "ice_hockey.hockey_coach",
					"class": "ice_hockey.hockey_coach",
					"friendly_name": "Ice hockey coach",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.buffalo_sabres",
					"class": "ice_hockey.hockey_team",
					"friendly_name": "buffalo",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "ice_hockey.hockey_coach.current_team",
					"friendly_name": "Current Team Coached"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :ice_hockey.hockey_coach . \nVALUES ?x1 { :en.buffalo_sabres } \n?x0 :ice_hockey.hockey_coach.current_team ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 89000002,
		"question": "what is the name of the sabres coach?",
		"answer": [
			"Ron Rolston"
		],
		"function": "none",
		"commonness": -15.280293643752703,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "ice_hockey.hockey_coach",
					"class": "ice_hockey.hockey_coach",
					"friendly_name": "Ice hockey coach",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.buffalo_sabres",
					"class": "ice_hockey.hockey_team",
					"friendly_name": "sabres",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "ice_hockey.hockey_coach.current_team",
					"friendly_name": "Current Team Coached"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :ice_hockey.hockey_coach . \nVALUES ?x1 { :en.buffalo_sabres } \n?x0 :ice_hockey.hockey_coach.current_team ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]