[
	{
		"qid": 122000100,
		"question": "what are the volume units that equals at least 0.00727373 cubic meters?",
		"answer": [
			"Cubic mile",
			"Peck (Imperial)",
			"Beer barrel (UK)",
			"Gallon (Scots)",
			"Peck (US)",
			"Bushel (US)",
			"Cubic metre",
			"Cubic foot",
			"Bushel (Imperial)",
			"Cubic kilometer",
			"Oil barrel",
			"Hectoliter",
			"Beer barrel (US)"
		],
		"function": ">=",
		"commonness": -16.920730397689574,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "measurement_unit.volume_unit",
					"class": "measurement_unit.volume_unit",
					"friendly_name": "Unit Of Volume",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "0.00727373^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "0.00727373",
					"question_node": 0,
					"function": ">="
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "measurement_unit.volume_unit.volume_in_cubic_meters",
					"friendly_name": "Volume In Cubic Meters"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :measurement_unit.volume_unit . \nFILTER (?x1 >= 0.00727373)\n?x0 :measurement_unit.volume_unit.volume_in_cubic_meters ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 122000200,
		"question": "what volume units are no less than 0.00727373 cubic meters per unit?",
		"answer": [
			"Gallon (Scots)",
			"Cubic kilometer",
			"Bushel (US)",
			"Bushel (Imperial)",
			"Beer barrel (UK)",
			"Oil barrel",
			"Peck (US)",
			"Beer barrel (US)",
			"Hectoliter",
			"Cubic mile",
			"Cubic foot",
			"Peck (Imperial)",
			"Cubic metre"
		],
		"function": ">=",
		"commonness": -16.920730397689574,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "measurement_unit.volume_unit",
					"class": "measurement_unit.volume_unit",
					"friendly_name": "Unit Of Volume",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "0.00727373^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "0.00727373",
					"question_node": 0,
					"function": ">="
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "measurement_unit.volume_unit.volume_in_cubic_meters",
					"friendly_name": "Volume In Cubic Meters"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :measurement_unit.volume_unit . \nFILTER (?x1 >= 0.00727373)\n?x0 :measurement_unit.volume_unit.volume_in_cubic_meters ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 122000300,
		"question": "what units of volume are no less than 0.00727373 cubic meters per unit?",
		"answer": [
			"Peck (Imperial)",
			"Bushel (US)",
			"Cubic foot",
			"Beer barrel (UK)",
			"Bushel (Imperial)",
			"Hectoliter",
			"Cubic mile",
			"Cubic metre",
			"Cubic kilometer",
			"Beer barrel (US)",
			"Oil barrel",
			"Gallon (Scots)",
			"Peck (US)"
		],
		"function": ">=",
		"commonness": -16.920730397689574,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "measurement_unit.volume_unit",
					"class": "measurement_unit.volume_unit",
					"friendly_name": "Unit Of Volume",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "0.00727373^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "0.00727373",
					"question_node": 0,
					"function": ">="
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "measurement_unit.volume_unit.volume_in_cubic_meters",
					"friendly_name": "Volume In Cubic Meters"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :measurement_unit.volume_unit . \nFILTER (?x1 >= 0.00727373)\n?x0 :measurement_unit.volume_unit.volume_in_cubic_meters ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 123000000,
		"question": "find cricket bowling paces no faster than 97 km/h.",
		"answer": [
			"Medium Slow",
			"Slow"
		],
		"function": "<=",
		"commonness": -20.403989141389708,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "cricket.cricket_bowling_pace",
					"class": "cricket.cricket_bowling_pace",
					"friendly_name": "Cricket Bowling Pace",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "97^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "97",
					"question_node": 0,
					"function": "<="
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "cricket.cricket_bowling_pace.max_speed_kmph",
					"friendly_name": "Max Speed"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :cricket.cricket_bowling_pace . \nFILTER (?x1 <= 97)\n?x0 :cricket.cricket_bowling_pace.max_speed_kmph ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 123000100,
		"question": "what cricket bowling paces have their max speed at most 97 km/h?",
		"answer": [
			"Slow",
			"Medium Slow"
		],
		"function": "<=",
		"commonness": -20.403989141389708,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "cricket.cricket_bowling_pace",
					"class": "cricket.cricket_bowling_pace",
					"friendly_name": "Cricket Bowling Pace",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "97^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "97",
					"question_node": 0,
					"function": "<="
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "cricket.cricket_bowling_pace.max_speed_kmph",
					"friendly_name": "Max Speed"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :cricket.cricket_bowling_pace . \nFILTER (?x1 <= 97)\n?x0 :cricket.cricket_bowling_pace.max_speed_kmph ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 123000200,
		"question": "which cricket bowling paces are slower than 97 km/h?",
		"answer": [
			"Slow",
			"Medium Slow"
		],
		"function": "<=",
		"commonness": -20.403989141389708,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "cricket.cricket_bowling_pace",
					"class": "cricket.cricket_bowling_pace",
					"friendly_name": "Cricket Bowling Pace",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "97^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "97",
					"question_node": 0,
					"function": "<="
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "cricket.cricket_bowling_pace.max_speed_kmph",
					"friendly_name": "Max Speed"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :cricket.cricket_bowling_pace . \nFILTER (?x1 <= 97)\n?x0 :cricket.cricket_bowling_pace.max_speed_kmph ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 124000000,
		"question": "find rockets with more than 2 stages.",
		"answer": [
			"Vanguard",
			"Europa",
			"Dnepr launch vehicle",
			"Minotaur",
			"Atlas II",
			"Geosynchronous Satellite Launch Vehicle",
			"Long March 3B",
			"Jupiter-C",
			"Long March 3",
			"Black Arrow",
			"Saturn V",
			"Diamant",
			"Ariane 4",
			"Juno I",
			"Saturn C-8",
			"VLS-1",
			"Polar Satellite Launch Vehicle",
			"Taurus",
			"N1"
		],
		"function": ">",
		"commonness": -16.603348596136406,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket",
					"class": "spaceflight.rocket",
					"friendly_name": "Rocket",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "2^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "2",
					"question_node": 0,
					"function": ">"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket.number_of_stages",
					"friendly_name": "Number Of Stages"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket . \nFILTER (?x1 > 2)\n?x0 :spaceflight.rocket.number_of_stages ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 124000100,
		"question": "what rocks have more than 2 stages?",
		"answer": [
			"Ariane 4",
			"Minotaur",
			"Taurus",
			"N1",
			"Geosynchronous Satellite Launch Vehicle",
			"Black Arrow",
			"Saturn V",
			"Dnepr launch vehicle",
			"VLS-1",
			"Long March 3B",
			"Europa",
			"Atlas II",
			"Juno I",
			"Saturn C-8",
			"Jupiter-C",
			"Long March 3",
			"Polar Satellite Launch Vehicle",
			"Vanguard",
			"Diamant"
		],
		"function": ">",
		"commonness": -16.603348596136406,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket",
					"class": "spaceflight.rocket",
					"friendly_name": "Rocket",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "2^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "2",
					"question_node": 0,
					"function": ">"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket.number_of_stages",
					"friendly_name": "Number Of Stages"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket . \nFILTER (?x1 > 2)\n?x0 :spaceflight.rocket.number_of_stages ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 125000000,
		"question": "find aircrafts with a cargo capacity of at least 6.4 square meters.",
		"answer": [
			"Gulfstream G500",
			"Gulfstream G550",
			"Boeing 767-200",
			"Airbus A380"
		],
		"function": ">=",
		"commonness": -16.864900172826232,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "aviation.aircraft_model",
					"class": "aviation.aircraft_model",
					"friendly_name": "Aircraft model",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "6.4^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "6.4",
					"question_node": 0,
					"function": ">="
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "aviation.aircraft_model.cargo_capacity",
					"friendly_name": "Cargo Capacity"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :aviation.aircraft_model . \nFILTER (?x1 >= 6.4)\n?x0 :aviation.aircraft_model.cargo_capacity ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 125000100,
		"question": "which aircraft have a minimum cargo capacity of 6.4 square meters?",
		"answer": [
			"Gulfstream G550",
			"Airbus A380",
			"Gulfstream G500",
			"Boeing 767-200"
		],
		"function": ">=",
		"commonness": -16.864900172826232,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "aviation.aircraft_model",
					"class": "aviation.aircraft_model",
					"friendly_name": "Aircraft model",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "6.4^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "6.4",
					"question_node": 0,
					"function": ">="
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "aviation.aircraft_model.cargo_capacity",
					"friendly_name": "Cargo Capacity"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :aviation.aircraft_model . \nFILTER (?x1 >= 6.4)\n?x0 :aviation.aircraft_model.cargo_capacity ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 125000200,
		"question": "which aircraft possess a cargo of 6.4 square meters or larger?",
		"answer": [
			"Gulfstream G550",
			"Airbus A380",
			"Boeing 767-200",
			"Gulfstream G500"
		],
		"function": ">=",
		"commonness": -16.864900172826232,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "aviation.aircraft_model",
					"class": "aviation.aircraft_model",
					"friendly_name": "Aircraft model",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "6.4^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "6.4",
					"question_node": 0,
					"function": ">="
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "aviation.aircraft_model.cargo_capacity",
					"friendly_name": "Cargo Capacity"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :aviation.aircraft_model . \nFILTER (?x1 >= 6.4)\n?x0 :aviation.aircraft_model.cargo_capacity ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 125000300,
		"question": "which airplanes have at least 6.4 square meters in cargo capacity?",
		"answer": [
			"Airbus A380",
			"Boeing 767-200",
			"Gulfstream G500",
			"Gulfstream G550"
		],
		"function": ">=",
		"commonness": -16.864900172826232,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "aviation.aircraft_model",
					"class": "aviation.aircraft_model",
					"friendly_name": "Aircraft model",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "6.4^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "6.4",
					"question_node": 0,
					"function": ">="
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "aviation.aircraft_model.cargo_capacity",
					"friendly_name": "Cargo Capacity"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :aviation.aircraft_model . \nFILTER (?x1 >= 6.4)\n?x0 :aviation.aircraft_model.cargo_capacity ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 126000000,
		"question": "how many locks does the panama canal have?",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -18.049431392764877,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.engineering.canal_lock",
					"class": "base.engineering.canal_lock",
					"friendly_name": "Canal Lock",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.panama_canal",
					"class": "base.engineering.canal",
					"friendly_name": "Panama Canal",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.engineering.canal.locks",
					"friendly_name": "Locks"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.engineering.canal_lock . \nVALUES ?x1 { :en.panama_canal } \n?x1 :base.engineering.canal.locks ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 126000001,
		"question": "how many locks does the panama channel have?",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -18.049431392764877,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.engineering.canal_lock",
					"class": "base.engineering.canal_lock",
					"friendly_name": "Canal Lock",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.panama_canal",
					"class": "base.engineering.canal",
					"friendly_name": "panama channel",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.engineering.canal.locks",
					"friendly_name": "Locks"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.engineering.canal_lock . \nVALUES ?x1 { :en.panama_canal } \n?x1 :base.engineering.canal.locks ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 126000002,
		"question": "how many locks does the panama ship canal have?",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -18.049431392764877,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.engineering.canal_lock",
					"class": "base.engineering.canal_lock",
					"friendly_name": "Canal Lock",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.panama_canal",
					"class": "base.engineering.canal",
					"friendly_name": "panama ship canal",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.engineering.canal.locks",
					"friendly_name": "Locks"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.engineering.canal_lock . \nVALUES ?x1 { :en.panama_canal } \n?x1 :base.engineering.canal.locks ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 126000100,
		"question": "in the panama canal how many locks are there?",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -18.049431392764877,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.engineering.canal_lock",
					"class": "base.engineering.canal_lock",
					"friendly_name": "Canal Lock",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.panama_canal",
					"class": "base.engineering.canal",
					"friendly_name": "Panama Canal",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.engineering.canal.locks",
					"friendly_name": "Locks"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.engineering.canal_lock . \nVALUES ?x1 { :en.panama_canal } \n?x1 :base.engineering.canal.locks ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 126000101,
		"question": "in the panama channel how many locks are there?",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -18.049431392764877,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.engineering.canal_lock",
					"class": "base.engineering.canal_lock",
					"friendly_name": "Canal Lock",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.panama_canal",
					"class": "base.engineering.canal",
					"friendly_name": "panama channel",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.engineering.canal.locks",
					"friendly_name": "Locks"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.engineering.canal_lock . \nVALUES ?x1 { :en.panama_canal } \n?x1 :base.engineering.canal.locks ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 126000102,
		"question": "in the panama ship canal how many locks are there?",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -18.049431392764877,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.engineering.canal_lock",
					"class": "base.engineering.canal_lock",
					"friendly_name": "Canal Lock",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.panama_canal",
					"class": "base.engineering.canal",
					"friendly_name": "panama ship canal",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.engineering.canal.locks",
					"friendly_name": "Locks"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.engineering.canal_lock . \nVALUES ?x1 { :en.panama_canal } \n?x1 :base.engineering.canal.locks ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 126000201,
		"question": "how many locks are there in the panama channel?",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -18.049431392764877,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.engineering.canal_lock",
					"class": "base.engineering.canal_lock",
					"friendly_name": "Canal Lock",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.panama_canal",
					"class": "base.engineering.canal",
					"friendly_name": "panama channel",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.engineering.canal.locks",
					"friendly_name": "Locks"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.engineering.canal_lock . \nVALUES ?x1 { :en.panama_canal } \n?x1 :base.engineering.canal.locks ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 126000202,
		"question": "how many locks are there in the panama ship canal?",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -18.049431392764877,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.engineering.canal_lock",
					"class": "base.engineering.canal_lock",
					"friendly_name": "Canal Lock",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.panama_canal",
					"class": "base.engineering.canal",
					"friendly_name": "panama ship canal",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.engineering.canal.locks",
					"friendly_name": "Locks"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.engineering.canal_lock . \nVALUES ?x1 { :en.panama_canal } \n?x1 :base.engineering.canal.locks ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 126000400,
		"question": "the panama canal contains how many different canal locks?",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -18.049431392764877,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.engineering.canal_lock",
					"class": "base.engineering.canal_lock",
					"friendly_name": "Canal Lock",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.panama_canal",
					"class": "base.engineering.canal",
					"friendly_name": "Panama Canal",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.engineering.canal.locks",
					"friendly_name": "Locks"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.engineering.canal_lock . \nVALUES ?x1 { :en.panama_canal } \n?x1 :base.engineering.canal.locks ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 126000401,
		"question": "the panama channel contains how many different canal locks?",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -18.049431392764877,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.engineering.canal_lock",
					"class": "base.engineering.canal_lock",
					"friendly_name": "Canal Lock",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.panama_canal",
					"class": "base.engineering.canal",
					"friendly_name": "panama channel",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.engineering.canal.locks",
					"friendly_name": "Locks"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.engineering.canal_lock . \nVALUES ?x1 { :en.panama_canal } \n?x1 :base.engineering.canal.locks ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 126000402,
		"question": "the panama ship canal contains how many different canal locks?",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -18.049431392764877,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.engineering.canal_lock",
					"class": "base.engineering.canal_lock",
					"friendly_name": "Canal Lock",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.panama_canal",
					"class": "base.engineering.canal",
					"friendly_name": "panama ship canal",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.engineering.canal.locks",
					"friendly_name": "Locks"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.engineering.canal_lock . \nVALUES ?x1 { :en.panama_canal } \n?x1 :base.engineering.canal.locks ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]