[
	{
		"qid": 36000300,
		"question": "who developed the source engine?",
		"answer": [
			"Valve Corporation"
		],
		"function": "none",
		"commonness": -16.53886073111844,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "cvg.computer_game_engine_developer",
					"class": "cvg.computer_game_engine_developer",
					"friendly_name": "Video Game Engine Developer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.source_engine",
					"class": "cvg.computer_game_engine",
					"friendly_name": "Source Engine",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "cvg.computer_game_engine_developer.computer_game_engines_developed",
					"friendly_name": "Computer game engines developed"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :cvg.computer_game_engine_developer . \nVALUES ?x1 { :en.source_engine } \n?x0 :cvg.computer_game_engine_developer.computer_game_engines_developed ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 36000400,
		"question": "who are the developers of the source engine?",
		"answer": [
			"Valve Corporation"
		],
		"function": "none",
		"commonness": -16.53886073111844,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "cvg.computer_game_engine_developer",
					"class": "cvg.computer_game_engine_developer",
					"friendly_name": "Video Game Engine Developer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.source_engine",
					"class": "cvg.computer_game_engine",
					"friendly_name": "Source Engine",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "cvg.computer_game_engine_developer.computer_game_engines_developed",
					"friendly_name": "Computer game engines developed"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :cvg.computer_game_engine_developer . \nVALUES ?x1 { :en.source_engine } \n?x0 :cvg.computer_game_engine_developer.computer_game_engines_developed ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 37000000,
		"question": "sony nex-5 uses which type of image stabilization technique?",
		"answer": [
			"Lens based optical stabilization"
		],
		"function": "none",
		"commonness": -20.571537198563355,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "digicams.image_stabilization_type",
					"class": "digicams.image_stabilization_type",
					"friendly_name": "Camera Image Stabilization Type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.0cp1pcv",
					"class": "digicams.digital_camera",
					"friendly_name": "Sony NEX-5",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "digicams.image_stabilization_type.digital_camera",
					"friendly_name": "Digital camera"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :digicams.image_stabilization_type . \nVALUES ?x1 { :m.0cp1pcv } \n?x0 :digicams.image_stabilization_type.digital_camera ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 37000001,
		"question": "nex-5 uses which type of image stabilization technique?",
		"answer": [
			"Lens based optical stabilization"
		],
		"function": "none",
		"commonness": -20.571537198563355,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "digicams.image_stabilization_type",
					"class": "digicams.image_stabilization_type",
					"friendly_name": "Camera Image Stabilization Type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.0cp1pcv",
					"class": "digicams.digital_camera",
					"friendly_name": "nex-5",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "digicams.image_stabilization_type.digital_camera",
					"friendly_name": "Digital camera"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :digicams.image_stabilization_type . \nVALUES ?x1 { :m.0cp1pcv } \n?x0 :digicams.image_stabilization_type.digital_camera ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 37000100,
		"question": "what type of image stabilization is used in the sony nex-5?",
		"answer": [
			"Lens based optical stabilization"
		],
		"function": "none",
		"commonness": -20.571537198563355,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "digicams.image_stabilization_type",
					"class": "digicams.image_stabilization_type",
					"friendly_name": "Camera Image Stabilization Type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.0cp1pcv",
					"class": "digicams.digital_camera",
					"friendly_name": "Sony NEX-5",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "digicams.image_stabilization_type.digital_camera",
					"friendly_name": "Digital camera"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :digicams.image_stabilization_type . \nVALUES ?x1 { :m.0cp1pcv } \n?x0 :digicams.image_stabilization_type.digital_camera ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 37000101,
		"question": "what type of image stabilization is used in the nex-5?",
		"answer": [
			"Lens based optical stabilization"
		],
		"function": "none",
		"commonness": -20.571537198563355,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "digicams.image_stabilization_type",
					"class": "digicams.image_stabilization_type",
					"friendly_name": "Camera Image Stabilization Type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.0cp1pcv",
					"class": "digicams.digital_camera",
					"friendly_name": "nex-5",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "digicams.image_stabilization_type.digital_camera",
					"friendly_name": "Digital camera"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :digicams.image_stabilization_type . \nVALUES ?x1 { :m.0cp1pcv } \n?x0 :digicams.image_stabilization_type.digital_camera ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 37000300,
		"question": "how does sony nex-5 stabilize images?",
		"answer": [
			"Lens based optical stabilization"
		],
		"function": "none",
		"commonness": -20.571537198563355,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "digicams.image_stabilization_type",
					"class": "digicams.image_stabilization_type",
					"friendly_name": "Camera Image Stabilization Type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.0cp1pcv",
					"class": "digicams.digital_camera",
					"friendly_name": "Sony NEX-5",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "digicams.image_stabilization_type.digital_camera",
					"friendly_name": "Digital camera"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :digicams.image_stabilization_type . \nVALUES ?x1 { :m.0cp1pcv } \n?x0 :digicams.image_stabilization_type.digital_camera ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 37000301,
		"question": "how does nex-5 stabilize images?",
		"answer": [
			"Lens based optical stabilization"
		],
		"function": "none",
		"commonness": -20.571537198563355,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "digicams.image_stabilization_type",
					"class": "digicams.image_stabilization_type",
					"friendly_name": "Camera Image Stabilization Type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.0cp1pcv",
					"class": "digicams.digital_camera",
					"friendly_name": "nex-5",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "digicams.image_stabilization_type.digital_camera",
					"friendly_name": "Digital camera"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :digicams.image_stabilization_type . \nVALUES ?x1 { :m.0cp1pcv } \n?x0 :digicams.image_stabilization_type.digital_camera ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 37000400,
		"question": "what kind of image stabilization technique is sony nex-5 using?",
		"answer": [
			"Lens based optical stabilization"
		],
		"function": "none",
		"commonness": -20.571537198563355,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "digicams.image_stabilization_type",
					"class": "digicams.image_stabilization_type",
					"friendly_name": "Camera Image Stabilization Type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.0cp1pcv",
					"class": "digicams.digital_camera",
					"friendly_name": "Sony NEX-5",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "digicams.image_stabilization_type.digital_camera",
					"friendly_name": "Digital camera"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :digicams.image_stabilization_type . \nVALUES ?x1 { :m.0cp1pcv } \n?x0 :digicams.image_stabilization_type.digital_camera ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 37000401,
		"question": "what kind of image stabilization technique is nex-5 using?",
		"answer": [
			"Lens based optical stabilization"
		],
		"function": "none",
		"commonness": -20.571537198563355,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "digicams.image_stabilization_type",
					"class": "digicams.image_stabilization_type",
					"friendly_name": "Camera Image Stabilization Type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.0cp1pcv",
					"class": "digicams.digital_camera",
					"friendly_name": "nex-5",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "digicams.image_stabilization_type.digital_camera",
					"friendly_name": "Digital camera"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :digicams.image_stabilization_type . \nVALUES ?x1 { :m.0cp1pcv } \n?x0 :digicams.image_stabilization_type.digital_camera ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 38000000,
		"question": "find the mother and father of ben stiller.",
		"answer": [
			"Jerry Stiller",
			"Anne Meara"
		],
		"function": "none",
		"commonness": -12.086977699616181,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.comedian",
					"class": "base.americancomedy.comedian",
					"friendly_name": "Comedian",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ben_stiller",
					"class": "people.person",
					"friendly_name": "Ben Stiller",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.children",
					"friendly_name": "Children"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.comedian . \nVALUES ?x1 { :en.ben_stiller } \n?x0 :people.person.children ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 38000200,
		"question": "who are ben stiller's parents?",
		"answer": [
			"Anne Meara",
			"Jerry Stiller"
		],
		"function": "none",
		"commonness": -12.086977699616181,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.comedian",
					"class": "base.americancomedy.comedian",
					"friendly_name": "Comedian",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ben_stiller",
					"class": "people.person",
					"friendly_name": "Ben Stiller",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.children",
					"friendly_name": "Children"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.comedian . \nVALUES ?x1 { :en.ben_stiller } \n?x0 :people.person.children ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 38000201,
		"question": "who are benjamin edward stiller's parents?",
		"answer": [
			"Anne Meara",
			"Jerry Stiller"
		],
		"function": "none",
		"commonness": -12.086977699616181,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.comedian",
					"class": "base.americancomedy.comedian",
					"friendly_name": "Comedian",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ben_stiller",
					"class": "people.person",
					"friendly_name": "benjamin edward stiller",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.children",
					"friendly_name": "Children"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.comedian . \nVALUES ?x1 { :en.ben_stiller } \n?x0 :people.person.children ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 38000202,
		"question": "who are benjamin stiller's parents?",
		"answer": [
			"Anne Meara",
			"Jerry Stiller"
		],
		"function": "none",
		"commonness": -12.086977699616181,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.comedian",
					"class": "base.americancomedy.comedian",
					"friendly_name": "Comedian",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.ben_stiller",
					"class": "people.person",
					"friendly_name": "benjamin stiller",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.children",
					"friendly_name": "Children"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.comedian . \nVALUES ?x1 { :en.ben_stiller } \n?x0 :people.person.children ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 39000000,
		"question": "svalbard has what fossil specimens?",
		"answer": [
			"Pliosaurus"
		],
		"function": "none",
		"commonness": -18.982916728576757,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.fossil_specimen",
					"class": "biology.fossil_specimen",
					"friendly_name": "Fossil specimen",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.svalbard",
					"class": "biology.fossil_site",
					"friendly_name": "Svalbard",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.fossil_specimen.found_at_site",
					"friendly_name": "Found at site"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.fossil_specimen . \nVALUES ?x1 { :en.svalbard } \n?x0 :biology.fossil_specimen.found_at_site ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 39000001,
		"question": "svalbard archipelago has what fossil specimens?",
		"answer": [
			"Pliosaurus"
		],
		"function": "none",
		"commonness": -18.982916728576757,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.fossil_specimen",
					"class": "biology.fossil_specimen",
					"friendly_name": "Fossil specimen",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.svalbard",
					"class": "biology.fossil_site",
					"friendly_name": "svalbard archipelago",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.fossil_specimen.found_at_site",
					"friendly_name": "Found at site"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.fossil_specimen . \nVALUES ?x1 { :en.svalbard } \n?x0 :biology.fossil_specimen.found_at_site ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 39000002,
		"question": "svalbard islands has what fossil specimens?",
		"answer": [
			"Pliosaurus"
		],
		"function": "none",
		"commonness": -18.982916728576757,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.fossil_specimen",
					"class": "biology.fossil_specimen",
					"friendly_name": "Fossil specimen",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.svalbard",
					"class": "biology.fossil_site",
					"friendly_name": "svalbard islands",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.fossil_specimen.found_at_site",
					"friendly_name": "Found at site"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.fossil_specimen . \nVALUES ?x1 { :en.svalbard } \n?x0 :biology.fossil_specimen.found_at_site ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 39000100,
		"question": "what fossil speciments are located in the svalbard site?",
		"answer": [
			"Pliosaurus"
		],
		"function": "none",
		"commonness": -18.982916728576757,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.fossil_specimen",
					"class": "biology.fossil_specimen",
					"friendly_name": "Fossil specimen",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.svalbard",
					"class": "biology.fossil_site",
					"friendly_name": "Svalbard",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.fossil_specimen.found_at_site",
					"friendly_name": "Found at site"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.fossil_specimen . \nVALUES ?x1 { :en.svalbard } \n?x0 :biology.fossil_specimen.found_at_site ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 39000101,
		"question": "what fossil speciments are located in the svalbard archipelago site?",
		"answer": [
			"Pliosaurus"
		],
		"function": "none",
		"commonness": -18.982916728576757,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.fossil_specimen",
					"class": "biology.fossil_specimen",
					"friendly_name": "Fossil specimen",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.svalbard",
					"class": "biology.fossil_site",
					"friendly_name": "svalbard archipelago",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.fossil_specimen.found_at_site",
					"friendly_name": "Found at site"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.fossil_specimen . \nVALUES ?x1 { :en.svalbard } \n?x0 :biology.fossil_specimen.found_at_site ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 39000102,
		"question": "what fossil speciments are located in the svalbard islands site?",
		"answer": [
			"Pliosaurus"
		],
		"function": "none",
		"commonness": -18.982916728576757,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.fossil_specimen",
					"class": "biology.fossil_specimen",
					"friendly_name": "Fossil specimen",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.svalbard",
					"class": "biology.fossil_site",
					"friendly_name": "svalbard islands",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.fossil_specimen.found_at_site",
					"friendly_name": "Found at site"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.fossil_specimen . \nVALUES ?x1 { :en.svalbard } \n?x0 :biology.fossil_specimen.found_at_site ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 39000200,
		"question": "which fossil specimens are found at svalbard?",
		"answer": [
			"Pliosaurus"
		],
		"function": "none",
		"commonness": -18.982916728576757,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.fossil_specimen",
					"class": "biology.fossil_specimen",
					"friendly_name": "Fossil specimen",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.svalbard",
					"class": "biology.fossil_site",
					"friendly_name": "Svalbard",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.fossil_specimen.found_at_site",
					"friendly_name": "Found at site"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.fossil_specimen . \nVALUES ?x1 { :en.svalbard } \n?x0 :biology.fossil_specimen.found_at_site ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 39000201,
		"question": "which fossil specimens are found at svalbard archipelago?",
		"answer": [
			"Pliosaurus"
		],
		"function": "none",
		"commonness": -18.982916728576757,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.fossil_specimen",
					"class": "biology.fossil_specimen",
					"friendly_name": "Fossil specimen",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.svalbard",
					"class": "biology.fossil_site",
					"friendly_name": "svalbard archipelago",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.fossil_specimen.found_at_site",
					"friendly_name": "Found at site"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.fossil_specimen . \nVALUES ?x1 { :en.svalbard } \n?x0 :biology.fossil_specimen.found_at_site ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 39000202,
		"question": "which fossil specimens are found at svalbard islands?",
		"answer": [
			"Pliosaurus"
		],
		"function": "none",
		"commonness": -18.982916728576757,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.fossil_specimen",
					"class": "biology.fossil_specimen",
					"friendly_name": "Fossil specimen",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.svalbard",
					"class": "biology.fossil_site",
					"friendly_name": "svalbard islands",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.fossil_specimen.found_at_site",
					"friendly_name": "Found at site"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.fossil_specimen . \nVALUES ?x1 { :en.svalbard } \n?x0 :biology.fossil_specimen.found_at_site ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 40000000,
		"question": "which casino has the most rooms?",
		"answer": [
			"Dunes"
		],
		"function": "argmax",
		"commonness": -15.67952353577434,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.casinos.casino",
					"class": "base.casinos.casino",
					"friendly_name": "Casino",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "0",
					"class": "type.int",
					"friendly_name": "0",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.casinos.casino.rooms",
					"friendly_name": "Rooms"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.casinos.casino . \n{\nSELECT (MAX(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :base.casinos.casino . \n?y0 :base.casinos.casino.rooms ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :base.casinos.casino.rooms ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]