[
	{
		"qid": 61000300,
		"question": "who are the data contributors of wordnet?",
		"answer": [
			"Helen Langone",
			"Randee Tengi",
			"Pamela Wakefield",
			"Christiane Fellbaum",
			"Benjamin R. Haskell",
			"George A. Miller"
		],
		"function": "none",
		"commonness": -16.318339719259637,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.database.data_contributor",
					"class": "base.database.data_contributor",
					"friendly_name": "Data contributor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.wordnet",
					"class": "base.database.database",
					"friendly_name": "WordNet",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.database.database.data_contributor_s",
					"friendly_name": "Data contributor(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.database.data_contributor . \nVALUES ?x1 { :en.wordnet } \n?x1 :base.database.database.data_contributor_s ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 61000301,
		"question": "who are the data contributors of princeton wordnet?",
		"answer": [
			"Pamela Wakefield",
			"Helen Langone",
			"Randee Tengi",
			"Benjamin R. Haskell",
			"George A. Miller",
			"Christiane Fellbaum"
		],
		"function": "none",
		"commonness": -16.318339719259637,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.database.data_contributor",
					"class": "base.database.data_contributor",
					"friendly_name": "Data contributor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.wordnet",
					"class": "base.database.database",
					"friendly_name": "princeton wordnet",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.database.database.data_contributor_s",
					"friendly_name": "Data contributor(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.database.data_contributor . \nVALUES ?x1 { :en.wordnet } \n?x1 :base.database.database.data_contributor_s ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 62000000,
		"question": "what fuel can be used for the engine bmw 3.0l 6 cylinder 300 hp 300 ft-lbs turbo?",
		"answer": [
			"Gasoline"
		],
		"function": "none",
		"commonness": -20.70207276046404,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "automotive.fuel",
					"class": "automotive.fuel",
					"friendly_name": "Fuel",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.bmw_3_0l_6_cylinder_300_hp_300_ft_lbs_turbo",
					"class": "automotive.engine",
					"friendly_name": "BMW 3.0L 6 cylinder 300 hp 300 ft-lbs Turbo",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "automotive.engine.fuels_used",
					"friendly_name": "Fuels Used"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :automotive.fuel . \nVALUES ?x1 { :en.bmw_3_0l_6_cylinder_300_hp_300_ft_lbs_turbo } \n?x1 :automotive.engine.fuels_used ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 62000100,
		"question": "what does the bmw 3.0l 6 cylinder 300 hp 300 ft-lbs turbo engine use for fuel?",
		"answer": [
			"Gasoline"
		],
		"function": "none",
		"commonness": -20.70207276046404,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "automotive.fuel",
					"class": "automotive.fuel",
					"friendly_name": "Fuel",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.bmw_3_0l_6_cylinder_300_hp_300_ft_lbs_turbo",
					"class": "automotive.engine",
					"friendly_name": "BMW 3.0L 6 cylinder 300 hp 300 ft-lbs Turbo",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "automotive.engine.fuels_used",
					"friendly_name": "Fuels Used"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :automotive.fuel . \nVALUES ?x1 { :en.bmw_3_0l_6_cylinder_300_hp_300_ft_lbs_turbo } \n?x1 :automotive.engine.fuels_used ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 62000200,
		"question": "what fuel does the bmw 3.0l 6 cylinder 300 hp 300 ft-lbs turbo engine use?",
		"answer": [
			"Gasoline"
		],
		"function": "none",
		"commonness": -20.70207276046404,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "automotive.fuel",
					"class": "automotive.fuel",
					"friendly_name": "Fuel",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.bmw_3_0l_6_cylinder_300_hp_300_ft_lbs_turbo",
					"class": "automotive.engine",
					"friendly_name": "BMW 3.0L 6 cylinder 300 hp 300 ft-lbs Turbo",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "automotive.engine.fuels_used",
					"friendly_name": "Fuels Used"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :automotive.fuel . \nVALUES ?x1 { :en.bmw_3_0l_6_cylinder_300_hp_300_ft_lbs_turbo } \n?x1 :automotive.engine.fuels_used ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 63000000,
		"question": "find islam diet practicers.",
		"answer": [
			"Q-Tip",
			"A. P. J. Abdul Kalam"
		],
		"function": "none",
		"commonness": -9.642628402256545,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.eating.practicer_of_diet",
					"class": "base.eating.practicer_of_diet",
					"friendly_name": "Practicer of diet",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.islam",
					"class": "religion.religion",
					"friendly_name": "Islam",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.religion",
					"friendly_name": "Religion"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.eating.practicer_of_diet . \nVALUES ?x1 { :en.islam } \n?x0 :people.person.religion ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 63000200,
		"question": "what are the names of diet practitioners who follow the islam religion?",
		"answer": [
			"Q-Tip",
			"A. P. J. Abdul Kalam"
		],
		"function": "none",
		"commonness": -9.642628402256545,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.eating.practicer_of_diet",
					"class": "base.eating.practicer_of_diet",
					"friendly_name": "Practicer of diet",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.islam",
					"class": "religion.religion",
					"friendly_name": "Islam",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.religion",
					"friendly_name": "Religion"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.eating.practicer_of_diet . \nVALUES ?x1 { :en.islam } \n?x0 :people.person.religion ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 63000202,
		"question": "what are the names of diet practitioners who follow the islamic faith religion?",
		"answer": [
			"A. P. J. Abdul Kalam",
			"Q-Tip"
		],
		"function": "none",
		"commonness": -9.642628402256545,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.eating.practicer_of_diet",
					"class": "base.eating.practicer_of_diet",
					"friendly_name": "Practicer of diet",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.islam",
					"class": "religion.religion",
					"friendly_name": "islamic faith",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.religion",
					"friendly_name": "Religion"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.eating.practicer_of_diet . \nVALUES ?x1 { :en.islam } \n?x0 :people.person.religion ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 64000000,
		"question": "which dog breeds have a blue coat?",
		"answer": [
			"Border Collie"
		],
		"function": "none",
		"commonness": -14.047684491886347,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.petbreeds.dog_breed",
					"class": "base.petbreeds.dog_breed",
					"friendly_name": "Dog Breed",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.blue",
					"class": "base.petbreeds.dog_coat_color",
					"friendly_name": "Blue",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.petbreeds.dog_breed.color",
					"friendly_name": "Color"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.petbreeds.dog_breed . \nVALUES ?x1 { :en.blue } \n?x0 :base.petbreeds.dog_breed.color ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 64000100,
		"question": "what is the name of the dog breed that features blue coat?",
		"answer": [
			"Border Collie"
		],
		"function": "none",
		"commonness": -14.047684491886347,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.petbreeds.dog_breed",
					"class": "base.petbreeds.dog_breed",
					"friendly_name": "Dog Breed",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.blue",
					"class": "base.petbreeds.dog_coat_color",
					"friendly_name": "Blue",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.petbreeds.dog_breed.color",
					"friendly_name": "Color"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.petbreeds.dog_breed . \nVALUES ?x1 { :en.blue } \n?x0 :base.petbreeds.dog_breed.color ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 64000200,
		"question": "which breeds of dogs are blue?",
		"answer": [
			"Border Collie"
		],
		"function": "none",
		"commonness": -14.047684491886347,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.petbreeds.dog_breed",
					"class": "base.petbreeds.dog_breed",
					"friendly_name": "Dog Breed",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.blue",
					"class": "base.petbreeds.dog_coat_color",
					"friendly_name": "Blue",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.petbreeds.dog_breed.color",
					"friendly_name": "Color"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.petbreeds.dog_breed . \nVALUES ?x1 { :en.blue } \n?x0 :base.petbreeds.dog_breed.color ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 64000300,
		"question": "what dog breeds are of blue color?",
		"answer": [
			"Border Collie"
		],
		"function": "none",
		"commonness": -14.047684491886347,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.petbreeds.dog_breed",
					"class": "base.petbreeds.dog_breed",
					"friendly_name": "Dog Breed",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.blue",
					"class": "base.petbreeds.dog_coat_color",
					"friendly_name": "Blue",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.petbreeds.dog_breed.color",
					"friendly_name": "Color"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.petbreeds.dog_breed . \nVALUES ?x1 { :en.blue } \n?x0 :base.petbreeds.dog_breed.color ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 65000000,
		"question": "what mathematical concept has circle as a specialization?",
		"answer": [
			"n-sphere"
		],
		"function": "none",
		"commonness": -15.649894192373681,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.mathematics1.mathematical_concept",
					"class": "base.mathematics1.mathematical_concept",
					"friendly_name": "Mathematical concept",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.circle",
					"class": "base.mathematics1.mathematical_concept",
					"friendly_name": "Circle",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.mathematics1.mathematical_concept.specializations",
					"friendly_name": "Specializations"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.mathematics1.mathematical_concept . \nVALUES ?x1 { :en.circle } \n?x0 :base.mathematics1.mathematical_concept.specializations ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 65000001,
		"question": "what mathematical concept has round as a specialization?",
		"answer": [
			"n-sphere"
		],
		"function": "none",
		"commonness": -15.649894192373681,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.mathematics1.mathematical_concept",
					"class": "base.mathematics1.mathematical_concept",
					"friendly_name": "Mathematical concept",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.circle",
					"class": "base.mathematics1.mathematical_concept",
					"friendly_name": "round",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.mathematics1.mathematical_concept.specializations",
					"friendly_name": "Specializations"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.mathematics1.mathematical_concept . \nVALUES ?x1 { :en.circle } \n?x0 :base.mathematics1.mathematical_concept.specializations ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 65000100,
		"question": "circle is a specialization of what mathematical concept?",
		"answer": [
			"n-sphere"
		],
		"function": "none",
		"commonness": -15.649894192373681,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.mathematics1.mathematical_concept",
					"class": "base.mathematics1.mathematical_concept",
					"friendly_name": "Mathematical concept",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.circle",
					"class": "base.mathematics1.mathematical_concept",
					"friendly_name": "Circle",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.mathematics1.mathematical_concept.specializations",
					"friendly_name": "Specializations"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.mathematics1.mathematical_concept . \nVALUES ?x1 { :en.circle } \n?x0 :base.mathematics1.mathematical_concept.specializations ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 65000101,
		"question": "round is a specialization of what mathematical concept?",
		"answer": [
			"n-sphere"
		],
		"function": "none",
		"commonness": -15.649894192373681,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.mathematics1.mathematical_concept",
					"class": "base.mathematics1.mathematical_concept",
					"friendly_name": "Mathematical concept",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.circle",
					"class": "base.mathematics1.mathematical_concept",
					"friendly_name": "round",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.mathematics1.mathematical_concept.specializations",
					"friendly_name": "Specializations"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.mathematics1.mathematical_concept . \nVALUES ?x1 { :en.circle } \n?x0 :base.mathematics1.mathematical_concept.specializations ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 65000200,
		"question": "what are the concepts in mathematics that generalize circle?",
		"answer": [
			"n-sphere"
		],
		"function": "none",
		"commonness": -15.649894192373681,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.mathematics1.mathematical_concept",
					"class": "base.mathematics1.mathematical_concept",
					"friendly_name": "Mathematical concept",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.circle",
					"class": "base.mathematics1.mathematical_concept",
					"friendly_name": "Circle",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.mathematics1.mathematical_concept.specializations",
					"friendly_name": "Specializations"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.mathematics1.mathematical_concept . \nVALUES ?x1 { :en.circle } \n?x0 :base.mathematics1.mathematical_concept.specializations ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 65000201,
		"question": "what are the concepts in mathematics that generalize round?",
		"answer": [
			"n-sphere"
		],
		"function": "none",
		"commonness": -15.649894192373681,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.mathematics1.mathematical_concept",
					"class": "base.mathematics1.mathematical_concept",
					"friendly_name": "Mathematical concept",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.circle",
					"class": "base.mathematics1.mathematical_concept",
					"friendly_name": "round",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.mathematics1.mathematical_concept.specializations",
					"friendly_name": "Specializations"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.mathematics1.mathematical_concept . \nVALUES ?x1 { :en.circle } \n?x0 :base.mathematics1.mathematical_concept.specializations ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 65000300,
		"question": "what mathematical concepts specialize circle?",
		"answer": [
			"n-sphere"
		],
		"function": "none",
		"commonness": -15.649894192373681,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.mathematics1.mathematical_concept",
					"class": "base.mathematics1.mathematical_concept",
					"friendly_name": "Mathematical concept",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.circle",
					"class": "base.mathematics1.mathematical_concept",
					"friendly_name": "Circle",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.mathematics1.mathematical_concept.specializations",
					"friendly_name": "Specializations"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.mathematics1.mathematical_concept . \nVALUES ?x1 { :en.circle } \n?x0 :base.mathematics1.mathematical_concept.specializations ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 65000301,
		"question": "what mathematical concepts specialize round?",
		"answer": [
			"n-sphere"
		],
		"function": "none",
		"commonness": -15.649894192373681,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.mathematics1.mathematical_concept",
					"class": "base.mathematics1.mathematical_concept",
					"friendly_name": "Mathematical concept",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.circle",
					"class": "base.mathematics1.mathematical_concept",
					"friendly_name": "round",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.mathematics1.mathematical_concept.specializations",
					"friendly_name": "Specializations"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.mathematics1.mathematical_concept . \nVALUES ?x1 { :en.circle } \n?x0 :base.mathematics1.mathematical_concept.specializations ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 66000000,
		"question": "find theses from university of california, berkeley.",
		"answer": [
			"A Framework for Separating Server Scalability and Availability from Internet Application Functionality",
			"Ultraproducts and Elementary Classes"
		],
		"function": "none",
		"commonness": -17.258794343414916,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.bibkn.thesis",
					"class": "base.bibkn.thesis",
					"friendly_name": "Thesis",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.university_of_california_berkeley",
					"class": "education.educational_institution",
					"friendly_name": "University of California, Berkeley",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "education.dissertation.institution",
					"friendly_name": "Institution"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.bibkn.thesis . \nVALUES ?x1 { :en.university_of_california_berkeley } \n?x0 :education.dissertation.institution ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 66000100,
		"question": "what dissertations were written at university of california, berkeley?",
		"answer": [
			"A Framework for Separating Server Scalability and Availability from Internet Application Functionality",
			"Ultraproducts and Elementary Classes"
		],
		"function": "none",
		"commonness": -17.258794343414916,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.bibkn.thesis",
					"class": "base.bibkn.thesis",
					"friendly_name": "Thesis",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.university_of_california_berkeley",
					"class": "education.educational_institution",
					"friendly_name": "University of California, Berkeley",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "education.dissertation.institution",
					"friendly_name": "Institution"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.bibkn.thesis . \nVALUES ?x1 { :en.university_of_california_berkeley } \n?x0 :education.dissertation.institution ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 66000101,
		"question": "what dissertations were written at uc berkeley?",
		"answer": [
			"Ultraproducts and Elementary Classes",
			"A Framework for Separating Server Scalability and Availability from Internet Application Functionality"
		],
		"function": "none",
		"commonness": -17.258794343414916,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.bibkn.thesis",
					"class": "base.bibkn.thesis",
					"friendly_name": "Thesis",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.university_of_california_berkeley",
					"class": "education.educational_institution",
					"friendly_name": "uc berkeley",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "education.dissertation.institution",
					"friendly_name": "Institution"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.bibkn.thesis . \nVALUES ?x1 { :en.university_of_california_berkeley } \n?x0 :education.dissertation.institution ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 66000102,
		"question": "what dissertations were written at university of california at berkeley?",
		"answer": [
			"A Framework for Separating Server Scalability and Availability from Internet Application Functionality",
			"Ultraproducts and Elementary Classes"
		],
		"function": "none",
		"commonness": -17.258794343414916,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.bibkn.thesis",
					"class": "base.bibkn.thesis",
					"friendly_name": "Thesis",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.university_of_california_berkeley",
					"class": "education.educational_institution",
					"friendly_name": "university of california at berkeley",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "education.dissertation.institution",
					"friendly_name": "Institution"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.bibkn.thesis . \nVALUES ?x1 { :en.university_of_california_berkeley } \n?x0 :education.dissertation.institution ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]