[
	{
		"qid": 151000501,
		"question": "the us has been hit by how many tropical cyclones?",
		"answer": [
			"24"
		],
		"function": "count",
		"commonness": -9.954693910239504,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "meteorology.tropical_cyclone",
					"class": "meteorology.tropical_cyclone",
					"friendly_name": "Tropical Cyclone",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "meteorology.cyclone_affected_area",
					"friendly_name": "us",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "meteorology.tropical_cyclone.affected_areas",
					"friendly_name": "Affected areas"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :meteorology.tropical_cyclone . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :meteorology.tropical_cyclone.affected_areas ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 151000502,
		"question": "the united states has been hit by how many tropical cyclones?",
		"answer": [
			"24"
		],
		"function": "count",
		"commonness": -9.954693910239504,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "meteorology.tropical_cyclone",
					"class": "meteorology.tropical_cyclone",
					"friendly_name": "Tropical Cyclone",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "meteorology.cyclone_affected_area",
					"friendly_name": "united states",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "meteorology.tropical_cyclone.affected_areas",
					"friendly_name": "Affected areas"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :meteorology.tropical_cyclone . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :meteorology.tropical_cyclone.affected_areas ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 152000000,
		"question": "give me the count of tracks on the release anne.",
		"answer": [
			"15"
		],
		"function": "count",
		"commonness": -11.490447809019981,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.release_track",
					"class": "music.release_track",
					"friendly_name": "Release track",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.03b7wt1",
					"class": "music.release",
					"friendly_name": "Anne",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "music.release.track_list",
					"friendly_name": "Track list"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.release_track . \nVALUES ?x1 { :m.03b7wt1 } \n?x1 :music.release.track_list ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 152000100,
		"question": "the album anne features how many tracks?",
		"answer": [
			"15"
		],
		"function": "count",
		"commonness": -11.490447809019981,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.release_track",
					"class": "music.release_track",
					"friendly_name": "Release track",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.03b7wt1",
					"class": "music.release",
					"friendly_name": "Anne",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "music.release.track_list",
					"friendly_name": "Track list"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.release_track . \nVALUES ?x1 { :m.03b7wt1 } \n?x1 :music.release.track_list ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 152000200,
		"question": "on the album anne, how many tracks are there?",
		"answer": [
			"15"
		],
		"function": "count",
		"commonness": -11.490447809019981,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.release_track",
					"class": "music.release_track",
					"friendly_name": "Release track",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.03b7wt1",
					"class": "music.release",
					"friendly_name": "Anne",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "music.release.track_list",
					"friendly_name": "Track list"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.release_track . \nVALUES ?x1 { :m.03b7wt1 } \n?x1 :music.release.track_list ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 152000300,
		"question": "how many tracks are on the album anne?",
		"answer": [
			"15"
		],
		"function": "count",
		"commonness": -11.490447809019981,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.release_track",
					"class": "music.release_track",
					"friendly_name": "Release track",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.03b7wt1",
					"class": "music.release",
					"friendly_name": "Anne",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "music.release.track_list",
					"friendly_name": "Track list"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.release_track . \nVALUES ?x1 { :m.03b7wt1 } \n?x1 :music.release.track_list ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 152000400,
		"question": "how many tracks are contained in anne?",
		"answer": [
			"15"
		],
		"function": "count",
		"commonness": -11.490447809019981,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.release_track",
					"class": "music.release_track",
					"friendly_name": "Release track",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.03b7wt1",
					"class": "music.release",
					"friendly_name": "Anne",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "music.release.track_list",
					"friendly_name": "Track list"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.release_track . \nVALUES ?x1 { :m.03b7wt1 } \n?x1 :music.release.track_list ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 152000500,
		"question": "how many songs are on the album anne?",
		"answer": [
			"15"
		],
		"function": "count",
		"commonness": -11.490447809019981,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.release_track",
					"class": "music.release_track",
					"friendly_name": "Release track",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.03b7wt1",
					"class": "music.release",
					"friendly_name": "Anne",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "music.release.track_list",
					"friendly_name": "Track list"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.release_track . \nVALUES ?x1 { :m.03b7wt1 } \n?x1 :music.release.track_list ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 153000000,
		"question": "the book the structure of evolutionary theory contains how many references?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -19.583634519648232,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.cited_work",
					"class": "book.cited_work",
					"friendly_name": "Cited work",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.the_structure_of_evolutionary_theory",
					"class": "book.scholarly_work",
					"friendly_name": "The Structure of Evolutionary Theory",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "book.scholarly_work.works_cited",
					"friendly_name": "Works cited"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.cited_work . \nVALUES ?x1 { :en.the_structure_of_evolutionary_theory } \n?x1 :book.scholarly_work.works_cited ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 153000100,
		"question": "the the structure of evolutionary theory cited how many works?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -19.583634519648232,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.cited_work",
					"class": "book.cited_work",
					"friendly_name": "Cited work",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.the_structure_of_evolutionary_theory",
					"class": "book.scholarly_work",
					"friendly_name": "The Structure of Evolutionary Theory",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "book.scholarly_work.works_cited",
					"friendly_name": "Works cited"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.cited_work . \nVALUES ?x1 { :en.the_structure_of_evolutionary_theory } \n?x1 :book.scholarly_work.works_cited ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 153000200,
		"question": "how many works are cited by the structure of evolutionary theory?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -19.583634519648232,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.cited_work",
					"class": "book.cited_work",
					"friendly_name": "Cited work",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.the_structure_of_evolutionary_theory",
					"class": "book.scholarly_work",
					"friendly_name": "The Structure of Evolutionary Theory",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "book.scholarly_work.works_cited",
					"friendly_name": "Works cited"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.cited_work . \nVALUES ?x1 { :en.the_structure_of_evolutionary_theory } \n?x1 :book.scholarly_work.works_cited ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 153000300,
		"question": "what is the number of works cited by the structure of evolutionary theory?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -19.583634519648232,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.cited_work",
					"class": "book.cited_work",
					"friendly_name": "Cited work",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.the_structure_of_evolutionary_theory",
					"class": "book.scholarly_work",
					"friendly_name": "The Structure of Evolutionary Theory",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "book.scholarly_work.works_cited",
					"friendly_name": "Works cited"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.cited_work . \nVALUES ?x1 { :en.the_structure_of_evolutionary_theory } \n?x1 :book.scholarly_work.works_cited ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 153000400,
		"question": "how many references are there in the book the structure of evolutionary theory?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -19.583634519648232,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.cited_work",
					"class": "book.cited_work",
					"friendly_name": "Cited work",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.the_structure_of_evolutionary_theory",
					"class": "book.scholarly_work",
					"friendly_name": "The Structure of Evolutionary Theory",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "book.scholarly_work.works_cited",
					"friendly_name": "Works cited"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.cited_work . \nVALUES ?x1 { :en.the_structure_of_evolutionary_theory } \n?x1 :book.scholarly_work.works_cited ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 154000000,
		"question": "how many songs has nirvana engineered?",
		"answer": [
			"15"
		],
		"function": "count",
		"commonness": -12.517132960870931,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.recording",
					"class": "music.recording",
					"friendly_name": "Musical Recording",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.0b1zz",
					"class": "music.engineer",
					"friendly_name": "Nirvana",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "music.recording.engineer",
					"friendly_name": "Engineer"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.recording . \nVALUES ?x1 { :m.0b1zz } \n?x0 :music.recording.engineer ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 154000100,
		"question": "how many musical tracks has nirvana recorded?",
		"answer": [
			"15"
		],
		"function": "count",
		"commonness": -12.517132960870931,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.recording",
					"class": "music.recording",
					"friendly_name": "Musical Recording",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.0b1zz",
					"class": "music.engineer",
					"friendly_name": "Nirvana",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "music.recording.engineer",
					"friendly_name": "Engineer"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.recording . \nVALUES ?x1 { :m.0b1zz } \n?x0 :music.recording.engineer ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 154000200,
		"question": "how many songs has nirvana recorded?",
		"answer": [
			"15"
		],
		"function": "count",
		"commonness": -12.517132960870931,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.recording",
					"class": "music.recording",
					"friendly_name": "Musical Recording",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.0b1zz",
					"class": "music.engineer",
					"friendly_name": "Nirvana",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "music.recording.engineer",
					"friendly_name": "Engineer"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.recording . \nVALUES ?x1 { :m.0b1zz } \n?x0 :music.recording.engineer ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 154000300,
		"question": "nirvana recorded a total of how many songs?",
		"answer": [
			"15"
		],
		"function": "count",
		"commonness": -12.517132960870931,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.recording",
					"class": "music.recording",
					"friendly_name": "Musical Recording",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.0b1zz",
					"class": "music.engineer",
					"friendly_name": "Nirvana",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "music.recording.engineer",
					"friendly_name": "Engineer"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.recording . \nVALUES ?x1 { :m.0b1zz } \n?x0 :music.recording.engineer ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 155000000,
		"question": "give me the number of courts louise arbour has worked in as a judge.",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -15.351967403051713,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.court",
					"class": "law.court",
					"friendly_name": "Court",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.louise_arbour",
					"class": "base.morelaw.canadian_judge",
					"friendly_name": "Louise Arbour",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.morelaw.canadian_judge.court",
					"friendly_name": "Court"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.court . \nVALUES ?x1 { :en.louise_arbour } \n?x1 :base.morelaw.canadian_judge.court ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 155000100,
		"question": "louise arbour has worked in how many courts?",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -15.351967403051713,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.court",
					"class": "law.court",
					"friendly_name": "Court",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.louise_arbour",
					"class": "base.morelaw.canadian_judge",
					"friendly_name": "Louise Arbour",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.morelaw.canadian_judge.court",
					"friendly_name": "Court"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.court . \nVALUES ?x1 { :en.louise_arbour } \n?x1 :base.morelaw.canadian_judge.court ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 155000200,
		"question": "how many courts has louise arbour worked in?",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -15.351967403051713,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.court",
					"class": "law.court",
					"friendly_name": "Court",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.louise_arbour",
					"class": "base.morelaw.canadian_judge",
					"friendly_name": "Louise Arbour",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.morelaw.canadian_judge.court",
					"friendly_name": "Court"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.court . \nVALUES ?x1 { :en.louise_arbour } \n?x1 :base.morelaw.canadian_judge.court ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 155000300,
		"question": "in how many courts louise arbour served?",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -15.351967403051713,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.court",
					"class": "law.court",
					"friendly_name": "Court",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.louise_arbour",
					"class": "base.morelaw.canadian_judge",
					"friendly_name": "Louise Arbour",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.morelaw.canadian_judge.court",
					"friendly_name": "Court"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.court . \nVALUES ?x1 { :en.louise_arbour } \n?x1 :base.morelaw.canadian_judge.court ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 156000000,
		"question": "the rosa rugosa is what kind of rose?",
		"answer": [
			"Shrub rose"
		],
		"function": "none",
		"commonness": -19.269808048337932,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.roses.type_of_rose",
					"class": "base.roses.type_of_rose",
					"friendly_name": "type_of_rose",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.rugosa_rose",
					"class": "base.roses.roses",
					"friendly_name": "Rosa rugosa",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.roses.type_of_rose.roses_of_this_type",
					"friendly_name": "Roses of this type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.roses.type_of_rose . \nVALUES ?x1 { :en.rugosa_rose } \n?x0 :base.roses.type_of_rose.roses_of_this_type ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 156000100,
		"question": "what type of rose is rosa rugosa?",
		"answer": [
			"Shrub rose"
		],
		"function": "none",
		"commonness": -19.269808048337932,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.roses.type_of_rose",
					"class": "base.roses.type_of_rose",
					"friendly_name": "type_of_rose",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.rugosa_rose",
					"class": "base.roses.roses",
					"friendly_name": "Rosa rugosa",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.roses.type_of_rose.roses_of_this_type",
					"friendly_name": "Roses of this type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.roses.type_of_rose . \nVALUES ?x1 { :en.rugosa_rose } \n?x0 :base.roses.type_of_rose.roses_of_this_type ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 156000200,
		"question": "what's the classification of rosa rugosa?",
		"answer": [
			"Shrub rose"
		],
		"function": "none",
		"commonness": -19.269808048337932,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.roses.type_of_rose",
					"class": "base.roses.type_of_rose",
					"friendly_name": "type_of_rose",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.rugosa_rose",
					"class": "base.roses.roses",
					"friendly_name": "Rosa rugosa",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.roses.type_of_rose.roses_of_this_type",
					"friendly_name": "Roses of this type"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.roses.type_of_rose . \nVALUES ?x1 { :en.rugosa_rose } \n?x0 :base.roses.type_of_rose.roses_of_this_type ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 157000000,
		"question": "list the producers of american idol.",
		"answer": [
			"19 Entertainment"
		],
		"function": "none",
		"commonness": -11.985498092691113,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "broadcast.producer",
					"class": "broadcast.producer",
					"friendly_name": "Broadcast Producer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.american_idol",
					"class": "broadcast.content",
					"friendly_name": "American Idol",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.producer.produces",
					"friendly_name": "Produces"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :broadcast.producer . \nVALUES ?x1 { :en.american_idol } \n?x0 :broadcast.producer.produces ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 157000100,
		"question": "who was the show american idol produced by?",
		"answer": [
			"19 Entertainment"
		],
		"function": "none",
		"commonness": -11.985498092691113,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "broadcast.producer",
					"class": "broadcast.producer",
					"friendly_name": "Broadcast Producer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.american_idol",
					"class": "broadcast.content",
					"friendly_name": "American Idol",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.producer.produces",
					"friendly_name": "Produces"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :broadcast.producer . \nVALUES ?x1 { :en.american_idol } \n?x0 :broadcast.producer.produces ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]