[
	{
		"qid": 11000500,
		"question": "which business manufactures the nikon d300 camera's image sensor?",
		"answer": [
			"Nikon Corporation"
		],
		"function": "none",
		"commonness": -15.008139899197342,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "digicams.camera_sensor_manufacturer",
					"class": "digicams.camera_sensor_manufacturer",
					"friendly_name": "Camera Sensor Manufacturer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nikon_d300",
					"class": "digicams.digital_camera",
					"friendly_name": "Nikon D300",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "digicams.camera_sensor_manufacturer.cameras",
					"friendly_name": "Cameras"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :digicams.camera_sensor_manufacturer . \nVALUES ?x1 { :en.nikon_d300 } \n?x0 :digicams.camera_sensor_manufacturer.cameras ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 11000501,
		"question": "which business manufactures the d300 camera's image sensor?",
		"answer": [
			"Nikon Corporation"
		],
		"function": "none",
		"commonness": -15.008139899197342,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "digicams.camera_sensor_manufacturer",
					"class": "digicams.camera_sensor_manufacturer",
					"friendly_name": "Camera Sensor Manufacturer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nikon_d300",
					"class": "digicams.digital_camera",
					"friendly_name": "d300",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "digicams.camera_sensor_manufacturer.cameras",
					"friendly_name": "Cameras"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :digicams.camera_sensor_manufacturer . \nVALUES ?x1 { :en.nikon_d300 } \n?x0 :digicams.camera_sensor_manufacturer.cameras ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 12000000,
		"question": "what ice hockey coaches have been working on their current job since 2009?",
		"answer": [
			"Dan Bylsma",
			"John Tortorella",
			"Peter Laviolette"
		],
		"function": "none",
		"commonness": -16.902052285994483,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "ice_hockey.hockey_coach",
					"class": "ice_hockey.hockey_coach",
					"friendly_name": "Ice hockey coach",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "2009^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "2009",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "ice_hockey.hockey_coach.first_year_with_current_team",
					"friendly_name": "First Year With Current Team"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :ice_hockey.hockey_coach . \nVALUES ?x1 { \"2009\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?x0 :ice_hockey.hockey_coach.first_year_with_current_team ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 12000100,
		"question": "2009 was the starting time of what current ice hockey coaches?",
		"answer": [
			"Dan Bylsma",
			"John Tortorella",
			"Peter Laviolette"
		],
		"function": "none",
		"commonness": -16.902052285994483,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "ice_hockey.hockey_coach",
					"class": "ice_hockey.hockey_coach",
					"friendly_name": "Ice hockey coach",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "2009^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "2009",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "ice_hockey.hockey_coach.first_year_with_current_team",
					"friendly_name": "First Year With Current Team"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :ice_hockey.hockey_coach . \nVALUES ?x1 { \"2009\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?x0 :ice_hockey.hockey_coach.first_year_with_current_team ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 12000200,
		"question": "which ice hockey coaches started their current employment from 2009?",
		"answer": [
			"Dan Bylsma",
			"John Tortorella",
			"Peter Laviolette"
		],
		"function": "none",
		"commonness": -16.902052285994483,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "ice_hockey.hockey_coach",
					"class": "ice_hockey.hockey_coach",
					"friendly_name": "Ice hockey coach",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "2009^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "2009",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "ice_hockey.hockey_coach.first_year_with_current_team",
					"friendly_name": "First Year With Current Team"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :ice_hockey.hockey_coach . \nVALUES ?x1 { \"2009\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?x0 :ice_hockey.hockey_coach.first_year_with_current_team ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 12000300,
		"question": "who started to coach his/her current ice hockey team from 2009?",
		"answer": [
			"John Tortorella",
			"Dan Bylsma",
			"Peter Laviolette"
		],
		"function": "none",
		"commonness": -16.902052285994483,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "ice_hockey.hockey_coach",
					"class": "ice_hockey.hockey_coach",
					"friendly_name": "Ice hockey coach",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "2009^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "2009",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "ice_hockey.hockey_coach.first_year_with_current_team",
					"friendly_name": "First Year With Current Team"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :ice_hockey.hockey_coach . \nVALUES ?x1 { \"2009\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?x0 :ice_hockey.hockey_coach.first_year_with_current_team ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 12000400,
		"question": "which ice hockey coaches started to coach their current team in 2009?",
		"answer": [
			"Peter Laviolette",
			"John Tortorella",
			"Dan Bylsma"
		],
		"function": "none",
		"commonness": -16.902052285994483,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "ice_hockey.hockey_coach",
					"class": "ice_hockey.hockey_coach",
					"friendly_name": "Ice hockey coach",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "2009^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "2009",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "ice_hockey.hockey_coach.first_year_with_current_team",
					"friendly_name": "First Year With Current Team"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :ice_hockey.hockey_coach . \nVALUES ?x1 { \"2009\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?x0 :ice_hockey.hockey_coach.first_year_with_current_team ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 13000000,
		"question": "which synagogues were designed in a gothic architecture style?",
		"answer": [
			"Eldridge Street Synagogue"
		],
		"function": "none",
		"commonness": -14.383022737137626,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.jewishcommunities.synagogue",
					"class": "base.jewishcommunities.synagogue",
					"friendly_name": "Synagogue",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.gothic_architecture",
					"class": "architecture.architectural_style",
					"friendly_name": "Gothic architecture",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.structure.architectural_style",
					"friendly_name": "Architectural Style"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.jewishcommunities.synagogue . \nVALUES ?x1 { :en.gothic_architecture } \n?x0 :architecture.structure.architectural_style ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 13000001,
		"question": "which synagogues were designed in a gothic style?",
		"answer": [
			"Eldridge Street Synagogue"
		],
		"function": "none",
		"commonness": -14.383022737137626,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.jewishcommunities.synagogue",
					"class": "base.jewishcommunities.synagogue",
					"friendly_name": "Synagogue",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.gothic_architecture",
					"class": "architecture.architectural_style",
					"friendly_name": "gothic",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.structure.architectural_style",
					"friendly_name": "Architectural Style"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.jewishcommunities.synagogue . \nVALUES ?x1 { :en.gothic_architecture } \n?x0 :architecture.structure.architectural_style ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 13000002,
		"question": "which synagogues were designed in a gothical style?",
		"answer": [
			"Eldridge Street Synagogue"
		],
		"function": "none",
		"commonness": -14.383022737137626,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.jewishcommunities.synagogue",
					"class": "base.jewishcommunities.synagogue",
					"friendly_name": "Synagogue",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.gothic_architecture",
					"class": "architecture.architectural_style",
					"friendly_name": "gothical",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.structure.architectural_style",
					"friendly_name": "Architectural Style"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.jewishcommunities.synagogue . \nVALUES ?x1 { :en.gothic_architecture } \n?x0 :architecture.structure.architectural_style ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 13000100,
		"question": "which synagogues are of the gothic architecture style?",
		"answer": [
			"Eldridge Street Synagogue"
		],
		"function": "none",
		"commonness": -14.383022737137626,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.jewishcommunities.synagogue",
					"class": "base.jewishcommunities.synagogue",
					"friendly_name": "Synagogue",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.gothic_architecture",
					"class": "architecture.architectural_style",
					"friendly_name": "Gothic architecture",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.structure.architectural_style",
					"friendly_name": "Architectural Style"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.jewishcommunities.synagogue . \nVALUES ?x1 { :en.gothic_architecture } \n?x0 :architecture.structure.architectural_style ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 13000101,
		"question": "which synagogues are of the gothic style?",
		"answer": [
			"Eldridge Street Synagogue"
		],
		"function": "none",
		"commonness": -14.383022737137626,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.jewishcommunities.synagogue",
					"class": "base.jewishcommunities.synagogue",
					"friendly_name": "Synagogue",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.gothic_architecture",
					"class": "architecture.architectural_style",
					"friendly_name": "gothic",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.structure.architectural_style",
					"friendly_name": "Architectural Style"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.jewishcommunities.synagogue . \nVALUES ?x1 { :en.gothic_architecture } \n?x0 :architecture.structure.architectural_style ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 13000102,
		"question": "which synagogues are of the gothical style?",
		"answer": [
			"Eldridge Street Synagogue"
		],
		"function": "none",
		"commonness": -14.383022737137626,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.jewishcommunities.synagogue",
					"class": "base.jewishcommunities.synagogue",
					"friendly_name": "Synagogue",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.gothic_architecture",
					"class": "architecture.architectural_style",
					"friendly_name": "gothical",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.structure.architectural_style",
					"friendly_name": "Architectural Style"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.jewishcommunities.synagogue . \nVALUES ?x1 { :en.gothic_architecture } \n?x0 :architecture.structure.architectural_style ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 13000200,
		"question": "what is the name of the jewish synagogue representing the gothic architecture style?",
		"answer": [
			"Eldridge Street Synagogue"
		],
		"function": "none",
		"commonness": -14.383022737137626,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.jewishcommunities.synagogue",
					"class": "base.jewishcommunities.synagogue",
					"friendly_name": "Synagogue",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.gothic_architecture",
					"class": "architecture.architectural_style",
					"friendly_name": "Gothic architecture",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.structure.architectural_style",
					"friendly_name": "Architectural Style"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.jewishcommunities.synagogue . \nVALUES ?x1 { :en.gothic_architecture } \n?x0 :architecture.structure.architectural_style ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 13000201,
		"question": "what is the name of the jewish synagogue representing the gothic style?",
		"answer": [
			"Eldridge Street Synagogue"
		],
		"function": "none",
		"commonness": -14.383022737137626,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.jewishcommunities.synagogue",
					"class": "base.jewishcommunities.synagogue",
					"friendly_name": "Synagogue",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.gothic_architecture",
					"class": "architecture.architectural_style",
					"friendly_name": "gothic",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.structure.architectural_style",
					"friendly_name": "Architectural Style"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.jewishcommunities.synagogue . \nVALUES ?x1 { :en.gothic_architecture } \n?x0 :architecture.structure.architectural_style ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 13000202,
		"question": "what is the name of the jewish synagogue representing the gothical style?",
		"answer": [
			"Eldridge Street Synagogue"
		],
		"function": "none",
		"commonness": -14.383022737137626,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.jewishcommunities.synagogue",
					"class": "base.jewishcommunities.synagogue",
					"friendly_name": "Synagogue",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.gothic_architecture",
					"class": "architecture.architectural_style",
					"friendly_name": "gothical",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.structure.architectural_style",
					"friendly_name": "Architectural Style"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.jewishcommunities.synagogue . \nVALUES ?x1 { :en.gothic_architecture } \n?x0 :architecture.structure.architectural_style ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 13000300,
		"question": "what are the synagogues that are built with a gothic architecture?",
		"answer": [
			"Eldridge Street Synagogue"
		],
		"function": "none",
		"commonness": -14.383022737137626,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.jewishcommunities.synagogue",
					"class": "base.jewishcommunities.synagogue",
					"friendly_name": "Synagogue",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.gothic_architecture",
					"class": "architecture.architectural_style",
					"friendly_name": "Gothic architecture",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.structure.architectural_style",
					"friendly_name": "Architectural Style"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.jewishcommunities.synagogue . \nVALUES ?x1 { :en.gothic_architecture } \n?x0 :architecture.structure.architectural_style ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 13000301,
		"question": "what are the synagogues that are built with a gothic?",
		"answer": [
			"Eldridge Street Synagogue"
		],
		"function": "none",
		"commonness": -14.383022737137626,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.jewishcommunities.synagogue",
					"class": "base.jewishcommunities.synagogue",
					"friendly_name": "Synagogue",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.gothic_architecture",
					"class": "architecture.architectural_style",
					"friendly_name": "gothic",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.structure.architectural_style",
					"friendly_name": "Architectural Style"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.jewishcommunities.synagogue . \nVALUES ?x1 { :en.gothic_architecture } \n?x0 :architecture.structure.architectural_style ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 13000302,
		"question": "what are the synagogues that are built with a gothical?",
		"answer": [
			"Eldridge Street Synagogue"
		],
		"function": "none",
		"commonness": -14.383022737137626,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.jewishcommunities.synagogue",
					"class": "base.jewishcommunities.synagogue",
					"friendly_name": "Synagogue",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.gothic_architecture",
					"class": "architecture.architectural_style",
					"friendly_name": "gothical",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.structure.architectural_style",
					"friendly_name": "Architectural Style"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.jewishcommunities.synagogue . \nVALUES ?x1 { :en.gothic_architecture } \n?x0 :architecture.structure.architectural_style ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 13000400,
		"question": "which synagogue has the architectural style gothic architecture?",
		"answer": [
			"Eldridge Street Synagogue"
		],
		"function": "none",
		"commonness": -14.383022737137626,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.jewishcommunities.synagogue",
					"class": "base.jewishcommunities.synagogue",
					"friendly_name": "Synagogue",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.gothic_architecture",
					"class": "architecture.architectural_style",
					"friendly_name": "Gothic architecture",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.structure.architectural_style",
					"friendly_name": "Architectural Style"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.jewishcommunities.synagogue . \nVALUES ?x1 { :en.gothic_architecture } \n?x0 :architecture.structure.architectural_style ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 13000401,
		"question": "which synagogue has the architectural style gothic?",
		"answer": [
			"Eldridge Street Synagogue"
		],
		"function": "none",
		"commonness": -14.383022737137626,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.jewishcommunities.synagogue",
					"class": "base.jewishcommunities.synagogue",
					"friendly_name": "Synagogue",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.gothic_architecture",
					"class": "architecture.architectural_style",
					"friendly_name": "gothic",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.structure.architectural_style",
					"friendly_name": "Architectural Style"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.jewishcommunities.synagogue . \nVALUES ?x1 { :en.gothic_architecture } \n?x0 :architecture.structure.architectural_style ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 13000402,
		"question": "which synagogue has the architectural style gothical?",
		"answer": [
			"Eldridge Street Synagogue"
		],
		"function": "none",
		"commonness": -14.383022737137626,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.jewishcommunities.synagogue",
					"class": "base.jewishcommunities.synagogue",
					"friendly_name": "Synagogue",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.gothic_architecture",
					"class": "architecture.architectural_style",
					"friendly_name": "gothical",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.structure.architectural_style",
					"friendly_name": "Architectural Style"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.jewishcommunities.synagogue . \nVALUES ?x1 { :en.gothic_architecture } \n?x0 :architecture.structure.architectural_style ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 14000000,
		"question": "who wrote twilight?",
		"answer": [
			"Stephenie Meyer"
		],
		"function": "none",
		"commonness": -11.10139189737362,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.film_story_contributor",
					"class": "film.film_story_contributor",
					"friendly_name": "Film story contributor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.03nm_fh",
					"class": "film.film",
					"friendly_name": "Twilight",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "film.film.story_by",
					"friendly_name": "Story by"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.film_story_contributor . \nVALUES ?x1 { :m.03nm_fh } \n?x1 :film.film.story_by ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]