[
	{
		"qid": 48000002,
		"question": "what is the temperament of gsd?",
		"answer": [
			"Courageous",
			"Intelligent",
			"Watchful",
			"Alert",
			"Loyal",
			"Confident"
		],
		"function": "none",
		"commonness": -17.262168132401072,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.petbreeds.dog_temperament",
					"class": "base.petbreeds.dog_temperament",
					"friendly_name": "Dog Temperament",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.east_german_shepherd_dog",
					"class": "base.petbreeds.dog_breed",
					"friendly_name": "gsd",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.petbreeds.dog_breed.temperament",
					"friendly_name": "Temperament"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.petbreeds.dog_temperament . \nVALUES ?x1 { :en.east_german_shepherd_dog } \n?x1 :base.petbreeds.dog_breed.temperament ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 48000100,
		"question": "what type of temperament is displayed by a german shepherd dog?",
		"answer": [
			"Confident",
			"Alert",
			"Watchful",
			"Intelligent",
			"Courageous",
			"Loyal"
		],
		"function": "none",
		"commonness": -17.262168132401072,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.petbreeds.dog_temperament",
					"class": "base.petbreeds.dog_temperament",
					"friendly_name": "Dog Temperament",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.east_german_shepherd_dog",
					"class": "base.petbreeds.dog_breed",
					"friendly_name": "German Shepherd Dog",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.petbreeds.dog_breed.temperament",
					"friendly_name": "Temperament"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.petbreeds.dog_temperament . \nVALUES ?x1 { :en.east_german_shepherd_dog } \n?x1 :base.petbreeds.dog_breed.temperament ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 48000101,
		"question": "what type of temperament is displayed by a german shepherd?",
		"answer": [
			"Intelligent",
			"Alert",
			"Watchful",
			"Loyal",
			"Courageous",
			"Confident"
		],
		"function": "none",
		"commonness": -17.262168132401072,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.petbreeds.dog_temperament",
					"class": "base.petbreeds.dog_temperament",
					"friendly_name": "Dog Temperament",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.east_german_shepherd_dog",
					"class": "base.petbreeds.dog_breed",
					"friendly_name": "german shepherd",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.petbreeds.dog_breed.temperament",
					"friendly_name": "Temperament"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.petbreeds.dog_temperament . \nVALUES ?x1 { :en.east_german_shepherd_dog } \n?x1 :base.petbreeds.dog_breed.temperament ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 48000102,
		"question": "what type of temperament is displayed by a gsd?",
		"answer": [
			"Loyal",
			"Confident",
			"Intelligent",
			"Alert",
			"Courageous",
			"Watchful"
		],
		"function": "none",
		"commonness": -17.262168132401072,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.petbreeds.dog_temperament",
					"class": "base.petbreeds.dog_temperament",
					"friendly_name": "Dog Temperament",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.east_german_shepherd_dog",
					"class": "base.petbreeds.dog_breed",
					"friendly_name": "gsd",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.petbreeds.dog_breed.temperament",
					"friendly_name": "Temperament"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.petbreeds.dog_temperament . \nVALUES ?x1 { :en.east_german_shepherd_dog } \n?x1 :base.petbreeds.dog_breed.temperament ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 49000000,
		"question": "in what diets eating lamb and mutton is not allowed?",
		"answer": [
			"Vegetarian food",
			"Veganism"
		],
		"function": "none",
		"commonness": -16.09437593730628,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.dietary_restriction",
					"class": "food.dietary_restriction",
					"friendly_name": "Dietary restriction",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.01hcps",
					"class": "food.ingredient",
					"friendly_name": "Lamb and mutton",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "food.dietary_restriction.incompatible_ingredients",
					"friendly_name": "Incompatible ingredients"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.dietary_restriction . \nVALUES ?x1 { :m.01hcps } \n?x0 :food.dietary_restriction.incompatible_ingredients ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 49000001,
		"question": "in what diets eating lamb is not allowed?",
		"answer": [
			"Veganism",
			"Vegetarian food"
		],
		"function": "none",
		"commonness": -16.09437593730628,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.dietary_restriction",
					"class": "food.dietary_restriction",
					"friendly_name": "Dietary restriction",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.01hcps",
					"class": "food.ingredient",
					"friendly_name": "lamb",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "food.dietary_restriction.incompatible_ingredients",
					"friendly_name": "Incompatible ingredients"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.dietary_restriction . \nVALUES ?x1 { :m.01hcps } \n?x0 :food.dietary_restriction.incompatible_ingredients ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 49000002,
		"question": "in what diets eating mutton is not allowed?",
		"answer": [
			"Vegetarian food",
			"Veganism"
		],
		"function": "none",
		"commonness": -16.09437593730628,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.dietary_restriction",
					"class": "food.dietary_restriction",
					"friendly_name": "Dietary restriction",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.01hcps",
					"class": "food.ingredient",
					"friendly_name": "mutton",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "food.dietary_restriction.incompatible_ingredients",
					"friendly_name": "Incompatible ingredients"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.dietary_restriction . \nVALUES ?x1 { :m.01hcps } \n?x0 :food.dietary_restriction.incompatible_ingredients ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 49000100,
		"question": "on which diet we can't eat lamb and mutton?",
		"answer": [
			"Vegetarian food",
			"Veganism"
		],
		"function": "none",
		"commonness": -16.09437593730628,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.dietary_restriction",
					"class": "food.dietary_restriction",
					"friendly_name": "Dietary restriction",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.01hcps",
					"class": "food.ingredient",
					"friendly_name": "Lamb and mutton",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "food.dietary_restriction.incompatible_ingredients",
					"friendly_name": "Incompatible ingredients"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.dietary_restriction . \nVALUES ?x1 { :m.01hcps } \n?x0 :food.dietary_restriction.incompatible_ingredients ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 49000101,
		"question": "on which diet we can't eat lamb?",
		"answer": [
			"Veganism",
			"Vegetarian food"
		],
		"function": "none",
		"commonness": -16.09437593730628,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.dietary_restriction",
					"class": "food.dietary_restriction",
					"friendly_name": "Dietary restriction",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.01hcps",
					"class": "food.ingredient",
					"friendly_name": "lamb",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "food.dietary_restriction.incompatible_ingredients",
					"friendly_name": "Incompatible ingredients"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.dietary_restriction . \nVALUES ?x1 { :m.01hcps } \n?x0 :food.dietary_restriction.incompatible_ingredients ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 49000102,
		"question": "on which diet we can't eat mutton?",
		"answer": [
			"Veganism",
			"Vegetarian food"
		],
		"function": "none",
		"commonness": -16.09437593730628,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.dietary_restriction",
					"class": "food.dietary_restriction",
					"friendly_name": "Dietary restriction",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.01hcps",
					"class": "food.ingredient",
					"friendly_name": "mutton",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "food.dietary_restriction.incompatible_ingredients",
					"friendly_name": "Incompatible ingredients"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.dietary_restriction . \nVALUES ?x1 { :m.01hcps } \n?x0 :food.dietary_restriction.incompatible_ingredients ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 49000200,
		"question": "which diet prohibits eating lamb and mutton?",
		"answer": [
			"Veganism",
			"Vegetarian food"
		],
		"function": "none",
		"commonness": -16.09437593730628,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.dietary_restriction",
					"class": "food.dietary_restriction",
					"friendly_name": "Dietary restriction",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.01hcps",
					"class": "food.ingredient",
					"friendly_name": "Lamb and mutton",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "food.dietary_restriction.incompatible_ingredients",
					"friendly_name": "Incompatible ingredients"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.dietary_restriction . \nVALUES ?x1 { :m.01hcps } \n?x0 :food.dietary_restriction.incompatible_ingredients ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 49000201,
		"question": "which diet prohibits eating lamb?",
		"answer": [
			"Veganism",
			"Vegetarian food"
		],
		"function": "none",
		"commonness": -16.09437593730628,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.dietary_restriction",
					"class": "food.dietary_restriction",
					"friendly_name": "Dietary restriction",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.01hcps",
					"class": "food.ingredient",
					"friendly_name": "lamb",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "food.dietary_restriction.incompatible_ingredients",
					"friendly_name": "Incompatible ingredients"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.dietary_restriction . \nVALUES ?x1 { :m.01hcps } \n?x0 :food.dietary_restriction.incompatible_ingredients ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 49000202,
		"question": "which diet prohibits eating mutton?",
		"answer": [
			"Vegetarian food",
			"Veganism"
		],
		"function": "none",
		"commonness": -16.09437593730628,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.dietary_restriction",
					"class": "food.dietary_restriction",
					"friendly_name": "Dietary restriction",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.01hcps",
					"class": "food.ingredient",
					"friendly_name": "mutton",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "food.dietary_restriction.incompatible_ingredients",
					"friendly_name": "Incompatible ingredients"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.dietary_restriction . \nVALUES ?x1 { :m.01hcps } \n?x0 :food.dietary_restriction.incompatible_ingredients ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 49000300,
		"question": "what diet doesn't include lamb and mutton?",
		"answer": [
			"Vegetarian food",
			"Veganism"
		],
		"function": "none",
		"commonness": -16.09437593730628,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.dietary_restriction",
					"class": "food.dietary_restriction",
					"friendly_name": "Dietary restriction",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.01hcps",
					"class": "food.ingredient",
					"friendly_name": "Lamb and mutton",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "food.dietary_restriction.incompatible_ingredients",
					"friendly_name": "Incompatible ingredients"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.dietary_restriction . \nVALUES ?x1 { :m.01hcps } \n?x0 :food.dietary_restriction.incompatible_ingredients ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 49000301,
		"question": "what diet doesn't include lamb?",
		"answer": [
			"Vegetarian food",
			"Veganism"
		],
		"function": "none",
		"commonness": -16.09437593730628,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.dietary_restriction",
					"class": "food.dietary_restriction",
					"friendly_name": "Dietary restriction",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.01hcps",
					"class": "food.ingredient",
					"friendly_name": "lamb",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "food.dietary_restriction.incompatible_ingredients",
					"friendly_name": "Incompatible ingredients"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.dietary_restriction . \nVALUES ?x1 { :m.01hcps } \n?x0 :food.dietary_restriction.incompatible_ingredients ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 49000302,
		"question": "what diet doesn't include mutton?",
		"answer": [
			"Vegetarian food",
			"Veganism"
		],
		"function": "none",
		"commonness": -16.09437593730628,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.dietary_restriction",
					"class": "food.dietary_restriction",
					"friendly_name": "Dietary restriction",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.01hcps",
					"class": "food.ingredient",
					"friendly_name": "mutton",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "food.dietary_restriction.incompatible_ingredients",
					"friendly_name": "Incompatible ingredients"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.dietary_restriction . \nVALUES ?x1 { :m.01hcps } \n?x0 :food.dietary_restriction.incompatible_ingredients ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 49000400,
		"question": "in what dietary restrictions people cannot eat lamb and mutton?",
		"answer": [
			"Vegetarian food",
			"Veganism"
		],
		"function": "none",
		"commonness": -16.09437593730628,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.dietary_restriction",
					"class": "food.dietary_restriction",
					"friendly_name": "Dietary restriction",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.01hcps",
					"class": "food.ingredient",
					"friendly_name": "Lamb and mutton",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "food.dietary_restriction.incompatible_ingredients",
					"friendly_name": "Incompatible ingredients"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.dietary_restriction . \nVALUES ?x1 { :m.01hcps } \n?x0 :food.dietary_restriction.incompatible_ingredients ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 49000401,
		"question": "in what dietary restrictions people cannot eat lamb?",
		"answer": [
			"Vegetarian food",
			"Veganism"
		],
		"function": "none",
		"commonness": -16.09437593730628,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.dietary_restriction",
					"class": "food.dietary_restriction",
					"friendly_name": "Dietary restriction",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.01hcps",
					"class": "food.ingredient",
					"friendly_name": "lamb",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "food.dietary_restriction.incompatible_ingredients",
					"friendly_name": "Incompatible ingredients"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.dietary_restriction . \nVALUES ?x1 { :m.01hcps } \n?x0 :food.dietary_restriction.incompatible_ingredients ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 49000402,
		"question": "in what dietary restrictions people cannot eat mutton?",
		"answer": [
			"Vegetarian food",
			"Veganism"
		],
		"function": "none",
		"commonness": -16.09437593730628,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.dietary_restriction",
					"class": "food.dietary_restriction",
					"friendly_name": "Dietary restriction",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.01hcps",
					"class": "food.ingredient",
					"friendly_name": "mutton",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "food.dietary_restriction.incompatible_ingredients",
					"friendly_name": "Incompatible ingredients"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.dietary_restriction . \nVALUES ?x1 { :m.01hcps } \n?x0 :food.dietary_restriction.incompatible_ingredients ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 49000500,
		"question": "what diet restricts lamb and mutton?",
		"answer": [
			"Veganism",
			"Vegetarian food"
		],
		"function": "none",
		"commonness": -16.09437593730628,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.dietary_restriction",
					"class": "food.dietary_restriction",
					"friendly_name": "Dietary restriction",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.01hcps",
					"class": "food.ingredient",
					"friendly_name": "Lamb and mutton",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "food.dietary_restriction.incompatible_ingredients",
					"friendly_name": "Incompatible ingredients"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.dietary_restriction . \nVALUES ?x1 { :m.01hcps } \n?x0 :food.dietary_restriction.incompatible_ingredients ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 49000501,
		"question": "what diet restricts lamb?",
		"answer": [
			"Vegetarian food",
			"Veganism"
		],
		"function": "none",
		"commonness": -16.09437593730628,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.dietary_restriction",
					"class": "food.dietary_restriction",
					"friendly_name": "Dietary restriction",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.01hcps",
					"class": "food.ingredient",
					"friendly_name": "lamb",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "food.dietary_restriction.incompatible_ingredients",
					"friendly_name": "Incompatible ingredients"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.dietary_restriction . \nVALUES ?x1 { :m.01hcps } \n?x0 :food.dietary_restriction.incompatible_ingredients ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 49000502,
		"question": "what diet restricts mutton?",
		"answer": [
			"Veganism",
			"Vegetarian food"
		],
		"function": "none",
		"commonness": -16.09437593730628,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.dietary_restriction",
					"class": "food.dietary_restriction",
					"friendly_name": "Dietary restriction",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.01hcps",
					"class": "food.ingredient",
					"friendly_name": "mutton",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "food.dietary_restriction.incompatible_ingredients",
					"friendly_name": "Incompatible ingredients"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.dietary_restriction . \nVALUES ?x1 { :m.01hcps } \n?x0 :food.dietary_restriction.incompatible_ingredients ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 49000601,
		"question": "which diet prohibits the consumption of lamb?",
		"answer": [
			"Veganism",
			"Vegetarian food"
		],
		"function": "none",
		"commonness": -16.09437593730628,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.dietary_restriction",
					"class": "food.dietary_restriction",
					"friendly_name": "Dietary restriction",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.01hcps",
					"class": "food.ingredient",
					"friendly_name": "lamb",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "food.dietary_restriction.incompatible_ingredients",
					"friendly_name": "Incompatible ingredients"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.dietary_restriction . \nVALUES ?x1 { :m.01hcps } \n?x0 :food.dietary_restriction.incompatible_ingredients ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 49000602,
		"question": "which diet prohibits the consumption of mutton?",
		"answer": [
			"Veganism",
			"Vegetarian food"
		],
		"function": "none",
		"commonness": -16.09437593730628,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.dietary_restriction",
					"class": "food.dietary_restriction",
					"friendly_name": "Dietary restriction",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.01hcps",
					"class": "food.ingredient",
					"friendly_name": "mutton",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "food.dietary_restriction.incompatible_ingredients",
					"friendly_name": "Incompatible ingredients"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.dietary_restriction . \nVALUES ?x1 { :m.01hcps } \n?x0 :food.dietary_restriction.incompatible_ingredients ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]