[
	{
		"qid": 46000101,
		"question": "what kind of order is templars?",
		"answer": [
			"Military order"
		],
		"function": "none",
		"commonness": -18.558266965194978,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "royalty.order_of_chivalry_category",
					"class": "royalty.order_of_chivalry_category",
					"friendly_name": "Order of Chivalry Category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.knights_templar",
					"class": "royalty.order_of_chivalry",
					"friendly_name": "templars",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "royalty.order_of_chivalry.category",
					"friendly_name": "Category"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :royalty.order_of_chivalry_category . \nVALUES ?x1 { :en.knights_templar } \n?x1 :royalty.order_of_chivalry.category ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 46000102,
		"question": "what kind of order is templar?",
		"answer": [
			"Military order"
		],
		"function": "none",
		"commonness": -18.558266965194978,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "royalty.order_of_chivalry_category",
					"class": "royalty.order_of_chivalry_category",
					"friendly_name": "Order of Chivalry Category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.knights_templar",
					"class": "royalty.order_of_chivalry",
					"friendly_name": "templar",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "royalty.order_of_chivalry.category",
					"friendly_name": "Category"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :royalty.order_of_chivalry_category . \nVALUES ?x1 { :en.knights_templar } \n?x1 :royalty.order_of_chivalry.category ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 46000200,
		"question": "what category is the order of chivalry knights templar in?",
		"answer": [
			"Military order"
		],
		"function": "none",
		"commonness": -18.558266965194978,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "royalty.order_of_chivalry_category",
					"class": "royalty.order_of_chivalry_category",
					"friendly_name": "Order of Chivalry Category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.knights_templar",
					"class": "royalty.order_of_chivalry",
					"friendly_name": "Knights Templar",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "royalty.order_of_chivalry.category",
					"friendly_name": "Category"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :royalty.order_of_chivalry_category . \nVALUES ?x1 { :en.knights_templar } \n?x1 :royalty.order_of_chivalry.category ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 46000201,
		"question": "what category is the order of chivalry templars in?",
		"answer": [
			"Military order"
		],
		"function": "none",
		"commonness": -18.558266965194978,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "royalty.order_of_chivalry_category",
					"class": "royalty.order_of_chivalry_category",
					"friendly_name": "Order of Chivalry Category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.knights_templar",
					"class": "royalty.order_of_chivalry",
					"friendly_name": "templars",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "royalty.order_of_chivalry.category",
					"friendly_name": "Category"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :royalty.order_of_chivalry_category . \nVALUES ?x1 { :en.knights_templar } \n?x1 :royalty.order_of_chivalry.category ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 46000202,
		"question": "what category is the order of chivalry templar in?",
		"answer": [
			"Military order"
		],
		"function": "none",
		"commonness": -18.558266965194978,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "royalty.order_of_chivalry_category",
					"class": "royalty.order_of_chivalry_category",
					"friendly_name": "Order of Chivalry Category",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.knights_templar",
					"class": "royalty.order_of_chivalry",
					"friendly_name": "templar",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "royalty.order_of_chivalry.category",
					"friendly_name": "Category"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :royalty.order_of_chivalry_category . \nVALUES ?x1 { :en.knights_templar } \n?x1 :royalty.order_of_chivalry.category ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 47000000,
		"question": "what is the name of the cinematographer son or daughter of nancy pelosi?",
		"answer": [
			"Alexandra Pelosi"
		],
		"function": "none",
		"commonness": -11.463001840688653,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.cinematographer",
					"class": "film.cinematographer",
					"friendly_name": "Film cinematographer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nancy_pelosi",
					"class": "people.person",
					"friendly_name": "Nancy Pelosi",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.parents",
					"friendly_name": "Parents"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.cinematographer . \nVALUES ?x1 { :en.nancy_pelosi } \n?x0 :people.person.parents ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 47000001,
		"question": "what is the name of the cinematographer son or daughter of pelosi?",
		"answer": [
			"Alexandra Pelosi"
		],
		"function": "none",
		"commonness": -11.463001840688653,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.cinematographer",
					"class": "film.cinematographer",
					"friendly_name": "Film cinematographer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nancy_pelosi",
					"class": "people.person",
					"friendly_name": "pelosi",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.parents",
					"friendly_name": "Parents"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.cinematographer . \nVALUES ?x1 { :en.nancy_pelosi } \n?x0 :people.person.parents ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 47000002,
		"question": "what is the name of the cinematographer son or daughter of speaker pelosi?",
		"answer": [
			"Alexandra Pelosi"
		],
		"function": "none",
		"commonness": -11.463001840688653,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.cinematographer",
					"class": "film.cinematographer",
					"friendly_name": "Film cinematographer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nancy_pelosi",
					"class": "people.person",
					"friendly_name": "speaker pelosi",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.parents",
					"friendly_name": "Parents"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.cinematographer . \nVALUES ?x1 { :en.nancy_pelosi } \n?x0 :people.person.parents ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 47000100,
		"question": "which child of nancy pelosi chose a career in cinematography?",
		"answer": [
			"Alexandra Pelosi"
		],
		"function": "none",
		"commonness": -11.463001840688653,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.cinematographer",
					"class": "film.cinematographer",
					"friendly_name": "Film cinematographer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nancy_pelosi",
					"class": "people.person",
					"friendly_name": "Nancy Pelosi",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.parents",
					"friendly_name": "Parents"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.cinematographer . \nVALUES ?x1 { :en.nancy_pelosi } \n?x0 :people.person.parents ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 47000101,
		"question": "which child of pelosi chose a career in cinematography?",
		"answer": [
			"Alexandra Pelosi"
		],
		"function": "none",
		"commonness": -11.463001840688653,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.cinematographer",
					"class": "film.cinematographer",
					"friendly_name": "Film cinematographer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nancy_pelosi",
					"class": "people.person",
					"friendly_name": "pelosi",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.parents",
					"friendly_name": "Parents"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.cinematographer . \nVALUES ?x1 { :en.nancy_pelosi } \n?x0 :people.person.parents ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 47000102,
		"question": "which child of speaker pelosi chose a career in cinematography?",
		"answer": [
			"Alexandra Pelosi"
		],
		"function": "none",
		"commonness": -11.463001840688653,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.cinematographer",
					"class": "film.cinematographer",
					"friendly_name": "Film cinematographer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nancy_pelosi",
					"class": "people.person",
					"friendly_name": "speaker pelosi",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.parents",
					"friendly_name": "Parents"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.cinematographer . \nVALUES ?x1 { :en.nancy_pelosi } \n?x0 :people.person.parents ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 47000200,
		"question": "which of nancy pelosi's children work in the cinematography field?",
		"answer": [
			"Alexandra Pelosi"
		],
		"function": "none",
		"commonness": -11.463001840688653,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.cinematographer",
					"class": "film.cinematographer",
					"friendly_name": "Film cinematographer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nancy_pelosi",
					"class": "people.person",
					"friendly_name": "Nancy Pelosi",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.parents",
					"friendly_name": "Parents"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.cinematographer . \nVALUES ?x1 { :en.nancy_pelosi } \n?x0 :people.person.parents ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 47000201,
		"question": "which of pelosi's children work in the cinematography field?",
		"answer": [
			"Alexandra Pelosi"
		],
		"function": "none",
		"commonness": -11.463001840688653,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.cinematographer",
					"class": "film.cinematographer",
					"friendly_name": "Film cinematographer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nancy_pelosi",
					"class": "people.person",
					"friendly_name": "pelosi",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.parents",
					"friendly_name": "Parents"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.cinematographer . \nVALUES ?x1 { :en.nancy_pelosi } \n?x0 :people.person.parents ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 47000202,
		"question": "which of speaker pelosi's children work in the cinematography field?",
		"answer": [
			"Alexandra Pelosi"
		],
		"function": "none",
		"commonness": -11.463001840688653,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.cinematographer",
					"class": "film.cinematographer",
					"friendly_name": "Film cinematographer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nancy_pelosi",
					"class": "people.person",
					"friendly_name": "speaker pelosi",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.parents",
					"friendly_name": "Parents"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.cinematographer . \nVALUES ?x1 { :en.nancy_pelosi } \n?x0 :people.person.parents ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 47000300,
		"question": "which of nancy pelosi's children chose to become a cinematographer?",
		"answer": [
			"Alexandra Pelosi"
		],
		"function": "none",
		"commonness": -11.463001840688653,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.cinematographer",
					"class": "film.cinematographer",
					"friendly_name": "Film cinematographer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nancy_pelosi",
					"class": "people.person",
					"friendly_name": "Nancy Pelosi",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.parents",
					"friendly_name": "Parents"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.cinematographer . \nVALUES ?x1 { :en.nancy_pelosi } \n?x0 :people.person.parents ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 47000301,
		"question": "which of pelosi's children chose to become a cinematographer?",
		"answer": [
			"Alexandra Pelosi"
		],
		"function": "none",
		"commonness": -11.463001840688653,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.cinematographer",
					"class": "film.cinematographer",
					"friendly_name": "Film cinematographer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nancy_pelosi",
					"class": "people.person",
					"friendly_name": "pelosi",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.parents",
					"friendly_name": "Parents"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.cinematographer . \nVALUES ?x1 { :en.nancy_pelosi } \n?x0 :people.person.parents ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 47000302,
		"question": "which of speaker pelosi's children chose to become a cinematographer?",
		"answer": [
			"Alexandra Pelosi"
		],
		"function": "none",
		"commonness": -11.463001840688653,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.cinematographer",
					"class": "film.cinematographer",
					"friendly_name": "Film cinematographer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nancy_pelosi",
					"class": "people.person",
					"friendly_name": "speaker pelosi",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.parents",
					"friendly_name": "Parents"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.cinematographer . \nVALUES ?x1 { :en.nancy_pelosi } \n?x0 :people.person.parents ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 47000400,
		"question": "which child of nancy pelosi is a film cinematographer?",
		"answer": [
			"Alexandra Pelosi"
		],
		"function": "none",
		"commonness": -11.463001840688653,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.cinematographer",
					"class": "film.cinematographer",
					"friendly_name": "Film cinematographer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nancy_pelosi",
					"class": "people.person",
					"friendly_name": "Nancy Pelosi",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.parents",
					"friendly_name": "Parents"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.cinematographer . \nVALUES ?x1 { :en.nancy_pelosi } \n?x0 :people.person.parents ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 47000401,
		"question": "which child of pelosi is a film cinematographer?",
		"answer": [
			"Alexandra Pelosi"
		],
		"function": "none",
		"commonness": -11.463001840688653,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.cinematographer",
					"class": "film.cinematographer",
					"friendly_name": "Film cinematographer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nancy_pelosi",
					"class": "people.person",
					"friendly_name": "pelosi",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.parents",
					"friendly_name": "Parents"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.cinematographer . \nVALUES ?x1 { :en.nancy_pelosi } \n?x0 :people.person.parents ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 47000402,
		"question": "which child of speaker pelosi is a film cinematographer?",
		"answer": [
			"Alexandra Pelosi"
		],
		"function": "none",
		"commonness": -11.463001840688653,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.cinematographer",
					"class": "film.cinematographer",
					"friendly_name": "Film cinematographer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nancy_pelosi",
					"class": "people.person",
					"friendly_name": "speaker pelosi",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.parents",
					"friendly_name": "Parents"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.cinematographer . \nVALUES ?x1 { :en.nancy_pelosi } \n?x0 :people.person.parents ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 47000500,
		"question": "which one of nancy pelosi's children had a career in cinematography?",
		"answer": [
			"Alexandra Pelosi"
		],
		"function": "none",
		"commonness": -11.463001840688653,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.cinematographer",
					"class": "film.cinematographer",
					"friendly_name": "Film cinematographer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nancy_pelosi",
					"class": "people.person",
					"friendly_name": "Nancy Pelosi",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.parents",
					"friendly_name": "Parents"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.cinematographer . \nVALUES ?x1 { :en.nancy_pelosi } \n?x0 :people.person.parents ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 47000501,
		"question": "which one of pelosi's children had a career in cinematography?",
		"answer": [
			"Alexandra Pelosi"
		],
		"function": "none",
		"commonness": -11.463001840688653,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.cinematographer",
					"class": "film.cinematographer",
					"friendly_name": "Film cinematographer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nancy_pelosi",
					"class": "people.person",
					"friendly_name": "pelosi",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.parents",
					"friendly_name": "Parents"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.cinematographer . \nVALUES ?x1 { :en.nancy_pelosi } \n?x0 :people.person.parents ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 47000502,
		"question": "which one of speaker pelosi's children had a career in cinematography?",
		"answer": [
			"Alexandra Pelosi"
		],
		"function": "none",
		"commonness": -11.463001840688653,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "film.cinematographer",
					"class": "film.cinematographer",
					"friendly_name": "Film cinematographer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nancy_pelosi",
					"class": "people.person",
					"friendly_name": "speaker pelosi",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.parents",
					"friendly_name": "Parents"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :film.cinematographer . \nVALUES ?x1 { :en.nancy_pelosi } \n?x0 :people.person.parents ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 48000000,
		"question": "what is the temperament of german shepherd dog?",
		"answer": [
			"Courageous",
			"Alert",
			"Confident",
			"Watchful",
			"Intelligent",
			"Loyal"
		],
		"function": "none",
		"commonness": -17.262168132401072,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.petbreeds.dog_temperament",
					"class": "base.petbreeds.dog_temperament",
					"friendly_name": "Dog Temperament",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.east_german_shepherd_dog",
					"class": "base.petbreeds.dog_breed",
					"friendly_name": "German Shepherd Dog",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.petbreeds.dog_breed.temperament",
					"friendly_name": "Temperament"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.petbreeds.dog_temperament . \nVALUES ?x1 { :en.east_german_shepherd_dog } \n?x1 :base.petbreeds.dog_breed.temperament ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 48000001,
		"question": "what is the temperament of german shepherd?",
		"answer": [
			"Intelligent",
			"Alert",
			"Loyal",
			"Courageous",
			"Watchful",
			"Confident"
		],
		"function": "none",
		"commonness": -17.262168132401072,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.petbreeds.dog_temperament",
					"class": "base.petbreeds.dog_temperament",
					"friendly_name": "Dog Temperament",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.east_german_shepherd_dog",
					"class": "base.petbreeds.dog_breed",
					"friendly_name": "german shepherd",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.petbreeds.dog_breed.temperament",
					"friendly_name": "Temperament"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.petbreeds.dog_temperament . \nVALUES ?x1 { :en.east_german_shepherd_dog } \n?x1 :base.petbreeds.dog_breed.temperament ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]