[
	{
		"qid": 197000101,
		"question": "on the spaceship voyager, crewmen are of what positions?",
		"answer": [
			"Cook",
			"Security Officer",
			"Captain",
			"First officer",
			"Chief medical officer"
		],
		"function": "none",
		"commonness": -25.230349463796532,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.character_occupation",
					"class": "fictional_universe.character_occupation",
					"friendly_name": "Character Occupation",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.fictionaluniverse.fictional_spaceship_crewman_posting",
					"class": "base.fictionaluniverse.fictional_spaceship_crewman_posting",
					"friendly_name": "Fictional Spaceship Crewman Posting",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.uss_voyager",
					"class": "base.fictionaluniverse.fictional_spacecraft",
					"friendly_name": "voyager",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.fictionaluniverse.fictional_spaceship_crewman_posting.position",
					"friendly_name": "Position"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "base.fictionaluniverse.fictional_spacecraft.crew",
					"friendly_name": "Crew"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.character_occupation . \n?x1 :type.object.type :base.fictionaluniverse.fictional_spaceship_crewman_posting . \nVALUES ?x2 { :en.uss_voyager } \n?x1 :base.fictionaluniverse.fictional_spaceship_crewman_posting.position ?x0 . \n?x2 :base.fictionaluniverse.fictional_spacecraft.crew ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 197000102,
		"question": "on the spaceship starship voyager, crewmen are of what positions?",
		"answer": [
			"Captain",
			"Cook",
			"Chief medical officer",
			"Security Officer",
			"First officer"
		],
		"function": "none",
		"commonness": -25.230349463796532,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.character_occupation",
					"class": "fictional_universe.character_occupation",
					"friendly_name": "Character Occupation",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.fictionaluniverse.fictional_spaceship_crewman_posting",
					"class": "base.fictionaluniverse.fictional_spaceship_crewman_posting",
					"friendly_name": "Fictional Spaceship Crewman Posting",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.uss_voyager",
					"class": "base.fictionaluniverse.fictional_spacecraft",
					"friendly_name": "starship voyager",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.fictionaluniverse.fictional_spaceship_crewman_posting.position",
					"friendly_name": "Position"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "base.fictionaluniverse.fictional_spacecraft.crew",
					"friendly_name": "Crew"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.character_occupation . \n?x1 :type.object.type :base.fictionaluniverse.fictional_spaceship_crewman_posting . \nVALUES ?x2 { :en.uss_voyager } \n?x1 :base.fictionaluniverse.fictional_spaceship_crewman_posting.position ?x0 . \n?x2 :base.fictionaluniverse.fictional_spacecraft.crew ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 197000200,
		"question": "the uss voyager has what crew positions?",
		"answer": [
			"Cook",
			"Captain",
			"Chief medical officer",
			"First officer",
			"Security Officer"
		],
		"function": "none",
		"commonness": -25.230349463796532,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.character_occupation",
					"class": "fictional_universe.character_occupation",
					"friendly_name": "Character Occupation",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.fictionaluniverse.fictional_spaceship_crewman_posting",
					"class": "base.fictionaluniverse.fictional_spaceship_crewman_posting",
					"friendly_name": "Fictional Spaceship Crewman Posting",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.uss_voyager",
					"class": "base.fictionaluniverse.fictional_spacecraft",
					"friendly_name": "USS Voyager",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.fictionaluniverse.fictional_spaceship_crewman_posting.position",
					"friendly_name": "Position"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "base.fictionaluniverse.fictional_spacecraft.crew",
					"friendly_name": "Crew"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.character_occupation . \n?x1 :type.object.type :base.fictionaluniverse.fictional_spaceship_crewman_posting . \nVALUES ?x2 { :en.uss_voyager } \n?x1 :base.fictionaluniverse.fictional_spaceship_crewman_posting.position ?x0 . \n?x2 :base.fictionaluniverse.fictional_spacecraft.crew ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 197000201,
		"question": "the voyager has what crew positions?",
		"answer": [
			"Captain",
			"Security Officer",
			"Cook",
			"Chief medical officer",
			"First officer"
		],
		"function": "none",
		"commonness": -25.230349463796532,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.character_occupation",
					"class": "fictional_universe.character_occupation",
					"friendly_name": "Character Occupation",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.fictionaluniverse.fictional_spaceship_crewman_posting",
					"class": "base.fictionaluniverse.fictional_spaceship_crewman_posting",
					"friendly_name": "Fictional Spaceship Crewman Posting",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.uss_voyager",
					"class": "base.fictionaluniverse.fictional_spacecraft",
					"friendly_name": "voyager",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.fictionaluniverse.fictional_spaceship_crewman_posting.position",
					"friendly_name": "Position"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "base.fictionaluniverse.fictional_spacecraft.crew",
					"friendly_name": "Crew"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.character_occupation . \n?x1 :type.object.type :base.fictionaluniverse.fictional_spaceship_crewman_posting . \nVALUES ?x2 { :en.uss_voyager } \n?x1 :base.fictionaluniverse.fictional_spaceship_crewman_posting.position ?x0 . \n?x2 :base.fictionaluniverse.fictional_spacecraft.crew ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 197000202,
		"question": "the starship voyager has what crew positions?",
		"answer": [
			"First officer",
			"Security Officer",
			"Cook",
			"Chief medical officer",
			"Captain"
		],
		"function": "none",
		"commonness": -25.230349463796532,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.character_occupation",
					"class": "fictional_universe.character_occupation",
					"friendly_name": "Character Occupation",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.fictionaluniverse.fictional_spaceship_crewman_posting",
					"class": "base.fictionaluniverse.fictional_spaceship_crewman_posting",
					"friendly_name": "Fictional Spaceship Crewman Posting",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.uss_voyager",
					"class": "base.fictionaluniverse.fictional_spacecraft",
					"friendly_name": "starship voyager",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.fictionaluniverse.fictional_spaceship_crewman_posting.position",
					"friendly_name": "Position"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "base.fictionaluniverse.fictional_spacecraft.crew",
					"friendly_name": "Crew"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.character_occupation . \n?x1 :type.object.type :base.fictionaluniverse.fictional_spaceship_crewman_posting . \nVALUES ?x2 { :en.uss_voyager } \n?x1 :base.fictionaluniverse.fictional_spaceship_crewman_posting.position ?x0 . \n?x2 :base.fictionaluniverse.fictional_spacecraft.crew ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 197000300,
		"question": "what are all the different crew positions on the uss voyager spaceship?",
		"answer": [
			"Cook",
			"Security Officer",
			"Captain",
			"First officer",
			"Chief medical officer"
		],
		"function": "none",
		"commonness": -25.230349463796532,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.character_occupation",
					"class": "fictional_universe.character_occupation",
					"friendly_name": "Character Occupation",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.fictionaluniverse.fictional_spaceship_crewman_posting",
					"class": "base.fictionaluniverse.fictional_spaceship_crewman_posting",
					"friendly_name": "Fictional Spaceship Crewman Posting",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.uss_voyager",
					"class": "base.fictionaluniverse.fictional_spacecraft",
					"friendly_name": "USS Voyager",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.fictionaluniverse.fictional_spaceship_crewman_posting.position",
					"friendly_name": "Position"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "base.fictionaluniverse.fictional_spacecraft.crew",
					"friendly_name": "Crew"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.character_occupation . \n?x1 :type.object.type :base.fictionaluniverse.fictional_spaceship_crewman_posting . \nVALUES ?x2 { :en.uss_voyager } \n?x1 :base.fictionaluniverse.fictional_spaceship_crewman_posting.position ?x0 . \n?x2 :base.fictionaluniverse.fictional_spacecraft.crew ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 197000301,
		"question": "what are all the different crew positions on the voyager spaceship?",
		"answer": [
			"Cook",
			"Captain",
			"Chief medical officer",
			"First officer",
			"Security Officer"
		],
		"function": "none",
		"commonness": -25.230349463796532,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.character_occupation",
					"class": "fictional_universe.character_occupation",
					"friendly_name": "Character Occupation",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.fictionaluniverse.fictional_spaceship_crewman_posting",
					"class": "base.fictionaluniverse.fictional_spaceship_crewman_posting",
					"friendly_name": "Fictional Spaceship Crewman Posting",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.uss_voyager",
					"class": "base.fictionaluniverse.fictional_spacecraft",
					"friendly_name": "voyager",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.fictionaluniverse.fictional_spaceship_crewman_posting.position",
					"friendly_name": "Position"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "base.fictionaluniverse.fictional_spacecraft.crew",
					"friendly_name": "Crew"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.character_occupation . \n?x1 :type.object.type :base.fictionaluniverse.fictional_spaceship_crewman_posting . \nVALUES ?x2 { :en.uss_voyager } \n?x1 :base.fictionaluniverse.fictional_spaceship_crewman_posting.position ?x0 . \n?x2 :base.fictionaluniverse.fictional_spacecraft.crew ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 197000302,
		"question": "what are all the different crew positions on the starship voyager spaceship?",
		"answer": [
			"Cook",
			"Security Officer",
			"Captain",
			"First officer",
			"Chief medical officer"
		],
		"function": "none",
		"commonness": -25.230349463796532,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.character_occupation",
					"class": "fictional_universe.character_occupation",
					"friendly_name": "Character Occupation",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.fictionaluniverse.fictional_spaceship_crewman_posting",
					"class": "base.fictionaluniverse.fictional_spaceship_crewman_posting",
					"friendly_name": "Fictional Spaceship Crewman Posting",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.uss_voyager",
					"class": "base.fictionaluniverse.fictional_spacecraft",
					"friendly_name": "starship voyager",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.fictionaluniverse.fictional_spaceship_crewman_posting.position",
					"friendly_name": "Position"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "base.fictionaluniverse.fictional_spacecraft.crew",
					"friendly_name": "Crew"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.character_occupation . \n?x1 :type.object.type :base.fictionaluniverse.fictional_spaceship_crewman_posting . \nVALUES ?x2 { :en.uss_voyager } \n?x1 :base.fictionaluniverse.fictional_spaceship_crewman_posting.position ?x0 . \n?x2 :base.fictionaluniverse.fictional_spacecraft.crew ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 197000400,
		"question": "what type of occupations are available on the uss voyager?",
		"answer": [
			"Security Officer",
			"Chief medical officer",
			"Captain",
			"First officer",
			"Cook"
		],
		"function": "none",
		"commonness": -25.230349463796532,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.character_occupation",
					"class": "fictional_universe.character_occupation",
					"friendly_name": "Character Occupation",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.fictionaluniverse.fictional_spaceship_crewman_posting",
					"class": "base.fictionaluniverse.fictional_spaceship_crewman_posting",
					"friendly_name": "Fictional Spaceship Crewman Posting",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.uss_voyager",
					"class": "base.fictionaluniverse.fictional_spacecraft",
					"friendly_name": "USS Voyager",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.fictionaluniverse.fictional_spaceship_crewman_posting.position",
					"friendly_name": "Position"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "base.fictionaluniverse.fictional_spacecraft.crew",
					"friendly_name": "Crew"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.character_occupation . \n?x1 :type.object.type :base.fictionaluniverse.fictional_spaceship_crewman_posting . \nVALUES ?x2 { :en.uss_voyager } \n?x1 :base.fictionaluniverse.fictional_spaceship_crewman_posting.position ?x0 . \n?x2 :base.fictionaluniverse.fictional_spacecraft.crew ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 197000401,
		"question": "what type of occupations are available on the voyager?",
		"answer": [
			"Security Officer",
			"First officer",
			"Chief medical officer",
			"Cook",
			"Captain"
		],
		"function": "none",
		"commonness": -25.230349463796532,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.character_occupation",
					"class": "fictional_universe.character_occupation",
					"friendly_name": "Character Occupation",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.fictionaluniverse.fictional_spaceship_crewman_posting",
					"class": "base.fictionaluniverse.fictional_spaceship_crewman_posting",
					"friendly_name": "Fictional Spaceship Crewman Posting",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.uss_voyager",
					"class": "base.fictionaluniverse.fictional_spacecraft",
					"friendly_name": "voyager",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.fictionaluniverse.fictional_spaceship_crewman_posting.position",
					"friendly_name": "Position"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "base.fictionaluniverse.fictional_spacecraft.crew",
					"friendly_name": "Crew"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.character_occupation . \n?x1 :type.object.type :base.fictionaluniverse.fictional_spaceship_crewman_posting . \nVALUES ?x2 { :en.uss_voyager } \n?x1 :base.fictionaluniverse.fictional_spaceship_crewman_posting.position ?x0 . \n?x2 :base.fictionaluniverse.fictional_spacecraft.crew ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 197000402,
		"question": "what type of occupations are available on the starship voyager?",
		"answer": [
			"Cook",
			"Security Officer",
			"Captain",
			"Chief medical officer",
			"First officer"
		],
		"function": "none",
		"commonness": -25.230349463796532,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.character_occupation",
					"class": "fictional_universe.character_occupation",
					"friendly_name": "Character Occupation",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.fictionaluniverse.fictional_spaceship_crewman_posting",
					"class": "base.fictionaluniverse.fictional_spaceship_crewman_posting",
					"friendly_name": "Fictional Spaceship Crewman Posting",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.uss_voyager",
					"class": "base.fictionaluniverse.fictional_spacecraft",
					"friendly_name": "starship voyager",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.fictionaluniverse.fictional_spaceship_crewman_posting.position",
					"friendly_name": "Position"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "base.fictionaluniverse.fictional_spacecraft.crew",
					"friendly_name": "Crew"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.character_occupation . \n?x1 :type.object.type :base.fictionaluniverse.fictional_spaceship_crewman_posting . \nVALUES ?x2 { :en.uss_voyager } \n?x1 :base.fictionaluniverse.fictional_spaceship_crewman_posting.position ?x0 . \n?x2 :base.fictionaluniverse.fictional_spacecraft.crew ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 198000100,
		"question": "for the star with the smallest right ascension, what is its spectral type?",
		"answer": [
			"M7 IIIe"
		],
		"function": "argmin",
		"commonness": -33.26212015489648,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.spectral_type",
					"class": "astronomy.spectral_type",
					"friendly_name": "Spectral Type",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "astronomy.star",
					"class": "astronomy.star",
					"friendly_name": "Star",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "0",
					"class": "type.float",
					"friendly_name": "0",
					"question_node": 0,
					"function": "argmin"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "astronomy.star.spectral_type",
					"friendly_name": "Spectral Type"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "astronomy.celestial_object.right_ascention",
					"friendly_name": "Right Ascension"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.spectral_type . \n?x1 :type.object.type :astronomy.star . \n{\nSELECT (MIN(?y2) AS ?x2)  WHERE { \n?y0 :type.object.type :astronomy.spectral_type . \n?y1 :type.object.type :astronomy.star . \n?y1 :astronomy.star.spectral_type ?y0 . \n?y1 :astronomy.celestial_object.right_ascention ?y2 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y1 != ?y2  )\n}\n}\n?x1 :astronomy.star.spectral_type ?x0 . \n?x1 :astronomy.celestial_object.right_ascention ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 199000000,
		"question": "what radio programs share the same genre with grand ole opry?",
		"answer": [
			"A Prairie Home Companion"
		],
		"function": "none",
		"commonness": -23.568853346576827,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "radio.radio_program",
					"class": "radio.radio_program",
					"friendly_name": "Radio program",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "broadcast.genre",
					"class": "broadcast.genre",
					"friendly_name": "Broadcast Genre",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.grand_ole_opry",
					"class": "broadcast.content",
					"friendly_name": "Grand Ole Opry",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.content.genre",
					"friendly_name": "Genres"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "broadcast.content.genre",
					"friendly_name": "Genres"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :radio.radio_program . \n?x1 :type.object.type :broadcast.genre . \nVALUES ?x2 { :en.grand_ole_opry } \n?x0 :broadcast.content.genre ?x1 . \n?x2 :broadcast.content.genre ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 199000001,
		"question": "what radio programs share the same genre with opry?",
		"answer": [
			"A Prairie Home Companion"
		],
		"function": "none",
		"commonness": -23.568853346576827,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "radio.radio_program",
					"class": "radio.radio_program",
					"friendly_name": "Radio program",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "broadcast.genre",
					"class": "broadcast.genre",
					"friendly_name": "Broadcast Genre",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.grand_ole_opry",
					"class": "broadcast.content",
					"friendly_name": "opry",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.content.genre",
					"friendly_name": "Genres"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "broadcast.content.genre",
					"friendly_name": "Genres"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :radio.radio_program . \n?x1 :type.object.type :broadcast.genre . \nVALUES ?x2 { :en.grand_ole_opry } \n?x0 :broadcast.content.genre ?x1 . \n?x2 :broadcast.content.genre ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 199000002,
		"question": "what radio programs share the same genre with grand old opry?",
		"answer": [
			"A Prairie Home Companion"
		],
		"function": "none",
		"commonness": -23.568853346576827,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "radio.radio_program",
					"class": "radio.radio_program",
					"friendly_name": "Radio program",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "broadcast.genre",
					"class": "broadcast.genre",
					"friendly_name": "Broadcast Genre",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.grand_ole_opry",
					"class": "broadcast.content",
					"friendly_name": "grand old opry",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.content.genre",
					"friendly_name": "Genres"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "broadcast.content.genre",
					"friendly_name": "Genres"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :radio.radio_program . \n?x1 :type.object.type :broadcast.genre . \nVALUES ?x2 { :en.grand_ole_opry } \n?x0 :broadcast.content.genre ?x1 . \n?x2 :broadcast.content.genre ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 199000100,
		"question": "what other radio programs are similar to grand ole opry?",
		"answer": [
			"A Prairie Home Companion"
		],
		"function": "none",
		"commonness": -23.568853346576827,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "radio.radio_program",
					"class": "radio.radio_program",
					"friendly_name": "Radio program",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "broadcast.genre",
					"class": "broadcast.genre",
					"friendly_name": "Broadcast Genre",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.grand_ole_opry",
					"class": "broadcast.content",
					"friendly_name": "Grand Ole Opry",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.content.genre",
					"friendly_name": "Genres"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "broadcast.content.genre",
					"friendly_name": "Genres"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :radio.radio_program . \n?x1 :type.object.type :broadcast.genre . \nVALUES ?x2 { :en.grand_ole_opry } \n?x0 :broadcast.content.genre ?x1 . \n?x2 :broadcast.content.genre ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	}
]