[
	{
		"qid": 234000001,
		"question": "crosby's team belongs to which conference for ice hockey?",
		"answer": [
			"Eastern Conference"
		],
		"function": "none",
		"commonness": -24.589948835793344,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "ice_hockey.hockey_conference",
					"class": "ice_hockey.hockey_conference",
					"friendly_name": "Ice hockey conference",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "ice_hockey.hockey_team",
					"class": "ice_hockey.hockey_team",
					"friendly_name": "Ice hockey team",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.sidney_crosby",
					"class": "ice_hockey.hockey_player",
					"friendly_name": "crosby",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "ice_hockey.hockey_team.conference",
					"friendly_name": "Conference"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "ice_hockey.hockey_team.captain",
					"friendly_name": "Captain"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :ice_hockey.hockey_conference . \n?x1 :type.object.type :ice_hockey.hockey_team . \nVALUES ?x2 { :en.sidney_crosby } \n?x1 :ice_hockey.hockey_team.conference ?x0 . \n?x1 :ice_hockey.hockey_team.captain ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 234000101,
		"question": "crosby is the captain of a team wthin which ice hockey conference?",
		"answer": [
			"Eastern Conference"
		],
		"function": "none",
		"commonness": -24.589948835793344,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "ice_hockey.hockey_conference",
					"class": "ice_hockey.hockey_conference",
					"friendly_name": "Ice hockey conference",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "ice_hockey.hockey_team",
					"class": "ice_hockey.hockey_team",
					"friendly_name": "Ice hockey team",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.sidney_crosby",
					"class": "ice_hockey.hockey_player",
					"friendly_name": "crosby",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "ice_hockey.hockey_team.conference",
					"friendly_name": "Conference"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "ice_hockey.hockey_team.captain",
					"friendly_name": "Captain"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :ice_hockey.hockey_conference . \n?x1 :type.object.type :ice_hockey.hockey_team . \nVALUES ?x2 { :en.sidney_crosby } \n?x1 :ice_hockey.hockey_team.conference ?x0 . \n?x1 :ice_hockey.hockey_team.captain ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 234000200,
		"question": "to which ice hockey conference does the team that sidney crosby captains belong?",
		"answer": [
			"Eastern Conference"
		],
		"function": "none",
		"commonness": -24.589948835793344,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "ice_hockey.hockey_conference",
					"class": "ice_hockey.hockey_conference",
					"friendly_name": "Ice hockey conference",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "ice_hockey.hockey_team",
					"class": "ice_hockey.hockey_team",
					"friendly_name": "Ice hockey team",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.sidney_crosby",
					"class": "ice_hockey.hockey_player",
					"friendly_name": "Sidney Crosby",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "ice_hockey.hockey_team.conference",
					"friendly_name": "Conference"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "ice_hockey.hockey_team.captain",
					"friendly_name": "Captain"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :ice_hockey.hockey_conference . \n?x1 :type.object.type :ice_hockey.hockey_team . \nVALUES ?x2 { :en.sidney_crosby } \n?x1 :ice_hockey.hockey_team.conference ?x0 . \n?x1 :ice_hockey.hockey_team.captain ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 234000201,
		"question": "to which ice hockey conference does the team that crosby captains belong?",
		"answer": [
			"Eastern Conference"
		],
		"function": "none",
		"commonness": -24.589948835793344,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "ice_hockey.hockey_conference",
					"class": "ice_hockey.hockey_conference",
					"friendly_name": "Ice hockey conference",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "ice_hockey.hockey_team",
					"class": "ice_hockey.hockey_team",
					"friendly_name": "Ice hockey team",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.sidney_crosby",
					"class": "ice_hockey.hockey_player",
					"friendly_name": "crosby",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "ice_hockey.hockey_team.conference",
					"friendly_name": "Conference"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "ice_hockey.hockey_team.captain",
					"friendly_name": "Captain"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :ice_hockey.hockey_conference . \n?x1 :type.object.type :ice_hockey.hockey_team . \nVALUES ?x2 { :en.sidney_crosby } \n?x1 :ice_hockey.hockey_team.conference ?x0 . \n?x1 :ice_hockey.hockey_team.captain ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 234000300,
		"question": "the team of which sidney crosby is the captain belongs to which ice hockey conference?",
		"answer": [
			"Eastern Conference"
		],
		"function": "none",
		"commonness": -24.589948835793344,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "ice_hockey.hockey_conference",
					"class": "ice_hockey.hockey_conference",
					"friendly_name": "Ice hockey conference",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "ice_hockey.hockey_team",
					"class": "ice_hockey.hockey_team",
					"friendly_name": "Ice hockey team",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.sidney_crosby",
					"class": "ice_hockey.hockey_player",
					"friendly_name": "Sidney Crosby",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "ice_hockey.hockey_team.conference",
					"friendly_name": "Conference"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "ice_hockey.hockey_team.captain",
					"friendly_name": "Captain"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :ice_hockey.hockey_conference . \n?x1 :type.object.type :ice_hockey.hockey_team . \nVALUES ?x2 { :en.sidney_crosby } \n?x1 :ice_hockey.hockey_team.conference ?x0 . \n?x1 :ice_hockey.hockey_team.captain ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 234000400,
		"question": "to which conference does the team of which sidney crosby be captain belong?",
		"answer": [
			"Eastern Conference"
		],
		"function": "none",
		"commonness": -24.589948835793344,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "ice_hockey.hockey_conference",
					"class": "ice_hockey.hockey_conference",
					"friendly_name": "Ice hockey conference",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "ice_hockey.hockey_team",
					"class": "ice_hockey.hockey_team",
					"friendly_name": "Ice hockey team",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.sidney_crosby",
					"class": "ice_hockey.hockey_player",
					"friendly_name": "Sidney Crosby",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "ice_hockey.hockey_team.conference",
					"friendly_name": "Conference"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "ice_hockey.hockey_team.captain",
					"friendly_name": "Captain"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :ice_hockey.hockey_conference . \n?x1 :type.object.type :ice_hockey.hockey_team . \nVALUES ?x2 { :en.sidney_crosby } \n?x1 :ice_hockey.hockey_team.conference ?x0 . \n?x1 :ice_hockey.hockey_team.captain ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 234000401,
		"question": "to which conference does the team of which crosby be captain belong?",
		"answer": [
			"Eastern Conference"
		],
		"function": "none",
		"commonness": -24.589948835793344,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "ice_hockey.hockey_conference",
					"class": "ice_hockey.hockey_conference",
					"friendly_name": "Ice hockey conference",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "ice_hockey.hockey_team",
					"class": "ice_hockey.hockey_team",
					"friendly_name": "Ice hockey team",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.sidney_crosby",
					"class": "ice_hockey.hockey_player",
					"friendly_name": "crosby",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "ice_hockey.hockey_team.conference",
					"friendly_name": "Conference"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "ice_hockey.hockey_team.captain",
					"friendly_name": "Captain"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :ice_hockey.hockey_conference . \n?x1 :type.object.type :ice_hockey.hockey_team . \nVALUES ?x2 { :en.sidney_crosby } \n?x1 :ice_hockey.hockey_team.conference ?x0 . \n?x1 :ice_hockey.hockey_team.captain ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 235000001,
		"question": "which group was gaga part of?",
		"answer": [
			"SGBand"
		],
		"function": "none",
		"commonness": -15.713858033023467,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.musical_group",
					"class": "music.musical_group",
					"friendly_name": "Musical Group",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "music.group_membership",
					"class": "music.group_membership",
					"friendly_name": "Musical Group Membership",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.lady_gaga",
					"class": "music.group_member",
					"friendly_name": "gaga",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "music.musical_group.member",
					"friendly_name": "Members Of Musical Group"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "music.group_member.membership",
					"friendly_name": "Member of"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.musical_group . \n?x1 :type.object.type :music.group_membership . \nVALUES ?x2 { :en.lady_gaga } \n?x0 :music.musical_group.member ?x1 . \n?x2 :music.group_member.membership ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 235000100,
		"question": "in which group was lady gaga a member?",
		"answer": [
			"SGBand"
		],
		"function": "none",
		"commonness": -15.713858033023467,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.musical_group",
					"class": "music.musical_group",
					"friendly_name": "Musical Group",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "music.group_membership",
					"class": "music.group_membership",
					"friendly_name": "Musical Group Membership",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.lady_gaga",
					"class": "music.group_member",
					"friendly_name": "Lady Gaga",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "music.musical_group.member",
					"friendly_name": "Members Of Musical Group"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "music.group_member.membership",
					"friendly_name": "Member of"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.musical_group . \n?x1 :type.object.type :music.group_membership . \nVALUES ?x2 { :en.lady_gaga } \n?x0 :music.musical_group.member ?x1 . \n?x2 :music.group_member.membership ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 235000101,
		"question": "in which group was gaga a member?",
		"answer": [
			"SGBand"
		],
		"function": "none",
		"commonness": -15.713858033023467,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.musical_group",
					"class": "music.musical_group",
					"friendly_name": "Musical Group",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "music.group_membership",
					"class": "music.group_membership",
					"friendly_name": "Musical Group Membership",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.lady_gaga",
					"class": "music.group_member",
					"friendly_name": "gaga",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "music.musical_group.member",
					"friendly_name": "Members Of Musical Group"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "music.group_member.membership",
					"friendly_name": "Member of"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.musical_group . \n?x1 :type.object.type :music.group_membership . \nVALUES ?x2 { :en.lady_gaga } \n?x0 :music.musical_group.member ?x1 . \n?x2 :music.group_member.membership ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 235000201,
		"question": "which group did gaga belong to?",
		"answer": [
			"SGBand"
		],
		"function": "none",
		"commonness": -15.713858033023467,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.musical_group",
					"class": "music.musical_group",
					"friendly_name": "Musical Group",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "music.group_membership",
					"class": "music.group_membership",
					"friendly_name": "Musical Group Membership",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.lady_gaga",
					"class": "music.group_member",
					"friendly_name": "gaga",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "music.musical_group.member",
					"friendly_name": "Members Of Musical Group"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "music.group_member.membership",
					"friendly_name": "Member of"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.musical_group . \n?x1 :type.object.type :music.group_membership . \nVALUES ?x2 { :en.lady_gaga } \n?x0 :music.musical_group.member ?x1 . \n?x2 :music.group_member.membership ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 235000300,
		"question": "to which group was lady gaga a member of?",
		"answer": [
			"SGBand"
		],
		"function": "none",
		"commonness": -15.713858033023467,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.musical_group",
					"class": "music.musical_group",
					"friendly_name": "Musical Group",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "music.group_membership",
					"class": "music.group_membership",
					"friendly_name": "Musical Group Membership",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.lady_gaga",
					"class": "music.group_member",
					"friendly_name": "Lady Gaga",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "music.musical_group.member",
					"friendly_name": "Members Of Musical Group"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "music.group_member.membership",
					"friendly_name": "Member of"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.musical_group . \n?x1 :type.object.type :music.group_membership . \nVALUES ?x2 { :en.lady_gaga } \n?x0 :music.musical_group.member ?x1 . \n?x2 :music.group_member.membership ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 235000301,
		"question": "to which group was gaga a member of?",
		"answer": [
			"SGBand"
		],
		"function": "none",
		"commonness": -15.713858033023467,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.musical_group",
					"class": "music.musical_group",
					"friendly_name": "Musical Group",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "music.group_membership",
					"class": "music.group_membership",
					"friendly_name": "Musical Group Membership",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.lady_gaga",
					"class": "music.group_member",
					"friendly_name": "gaga",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "music.musical_group.member",
					"friendly_name": "Members Of Musical Group"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "music.group_member.membership",
					"friendly_name": "Member of"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.musical_group . \n?x1 :type.object.type :music.group_membership . \nVALUES ?x2 { :en.lady_gaga } \n?x0 :music.musical_group.member ?x1 . \n?x2 :music.group_member.membership ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 235000400,
		"question": "lady gaga was a member of which group?",
		"answer": [
			"SGBand"
		],
		"function": "none",
		"commonness": -15.713858033023467,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.musical_group",
					"class": "music.musical_group",
					"friendly_name": "Musical Group",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "music.group_membership",
					"class": "music.group_membership",
					"friendly_name": "Musical Group Membership",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.lady_gaga",
					"class": "music.group_member",
					"friendly_name": "Lady Gaga",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "music.musical_group.member",
					"friendly_name": "Members Of Musical Group"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "music.group_member.membership",
					"friendly_name": "Member of"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.musical_group . \n?x1 :type.object.type :music.group_membership . \nVALUES ?x2 { :en.lady_gaga } \n?x0 :music.musical_group.member ?x1 . \n?x2 :music.group_member.membership ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 235000401,
		"question": "gaga was a member of which group?",
		"answer": [
			"SGBand"
		],
		"function": "none",
		"commonness": -15.713858033023467,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "music.musical_group",
					"class": "music.musical_group",
					"friendly_name": "Musical Group",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "music.group_membership",
					"class": "music.group_membership",
					"friendly_name": "Musical Group Membership",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.lady_gaga",
					"class": "music.group_member",
					"friendly_name": "gaga",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "music.musical_group.member",
					"friendly_name": "Members Of Musical Group"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "music.group_member.membership",
					"friendly_name": "Member of"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :music.musical_group . \n?x1 :type.object.type :music.group_membership . \nVALUES ?x2 { :en.lady_gaga } \n?x0 :music.musical_group.member ?x1 . \n?x2 :music.group_member.membership ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 236000000,
		"question": "which of the united states of americas race horses was born in 1948?",
		"answer": [
			"Bold"
		],
		"function": "none",
		"commonness": -21.69399999535365,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.thoroughbredracing.thoroughbred_racehorse",
					"class": "base.thoroughbredracing.thoroughbred_racehorse",
					"friendly_name": "Thoroughbred racehorse",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "1948^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "1948",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "base.thoroughbredracing.thoroughbred_racehorse_origin",
					"friendly_name": "United States of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.organism.date_of_birth",
					"friendly_name": "Date of Birth"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.thoroughbredracing.thoroughbred_racehorse.country",
					"friendly_name": "Country"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.thoroughbredracing.thoroughbred_racehorse . \nVALUES ?x1 { \"1948\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \nVALUES ?x2 { :en.united_states_of_america } \n?x0 :biology.organism.date_of_birth ?x1 . \n?x0 :base.thoroughbredracing.thoroughbred_racehorse.country ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 236000001,
		"question": "which of the uss race horses was born in 1948?",
		"answer": [
			"Bold"
		],
		"function": "none",
		"commonness": -21.69399999535365,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.thoroughbredracing.thoroughbred_racehorse",
					"class": "base.thoroughbredracing.thoroughbred_racehorse",
					"friendly_name": "Thoroughbred racehorse",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "1948^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "1948",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "base.thoroughbredracing.thoroughbred_racehorse_origin",
					"friendly_name": "us",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.organism.date_of_birth",
					"friendly_name": "Date of Birth"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.thoroughbredracing.thoroughbred_racehorse.country",
					"friendly_name": "Country"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.thoroughbredracing.thoroughbred_racehorse . \nVALUES ?x1 { \"1948\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \nVALUES ?x2 { :en.united_states_of_america } \n?x0 :biology.organism.date_of_birth ?x1 . \n?x0 :base.thoroughbredracing.thoroughbred_racehorse.country ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 236000002,
		"question": "which of the united statess race horses was born in 1948?",
		"answer": [
			"Bold"
		],
		"function": "none",
		"commonness": -21.69399999535365,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.thoroughbredracing.thoroughbred_racehorse",
					"class": "base.thoroughbredracing.thoroughbred_racehorse",
					"friendly_name": "Thoroughbred racehorse",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "1948^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "1948",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "base.thoroughbredracing.thoroughbred_racehorse_origin",
					"friendly_name": "united states",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "biology.organism.date_of_birth",
					"friendly_name": "Date of Birth"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.thoroughbredracing.thoroughbred_racehorse.country",
					"friendly_name": "Country"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.thoroughbredracing.thoroughbred_racehorse . \nVALUES ?x1 { \"1948\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \nVALUES ?x2 { :en.united_states_of_america } \n?x0 :biology.organism.date_of_birth ?x1 . \n?x0 :base.thoroughbredracing.thoroughbred_racehorse.country ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	}
]