[
	{
		"qid": 242000201,
		"question": "what rocket function is supported by saturn v as well as another rocket made by chrysler?",
		"answer": [
			"Launch vehicle",
			"Low Earth orbit"
		],
		"function": "none",
		"commonness": -38.01722329822522,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_function",
					"class": "spaceflight.rocket_function",
					"friendly_name": "Rocket Function",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "spaceflight.rocket",
					"class": "spaceflight.rocket",
					"friendly_name": "Rocket",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.chrysler",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "chrysler",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.saturn_v",
					"class": "spaceflight.rocket",
					"friendly_name": "Saturn V",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket_function.rockets_supporting_this_function",
					"friendly_name": "Rockets supporting this function"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				},
				{
					"start": 3,
					"end": 0,
					"relation": "spaceflight.rocket.rocket_function",
					"friendly_name": "Rocket Function"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_function . \n?x1 :type.object.type :spaceflight.rocket . \nVALUES ?x2 { :en.chrysler } \nVALUES ?x3 { :en.saturn_v } \n?x0 :spaceflight.rocket_function.rockets_supporting_this_function ?x1 . \n?x2 :spaceflight.rocket_manufacturer.rockets_manufactured ?x1 . \n?x3 :spaceflight.rocket.rocket_function ?x0 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 242000202,
		"question": "what rocket function is supported by saturn v as well as another rocket made by chrysler llc?",
		"answer": [
			"Launch vehicle",
			"Low Earth orbit"
		],
		"function": "none",
		"commonness": -38.01722329822522,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_function",
					"class": "spaceflight.rocket_function",
					"friendly_name": "Rocket Function",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "spaceflight.rocket",
					"class": "spaceflight.rocket",
					"friendly_name": "Rocket",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.chrysler",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "chrysler llc",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.saturn_v",
					"class": "spaceflight.rocket",
					"friendly_name": "Saturn V",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket_function.rockets_supporting_this_function",
					"friendly_name": "Rockets supporting this function"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				},
				{
					"start": 3,
					"end": 0,
					"relation": "spaceflight.rocket.rocket_function",
					"friendly_name": "Rocket Function"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_function . \n?x1 :type.object.type :spaceflight.rocket . \nVALUES ?x2 { :en.chrysler } \nVALUES ?x3 { :en.saturn_v } \n?x0 :spaceflight.rocket_function.rockets_supporting_this_function ?x1 . \n?x2 :spaceflight.rocket_manufacturer.rockets_manufactured ?x1 . \n?x3 :spaceflight.rocket.rocket_function ?x0 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 243000000,
		"question": "what radio programs made in the english language talk about the same subjects as schizophrenia: voices of an illness?",
		"answer": [
			"A Disaster Called Schizophrenia"
		],
		"function": "none",
		"commonness": -39.718054108462916,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "radio.radio_program",
					"class": "radio.radio_program",
					"friendly_name": "Radio program",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.english",
					"class": "language.human_language",
					"friendly_name": "English Language",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "radio.radio_subject",
					"class": "radio.radio_subject",
					"friendly_name": "Radio subject",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "m.05v48n2",
					"class": "radio.radio_program_episode",
					"friendly_name": "Schizophrenia: Voices of an Illness",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.content.language",
					"friendly_name": "Language"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "radio.radio_program.subjects",
					"friendly_name": "Subject"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "radio.radio_program_episode.subjects",
					"friendly_name": "Subjects"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :radio.radio_program . \nVALUES ?x1 { :en.english } \n?x2 :type.object.type :radio.radio_subject . \nVALUES ?x3 { :m.05v48n2 } \n?x0 :broadcast.content.language ?x1 . \n?x0 :radio.radio_program.subjects ?x2 . \n?x3 :radio.radio_program_episode.subjects ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 243000001,
		"question": "what radio programs made in the english talk about the same subjects as schizophrenia: voices of an illness?",
		"answer": [
			"A Disaster Called Schizophrenia"
		],
		"function": "none",
		"commonness": -39.718054108462916,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "radio.radio_program",
					"class": "radio.radio_program",
					"friendly_name": "Radio program",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.english",
					"class": "language.human_language",
					"friendly_name": "english",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "radio.radio_subject",
					"class": "radio.radio_subject",
					"friendly_name": "Radio subject",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "m.05v48n2",
					"class": "radio.radio_program_episode",
					"friendly_name": "Schizophrenia: Voices of an Illness",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.content.language",
					"friendly_name": "Language"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "radio.radio_program.subjects",
					"friendly_name": "Subject"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "radio.radio_program_episode.subjects",
					"friendly_name": "Subjects"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :radio.radio_program . \nVALUES ?x1 { :en.english } \n?x2 :type.object.type :radio.radio_subject . \nVALUES ?x3 { :m.05v48n2 } \n?x0 :broadcast.content.language ?x1 . \n?x0 :radio.radio_program.subjects ?x2 . \n?x3 :radio.radio_program_episode.subjects ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 243000100,
		"question": "which radio programs broadcasted in the english language deal with the same topics as schizophrenia: voices of an illness?",
		"answer": [
			"A Disaster Called Schizophrenia"
		],
		"function": "none",
		"commonness": -39.718054108462916,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "radio.radio_program",
					"class": "radio.radio_program",
					"friendly_name": "Radio program",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.english",
					"class": "language.human_language",
					"friendly_name": "English Language",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "radio.radio_subject",
					"class": "radio.radio_subject",
					"friendly_name": "Radio subject",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "m.05v48n2",
					"class": "radio.radio_program_episode",
					"friendly_name": "Schizophrenia: Voices of an Illness",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.content.language",
					"friendly_name": "Language"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "radio.radio_program.subjects",
					"friendly_name": "Subject"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "radio.radio_program_episode.subjects",
					"friendly_name": "Subjects"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :radio.radio_program . \nVALUES ?x1 { :en.english } \n?x2 :type.object.type :radio.radio_subject . \nVALUES ?x3 { :m.05v48n2 } \n?x0 :broadcast.content.language ?x1 . \n?x0 :radio.radio_program.subjects ?x2 . \n?x3 :radio.radio_program_episode.subjects ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 243000101,
		"question": "which radio programs broadcasted in the english deal with the same topics as schizophrenia: voices of an illness?",
		"answer": [
			"A Disaster Called Schizophrenia"
		],
		"function": "none",
		"commonness": -39.718054108462916,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "radio.radio_program",
					"class": "radio.radio_program",
					"friendly_name": "Radio program",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.english",
					"class": "language.human_language",
					"friendly_name": "english",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "radio.radio_subject",
					"class": "radio.radio_subject",
					"friendly_name": "Radio subject",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "m.05v48n2",
					"class": "radio.radio_program_episode",
					"friendly_name": "Schizophrenia: Voices of an Illness",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.content.language",
					"friendly_name": "Language"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "radio.radio_program.subjects",
					"friendly_name": "Subject"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "radio.radio_program_episode.subjects",
					"friendly_name": "Subjects"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :radio.radio_program . \nVALUES ?x1 { :en.english } \n?x2 :type.object.type :radio.radio_subject . \nVALUES ?x3 { :m.05v48n2 } \n?x0 :broadcast.content.language ?x1 . \n?x0 :radio.radio_program.subjects ?x2 . \n?x3 :radio.radio_program_episode.subjects ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 243000200,
		"question": "which english language programs on the radio discuss the same subject matter as schizophrenia: voices of an illness?",
		"answer": [
			"A Disaster Called Schizophrenia"
		],
		"function": "none",
		"commonness": -39.718054108462916,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "radio.radio_program",
					"class": "radio.radio_program",
					"friendly_name": "Radio program",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.english",
					"class": "language.human_language",
					"friendly_name": "English Language",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "radio.radio_subject",
					"class": "radio.radio_subject",
					"friendly_name": "Radio subject",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "m.05v48n2",
					"class": "radio.radio_program_episode",
					"friendly_name": "Schizophrenia: Voices of an Illness",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.content.language",
					"friendly_name": "Language"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "radio.radio_program.subjects",
					"friendly_name": "Subject"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "radio.radio_program_episode.subjects",
					"friendly_name": "Subjects"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :radio.radio_program . \nVALUES ?x1 { :en.english } \n?x2 :type.object.type :radio.radio_subject . \nVALUES ?x3 { :m.05v48n2 } \n?x0 :broadcast.content.language ?x1 . \n?x0 :radio.radio_program.subjects ?x2 . \n?x3 :radio.radio_program_episode.subjects ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 243000300,
		"question": "which radio programs in the english language have the same subjects as schizophrenia: voices of an illness?",
		"answer": [
			"A Disaster Called Schizophrenia"
		],
		"function": "none",
		"commonness": -39.718054108462916,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "radio.radio_program",
					"class": "radio.radio_program",
					"friendly_name": "Radio program",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.english",
					"class": "language.human_language",
					"friendly_name": "English Language",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "radio.radio_subject",
					"class": "radio.radio_subject",
					"friendly_name": "Radio subject",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "m.05v48n2",
					"class": "radio.radio_program_episode",
					"friendly_name": "Schizophrenia: Voices of an Illness",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.content.language",
					"friendly_name": "Language"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "radio.radio_program.subjects",
					"friendly_name": "Subject"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "radio.radio_program_episode.subjects",
					"friendly_name": "Subjects"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :radio.radio_program . \nVALUES ?x1 { :en.english } \n?x2 :type.object.type :radio.radio_subject . \nVALUES ?x3 { :m.05v48n2 } \n?x0 :broadcast.content.language ?x1 . \n?x0 :radio.radio_program.subjects ?x2 . \n?x3 :radio.radio_program_episode.subjects ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 243000301,
		"question": "which radio programs in the english have the same subjects as schizophrenia: voices of an illness?",
		"answer": [
			"A Disaster Called Schizophrenia"
		],
		"function": "none",
		"commonness": -39.718054108462916,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "radio.radio_program",
					"class": "radio.radio_program",
					"friendly_name": "Radio program",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.english",
					"class": "language.human_language",
					"friendly_name": "english",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "radio.radio_subject",
					"class": "radio.radio_subject",
					"friendly_name": "Radio subject",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "m.05v48n2",
					"class": "radio.radio_program_episode",
					"friendly_name": "Schizophrenia: Voices of an Illness",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.content.language",
					"friendly_name": "Language"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "radio.radio_program.subjects",
					"friendly_name": "Subject"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "radio.radio_program_episode.subjects",
					"friendly_name": "Subjects"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :radio.radio_program . \nVALUES ?x1 { :en.english } \n?x2 :type.object.type :radio.radio_subject . \nVALUES ?x3 { :m.05v48n2 } \n?x0 :broadcast.content.language ?x1 . \n?x0 :radio.radio_program.subjects ?x2 . \n?x3 :radio.radio_program_episode.subjects ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 243000400,
		"question": "what radio shows spoken in the english language share the same subjects as schizophrenia: voices of an illness?",
		"answer": [
			"A Disaster Called Schizophrenia"
		],
		"function": "none",
		"commonness": -39.718054108462916,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "radio.radio_program",
					"class": "radio.radio_program",
					"friendly_name": "Radio program",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.english",
					"class": "language.human_language",
					"friendly_name": "English Language",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "radio.radio_subject",
					"class": "radio.radio_subject",
					"friendly_name": "Radio subject",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "m.05v48n2",
					"class": "radio.radio_program_episode",
					"friendly_name": "Schizophrenia: Voices of an Illness",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.content.language",
					"friendly_name": "Language"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "radio.radio_program.subjects",
					"friendly_name": "Subject"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "radio.radio_program_episode.subjects",
					"friendly_name": "Subjects"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :radio.radio_program . \nVALUES ?x1 { :en.english } \n?x2 :type.object.type :radio.radio_subject . \nVALUES ?x3 { :m.05v48n2 } \n?x0 :broadcast.content.language ?x1 . \n?x0 :radio.radio_program.subjects ?x2 . \n?x3 :radio.radio_program_episode.subjects ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 243000401,
		"question": "what radio shows spoken in the english share the same subjects as schizophrenia: voices of an illness?",
		"answer": [
			"A Disaster Called Schizophrenia"
		],
		"function": "none",
		"commonness": -39.718054108462916,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "radio.radio_program",
					"class": "radio.radio_program",
					"friendly_name": "Radio program",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.english",
					"class": "language.human_language",
					"friendly_name": "english",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "radio.radio_subject",
					"class": "radio.radio_subject",
					"friendly_name": "Radio subject",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "m.05v48n2",
					"class": "radio.radio_program_episode",
					"friendly_name": "Schizophrenia: Voices of an Illness",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.content.language",
					"friendly_name": "Language"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "radio.radio_program.subjects",
					"friendly_name": "Subject"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "radio.radio_program_episode.subjects",
					"friendly_name": "Subjects"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :radio.radio_program . \nVALUES ?x1 { :en.english } \n?x2 :type.object.type :radio.radio_subject . \nVALUES ?x3 { :m.05v48n2 } \n?x0 :broadcast.content.language ?x1 . \n?x0 :radio.radio_program.subjects ?x2 . \n?x3 :radio.radio_program_episode.subjects ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 244000000,
		"question": "what is the name of the manager of the team which won the runner-up for the 2007 world series?",
		"answer": [
			"Jim Leyland",
			"Don Baylor",
			"Clint Hurdle"
		],
		"function": "none",
		"commonness": -33.313388228157265,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "baseball.baseball_manager",
					"class": "baseball.baseball_manager",
					"friendly_name": "Baseball Manager",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "baseball.baseball_historical_managerial_position",
					"class": "baseball.baseball_historical_managerial_position",
					"friendly_name": "Baseball Historical Managerial Position",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "baseball.baseball_team",
					"class": "baseball.baseball_team",
					"friendly_name": "Baseball Team",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.2007_world_series",
					"class": "sports.sports_championship_event",
					"friendly_name": "2007 World Series",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "baseball.baseball_historical_managerial_position.manager",
					"friendly_name": "Manager"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "baseball.baseball_historical_managerial_position.team",
					"friendly_name": "Team"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "sports.sports_championship_event.runner_up",
					"friendly_name": "Runner-up"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :baseball.baseball_manager . \n?x1 :type.object.type :baseball.baseball_historical_managerial_position . \n?x2 :type.object.type :baseball.baseball_team . \nVALUES ?x3 { :en.2007_world_series } \n?x1 :baseball.baseball_historical_managerial_position.manager ?x0 . \n?x1 :baseball.baseball_historical_managerial_position.team ?x2 . \n?x3 :sports.sports_championship_event.runner_up ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 244000001,
		"question": "what is the name of the manager of the team which won the runner-up for the ws07?",
		"answer": [
			"Jim Leyland",
			"Clint Hurdle",
			"Don Baylor"
		],
		"function": "none",
		"commonness": -33.313388228157265,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "baseball.baseball_manager",
					"class": "baseball.baseball_manager",
					"friendly_name": "Baseball Manager",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "baseball.baseball_historical_managerial_position",
					"class": "baseball.baseball_historical_managerial_position",
					"friendly_name": "Baseball Historical Managerial Position",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "baseball.baseball_team",
					"class": "baseball.baseball_team",
					"friendly_name": "Baseball Team",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.2007_world_series",
					"class": "sports.sports_championship_event",
					"friendly_name": "ws07",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "baseball.baseball_historical_managerial_position.manager",
					"friendly_name": "Manager"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "baseball.baseball_historical_managerial_position.team",
					"friendly_name": "Team"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "sports.sports_championship_event.runner_up",
					"friendly_name": "Runner-up"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :baseball.baseball_manager . \n?x1 :type.object.type :baseball.baseball_historical_managerial_position . \n?x2 :type.object.type :baseball.baseball_team . \nVALUES ?x3 { :en.2007_world_series } \n?x1 :baseball.baseball_historical_managerial_position.manager ?x0 . \n?x1 :baseball.baseball_historical_managerial_position.team ?x2 . \n?x3 :sports.sports_championship_event.runner_up ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	}
]