[
	{
		"qid": 72000100,
		"question": "who made the saturn v?",
		"answer": [
			"Douglas Aircraft Company",
			"North American Aviation",
			"Boeing"
		],
		"function": "none",
		"commonness": -15.279118137692226,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_manufacturer",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "Rocket Manufacturer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.saturn_v",
					"class": "spaceflight.rocket",
					"friendly_name": "Saturn V",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_manufacturer . \nVALUES ?x1 { :en.saturn_v } \n?x0 :spaceflight.rocket_manufacturer.rockets_manufactured ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 72000101,
		"question": "who made the saturn 5?",
		"answer": [
			"Boeing",
			"North American Aviation",
			"Douglas Aircraft Company"
		],
		"function": "none",
		"commonness": -15.279118137692226,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_manufacturer",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "Rocket Manufacturer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.saturn_v",
					"class": "spaceflight.rocket",
					"friendly_name": "saturn 5",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_manufacturer . \nVALUES ?x1 { :en.saturn_v } \n?x0 :spaceflight.rocket_manufacturer.rockets_manufactured ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 72000200,
		"question": "what company made the saturn v?",
		"answer": [
			"Douglas Aircraft Company",
			"Boeing",
			"North American Aviation"
		],
		"function": "none",
		"commonness": -15.279118137692226,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_manufacturer",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "Rocket Manufacturer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.saturn_v",
					"class": "spaceflight.rocket",
					"friendly_name": "Saturn V",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_manufacturer . \nVALUES ?x1 { :en.saturn_v } \n?x0 :spaceflight.rocket_manufacturer.rockets_manufactured ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 72000201,
		"question": "what company made the saturn 5?",
		"answer": [
			"Douglas Aircraft Company",
			"North American Aviation",
			"Boeing"
		],
		"function": "none",
		"commonness": -15.279118137692226,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_manufacturer",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "Rocket Manufacturer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.saturn_v",
					"class": "spaceflight.rocket",
					"friendly_name": "saturn 5",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_manufacturer . \nVALUES ?x1 { :en.saturn_v } \n?x0 :spaceflight.rocket_manufacturer.rockets_manufactured ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 72000300,
		"question": "the saturn v rocket was built by who?",
		"answer": [
			"North American Aviation",
			"Douglas Aircraft Company",
			"Boeing"
		],
		"function": "none",
		"commonness": -15.279118137692226,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_manufacturer",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "Rocket Manufacturer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.saturn_v",
					"class": "spaceflight.rocket",
					"friendly_name": "Saturn V",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_manufacturer . \nVALUES ?x1 { :en.saturn_v } \n?x0 :spaceflight.rocket_manufacturer.rockets_manufactured ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 72000301,
		"question": "the saturn 5 rocket was built by who?",
		"answer": [
			"Douglas Aircraft Company",
			"North American Aviation",
			"Boeing"
		],
		"function": "none",
		"commonness": -15.279118137692226,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_manufacturer",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "Rocket Manufacturer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.saturn_v",
					"class": "spaceflight.rocket",
					"friendly_name": "saturn 5",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_manufacturer . \nVALUES ?x1 { :en.saturn_v } \n?x0 :spaceflight.rocket_manufacturer.rockets_manufactured ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 72000400,
		"question": "who is credited with constructing the saturn v rocket?",
		"answer": [
			"North American Aviation",
			"Boeing",
			"Douglas Aircraft Company"
		],
		"function": "none",
		"commonness": -15.279118137692226,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_manufacturer",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "Rocket Manufacturer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.saturn_v",
					"class": "spaceflight.rocket",
					"friendly_name": "Saturn V",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_manufacturer . \nVALUES ?x1 { :en.saturn_v } \n?x0 :spaceflight.rocket_manufacturer.rockets_manufactured ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 72000401,
		"question": "who is credited with constructing the saturn 5 rocket?",
		"answer": [
			"Douglas Aircraft Company",
			"North American Aviation",
			"Boeing"
		],
		"function": "none",
		"commonness": -15.279118137692226,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_manufacturer",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "Rocket Manufacturer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.saturn_v",
					"class": "spaceflight.rocket",
					"friendly_name": "saturn 5",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_manufacturer . \nVALUES ?x1 { :en.saturn_v } \n?x0 :spaceflight.rocket_manufacturer.rockets_manufactured ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 73000000,
		"question": "haunted mansion has which theme?",
		"answer": [
			"Haunted house"
		],
		"function": "none",
		"commonness": -14.63675919580269,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "amusement_parks.ride_theme",
					"class": "amusement_parks.ride_theme",
					"friendly_name": "Amusement Ride Theme",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.haunted_mansion",
					"class": "amusement_parks.ride",
					"friendly_name": "Haunted Mansion",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "amusement_parks.ride_theme.rides",
					"friendly_name": "Rides"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :amusement_parks.ride_theme . \nVALUES ?x1 { :en.haunted_mansion } \n?x0 :amusement_parks.ride_theme.rides ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 73000001,
		"question": "mansion has which theme?",
		"answer": [
			"Haunted house"
		],
		"function": "none",
		"commonness": -14.63675919580269,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "amusement_parks.ride_theme",
					"class": "amusement_parks.ride_theme",
					"friendly_name": "Amusement Ride Theme",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.haunted_mansion",
					"class": "amusement_parks.ride",
					"friendly_name": "mansion",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "amusement_parks.ride_theme.rides",
					"friendly_name": "Rides"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :amusement_parks.ride_theme . \nVALUES ?x1 { :en.haunted_mansion } \n?x0 :amusement_parks.ride_theme.rides ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 73000002,
		"question": "haunted manison has which theme?",
		"answer": [
			"Haunted house"
		],
		"function": "none",
		"commonness": -14.63675919580269,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "amusement_parks.ride_theme",
					"class": "amusement_parks.ride_theme",
					"friendly_name": "Amusement Ride Theme",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.haunted_mansion",
					"class": "amusement_parks.ride",
					"friendly_name": "haunted manison",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "amusement_parks.ride_theme.rides",
					"friendly_name": "Rides"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :amusement_parks.ride_theme . \nVALUES ?x1 { :en.haunted_mansion } \n?x0 :amusement_parks.ride_theme.rides ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 73000100,
		"question": "what is the theme of haunted mansion?",
		"answer": [
			"Haunted house"
		],
		"function": "none",
		"commonness": -14.63675919580269,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "amusement_parks.ride_theme",
					"class": "amusement_parks.ride_theme",
					"friendly_name": "Amusement Ride Theme",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.haunted_mansion",
					"class": "amusement_parks.ride",
					"friendly_name": "Haunted Mansion",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "amusement_parks.ride_theme.rides",
					"friendly_name": "Rides"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :amusement_parks.ride_theme . \nVALUES ?x1 { :en.haunted_mansion } \n?x0 :amusement_parks.ride_theme.rides ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 73000101,
		"question": "what is the theme of mansion?",
		"answer": [
			"Haunted house"
		],
		"function": "none",
		"commonness": -14.63675919580269,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "amusement_parks.ride_theme",
					"class": "amusement_parks.ride_theme",
					"friendly_name": "Amusement Ride Theme",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.haunted_mansion",
					"class": "amusement_parks.ride",
					"friendly_name": "mansion",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "amusement_parks.ride_theme.rides",
					"friendly_name": "Rides"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :amusement_parks.ride_theme . \nVALUES ?x1 { :en.haunted_mansion } \n?x0 :amusement_parks.ride_theme.rides ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 73000102,
		"question": "what is the theme of haunted manison?",
		"answer": [
			"Haunted house"
		],
		"function": "none",
		"commonness": -14.63675919580269,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "amusement_parks.ride_theme",
					"class": "amusement_parks.ride_theme",
					"friendly_name": "Amusement Ride Theme",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.haunted_mansion",
					"class": "amusement_parks.ride",
					"friendly_name": "haunted manison",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "amusement_parks.ride_theme.rides",
					"friendly_name": "Rides"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :amusement_parks.ride_theme . \nVALUES ?x1 { :en.haunted_mansion } \n?x0 :amusement_parks.ride_theme.rides ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 73000200,
		"question": "what type of amusement ride is haunted mansion?",
		"answer": [
			"Haunted house"
		],
		"function": "none",
		"commonness": -14.63675919580269,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "amusement_parks.ride_theme",
					"class": "amusement_parks.ride_theme",
					"friendly_name": "Amusement Ride Theme",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.haunted_mansion",
					"class": "amusement_parks.ride",
					"friendly_name": "Haunted Mansion",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "amusement_parks.ride_theme.rides",
					"friendly_name": "Rides"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :amusement_parks.ride_theme . \nVALUES ?x1 { :en.haunted_mansion } \n?x0 :amusement_parks.ride_theme.rides ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 73000201,
		"question": "what type of amusement ride is mansion?",
		"answer": [
			"Haunted house"
		],
		"function": "none",
		"commonness": -14.63675919580269,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "amusement_parks.ride_theme",
					"class": "amusement_parks.ride_theme",
					"friendly_name": "Amusement Ride Theme",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.haunted_mansion",
					"class": "amusement_parks.ride",
					"friendly_name": "mansion",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "amusement_parks.ride_theme.rides",
					"friendly_name": "Rides"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :amusement_parks.ride_theme . \nVALUES ?x1 { :en.haunted_mansion } \n?x0 :amusement_parks.ride_theme.rides ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 73000202,
		"question": "what type of amusement ride is haunted manison?",
		"answer": [
			"Haunted house"
		],
		"function": "none",
		"commonness": -14.63675919580269,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "amusement_parks.ride_theme",
					"class": "amusement_parks.ride_theme",
					"friendly_name": "Amusement Ride Theme",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.haunted_mansion",
					"class": "amusement_parks.ride",
					"friendly_name": "haunted manison",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "amusement_parks.ride_theme.rides",
					"friendly_name": "Rides"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :amusement_parks.ride_theme . \nVALUES ?x1 { :en.haunted_mansion } \n?x0 :amusement_parks.ride_theme.rides ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 73000300,
		"question": "what kind of theme does the amusement ride haunted mansion use?",
		"answer": [
			"Haunted house"
		],
		"function": "none",
		"commonness": -14.63675919580269,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "amusement_parks.ride_theme",
					"class": "amusement_parks.ride_theme",
					"friendly_name": "Amusement Ride Theme",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.haunted_mansion",
					"class": "amusement_parks.ride",
					"friendly_name": "Haunted Mansion",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "amusement_parks.ride_theme.rides",
					"friendly_name": "Rides"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :amusement_parks.ride_theme . \nVALUES ?x1 { :en.haunted_mansion } \n?x0 :amusement_parks.ride_theme.rides ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 73000301,
		"question": "what kind of theme does the amusement ride mansion use?",
		"answer": [
			"Haunted house"
		],
		"function": "none",
		"commonness": -14.63675919580269,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "amusement_parks.ride_theme",
					"class": "amusement_parks.ride_theme",
					"friendly_name": "Amusement Ride Theme",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.haunted_mansion",
					"class": "amusement_parks.ride",
					"friendly_name": "mansion",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "amusement_parks.ride_theme.rides",
					"friendly_name": "Rides"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :amusement_parks.ride_theme . \nVALUES ?x1 { :en.haunted_mansion } \n?x0 :amusement_parks.ride_theme.rides ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 73000302,
		"question": "what kind of theme does the amusement ride haunted manison use?",
		"answer": [
			"Haunted house"
		],
		"function": "none",
		"commonness": -14.63675919580269,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "amusement_parks.ride_theme",
					"class": "amusement_parks.ride_theme",
					"friendly_name": "Amusement Ride Theme",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.haunted_mansion",
					"class": "amusement_parks.ride",
					"friendly_name": "haunted manison",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "amusement_parks.ride_theme.rides",
					"friendly_name": "Rides"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :amusement_parks.ride_theme . \nVALUES ?x1 { :en.haunted_mansion } \n?x0 :amusement_parks.ride_theme.rides ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 73000400,
		"question": "what is the subject in the design of haunted mansion?",
		"answer": [
			"Haunted house"
		],
		"function": "none",
		"commonness": -14.63675919580269,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "amusement_parks.ride_theme",
					"class": "amusement_parks.ride_theme",
					"friendly_name": "Amusement Ride Theme",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.haunted_mansion",
					"class": "amusement_parks.ride",
					"friendly_name": "Haunted Mansion",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "amusement_parks.ride_theme.rides",
					"friendly_name": "Rides"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :amusement_parks.ride_theme . \nVALUES ?x1 { :en.haunted_mansion } \n?x0 :amusement_parks.ride_theme.rides ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 73000401,
		"question": "what is the subject in the design of mansion?",
		"answer": [
			"Haunted house"
		],
		"function": "none",
		"commonness": -14.63675919580269,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "amusement_parks.ride_theme",
					"class": "amusement_parks.ride_theme",
					"friendly_name": "Amusement Ride Theme",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.haunted_mansion",
					"class": "amusement_parks.ride",
					"friendly_name": "mansion",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "amusement_parks.ride_theme.rides",
					"friendly_name": "Rides"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :amusement_parks.ride_theme . \nVALUES ?x1 { :en.haunted_mansion } \n?x0 :amusement_parks.ride_theme.rides ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 73000402,
		"question": "what is the subject in the design of haunted manison?",
		"answer": [
			"Haunted house"
		],
		"function": "none",
		"commonness": -14.63675919580269,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "amusement_parks.ride_theme",
					"class": "amusement_parks.ride_theme",
					"friendly_name": "Amusement Ride Theme",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.haunted_mansion",
					"class": "amusement_parks.ride",
					"friendly_name": "haunted manison",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "amusement_parks.ride_theme.rides",
					"friendly_name": "Rides"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :amusement_parks.ride_theme . \nVALUES ?x1 { :en.haunted_mansion } \n?x0 :amusement_parks.ride_theme.rides ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 73000501,
		"question": "what motif does disneyland's mansion feature?",
		"answer": [
			"Haunted house"
		],
		"function": "none",
		"commonness": -14.63675919580269,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "amusement_parks.ride_theme",
					"class": "amusement_parks.ride_theme",
					"friendly_name": "Amusement Ride Theme",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.haunted_mansion",
					"class": "amusement_parks.ride",
					"friendly_name": "mansion",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "amusement_parks.ride_theme.rides",
					"friendly_name": "Rides"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :amusement_parks.ride_theme . \nVALUES ?x1 { :en.haunted_mansion } \n?x0 :amusement_parks.ride_theme.rides ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]