[
	{
		"qid": 241000200,
		"question": "who is the designer of an amusement ride which has the same theme as haunted mansion?",
		"answer": [
			"Walt Disney Imagineering"
		],
		"function": "none",
		"commonness": -35.55893972064999,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "amusement_parks.ride_designer",
					"class": "amusement_parks.ride_designer",
					"friendly_name": "Amusement Ride Designer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "amusement_parks.ride",
					"class": "amusement_parks.ride",
					"friendly_name": "Amusement Ride",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "amusement_parks.ride_theme",
					"class": "amusement_parks.ride_theme",
					"friendly_name": "Amusement Ride Theme",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.haunted_mansion",
					"class": "amusement_parks.ride",
					"friendly_name": "Haunted Mansion",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "amusement_parks.ride.designer",
					"friendly_name": "Designer"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "amusement_parks.ride.theme",
					"friendly_name": "Theme"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "amusement_parks.ride.theme",
					"friendly_name": "Theme"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :amusement_parks.ride_designer . \n?x1 :type.object.type :amusement_parks.ride . \n?x2 :type.object.type :amusement_parks.ride_theme . \nVALUES ?x3 { :en.haunted_mansion } \n?x1 :amusement_parks.ride.designer ?x0 . \n?x3 :amusement_parks.ride.theme ?x2 . \n?x1 :amusement_parks.ride.theme ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 241000201,
		"question": "who is the designer of an amusement ride which has the same theme as mansion?",
		"answer": [
			"Walt Disney Imagineering"
		],
		"function": "none",
		"commonness": -35.55893972064999,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "amusement_parks.ride_designer",
					"class": "amusement_parks.ride_designer",
					"friendly_name": "Amusement Ride Designer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "amusement_parks.ride",
					"class": "amusement_parks.ride",
					"friendly_name": "Amusement Ride",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "amusement_parks.ride_theme",
					"class": "amusement_parks.ride_theme",
					"friendly_name": "Amusement Ride Theme",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.haunted_mansion",
					"class": "amusement_parks.ride",
					"friendly_name": "mansion",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "amusement_parks.ride.designer",
					"friendly_name": "Designer"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "amusement_parks.ride.theme",
					"friendly_name": "Theme"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "amusement_parks.ride.theme",
					"friendly_name": "Theme"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :amusement_parks.ride_designer . \n?x1 :type.object.type :amusement_parks.ride . \n?x2 :type.object.type :amusement_parks.ride_theme . \nVALUES ?x3 { :en.haunted_mansion } \n?x1 :amusement_parks.ride.designer ?x0 . \n?x3 :amusement_parks.ride.theme ?x2 . \n?x1 :amusement_parks.ride.theme ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 241000202,
		"question": "who is the designer of an amusement ride which has the same theme as haunted manison?",
		"answer": [
			"Walt Disney Imagineering"
		],
		"function": "none",
		"commonness": -35.55893972064999,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "amusement_parks.ride_designer",
					"class": "amusement_parks.ride_designer",
					"friendly_name": "Amusement Ride Designer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "amusement_parks.ride",
					"class": "amusement_parks.ride",
					"friendly_name": "Amusement Ride",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "amusement_parks.ride_theme",
					"class": "amusement_parks.ride_theme",
					"friendly_name": "Amusement Ride Theme",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.haunted_mansion",
					"class": "amusement_parks.ride",
					"friendly_name": "haunted manison",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "amusement_parks.ride.designer",
					"friendly_name": "Designer"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "amusement_parks.ride.theme",
					"friendly_name": "Theme"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "amusement_parks.ride.theme",
					"friendly_name": "Theme"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :amusement_parks.ride_designer . \n?x1 :type.object.type :amusement_parks.ride . \n?x2 :type.object.type :amusement_parks.ride_theme . \nVALUES ?x3 { :en.haunted_mansion } \n?x1 :amusement_parks.ride.designer ?x0 . \n?x3 :amusement_parks.ride.theme ?x2 . \n?x1 :amusement_parks.ride.theme ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 241000300,
		"question": "who has designed an amusement ride with the same theme as haunted mansion?",
		"answer": [
			"Walt Disney Imagineering"
		],
		"function": "none",
		"commonness": -35.55893972064999,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "amusement_parks.ride_designer",
					"class": "amusement_parks.ride_designer",
					"friendly_name": "Amusement Ride Designer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "amusement_parks.ride",
					"class": "amusement_parks.ride",
					"friendly_name": "Amusement Ride",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "amusement_parks.ride_theme",
					"class": "amusement_parks.ride_theme",
					"friendly_name": "Amusement Ride Theme",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.haunted_mansion",
					"class": "amusement_parks.ride",
					"friendly_name": "Haunted Mansion",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "amusement_parks.ride.designer",
					"friendly_name": "Designer"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "amusement_parks.ride.theme",
					"friendly_name": "Theme"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "amusement_parks.ride.theme",
					"friendly_name": "Theme"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :amusement_parks.ride_designer . \n?x1 :type.object.type :amusement_parks.ride . \n?x2 :type.object.type :amusement_parks.ride_theme . \nVALUES ?x3 { :en.haunted_mansion } \n?x1 :amusement_parks.ride.designer ?x0 . \n?x3 :amusement_parks.ride.theme ?x2 . \n?x1 :amusement_parks.ride.theme ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 241000301,
		"question": "who has designed an amusement ride with the same theme as mansion?",
		"answer": [
			"Walt Disney Imagineering"
		],
		"function": "none",
		"commonness": -35.55893972064999,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "amusement_parks.ride_designer",
					"class": "amusement_parks.ride_designer",
					"friendly_name": "Amusement Ride Designer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "amusement_parks.ride",
					"class": "amusement_parks.ride",
					"friendly_name": "Amusement Ride",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "amusement_parks.ride_theme",
					"class": "amusement_parks.ride_theme",
					"friendly_name": "Amusement Ride Theme",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.haunted_mansion",
					"class": "amusement_parks.ride",
					"friendly_name": "mansion",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "amusement_parks.ride.designer",
					"friendly_name": "Designer"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "amusement_parks.ride.theme",
					"friendly_name": "Theme"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "amusement_parks.ride.theme",
					"friendly_name": "Theme"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :amusement_parks.ride_designer . \n?x1 :type.object.type :amusement_parks.ride . \n?x2 :type.object.type :amusement_parks.ride_theme . \nVALUES ?x3 { :en.haunted_mansion } \n?x1 :amusement_parks.ride.designer ?x0 . \n?x3 :amusement_parks.ride.theme ?x2 . \n?x1 :amusement_parks.ride.theme ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 241000302,
		"question": "who has designed an amusement ride with the same theme as haunted manison?",
		"answer": [
			"Walt Disney Imagineering"
		],
		"function": "none",
		"commonness": -35.55893972064999,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "amusement_parks.ride_designer",
					"class": "amusement_parks.ride_designer",
					"friendly_name": "Amusement Ride Designer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "amusement_parks.ride",
					"class": "amusement_parks.ride",
					"friendly_name": "Amusement Ride",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "amusement_parks.ride_theme",
					"class": "amusement_parks.ride_theme",
					"friendly_name": "Amusement Ride Theme",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.haunted_mansion",
					"class": "amusement_parks.ride",
					"friendly_name": "haunted manison",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "amusement_parks.ride.designer",
					"friendly_name": "Designer"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "amusement_parks.ride.theme",
					"friendly_name": "Theme"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "amusement_parks.ride.theme",
					"friendly_name": "Theme"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :amusement_parks.ride_designer . \n?x1 :type.object.type :amusement_parks.ride . \n?x2 :type.object.type :amusement_parks.ride_theme . \nVALUES ?x3 { :en.haunted_mansion } \n?x1 :amusement_parks.ride.designer ?x0 . \n?x3 :amusement_parks.ride.theme ?x2 . \n?x1 :amusement_parks.ride.theme ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 242000000,
		"question": "saturn v supports which rocket function that can also be found in another rocket made by chrysler group llc?",
		"answer": [
			"Launch vehicle",
			"Low Earth orbit"
		],
		"function": "none",
		"commonness": -38.01722329822522,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_function",
					"class": "spaceflight.rocket_function",
					"friendly_name": "Rocket Function",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "spaceflight.rocket",
					"class": "spaceflight.rocket",
					"friendly_name": "Rocket",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.chrysler",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "Chrysler Group LLC",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.saturn_v",
					"class": "spaceflight.rocket",
					"friendly_name": "Saturn V",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket_function.rockets_supporting_this_function",
					"friendly_name": "Rockets supporting this function"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				},
				{
					"start": 3,
					"end": 0,
					"relation": "spaceflight.rocket.rocket_function",
					"friendly_name": "Rocket Function"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_function . \n?x1 :type.object.type :spaceflight.rocket . \nVALUES ?x2 { :en.chrysler } \nVALUES ?x3 { :en.saturn_v } \n?x0 :spaceflight.rocket_function.rockets_supporting_this_function ?x1 . \n?x2 :spaceflight.rocket_manufacturer.rockets_manufactured ?x1 . \n?x3 :spaceflight.rocket.rocket_function ?x0 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 242000001,
		"question": "saturn v supports which rocket function that can also be found in another rocket made by chrysler?",
		"answer": [
			"Launch vehicle",
			"Low Earth orbit"
		],
		"function": "none",
		"commonness": -38.01722329822522,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_function",
					"class": "spaceflight.rocket_function",
					"friendly_name": "Rocket Function",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "spaceflight.rocket",
					"class": "spaceflight.rocket",
					"friendly_name": "Rocket",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.chrysler",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "chrysler",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.saturn_v",
					"class": "spaceflight.rocket",
					"friendly_name": "Saturn V",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket_function.rockets_supporting_this_function",
					"friendly_name": "Rockets supporting this function"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				},
				{
					"start": 3,
					"end": 0,
					"relation": "spaceflight.rocket.rocket_function",
					"friendly_name": "Rocket Function"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_function . \n?x1 :type.object.type :spaceflight.rocket . \nVALUES ?x2 { :en.chrysler } \nVALUES ?x3 { :en.saturn_v } \n?x0 :spaceflight.rocket_function.rockets_supporting_this_function ?x1 . \n?x2 :spaceflight.rocket_manufacturer.rockets_manufactured ?x1 . \n?x3 :spaceflight.rocket.rocket_function ?x0 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 242000002,
		"question": "saturn v supports which rocket function that can also be found in another rocket made by chrysler llc?",
		"answer": [
			"Low Earth orbit",
			"Launch vehicle"
		],
		"function": "none",
		"commonness": -38.01722329822522,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_function",
					"class": "spaceflight.rocket_function",
					"friendly_name": "Rocket Function",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "spaceflight.rocket",
					"class": "spaceflight.rocket",
					"friendly_name": "Rocket",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.chrysler",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "chrysler llc",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.saturn_v",
					"class": "spaceflight.rocket",
					"friendly_name": "Saturn V",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket_function.rockets_supporting_this_function",
					"friendly_name": "Rockets supporting this function"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				},
				{
					"start": 3,
					"end": 0,
					"relation": "spaceflight.rocket.rocket_function",
					"friendly_name": "Rocket Function"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_function . \n?x1 :type.object.type :spaceflight.rocket . \nVALUES ?x2 { :en.chrysler } \nVALUES ?x3 { :en.saturn_v } \n?x0 :spaceflight.rocket_function.rockets_supporting_this_function ?x1 . \n?x2 :spaceflight.rocket_manufacturer.rockets_manufactured ?x1 . \n?x3 :spaceflight.rocket.rocket_function ?x0 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 242000100,
		"question": "which rocket function can be found on the saturn v as well as on another rocket made by chrysler group llc?",
		"answer": [
			"Launch vehicle",
			"Low Earth orbit"
		],
		"function": "none",
		"commonness": -38.01722329822522,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_function",
					"class": "spaceflight.rocket_function",
					"friendly_name": "Rocket Function",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "spaceflight.rocket",
					"class": "spaceflight.rocket",
					"friendly_name": "Rocket",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.chrysler",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "Chrysler Group LLC",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.saturn_v",
					"class": "spaceflight.rocket",
					"friendly_name": "Saturn V",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket_function.rockets_supporting_this_function",
					"friendly_name": "Rockets supporting this function"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				},
				{
					"start": 3,
					"end": 0,
					"relation": "spaceflight.rocket.rocket_function",
					"friendly_name": "Rocket Function"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_function . \n?x1 :type.object.type :spaceflight.rocket . \nVALUES ?x2 { :en.chrysler } \nVALUES ?x3 { :en.saturn_v } \n?x0 :spaceflight.rocket_function.rockets_supporting_this_function ?x1 . \n?x2 :spaceflight.rocket_manufacturer.rockets_manufactured ?x1 . \n?x3 :spaceflight.rocket.rocket_function ?x0 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 242000101,
		"question": "which rocket function can be found on the saturn v as well as on another rocket made by chrysler?",
		"answer": [
			"Launch vehicle",
			"Low Earth orbit"
		],
		"function": "none",
		"commonness": -38.01722329822522,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_function",
					"class": "spaceflight.rocket_function",
					"friendly_name": "Rocket Function",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "spaceflight.rocket",
					"class": "spaceflight.rocket",
					"friendly_name": "Rocket",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.chrysler",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "chrysler",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.saturn_v",
					"class": "spaceflight.rocket",
					"friendly_name": "Saturn V",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket_function.rockets_supporting_this_function",
					"friendly_name": "Rockets supporting this function"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				},
				{
					"start": 3,
					"end": 0,
					"relation": "spaceflight.rocket.rocket_function",
					"friendly_name": "Rocket Function"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_function . \n?x1 :type.object.type :spaceflight.rocket . \nVALUES ?x2 { :en.chrysler } \nVALUES ?x3 { :en.saturn_v } \n?x0 :spaceflight.rocket_function.rockets_supporting_this_function ?x1 . \n?x2 :spaceflight.rocket_manufacturer.rockets_manufactured ?x1 . \n?x3 :spaceflight.rocket.rocket_function ?x0 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 242000102,
		"question": "which rocket function can be found on the saturn v as well as on another rocket made by chrysler llc?",
		"answer": [
			"Low Earth orbit",
			"Launch vehicle"
		],
		"function": "none",
		"commonness": -38.01722329822522,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_function",
					"class": "spaceflight.rocket_function",
					"friendly_name": "Rocket Function",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "spaceflight.rocket",
					"class": "spaceflight.rocket",
					"friendly_name": "Rocket",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.chrysler",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "chrysler llc",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.saturn_v",
					"class": "spaceflight.rocket",
					"friendly_name": "Saturn V",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket_function.rockets_supporting_this_function",
					"friendly_name": "Rockets supporting this function"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				},
				{
					"start": 3,
					"end": 0,
					"relation": "spaceflight.rocket.rocket_function",
					"friendly_name": "Rocket Function"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_function . \n?x1 :type.object.type :spaceflight.rocket . \nVALUES ?x2 { :en.chrysler } \nVALUES ?x3 { :en.saturn_v } \n?x0 :spaceflight.rocket_function.rockets_supporting_this_function ?x1 . \n?x2 :spaceflight.rocket_manufacturer.rockets_manufactured ?x1 . \n?x3 :spaceflight.rocket.rocket_function ?x0 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 242000200,
		"question": "what rocket function is supported by saturn v as well as another rocket made by chrysler group llc?",
		"answer": [
			"Launch vehicle",
			"Low Earth orbit"
		],
		"function": "none",
		"commonness": -38.01722329822522,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_function",
					"class": "spaceflight.rocket_function",
					"friendly_name": "Rocket Function",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "spaceflight.rocket",
					"class": "spaceflight.rocket",
					"friendly_name": "Rocket",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.chrysler",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "Chrysler Group LLC",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.saturn_v",
					"class": "spaceflight.rocket",
					"friendly_name": "Saturn V",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket_function.rockets_supporting_this_function",
					"friendly_name": "Rockets supporting this function"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				},
				{
					"start": 3,
					"end": 0,
					"relation": "spaceflight.rocket.rocket_function",
					"friendly_name": "Rocket Function"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_function . \n?x1 :type.object.type :spaceflight.rocket . \nVALUES ?x2 { :en.chrysler } \nVALUES ?x3 { :en.saturn_v } \n?x0 :spaceflight.rocket_function.rockets_supporting_this_function ?x1 . \n?x2 :spaceflight.rocket_manufacturer.rockets_manufactured ?x1 . \n?x3 :spaceflight.rocket.rocket_function ?x0 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	}
]