[
	{
		"qid": 189000200,
		"question": "who is responsible for bo?",
		"answer": [
			"Michelle Obama",
			"Barack Obama"
		],
		"function": "none",
		"commonness": -23.04507801907431,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.animal_owner",
					"class": "biology.animal_owner",
					"friendly_name": "Animal owner",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "biology.animal_ownership",
					"class": "biology.animal_ownership",
					"friendly_name": "Animal ownership",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "m.05t073s",
					"class": "biology.owned_animal",
					"friendly_name": "Bo",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "biology.animal_ownership.owners",
					"friendly_name": "Owners"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "biology.owned_animal.owners",
					"friendly_name": "Owners"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.animal_owner . \n?x1 :type.object.type :biology.animal_ownership . \nVALUES ?x2 { :m.05t073s } \n?x1 :biology.animal_ownership.owners ?x0 . \n?x2 :biology.owned_animal.owners ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 189000201,
		"question": "who is responsible for bo obama?",
		"answer": [
			"Barack Obama",
			"Michelle Obama"
		],
		"function": "none",
		"commonness": -23.04507801907431,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.animal_owner",
					"class": "biology.animal_owner",
					"friendly_name": "Animal owner",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "biology.animal_ownership",
					"class": "biology.animal_ownership",
					"friendly_name": "Animal ownership",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "m.05t073s",
					"class": "biology.owned_animal",
					"friendly_name": "bo obama",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "biology.animal_ownership.owners",
					"friendly_name": "Owners"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "biology.owned_animal.owners",
					"friendly_name": "Owners"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.animal_owner . \n?x1 :type.object.type :biology.animal_ownership . \nVALUES ?x2 { :m.05t073s } \n?x1 :biology.animal_ownership.owners ?x0 . \n?x2 :biology.owned_animal.owners ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 189000202,
		"question": "who is responsible for obama dog?",
		"answer": [
			"Barack Obama",
			"Michelle Obama"
		],
		"function": "none",
		"commonness": -23.04507801907431,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.animal_owner",
					"class": "biology.animal_owner",
					"friendly_name": "Animal owner",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "biology.animal_ownership",
					"class": "biology.animal_ownership",
					"friendly_name": "Animal ownership",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "m.05t073s",
					"class": "biology.owned_animal",
					"friendly_name": "obama dog",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "biology.animal_ownership.owners",
					"friendly_name": "Owners"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "biology.owned_animal.owners",
					"friendly_name": "Owners"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.animal_owner . \n?x1 :type.object.type :biology.animal_ownership . \nVALUES ?x2 { :m.05t073s } \n?x1 :biology.animal_ownership.owners ?x0 . \n?x2 :biology.owned_animal.owners ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 189000300,
		"question": "bo is owned by whom?",
		"answer": [
			"Barack Obama",
			"Michelle Obama"
		],
		"function": "none",
		"commonness": -23.04507801907431,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.animal_owner",
					"class": "biology.animal_owner",
					"friendly_name": "Animal owner",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "biology.animal_ownership",
					"class": "biology.animal_ownership",
					"friendly_name": "Animal ownership",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "m.05t073s",
					"class": "biology.owned_animal",
					"friendly_name": "Bo",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "biology.animal_ownership.owners",
					"friendly_name": "Owners"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "biology.owned_animal.owners",
					"friendly_name": "Owners"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.animal_owner . \n?x1 :type.object.type :biology.animal_ownership . \nVALUES ?x2 { :m.05t073s } \n?x1 :biology.animal_ownership.owners ?x0 . \n?x2 :biology.owned_animal.owners ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 189000301,
		"question": "bo obama is owned by whom?",
		"answer": [
			"Michelle Obama",
			"Barack Obama"
		],
		"function": "none",
		"commonness": -23.04507801907431,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.animal_owner",
					"class": "biology.animal_owner",
					"friendly_name": "Animal owner",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "biology.animal_ownership",
					"class": "biology.animal_ownership",
					"friendly_name": "Animal ownership",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "m.05t073s",
					"class": "biology.owned_animal",
					"friendly_name": "bo obama",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "biology.animal_ownership.owners",
					"friendly_name": "Owners"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "biology.owned_animal.owners",
					"friendly_name": "Owners"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.animal_owner . \n?x1 :type.object.type :biology.animal_ownership . \nVALUES ?x2 { :m.05t073s } \n?x1 :biology.animal_ownership.owners ?x0 . \n?x2 :biology.owned_animal.owners ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 189000302,
		"question": "obama dog is owned by whom?",
		"answer": [
			"Michelle Obama",
			"Barack Obama"
		],
		"function": "none",
		"commonness": -23.04507801907431,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.animal_owner",
					"class": "biology.animal_owner",
					"friendly_name": "Animal owner",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "biology.animal_ownership",
					"class": "biology.animal_ownership",
					"friendly_name": "Animal ownership",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "m.05t073s",
					"class": "biology.owned_animal",
					"friendly_name": "obama dog",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "biology.animal_ownership.owners",
					"friendly_name": "Owners"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "biology.owned_animal.owners",
					"friendly_name": "Owners"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.animal_owner . \n?x1 :type.object.type :biology.animal_ownership . \nVALUES ?x2 { :m.05t073s } \n?x1 :biology.animal_ownership.owners ?x0 . \n?x2 :biology.owned_animal.owners ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 189000400,
		"question": "who keeps the dog bo?",
		"answer": [
			"Michelle Obama",
			"Barack Obama"
		],
		"function": "none",
		"commonness": -23.04507801907431,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.animal_owner",
					"class": "biology.animal_owner",
					"friendly_name": "Animal owner",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "biology.animal_ownership",
					"class": "biology.animal_ownership",
					"friendly_name": "Animal ownership",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "m.05t073s",
					"class": "biology.owned_animal",
					"friendly_name": "Bo",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "biology.animal_ownership.owners",
					"friendly_name": "Owners"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "biology.owned_animal.owners",
					"friendly_name": "Owners"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.animal_owner . \n?x1 :type.object.type :biology.animal_ownership . \nVALUES ?x2 { :m.05t073s } \n?x1 :biology.animal_ownership.owners ?x0 . \n?x2 :biology.owned_animal.owners ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 189000401,
		"question": "who keeps the dog bo obama?",
		"answer": [
			"Michelle Obama",
			"Barack Obama"
		],
		"function": "none",
		"commonness": -23.04507801907431,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.animal_owner",
					"class": "biology.animal_owner",
					"friendly_name": "Animal owner",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "biology.animal_ownership",
					"class": "biology.animal_ownership",
					"friendly_name": "Animal ownership",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "m.05t073s",
					"class": "biology.owned_animal",
					"friendly_name": "bo obama",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "biology.animal_ownership.owners",
					"friendly_name": "Owners"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "biology.owned_animal.owners",
					"friendly_name": "Owners"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.animal_owner . \n?x1 :type.object.type :biology.animal_ownership . \nVALUES ?x2 { :m.05t073s } \n?x1 :biology.animal_ownership.owners ?x0 . \n?x2 :biology.owned_animal.owners ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 189000402,
		"question": "who keeps the dog obama dog?",
		"answer": [
			"Michelle Obama",
			"Barack Obama"
		],
		"function": "none",
		"commonness": -23.04507801907431,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.animal_owner",
					"class": "biology.animal_owner",
					"friendly_name": "Animal owner",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "biology.animal_ownership",
					"class": "biology.animal_ownership",
					"friendly_name": "Animal ownership",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "m.05t073s",
					"class": "biology.owned_animal",
					"friendly_name": "obama dog",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "biology.animal_ownership.owners",
					"friendly_name": "Owners"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "biology.owned_animal.owners",
					"friendly_name": "Owners"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.animal_owner . \n?x1 :type.object.type :biology.animal_ownership . \nVALUES ?x2 { :m.05t073s } \n?x1 :biology.animal_ownership.owners ?x0 . \n?x2 :biology.owned_animal.owners ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 189000500,
		"question": "who is the owner of bo?",
		"answer": [
			"Michelle Obama",
			"Barack Obama"
		],
		"function": "none",
		"commonness": -23.04507801907431,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.animal_owner",
					"class": "biology.animal_owner",
					"friendly_name": "Animal owner",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "biology.animal_ownership",
					"class": "biology.animal_ownership",
					"friendly_name": "Animal ownership",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "m.05t073s",
					"class": "biology.owned_animal",
					"friendly_name": "Bo",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "biology.animal_ownership.owners",
					"friendly_name": "Owners"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "biology.owned_animal.owners",
					"friendly_name": "Owners"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.animal_owner . \n?x1 :type.object.type :biology.animal_ownership . \nVALUES ?x2 { :m.05t073s } \n?x1 :biology.animal_ownership.owners ?x0 . \n?x2 :biology.owned_animal.owners ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 189000501,
		"question": "who is the owner of bo obama?",
		"answer": [
			"Michelle Obama",
			"Barack Obama"
		],
		"function": "none",
		"commonness": -23.04507801907431,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.animal_owner",
					"class": "biology.animal_owner",
					"friendly_name": "Animal owner",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "biology.animal_ownership",
					"class": "biology.animal_ownership",
					"friendly_name": "Animal ownership",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "m.05t073s",
					"class": "biology.owned_animal",
					"friendly_name": "bo obama",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "biology.animal_ownership.owners",
					"friendly_name": "Owners"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "biology.owned_animal.owners",
					"friendly_name": "Owners"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.animal_owner . \n?x1 :type.object.type :biology.animal_ownership . \nVALUES ?x2 { :m.05t073s } \n?x1 :biology.animal_ownership.owners ?x0 . \n?x2 :biology.owned_animal.owners ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 189000502,
		"question": "who is the owner of obama dog?",
		"answer": [
			"Barack Obama",
			"Michelle Obama"
		],
		"function": "none",
		"commonness": -23.04507801907431,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "biology.animal_owner",
					"class": "biology.animal_owner",
					"friendly_name": "Animal owner",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "biology.animal_ownership",
					"class": "biology.animal_ownership",
					"friendly_name": "Animal ownership",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "m.05t073s",
					"class": "biology.owned_animal",
					"friendly_name": "obama dog",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "biology.animal_ownership.owners",
					"friendly_name": "Owners"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "biology.owned_animal.owners",
					"friendly_name": "Owners"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :biology.animal_owner . \n?x1 :type.object.type :biology.animal_ownership . \nVALUES ?x2 { :m.05t073s } \n?x1 :biology.animal_ownership.owners ?x0 . \n?x2 :biology.owned_animal.owners ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 190000000,
		"question": "find all ice hockey coaches in canada.",
		"answer": [
			"Ken Hitchcock"
		],
		"function": "none",
		"commonness": -21.05028879602097,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "ice_hockey.hockey_coach",
					"class": "ice_hockey.hockey_coach",
					"friendly_name": "Ice hockey coach",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "ice_hockey.hockey_team",
					"class": "ice_hockey.hockey_team",
					"friendly_name": "Ice hockey team",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.canada",
					"class": "sports.sports_team_location",
					"friendly_name": "Canada",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "ice_hockey.hockey_team.coach",
					"friendly_name": "Coach"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "sports.sports_team_location.teams",
					"friendly_name": "Teams"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :ice_hockey.hockey_coach . \n?x1 :type.object.type :ice_hockey.hockey_team . \nVALUES ?x2 { :en.canada } \n?x1 :ice_hockey.hockey_team.coach ?x0 . \n?x2 :sports.sports_team_location.teams ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 190000100,
		"question": "who are all the ice hockey coaches in the country of canada?",
		"answer": [
			"Ken Hitchcock"
		],
		"function": "none",
		"commonness": -21.05028879602097,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "ice_hockey.hockey_coach",
					"class": "ice_hockey.hockey_coach",
					"friendly_name": "Ice hockey coach",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "ice_hockey.hockey_team",
					"class": "ice_hockey.hockey_team",
					"friendly_name": "Ice hockey team",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.canada",
					"class": "sports.sports_team_location",
					"friendly_name": "Canada",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "ice_hockey.hockey_team.coach",
					"friendly_name": "Coach"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "sports.sports_team_location.teams",
					"friendly_name": "Teams"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :ice_hockey.hockey_coach . \n?x1 :type.object.type :ice_hockey.hockey_team . \nVALUES ?x2 { :en.canada } \n?x1 :ice_hockey.hockey_team.coach ?x0 . \n?x2 :sports.sports_team_location.teams ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 190000101,
		"question": "who are all the ice hockey coaches in the country of can?",
		"answer": [
			"Ken Hitchcock"
		],
		"function": "none",
		"commonness": -21.05028879602097,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "ice_hockey.hockey_coach",
					"class": "ice_hockey.hockey_coach",
					"friendly_name": "Ice hockey coach",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "ice_hockey.hockey_team",
					"class": "ice_hockey.hockey_team",
					"friendly_name": "Ice hockey team",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.canada",
					"class": "sports.sports_team_location",
					"friendly_name": "can",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "ice_hockey.hockey_team.coach",
					"friendly_name": "Coach"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "sports.sports_team_location.teams",
					"friendly_name": "Teams"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :ice_hockey.hockey_coach . \n?x1 :type.object.type :ice_hockey.hockey_team . \nVALUES ?x2 { :en.canada } \n?x1 :ice_hockey.hockey_team.coach ?x0 . \n?x2 :sports.sports_team_location.teams ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 190000102,
		"question": "who are all the ice hockey coaches in the country of dominion of canada?",
		"answer": [
			"Ken Hitchcock"
		],
		"function": "none",
		"commonness": -21.05028879602097,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "ice_hockey.hockey_coach",
					"class": "ice_hockey.hockey_coach",
					"friendly_name": "Ice hockey coach",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "ice_hockey.hockey_team",
					"class": "ice_hockey.hockey_team",
					"friendly_name": "Ice hockey team",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.canada",
					"class": "sports.sports_team_location",
					"friendly_name": "dominion of canada",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "ice_hockey.hockey_team.coach",
					"friendly_name": "Coach"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "sports.sports_team_location.teams",
					"friendly_name": "Teams"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :ice_hockey.hockey_coach . \n?x1 :type.object.type :ice_hockey.hockey_team . \nVALUES ?x2 { :en.canada } \n?x1 :ice_hockey.hockey_team.coach ?x0 . \n?x2 :sports.sports_team_location.teams ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 190000200,
		"question": "who has ever coached an ice hockey team in canada?",
		"answer": [
			"Ken Hitchcock"
		],
		"function": "none",
		"commonness": -21.05028879602097,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "ice_hockey.hockey_coach",
					"class": "ice_hockey.hockey_coach",
					"friendly_name": "Ice hockey coach",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "ice_hockey.hockey_team",
					"class": "ice_hockey.hockey_team",
					"friendly_name": "Ice hockey team",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.canada",
					"class": "sports.sports_team_location",
					"friendly_name": "Canada",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "ice_hockey.hockey_team.coach",
					"friendly_name": "Coach"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "sports.sports_team_location.teams",
					"friendly_name": "Teams"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :ice_hockey.hockey_coach . \n?x1 :type.object.type :ice_hockey.hockey_team . \nVALUES ?x2 { :en.canada } \n?x1 :ice_hockey.hockey_team.coach ?x0 . \n?x2 :sports.sports_team_location.teams ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 190000202,
		"question": "who has ever coached an ice hockey team in dominion of canada?",
		"answer": [
			"Ken Hitchcock"
		],
		"function": "none",
		"commonness": -21.05028879602097,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "ice_hockey.hockey_coach",
					"class": "ice_hockey.hockey_coach",
					"friendly_name": "Ice hockey coach",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "ice_hockey.hockey_team",
					"class": "ice_hockey.hockey_team",
					"friendly_name": "Ice hockey team",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.canada",
					"class": "sports.sports_team_location",
					"friendly_name": "dominion of canada",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "ice_hockey.hockey_team.coach",
					"friendly_name": "Coach"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "sports.sports_team_location.teams",
					"friendly_name": "Teams"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :ice_hockey.hockey_coach . \n?x1 :type.object.type :ice_hockey.hockey_team . \nVALUES ?x2 { :en.canada } \n?x1 :ice_hockey.hockey_team.coach ?x0 . \n?x2 :sports.sports_team_location.teams ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	}
]