[
	{
		"qid": 145000202,
		"question": "how many alternative lines does the dart station have?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -17.518221396394555,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "metropolitan_transit.transit_line",
					"class": "metropolitan_transit.transit_line",
					"friendly_name": "Transit Line",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.dublin_area_rapid_transit",
					"class": "metropolitan_transit.transit_line",
					"friendly_name": "dart station",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "metropolitan_transit.transit_line.primary_line",
					"friendly_name": "Alternate Of Primary Line"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :metropolitan_transit.transit_line . \nVALUES ?x1 { :en.dublin_area_rapid_transit } \n?x0 :metropolitan_transit.transit_line.primary_line ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 146000000,
		"question": "in the united states of america, how many translators were born?",
		"answer": [
			"6"
		],
		"function": "count",
		"commonness": -9.004123370849127,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.translator",
					"class": "book.translator",
					"friendly_name": "Translator",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.location",
					"friendly_name": "United States of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.place_of_birth",
					"friendly_name": "Place of birth"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.translator . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :people.person.place_of_birth ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 146000001,
		"question": "in the us, how many translators were born?",
		"answer": [
			"6"
		],
		"function": "count",
		"commonness": -9.004123370849127,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.translator",
					"class": "book.translator",
					"friendly_name": "Translator",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.location",
					"friendly_name": "us",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.place_of_birth",
					"friendly_name": "Place of birth"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.translator . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :people.person.place_of_birth ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 146000002,
		"question": "in the united states, how many translators were born?",
		"answer": [
			"6"
		],
		"function": "count",
		"commonness": -9.004123370849127,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.translator",
					"class": "book.translator",
					"friendly_name": "Translator",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.location",
					"friendly_name": "united states",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.place_of_birth",
					"friendly_name": "Place of birth"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.translator . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :people.person.place_of_birth ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 146000100,
		"question": "what is the number of translators from the united states of america?",
		"answer": [
			"6"
		],
		"function": "count",
		"commonness": -9.004123370849127,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.translator",
					"class": "book.translator",
					"friendly_name": "Translator",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.location",
					"friendly_name": "United States of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.place_of_birth",
					"friendly_name": "Place of birth"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.translator . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :people.person.place_of_birth ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 146000101,
		"question": "what is the number of translators from the us?",
		"answer": [
			"6"
		],
		"function": "count",
		"commonness": -9.004123370849127,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.translator",
					"class": "book.translator",
					"friendly_name": "Translator",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.location",
					"friendly_name": "us",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.place_of_birth",
					"friendly_name": "Place of birth"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.translator . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :people.person.place_of_birth ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 146000102,
		"question": "what is the number of translators from the united states?",
		"answer": [
			"6"
		],
		"function": "count",
		"commonness": -9.004123370849127,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.translator",
					"class": "book.translator",
					"friendly_name": "Translator",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.location",
					"friendly_name": "united states",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.place_of_birth",
					"friendly_name": "Place of birth"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.translator . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :people.person.place_of_birth ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 146000200,
		"question": "how many translators were born in the united states of america?",
		"answer": [
			"6"
		],
		"function": "count",
		"commonness": -9.004123370849127,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.translator",
					"class": "book.translator",
					"friendly_name": "Translator",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.location",
					"friendly_name": "United States of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.place_of_birth",
					"friendly_name": "Place of birth"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.translator . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :people.person.place_of_birth ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 146000201,
		"question": "how many translators were born in the us?",
		"answer": [
			"6"
		],
		"function": "count",
		"commonness": -9.004123370849127,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.translator",
					"class": "book.translator",
					"friendly_name": "Translator",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.location",
					"friendly_name": "us",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.place_of_birth",
					"friendly_name": "Place of birth"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.translator . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :people.person.place_of_birth ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 146000202,
		"question": "how many translators were born in the united states?",
		"answer": [
			"6"
		],
		"function": "count",
		"commonness": -9.004123370849127,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.translator",
					"class": "book.translator",
					"friendly_name": "Translator",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.location",
					"friendly_name": "united states",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.place_of_birth",
					"friendly_name": "Place of birth"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.translator . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :people.person.place_of_birth ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 146000300,
		"question": "for how many translators is the united states of america their birthplace?",
		"answer": [
			"6"
		],
		"function": "count",
		"commonness": -9.004123370849127,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.translator",
					"class": "book.translator",
					"friendly_name": "Translator",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.location",
					"friendly_name": "United States of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.place_of_birth",
					"friendly_name": "Place of birth"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.translator . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :people.person.place_of_birth ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 146000301,
		"question": "for how many translators is the us their birthplace?",
		"answer": [
			"6"
		],
		"function": "count",
		"commonness": -9.004123370849127,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.translator",
					"class": "book.translator",
					"friendly_name": "Translator",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.location",
					"friendly_name": "us",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.place_of_birth",
					"friendly_name": "Place of birth"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.translator . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :people.person.place_of_birth ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 146000302,
		"question": "for how many translators is the united states their birthplace?",
		"answer": [
			"6"
		],
		"function": "count",
		"commonness": -9.004123370849127,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.translator",
					"class": "book.translator",
					"friendly_name": "Translator",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.location",
					"friendly_name": "united states",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.place_of_birth",
					"friendly_name": "Place of birth"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.translator . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :people.person.place_of_birth ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 147000000,
		"question": "the world trade center consists of how many buildings?",
		"answer": [
			"8"
		],
		"function": "count",
		"commonness": -12.331540563847096,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.building",
					"class": "architecture.building",
					"friendly_name": "Building",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.world_trade_center",
					"class": "architecture.building_complex",
					"friendly_name": "World Trade Center",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.building.building_complex",
					"friendly_name": "Building Complex"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.building . \nVALUES ?x1 { :en.world_trade_center } \n?x0 :architecture.building.building_complex ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 147000001,
		"question": "the wtc consists of how many buildings?",
		"answer": [
			"8"
		],
		"function": "count",
		"commonness": -12.331540563847096,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.building",
					"class": "architecture.building",
					"friendly_name": "Building",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.world_trade_center",
					"class": "architecture.building_complex",
					"friendly_name": "wtc",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.building.building_complex",
					"friendly_name": "Building Complex"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.building . \nVALUES ?x1 { :en.world_trade_center } \n?x0 :architecture.building.building_complex ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 147000002,
		"question": "the twin towers consists of how many buildings?",
		"answer": [
			"8"
		],
		"function": "count",
		"commonness": -12.331540563847096,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.building",
					"class": "architecture.building",
					"friendly_name": "Building",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.world_trade_center",
					"class": "architecture.building_complex",
					"friendly_name": "twin towers",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.building.building_complex",
					"friendly_name": "Building Complex"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.building . \nVALUES ?x1 { :en.world_trade_center } \n?x0 :architecture.building.building_complex ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 147000100,
		"question": "the world trade center includes how many buildings?",
		"answer": [
			"8"
		],
		"function": "count",
		"commonness": -12.331540563847096,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.building",
					"class": "architecture.building",
					"friendly_name": "Building",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.world_trade_center",
					"class": "architecture.building_complex",
					"friendly_name": "World Trade Center",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.building.building_complex",
					"friendly_name": "Building Complex"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.building . \nVALUES ?x1 { :en.world_trade_center } \n?x0 :architecture.building.building_complex ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 147000101,
		"question": "the wtc includes how many buildings?",
		"answer": [
			"8"
		],
		"function": "count",
		"commonness": -12.331540563847096,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.building",
					"class": "architecture.building",
					"friendly_name": "Building",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.world_trade_center",
					"class": "architecture.building_complex",
					"friendly_name": "wtc",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.building.building_complex",
					"friendly_name": "Building Complex"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.building . \nVALUES ?x1 { :en.world_trade_center } \n?x0 :architecture.building.building_complex ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 147000102,
		"question": "the twin towers includes how many buildings?",
		"answer": [
			"8"
		],
		"function": "count",
		"commonness": -12.331540563847096,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.building",
					"class": "architecture.building",
					"friendly_name": "Building",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.world_trade_center",
					"class": "architecture.building_complex",
					"friendly_name": "twin towers",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.building.building_complex",
					"friendly_name": "Building Complex"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.building . \nVALUES ?x1 { :en.world_trade_center } \n?x0 :architecture.building.building_complex ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 147000200,
		"question": "what is the total amount of buildings in the world trade center?",
		"answer": [
			"8"
		],
		"function": "count",
		"commonness": -12.331540563847096,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.building",
					"class": "architecture.building",
					"friendly_name": "Building",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.world_trade_center",
					"class": "architecture.building_complex",
					"friendly_name": "World Trade Center",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.building.building_complex",
					"friendly_name": "Building Complex"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.building . \nVALUES ?x1 { :en.world_trade_center } \n?x0 :architecture.building.building_complex ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 147000201,
		"question": "what is the total amount of buildings in the wtc?",
		"answer": [
			"8"
		],
		"function": "count",
		"commonness": -12.331540563847096,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.building",
					"class": "architecture.building",
					"friendly_name": "Building",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.world_trade_center",
					"class": "architecture.building_complex",
					"friendly_name": "wtc",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.building.building_complex",
					"friendly_name": "Building Complex"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.building . \nVALUES ?x1 { :en.world_trade_center } \n?x0 :architecture.building.building_complex ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 147000202,
		"question": "what is the total amount of buildings in the twin towers?",
		"answer": [
			"8"
		],
		"function": "count",
		"commonness": -12.331540563847096,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.building",
					"class": "architecture.building",
					"friendly_name": "Building",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.world_trade_center",
					"class": "architecture.building_complex",
					"friendly_name": "twin towers",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.building.building_complex",
					"friendly_name": "Building Complex"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.building . \nVALUES ?x1 { :en.world_trade_center } \n?x0 :architecture.building.building_complex ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 147000300,
		"question": "how many towers does the world trade center have?",
		"answer": [
			"8"
		],
		"function": "count",
		"commonness": -12.331540563847096,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.building",
					"class": "architecture.building",
					"friendly_name": "Building",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.world_trade_center",
					"class": "architecture.building_complex",
					"friendly_name": "World Trade Center",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.building.building_complex",
					"friendly_name": "Building Complex"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.building . \nVALUES ?x1 { :en.world_trade_center } \n?x0 :architecture.building.building_complex ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 147000301,
		"question": "how many towers does the wtc have?",
		"answer": [
			"8"
		],
		"function": "count",
		"commonness": -12.331540563847096,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.building",
					"class": "architecture.building",
					"friendly_name": "Building",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.world_trade_center",
					"class": "architecture.building_complex",
					"friendly_name": "wtc",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.building.building_complex",
					"friendly_name": "Building Complex"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.building . \nVALUES ?x1 { :en.world_trade_center } \n?x0 :architecture.building.building_complex ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 147000302,
		"question": "how many towers does the twin towers have?",
		"answer": [
			"8"
		],
		"function": "count",
		"commonness": -12.331540563847096,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.building",
					"class": "architecture.building",
					"friendly_name": "Building",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.world_trade_center",
					"class": "architecture.building_complex",
					"friendly_name": "twin towers",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.building.building_complex",
					"friendly_name": "Building Complex"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.building . \nVALUES ?x1 { :en.world_trade_center } \n?x0 :architecture.building.building_complex ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]