[
	{
		"qid": 20000600,
		"question": "in gossip girl, what is the name of the person who plays serena van der woodsen?",
		"answer": [
			"Blake Lively"
		],
		"function": "none",
		"commonness": -16.335288345723843,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gossipgirl.actor",
					"class": "base.gossipgirl.actor",
					"friendly_name": "Actor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.serena_van_der_woodsen",
					"class": "base.gossipgirl.character",
					"friendly_name": "Serena van der Woodsen",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.gossipgirl.actor.plays",
					"friendly_name": "plays"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gossipgirl.actor . \nVALUES ?x1 { :en.serena_van_der_woodsen } \n?x0 :base.gossipgirl.actor.plays ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 20000601,
		"question": "in gossip girl, what is the name of the person who plays serena?",
		"answer": [
			"Blake Lively"
		],
		"function": "none",
		"commonness": -16.335288345723843,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gossipgirl.actor",
					"class": "base.gossipgirl.actor",
					"friendly_name": "Actor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.serena_van_der_woodsen",
					"class": "base.gossipgirl.character",
					"friendly_name": "serena",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.gossipgirl.actor.plays",
					"friendly_name": "plays"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gossipgirl.actor . \nVALUES ?x1 { :en.serena_van_der_woodsen } \n?x0 :base.gossipgirl.actor.plays ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 21000000,
		"question": "iron man has held what ranks?",
		"answer": [
			"Chief Executive Officer"
		],
		"function": "none",
		"commonness": -13.287605932528287,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.character_rank",
					"class": "fictional_universe.character_rank",
					"friendly_name": "Character Rank",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.iron_man",
					"class": "fictional_universe.fictional_character",
					"friendly_name": "Iron Man",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "fictional_universe.character_rank.characters_of_this_rank",
					"friendly_name": "Characters of This Rank"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.character_rank . \nVALUES ?x1 { :en.iron_man } \n?x0 :fictional_universe.character_rank.characters_of_this_rank ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 21000001,
		"question": "tony stark has held what ranks?",
		"answer": [
			"Chief Executive Officer"
		],
		"function": "none",
		"commonness": -13.287605932528287,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.character_rank",
					"class": "fictional_universe.character_rank",
					"friendly_name": "Character Rank",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.iron_man",
					"class": "fictional_universe.fictional_character",
					"friendly_name": "tony stark",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "fictional_universe.character_rank.characters_of_this_rank",
					"friendly_name": "Characters of This Rank"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.character_rank . \nVALUES ?x1 { :en.iron_man } \n?x0 :fictional_universe.character_rank.characters_of_this_rank ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 21000100,
		"question": "what is the rank of the marvel character iron man?",
		"answer": [
			"Chief Executive Officer"
		],
		"function": "none",
		"commonness": -13.287605932528287,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.character_rank",
					"class": "fictional_universe.character_rank",
					"friendly_name": "Character Rank",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.iron_man",
					"class": "fictional_universe.fictional_character",
					"friendly_name": "Iron Man",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "fictional_universe.character_rank.characters_of_this_rank",
					"friendly_name": "Characters of This Rank"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.character_rank . \nVALUES ?x1 { :en.iron_man } \n?x0 :fictional_universe.character_rank.characters_of_this_rank ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 21000101,
		"question": "what is the rank of the marvel character tony stark?",
		"answer": [
			"Chief Executive Officer"
		],
		"function": "none",
		"commonness": -13.287605932528287,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.character_rank",
					"class": "fictional_universe.character_rank",
					"friendly_name": "Character Rank",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.iron_man",
					"class": "fictional_universe.fictional_character",
					"friendly_name": "tony stark",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "fictional_universe.character_rank.characters_of_this_rank",
					"friendly_name": "Characters of This Rank"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.character_rank . \nVALUES ?x1 { :en.iron_man } \n?x0 :fictional_universe.character_rank.characters_of_this_rank ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 21000200,
		"question": "what ranks has iron man held?",
		"answer": [
			"Chief Executive Officer"
		],
		"function": "none",
		"commonness": -13.287605932528287,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.character_rank",
					"class": "fictional_universe.character_rank",
					"friendly_name": "Character Rank",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.iron_man",
					"class": "fictional_universe.fictional_character",
					"friendly_name": "Iron Man",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "fictional_universe.character_rank.characters_of_this_rank",
					"friendly_name": "Characters of This Rank"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.character_rank . \nVALUES ?x1 { :en.iron_man } \n?x0 :fictional_universe.character_rank.characters_of_this_rank ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 21000201,
		"question": "what ranks has tony stark held?",
		"answer": [
			"Chief Executive Officer"
		],
		"function": "none",
		"commonness": -13.287605932528287,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.character_rank",
					"class": "fictional_universe.character_rank",
					"friendly_name": "Character Rank",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.iron_man",
					"class": "fictional_universe.fictional_character",
					"friendly_name": "tony stark",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "fictional_universe.character_rank.characters_of_this_rank",
					"friendly_name": "Characters of This Rank"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.character_rank . \nVALUES ?x1 { :en.iron_man } \n?x0 :fictional_universe.character_rank.characters_of_this_rank ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 21000300,
		"question": "what job does iron man hold?",
		"answer": [
			"Chief Executive Officer"
		],
		"function": "none",
		"commonness": -13.287605932528287,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.character_rank",
					"class": "fictional_universe.character_rank",
					"friendly_name": "Character Rank",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.iron_man",
					"class": "fictional_universe.fictional_character",
					"friendly_name": "Iron Man",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "fictional_universe.character_rank.characters_of_this_rank",
					"friendly_name": "Characters of This Rank"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.character_rank . \nVALUES ?x1 { :en.iron_man } \n?x0 :fictional_universe.character_rank.characters_of_this_rank ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 21000301,
		"question": "what job does tony stark hold?",
		"answer": [
			"Chief Executive Officer"
		],
		"function": "none",
		"commonness": -13.287605932528287,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.character_rank",
					"class": "fictional_universe.character_rank",
					"friendly_name": "Character Rank",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.iron_man",
					"class": "fictional_universe.fictional_character",
					"friendly_name": "tony stark",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "fictional_universe.character_rank.characters_of_this_rank",
					"friendly_name": "Characters of This Rank"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.character_rank . \nVALUES ?x1 { :en.iron_man } \n?x0 :fictional_universe.character_rank.characters_of_this_rank ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 21000400,
		"question": "iron man has held which positions?",
		"answer": [
			"Chief Executive Officer"
		],
		"function": "none",
		"commonness": -13.287605932528287,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.character_rank",
					"class": "fictional_universe.character_rank",
					"friendly_name": "Character Rank",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.iron_man",
					"class": "fictional_universe.fictional_character",
					"friendly_name": "Iron Man",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "fictional_universe.character_rank.characters_of_this_rank",
					"friendly_name": "Characters of This Rank"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.character_rank . \nVALUES ?x1 { :en.iron_man } \n?x0 :fictional_universe.character_rank.characters_of_this_rank ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 21000401,
		"question": "tony stark has held which positions?",
		"answer": [
			"Chief Executive Officer"
		],
		"function": "none",
		"commonness": -13.287605932528287,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fictional_universe.character_rank",
					"class": "fictional_universe.character_rank",
					"friendly_name": "Character Rank",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.iron_man",
					"class": "fictional_universe.fictional_character",
					"friendly_name": "tony stark",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "fictional_universe.character_rank.characters_of_this_rank",
					"friendly_name": "Characters of This Rank"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fictional_universe.character_rank . \nVALUES ?x1 { :en.iron_man } \n?x0 :fictional_universe.character_rank.characters_of_this_rank ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 22000000,
		"question": "what is cheer bear's tummy symbol?",
		"answer": [
			"Rainbow"
		],
		"function": "none",
		"commonness": -19.666389387745287,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.carebears.care_bears_tummy_symbol",
					"class": "base.carebears.care_bears_tummy_symbol",
					"friendly_name": "Care Bears Tummy Symbol",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.cheer_bear",
					"class": "base.carebears.care_bears_character",
					"friendly_name": "Cheer Bear",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.carebears.care_bears_character.tummy_symbol",
					"friendly_name": "Tummy Symbol"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.carebears.care_bears_tummy_symbol . \nVALUES ?x1 { :en.cheer_bear } \n?x1 :base.carebears.care_bears_character.tummy_symbol ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 22000100,
		"question": "what symbol stands for the cheer bear?",
		"answer": [
			"Rainbow"
		],
		"function": "none",
		"commonness": -19.666389387745287,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.carebears.care_bears_tummy_symbol",
					"class": "base.carebears.care_bears_tummy_symbol",
					"friendly_name": "Care Bears Tummy Symbol",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.cheer_bear",
					"class": "base.carebears.care_bears_character",
					"friendly_name": "Cheer Bear",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.carebears.care_bears_character.tummy_symbol",
					"friendly_name": "Tummy Symbol"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.carebears.care_bears_tummy_symbol . \nVALUES ?x1 { :en.cheer_bear } \n?x1 :base.carebears.care_bears_character.tummy_symbol ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 22000200,
		"question": "what symbol appears on the stomachs of cheer bear?",
		"answer": [
			"Rainbow"
		],
		"function": "none",
		"commonness": -19.666389387745287,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.carebears.care_bears_tummy_symbol",
					"class": "base.carebears.care_bears_tummy_symbol",
					"friendly_name": "Care Bears Tummy Symbol",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.cheer_bear",
					"class": "base.carebears.care_bears_character",
					"friendly_name": "Cheer Bear",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.carebears.care_bears_character.tummy_symbol",
					"friendly_name": "Tummy Symbol"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.carebears.care_bears_tummy_symbol . \nVALUES ?x1 { :en.cheer_bear } \n?x1 :base.carebears.care_bears_character.tummy_symbol ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 22000300,
		"question": "what symbol does cheer bear have on her tummy?",
		"answer": [
			"Rainbow"
		],
		"function": "none",
		"commonness": -19.666389387745287,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.carebears.care_bears_tummy_symbol",
					"class": "base.carebears.care_bears_tummy_symbol",
					"friendly_name": "Care Bears Tummy Symbol",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.cheer_bear",
					"class": "base.carebears.care_bears_character",
					"friendly_name": "Cheer Bear",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.carebears.care_bears_character.tummy_symbol",
					"friendly_name": "Tummy Symbol"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.carebears.care_bears_tummy_symbol . \nVALUES ?x1 { :en.cheer_bear } \n?x1 :base.carebears.care_bears_character.tummy_symbol ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 22000400,
		"question": "what symbol is on cheer bear's tummy?",
		"answer": [
			"Rainbow"
		],
		"function": "none",
		"commonness": -19.666389387745287,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.carebears.care_bears_tummy_symbol",
					"class": "base.carebears.care_bears_tummy_symbol",
					"friendly_name": "Care Bears Tummy Symbol",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.cheer_bear",
					"class": "base.carebears.care_bears_character",
					"friendly_name": "Cheer Bear",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.carebears.care_bears_character.tummy_symbol",
					"friendly_name": "Tummy Symbol"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.carebears.care_bears_tummy_symbol . \nVALUES ?x1 { :en.cheer_bear } \n?x1 :base.carebears.care_bears_character.tummy_symbol ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 22000500,
		"question": "what's the tummy symbol of cheer bear?",
		"answer": [
			"Rainbow"
		],
		"function": "none",
		"commonness": -19.666389387745287,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.carebears.care_bears_tummy_symbol",
					"class": "base.carebears.care_bears_tummy_symbol",
					"friendly_name": "Care Bears Tummy Symbol",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.cheer_bear",
					"class": "base.carebears.care_bears_character",
					"friendly_name": "Cheer Bear",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.carebears.care_bears_character.tummy_symbol",
					"friendly_name": "Tummy Symbol"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.carebears.care_bears_tummy_symbol . \nVALUES ?x1 { :en.cheer_bear } \n?x1 :base.carebears.care_bears_character.tummy_symbol ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 23000000,
		"question": "what solid materials fuse at 435.4 joules/mole and above?",
		"answer": [
			"Titanium",
			"Aluminium oxide",
			"Beryllium"
		],
		"function": ">=",
		"commonness": -17.03884241302868,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.materials.solid_material",
					"class": "base.materials.solid_material",
					"friendly_name": "Solid Material",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "435.4^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "435.4",
					"question_node": 0,
					"function": ">="
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.materials.solid_material.heat_of_fusion",
					"friendly_name": "Heat of Fusion"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.materials.solid_material . \nFILTER (?x1 >= 435.4)\n?x0 :base.materials.solid_material.heat_of_fusion ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 23000100,
		"question": "which solid materials take no less than 435.4 joules per mole to fuse?",
		"answer": [
			"Beryllium",
			"Aluminium oxide",
			"Titanium"
		],
		"function": ">=",
		"commonness": -17.03884241302868,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.materials.solid_material",
					"class": "base.materials.solid_material",
					"friendly_name": "Solid Material",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "435.4^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "435.4",
					"question_node": 0,
					"function": ">="
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.materials.solid_material.heat_of_fusion",
					"friendly_name": "Heat of Fusion"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.materials.solid_material . \nFILTER (?x1 >= 435.4)\n?x0 :base.materials.solid_material.heat_of_fusion ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 23000200,
		"question": "fusion occurs with at least 435.4 joules for which solid material?",
		"answer": [
			"Aluminium oxide",
			"Titanium",
			"Beryllium"
		],
		"function": ">=",
		"commonness": -17.03884241302868,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.materials.solid_material",
					"class": "base.materials.solid_material",
					"friendly_name": "Solid Material",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "435.4^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "435.4",
					"question_node": 0,
					"function": ">="
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.materials.solid_material.heat_of_fusion",
					"friendly_name": "Heat of Fusion"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.materials.solid_material . \nFILTER (?x1 >= 435.4)\n?x0 :base.materials.solid_material.heat_of_fusion ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 23000300,
		"question": "which materials need to take at least 435.4 joules of heat to fuse for one mole?",
		"answer": [
			"Titanium",
			"Beryllium",
			"Aluminium oxide"
		],
		"function": ">=",
		"commonness": -17.03884241302868,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.materials.solid_material",
					"class": "base.materials.solid_material",
					"friendly_name": "Solid Material",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "435.4^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "435.4",
					"question_node": 0,
					"function": ">="
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.materials.solid_material.heat_of_fusion",
					"friendly_name": "Heat of Fusion"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.materials.solid_material . \nFILTER (?x1 >= 435.4)\n?x0 :base.materials.solid_material.heat_of_fusion ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 23000400,
		"question": "what materials fuse at 435.4 joules per mole?",
		"answer": [
			"Titanium",
			"Beryllium",
			"Aluminium oxide"
		],
		"function": ">=",
		"commonness": -17.03884241302868,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.materials.solid_material",
					"class": "base.materials.solid_material",
					"friendly_name": "Solid Material",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "435.4^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "435.4",
					"question_node": 0,
					"function": ">="
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.materials.solid_material.heat_of_fusion",
					"friendly_name": "Heat of Fusion"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.materials.solid_material . \nFILTER (?x1 >= 435.4)\n?x0 :base.materials.solid_material.heat_of_fusion ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 24000000,
		"question": "what's the name of team saxo bank-sungard's general manager?",
		"answer": [
			"Bjarne Riis"
		],
		"function": "none",
		"commonness": -18.42626988711012,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.peleton.cycling_team_staff",
					"class": "base.peleton.cycling_team_staff",
					"friendly_name": "Cycling Team Staff",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.team_csc",
					"class": "base.peleton.cycling_team_professional",
					"friendly_name": "Team Saxo Bank-SunGard",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.peleton.cycling_team_professional.general_manager",
					"friendly_name": "General Manager"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.peleton.cycling_team_staff . \nVALUES ?x1 { :en.team_csc } \n?x1 :base.peleton.cycling_team_professional.general_manager ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]