[
	{
		"qid": 185000002,
		"question": "christian religion shows are broadcasted by which networks?",
		"answer": [
			"Joy!Cast - Podcast Feed",
			"Dr. Gary and Barb Rosberg - Your Marriage Coaches - Podcast Feed",
			"JT's Indie Christian Music Podcast - Podcast Feed",
			"Curbside Catastrophe - Podcast Feed",
			"St George's Anglican Church Sermon Podcast - Podcast Feed",
			"the Neighborhood Podcast - Podcast Feed",
			"NOOMA - Podcast Feed",
			"Grace Community Church Weekly Podcast - Podcast Feed",
			"The Way of Reason - An Infidel Guy Production - Podcast Feed",
			"1 Year Daily Audio Bible - Podcast Feed"
		],
		"function": "none",
		"commonness": -21.09855810615146,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "broadcast.broadcast",
					"class": "broadcast.broadcast",
					"friendly_name": "Broadcast",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "broadcast.content",
					"class": "broadcast.content",
					"friendly_name": "Broadcast Content",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.christianity",
					"class": "broadcast.genre",
					"friendly_name": "christian religion",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.broadcast.content",
					"friendly_name": "Content"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "broadcast.genre.content",
					"friendly_name": "Content"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :broadcast.broadcast . \n?x1 :type.object.type :broadcast.content . \nVALUES ?x2 { :en.christianity } \n?x0 :broadcast.broadcast.content ?x1 . \n?x2 :broadcast.genre.content ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 185000100,
		"question": "who broadcast christianity stuff?",
		"answer": [
			"St George's Anglican Church Sermon Podcast - Podcast Feed",
			"JT's Indie Christian Music Podcast - Podcast Feed",
			"Joy!Cast - Podcast Feed",
			"Curbside Catastrophe - Podcast Feed",
			"the Neighborhood Podcast - Podcast Feed",
			"1 Year Daily Audio Bible - Podcast Feed",
			"Grace Community Church Weekly Podcast - Podcast Feed",
			"NOOMA - Podcast Feed",
			"Dr. Gary and Barb Rosberg - Your Marriage Coaches - Podcast Feed",
			"The Way of Reason - An Infidel Guy Production - Podcast Feed"
		],
		"function": "none",
		"commonness": -21.09855810615146,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "broadcast.broadcast",
					"class": "broadcast.broadcast",
					"friendly_name": "Broadcast",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "broadcast.content",
					"class": "broadcast.content",
					"friendly_name": "Broadcast Content",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.christianity",
					"class": "broadcast.genre",
					"friendly_name": "Christianity",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.broadcast.content",
					"friendly_name": "Content"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "broadcast.genre.content",
					"friendly_name": "Content"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :broadcast.broadcast . \n?x1 :type.object.type :broadcast.content . \nVALUES ?x2 { :en.christianity } \n?x0 :broadcast.broadcast.content ?x1 . \n?x2 :broadcast.genre.content ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 185000101,
		"question": "who broadcast christian faith stuff?",
		"answer": [
			"The Way of Reason - An Infidel Guy Production - Podcast Feed",
			"Grace Community Church Weekly Podcast - Podcast Feed",
			"the Neighborhood Podcast - Podcast Feed",
			"Curbside Catastrophe - Podcast Feed",
			"Joy!Cast - Podcast Feed",
			"Dr. Gary and Barb Rosberg - Your Marriage Coaches - Podcast Feed",
			"1 Year Daily Audio Bible - Podcast Feed",
			"NOOMA - Podcast Feed",
			"JT's Indie Christian Music Podcast - Podcast Feed",
			"St George's Anglican Church Sermon Podcast - Podcast Feed"
		],
		"function": "none",
		"commonness": -21.09855810615146,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "broadcast.broadcast",
					"class": "broadcast.broadcast",
					"friendly_name": "Broadcast",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "broadcast.content",
					"class": "broadcast.content",
					"friendly_name": "Broadcast Content",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.christianity",
					"class": "broadcast.genre",
					"friendly_name": "christian faith",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.broadcast.content",
					"friendly_name": "Content"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "broadcast.genre.content",
					"friendly_name": "Content"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :broadcast.broadcast . \n?x1 :type.object.type :broadcast.content . \nVALUES ?x2 { :en.christianity } \n?x0 :broadcast.broadcast.content ?x1 . \n?x2 :broadcast.genre.content ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 185000102,
		"question": "who broadcast christian religion stuff?",
		"answer": [
			"Joy!Cast - Podcast Feed",
			"the Neighborhood Podcast - Podcast Feed",
			"Curbside Catastrophe - Podcast Feed",
			"The Way of Reason - An Infidel Guy Production - Podcast Feed",
			"1 Year Daily Audio Bible - Podcast Feed",
			"Dr. Gary and Barb Rosberg - Your Marriage Coaches - Podcast Feed",
			"St George's Anglican Church Sermon Podcast - Podcast Feed",
			"NOOMA - Podcast Feed",
			"Grace Community Church Weekly Podcast - Podcast Feed",
			"JT's Indie Christian Music Podcast - Podcast Feed"
		],
		"function": "none",
		"commonness": -21.09855810615146,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "broadcast.broadcast",
					"class": "broadcast.broadcast",
					"friendly_name": "Broadcast",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "broadcast.content",
					"class": "broadcast.content",
					"friendly_name": "Broadcast Content",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.christianity",
					"class": "broadcast.genre",
					"friendly_name": "christian religion",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.broadcast.content",
					"friendly_name": "Content"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "broadcast.genre.content",
					"friendly_name": "Content"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :broadcast.broadcast . \n?x1 :type.object.type :broadcast.content . \nVALUES ?x2 { :en.christianity } \n?x0 :broadcast.broadcast.content ?x1 . \n?x2 :broadcast.genre.content ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 186000000,
		"question": "what type of tea is cultivated in china and japan?",
		"answer": [
			"Matcha"
		],
		"function": "none",
		"commonness": -21.807589230994807,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.tea",
					"class": "food.tea",
					"friendly_name": "Tea",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.china",
					"class": "location.location",
					"friendly_name": "China",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.japan",
					"class": "location.location",
					"friendly_name": "Japan",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "food.tea.regions_where_grown",
					"friendly_name": "Regions where grown"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "food.tea.regions_where_grown",
					"friendly_name": "Regions where grown"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.tea . \nVALUES ?x1 { :en.china } \nVALUES ?x2 { :en.japan } \n?x0 :food.tea.regions_where_grown ?x1 . \n?x0 :food.tea.regions_where_grown ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 186000001,
		"question": "what type of tea is cultivated in china and jp?",
		"answer": [
			"Matcha"
		],
		"function": "none",
		"commonness": -21.807589230994807,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.tea",
					"class": "food.tea",
					"friendly_name": "Tea",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.china",
					"class": "location.location",
					"friendly_name": "China",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.japan",
					"class": "location.location",
					"friendly_name": "jp",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "food.tea.regions_where_grown",
					"friendly_name": "Regions where grown"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "food.tea.regions_where_grown",
					"friendly_name": "Regions where grown"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.tea . \nVALUES ?x1 { :en.china } \nVALUES ?x2 { :en.japan } \n?x0 :food.tea.regions_where_grown ?x1 . \n?x0 :food.tea.regions_where_grown ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 186000002,
		"question": "what type of tea is cultivated in people's republic of china and japan?",
		"answer": [
			"Matcha"
		],
		"function": "none",
		"commonness": -21.807589230994807,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.tea",
					"class": "food.tea",
					"friendly_name": "Tea",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.china",
					"class": "location.location",
					"friendly_name": "people's republic of china",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.japan",
					"class": "location.location",
					"friendly_name": "Japan",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "food.tea.regions_where_grown",
					"friendly_name": "Regions where grown"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "food.tea.regions_where_grown",
					"friendly_name": "Regions where grown"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.tea . \nVALUES ?x1 { :en.china } \nVALUES ?x2 { :en.japan } \n?x0 :food.tea.regions_where_grown ?x1 . \n?x0 :food.tea.regions_where_grown ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 186000100,
		"question": "in both china and japan, what tea is grown?",
		"answer": [
			"Matcha"
		],
		"function": "none",
		"commonness": -21.807589230994807,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.tea",
					"class": "food.tea",
					"friendly_name": "Tea",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.china",
					"class": "location.location",
					"friendly_name": "China",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.japan",
					"class": "location.location",
					"friendly_name": "Japan",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "food.tea.regions_where_grown",
					"friendly_name": "Regions where grown"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "food.tea.regions_where_grown",
					"friendly_name": "Regions where grown"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.tea . \nVALUES ?x1 { :en.china } \nVALUES ?x2 { :en.japan } \n?x0 :food.tea.regions_where_grown ?x1 . \n?x0 :food.tea.regions_where_grown ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 186000101,
		"question": "in both china and jp, what tea is grown?",
		"answer": [
			"Matcha"
		],
		"function": "none",
		"commonness": -21.807589230994807,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.tea",
					"class": "food.tea",
					"friendly_name": "Tea",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.china",
					"class": "location.location",
					"friendly_name": "China",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.japan",
					"class": "location.location",
					"friendly_name": "jp",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "food.tea.regions_where_grown",
					"friendly_name": "Regions where grown"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "food.tea.regions_where_grown",
					"friendly_name": "Regions where grown"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.tea . \nVALUES ?x1 { :en.china } \nVALUES ?x2 { :en.japan } \n?x0 :food.tea.regions_where_grown ?x1 . \n?x0 :food.tea.regions_where_grown ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 186000102,
		"question": "in both people's republic of china and japan, what tea is grown?",
		"answer": [
			"Matcha"
		],
		"function": "none",
		"commonness": -21.807589230994807,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.tea",
					"class": "food.tea",
					"friendly_name": "Tea",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.china",
					"class": "location.location",
					"friendly_name": "people's republic of china",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.japan",
					"class": "location.location",
					"friendly_name": "Japan",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "food.tea.regions_where_grown",
					"friendly_name": "Regions where grown"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "food.tea.regions_where_grown",
					"friendly_name": "Regions where grown"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.tea . \nVALUES ?x1 { :en.china } \nVALUES ?x2 { :en.japan } \n?x0 :food.tea.regions_where_grown ?x1 . \n?x0 :food.tea.regions_where_grown ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 186000200,
		"question": "what tea can be found in both china and japan?",
		"answer": [
			"Matcha"
		],
		"function": "none",
		"commonness": -21.807589230994807,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.tea",
					"class": "food.tea",
					"friendly_name": "Tea",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.china",
					"class": "location.location",
					"friendly_name": "China",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.japan",
					"class": "location.location",
					"friendly_name": "Japan",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "food.tea.regions_where_grown",
					"friendly_name": "Regions where grown"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "food.tea.regions_where_grown",
					"friendly_name": "Regions where grown"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.tea . \nVALUES ?x1 { :en.china } \nVALUES ?x2 { :en.japan } \n?x0 :food.tea.regions_where_grown ?x1 . \n?x0 :food.tea.regions_where_grown ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 186000201,
		"question": "what tea can be found in both china and jp?",
		"answer": [
			"Matcha"
		],
		"function": "none",
		"commonness": -21.807589230994807,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.tea",
					"class": "food.tea",
					"friendly_name": "Tea",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.china",
					"class": "location.location",
					"friendly_name": "China",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.japan",
					"class": "location.location",
					"friendly_name": "jp",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "food.tea.regions_where_grown",
					"friendly_name": "Regions where grown"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "food.tea.regions_where_grown",
					"friendly_name": "Regions where grown"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.tea . \nVALUES ?x1 { :en.china } \nVALUES ?x2 { :en.japan } \n?x0 :food.tea.regions_where_grown ?x1 . \n?x0 :food.tea.regions_where_grown ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 186000202,
		"question": "what tea can be found in both people's republic of china and japan?",
		"answer": [
			"Matcha"
		],
		"function": "none",
		"commonness": -21.807589230994807,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.tea",
					"class": "food.tea",
					"friendly_name": "Tea",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.china",
					"class": "location.location",
					"friendly_name": "people's republic of china",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.japan",
					"class": "location.location",
					"friendly_name": "Japan",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "food.tea.regions_where_grown",
					"friendly_name": "Regions where grown"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "food.tea.regions_where_grown",
					"friendly_name": "Regions where grown"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.tea . \nVALUES ?x1 { :en.china } \nVALUES ?x2 { :en.japan } \n?x0 :food.tea.regions_where_grown ?x1 . \n?x0 :food.tea.regions_where_grown ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 186000300,
		"question": "what tea does both china and japan grow?",
		"answer": [
			"Matcha"
		],
		"function": "none",
		"commonness": -21.807589230994807,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.tea",
					"class": "food.tea",
					"friendly_name": "Tea",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.china",
					"class": "location.location",
					"friendly_name": "China",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.japan",
					"class": "location.location",
					"friendly_name": "Japan",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "food.tea.regions_where_grown",
					"friendly_name": "Regions where grown"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "food.tea.regions_where_grown",
					"friendly_name": "Regions where grown"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.tea . \nVALUES ?x1 { :en.china } \nVALUES ?x2 { :en.japan } \n?x0 :food.tea.regions_where_grown ?x1 . \n?x0 :food.tea.regions_where_grown ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 186000301,
		"question": "what tea does both china and jp grow?",
		"answer": [
			"Matcha"
		],
		"function": "none",
		"commonness": -21.807589230994807,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.tea",
					"class": "food.tea",
					"friendly_name": "Tea",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.china",
					"class": "location.location",
					"friendly_name": "China",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.japan",
					"class": "location.location",
					"friendly_name": "jp",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "food.tea.regions_where_grown",
					"friendly_name": "Regions where grown"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "food.tea.regions_where_grown",
					"friendly_name": "Regions where grown"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.tea . \nVALUES ?x1 { :en.china } \nVALUES ?x2 { :en.japan } \n?x0 :food.tea.regions_where_grown ?x1 . \n?x0 :food.tea.regions_where_grown ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 186000302,
		"question": "what tea does both people's republic of china and japan grow?",
		"answer": [
			"Matcha"
		],
		"function": "none",
		"commonness": -21.807589230994807,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.tea",
					"class": "food.tea",
					"friendly_name": "Tea",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.china",
					"class": "location.location",
					"friendly_name": "people's republic of china",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.japan",
					"class": "location.location",
					"friendly_name": "Japan",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "food.tea.regions_where_grown",
					"friendly_name": "Regions where grown"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "food.tea.regions_where_grown",
					"friendly_name": "Regions where grown"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.tea . \nVALUES ?x1 { :en.china } \nVALUES ?x2 { :en.japan } \n?x0 :food.tea.regions_where_grown ?x1 . \n?x0 :food.tea.regions_where_grown ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 186000400,
		"question": "which type of tea is produced in both china and japan?",
		"answer": [
			"Matcha"
		],
		"function": "none",
		"commonness": -21.807589230994807,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.tea",
					"class": "food.tea",
					"friendly_name": "Tea",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.china",
					"class": "location.location",
					"friendly_name": "China",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.japan",
					"class": "location.location",
					"friendly_name": "Japan",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "food.tea.regions_where_grown",
					"friendly_name": "Regions where grown"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "food.tea.regions_where_grown",
					"friendly_name": "Regions where grown"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.tea . \nVALUES ?x1 { :en.china } \nVALUES ?x2 { :en.japan } \n?x0 :food.tea.regions_where_grown ?x1 . \n?x0 :food.tea.regions_where_grown ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 186000401,
		"question": "which type of tea is produced in both china and jp?",
		"answer": [
			"Matcha"
		],
		"function": "none",
		"commonness": -21.807589230994807,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "food.tea",
					"class": "food.tea",
					"friendly_name": "Tea",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.china",
					"class": "location.location",
					"friendly_name": "China",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.japan",
					"class": "location.location",
					"friendly_name": "jp",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "food.tea.regions_where_grown",
					"friendly_name": "Regions where grown"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "food.tea.regions_where_grown",
					"friendly_name": "Regions where grown"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :food.tea . \nVALUES ?x1 { :en.china } \nVALUES ?x2 { :en.japan } \n?x0 :food.tea.regions_where_grown ?x1 . \n?x0 :food.tea.regions_where_grown ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	}
]