[
	{
		"qid": 231000402,
		"question": "which pet diseases that result from an infection can be detected through ekg?",
		"answer": [
			"Congestive Heart Failure in Dogs"
		],
		"function": "none",
		"commonness": -29.219105976291093,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.pethealth.pet_disease_or_medical_condition",
					"class": "base.pethealth.pet_disease_or_medical_condition",
					"friendly_name": "Pet disease or medical condition",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.infection",
					"class": "base.pethealth.pet_disease_risk_factor",
					"friendly_name": "Infection",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.electrocardiogram",
					"class": "base.pethealth.diagnosis",
					"friendly_name": "ekg",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor",
					"friendly_name": "Pet Diseases with this Risk Factor"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.pethealth.pet_disease_or_medical_condition.diagnosis",
					"friendly_name": "Diagnostic Tests"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.pethealth.pet_disease_or_medical_condition . \nVALUES ?x1 { :en.infection } \nVALUES ?x2 { :en.electrocardiogram } \n?x1 :base.pethealth.pet_disease_risk_factor.pet_diseases_with_this_risk_factor ?x0 . \n?x0 :base.pethealth.pet_disease_or_medical_condition.diagnosis ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 232000000,
		"question": "who wrote the libretto for an opera that was first performed on 1865-06-10?",
		"answer": [
			"Richard Wagner"
		],
		"function": "none",
		"commonness": -24.043207705254712,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "opera.librettist",
					"class": "opera.librettist",
					"friendly_name": "Librettist",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "opera.opera",
					"class": "opera.opera",
					"friendly_name": "Opera",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "1865-06-10^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "1865-06-10",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "opera.opera.librettist",
					"friendly_name": "Librettist"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "opera.opera.date_of_first_performance",
					"friendly_name": "Date of First Performance"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :opera.librettist . \n?x1 :type.object.type :opera.opera . \nVALUES ?x2 { \"1865-06-10\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?x1 :opera.opera.librettist ?x0 . \n?x1 :opera.opera.date_of_first_performance ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 232000100,
		"question": "whose work was the libretto for an opera performed on 1865-06-10 for the first time?",
		"answer": [
			"Richard Wagner"
		],
		"function": "none",
		"commonness": -24.043207705254712,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "opera.librettist",
					"class": "opera.librettist",
					"friendly_name": "Librettist",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "opera.opera",
					"class": "opera.opera",
					"friendly_name": "Opera",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "1865-06-10^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "1865-06-10",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "opera.opera.librettist",
					"friendly_name": "Librettist"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "opera.opera.date_of_first_performance",
					"friendly_name": "Date of First Performance"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :opera.librettist . \n?x1 :type.object.type :opera.opera . \nVALUES ?x2 { \"1865-06-10\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?x1 :opera.opera.librettist ?x0 . \n?x1 :opera.opera.date_of_first_performance ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 232000200,
		"question": "a libretto for an opera that was first performed on 1865-06-10 was written by whom?",
		"answer": [
			"Richard Wagner"
		],
		"function": "none",
		"commonness": -24.043207705254712,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "opera.librettist",
					"class": "opera.librettist",
					"friendly_name": "Librettist",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "opera.opera",
					"class": "opera.opera",
					"friendly_name": "Opera",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "1865-06-10^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "1865-06-10",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "opera.opera.librettist",
					"friendly_name": "Librettist"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "opera.opera.date_of_first_performance",
					"friendly_name": "Date of First Performance"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :opera.librettist . \n?x1 :type.object.type :opera.opera . \nVALUES ?x2 { \"1865-06-10\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?x1 :opera.opera.librettist ?x0 . \n?x1 :opera.opera.date_of_first_performance ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 232000300,
		"question": "who is the composer of the libretto for an opera that was initially performed in 1865-06-10?",
		"answer": [
			"Richard Wagner"
		],
		"function": "none",
		"commonness": -24.043207705254712,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "opera.librettist",
					"class": "opera.librettist",
					"friendly_name": "Librettist",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "opera.opera",
					"class": "opera.opera",
					"friendly_name": "Opera",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "1865-06-10^^http://www.w3.org/2001/XMLSchema#datetime",
					"class": "type.datetime",
					"friendly_name": "1865-06-10",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "opera.opera.librettist",
					"friendly_name": "Librettist"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "opera.opera.date_of_first_performance",
					"friendly_name": "Date of First Performance"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :opera.librettist . \n?x1 :type.object.type :opera.opera . \nVALUES ?x2 { \"1865-06-10\"^^<http://www.w3.org/2001/XMLSchema#datetime> } \n?x1 :opera.opera.librettist ?x0 . \n?x1 :opera.opera.date_of_first_performance ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 233000000,
		"question": "edwin hubble has discovered asteroids in which asteroid groups?",
		"answer": [
			"Cybele asteroid"
		],
		"function": "none",
		"commonness": -27.057867969175838,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.asteroid_group",
					"class": "astronomy.asteroid_group",
					"friendly_name": "Asteroid Group",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "astronomy.asteroid",
					"class": "astronomy.asteroid",
					"friendly_name": "Asteroid",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.edwin_hubble",
					"class": "astronomy.astronomer",
					"friendly_name": "Edwin Hubble",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "astronomy.asteroid_group.asteroid_group_members",
					"friendly_name": "Asteroid Group Members"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "astronomy.astronomer.astronomical_objects_discovered",
					"friendly_name": "Astronomical objects discovered"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.asteroid_group . \n?x1 :type.object.type :astronomy.asteroid . \nVALUES ?x2 { :en.edwin_hubble } \n?x0 :astronomy.asteroid_group.asteroid_group_members ?x1 . \n?x2 :astronomy.astronomer.astronomical_objects_discovered ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 233000001,
		"question": "hubble has discovered asteroids in which asteroid groups?",
		"answer": [
			"Cybele asteroid"
		],
		"function": "none",
		"commonness": -27.057867969175838,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.asteroid_group",
					"class": "astronomy.asteroid_group",
					"friendly_name": "Asteroid Group",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "astronomy.asteroid",
					"class": "astronomy.asteroid",
					"friendly_name": "Asteroid",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.edwin_hubble",
					"class": "astronomy.astronomer",
					"friendly_name": "hubble",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "astronomy.asteroid_group.asteroid_group_members",
					"friendly_name": "Asteroid Group Members"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "astronomy.astronomer.astronomical_objects_discovered",
					"friendly_name": "Astronomical objects discovered"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.asteroid_group . \n?x1 :type.object.type :astronomy.asteroid . \nVALUES ?x2 { :en.edwin_hubble } \n?x0 :astronomy.asteroid_group.asteroid_group_members ?x1 . \n?x2 :astronomy.astronomer.astronomical_objects_discovered ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 233000002,
		"question": "edwin powell hubble has discovered asteroids in which asteroid groups?",
		"answer": [
			"Cybele asteroid"
		],
		"function": "none",
		"commonness": -27.057867969175838,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.asteroid_group",
					"class": "astronomy.asteroid_group",
					"friendly_name": "Asteroid Group",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "astronomy.asteroid",
					"class": "astronomy.asteroid",
					"friendly_name": "Asteroid",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.edwin_hubble",
					"class": "astronomy.astronomer",
					"friendly_name": "edwin powell hubble",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "astronomy.asteroid_group.asteroid_group_members",
					"friendly_name": "Asteroid Group Members"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "astronomy.astronomer.astronomical_objects_discovered",
					"friendly_name": "Astronomical objects discovered"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.asteroid_group . \n?x1 :type.object.type :astronomy.asteroid . \nVALUES ?x2 { :en.edwin_hubble } \n?x0 :astronomy.asteroid_group.asteroid_group_members ?x1 . \n?x2 :astronomy.astronomer.astronomical_objects_discovered ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 233000101,
		"question": "in which asteroid groups has hubble discovered an asteroid?",
		"answer": [
			"Cybele asteroid"
		],
		"function": "none",
		"commonness": -27.057867969175838,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.asteroid_group",
					"class": "astronomy.asteroid_group",
					"friendly_name": "Asteroid Group",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "astronomy.asteroid",
					"class": "astronomy.asteroid",
					"friendly_name": "Asteroid",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.edwin_hubble",
					"class": "astronomy.astronomer",
					"friendly_name": "hubble",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "astronomy.asteroid_group.asteroid_group_members",
					"friendly_name": "Asteroid Group Members"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "astronomy.astronomer.astronomical_objects_discovered",
					"friendly_name": "Astronomical objects discovered"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.asteroid_group . \n?x1 :type.object.type :astronomy.asteroid . \nVALUES ?x2 { :en.edwin_hubble } \n?x0 :astronomy.asteroid_group.asteroid_group_members ?x1 . \n?x2 :astronomy.astronomer.astronomical_objects_discovered ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 233000102,
		"question": "in which asteroid groups has edwin powell hubble discovered an asteroid?",
		"answer": [
			"Cybele asteroid"
		],
		"function": "none",
		"commonness": -27.057867969175838,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.asteroid_group",
					"class": "astronomy.asteroid_group",
					"friendly_name": "Asteroid Group",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "astronomy.asteroid",
					"class": "astronomy.asteroid",
					"friendly_name": "Asteroid",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.edwin_hubble",
					"class": "astronomy.astronomer",
					"friendly_name": "edwin powell hubble",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "astronomy.asteroid_group.asteroid_group_members",
					"friendly_name": "Asteroid Group Members"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "astronomy.astronomer.astronomical_objects_discovered",
					"friendly_name": "Astronomical objects discovered"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.asteroid_group . \n?x1 :type.object.type :astronomy.asteroid . \nVALUES ?x2 { :en.edwin_hubble } \n?x0 :astronomy.asteroid_group.asteroid_group_members ?x1 . \n?x2 :astronomy.astronomer.astronomical_objects_discovered ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 233000200,
		"question": "in which groups of asteroids did edwin hubble discover one?",
		"answer": [
			"Cybele asteroid"
		],
		"function": "none",
		"commonness": -27.057867969175838,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.asteroid_group",
					"class": "astronomy.asteroid_group",
					"friendly_name": "Asteroid Group",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "astronomy.asteroid",
					"class": "astronomy.asteroid",
					"friendly_name": "Asteroid",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.edwin_hubble",
					"class": "astronomy.astronomer",
					"friendly_name": "Edwin Hubble",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "astronomy.asteroid_group.asteroid_group_members",
					"friendly_name": "Asteroid Group Members"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "astronomy.astronomer.astronomical_objects_discovered",
					"friendly_name": "Astronomical objects discovered"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.asteroid_group . \n?x1 :type.object.type :astronomy.asteroid . \nVALUES ?x2 { :en.edwin_hubble } \n?x0 :astronomy.asteroid_group.asteroid_group_members ?x1 . \n?x2 :astronomy.astronomer.astronomical_objects_discovered ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 233000201,
		"question": "in which groups of asteroids did hubble discover one?",
		"answer": [
			"Cybele asteroid"
		],
		"function": "none",
		"commonness": -27.057867969175838,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.asteroid_group",
					"class": "astronomy.asteroid_group",
					"friendly_name": "Asteroid Group",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "astronomy.asteroid",
					"class": "astronomy.asteroid",
					"friendly_name": "Asteroid",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.edwin_hubble",
					"class": "astronomy.astronomer",
					"friendly_name": "hubble",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "astronomy.asteroid_group.asteroid_group_members",
					"friendly_name": "Asteroid Group Members"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "astronomy.astronomer.astronomical_objects_discovered",
					"friendly_name": "Astronomical objects discovered"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.asteroid_group . \n?x1 :type.object.type :astronomy.asteroid . \nVALUES ?x2 { :en.edwin_hubble } \n?x0 :astronomy.asteroid_group.asteroid_group_members ?x1 . \n?x2 :astronomy.astronomer.astronomical_objects_discovered ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 233000202,
		"question": "in which groups of asteroids did edwin powell hubble discover one?",
		"answer": [
			"Cybele asteroid"
		],
		"function": "none",
		"commonness": -27.057867969175838,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.asteroid_group",
					"class": "astronomy.asteroid_group",
					"friendly_name": "Asteroid Group",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "astronomy.asteroid",
					"class": "astronomy.asteroid",
					"friendly_name": "Asteroid",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.edwin_hubble",
					"class": "astronomy.astronomer",
					"friendly_name": "edwin powell hubble",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "astronomy.asteroid_group.asteroid_group_members",
					"friendly_name": "Asteroid Group Members"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "astronomy.astronomer.astronomical_objects_discovered",
					"friendly_name": "Astronomical objects discovered"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.asteroid_group . \n?x1 :type.object.type :astronomy.asteroid . \nVALUES ?x2 { :en.edwin_hubble } \n?x0 :astronomy.asteroid_group.asteroid_group_members ?x1 . \n?x2 :astronomy.astronomer.astronomical_objects_discovered ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 233000300,
		"question": "edwin hubble found an asteroid in which asteroid groups?",
		"answer": [
			"Cybele asteroid"
		],
		"function": "none",
		"commonness": -27.057867969175838,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.asteroid_group",
					"class": "astronomy.asteroid_group",
					"friendly_name": "Asteroid Group",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "astronomy.asteroid",
					"class": "astronomy.asteroid",
					"friendly_name": "Asteroid",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.edwin_hubble",
					"class": "astronomy.astronomer",
					"friendly_name": "Edwin Hubble",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "astronomy.asteroid_group.asteroid_group_members",
					"friendly_name": "Asteroid Group Members"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "astronomy.astronomer.astronomical_objects_discovered",
					"friendly_name": "Astronomical objects discovered"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.asteroid_group . \n?x1 :type.object.type :astronomy.asteroid . \nVALUES ?x2 { :en.edwin_hubble } \n?x0 :astronomy.asteroid_group.asteroid_group_members ?x1 . \n?x2 :astronomy.astronomer.astronomical_objects_discovered ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 233000301,
		"question": "hubble found an asteroid in which asteroid groups?",
		"answer": [
			"Cybele asteroid"
		],
		"function": "none",
		"commonness": -27.057867969175838,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.asteroid_group",
					"class": "astronomy.asteroid_group",
					"friendly_name": "Asteroid Group",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "astronomy.asteroid",
					"class": "astronomy.asteroid",
					"friendly_name": "Asteroid",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.edwin_hubble",
					"class": "astronomy.astronomer",
					"friendly_name": "hubble",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "astronomy.asteroid_group.asteroid_group_members",
					"friendly_name": "Asteroid Group Members"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "astronomy.astronomer.astronomical_objects_discovered",
					"friendly_name": "Astronomical objects discovered"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.asteroid_group . \n?x1 :type.object.type :astronomy.asteroid . \nVALUES ?x2 { :en.edwin_hubble } \n?x0 :astronomy.asteroid_group.asteroid_group_members ?x1 . \n?x2 :astronomy.astronomer.astronomical_objects_discovered ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 233000302,
		"question": "edwin powell hubble found an asteroid in which asteroid groups?",
		"answer": [
			"Cybele asteroid"
		],
		"function": "none",
		"commonness": -27.057867969175838,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.asteroid_group",
					"class": "astronomy.asteroid_group",
					"friendly_name": "Asteroid Group",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "astronomy.asteroid",
					"class": "astronomy.asteroid",
					"friendly_name": "Asteroid",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.edwin_hubble",
					"class": "astronomy.astronomer",
					"friendly_name": "edwin powell hubble",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "astronomy.asteroid_group.asteroid_group_members",
					"friendly_name": "Asteroid Group Members"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "astronomy.astronomer.astronomical_objects_discovered",
					"friendly_name": "Astronomical objects discovered"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.asteroid_group . \n?x1 :type.object.type :astronomy.asteroid . \nVALUES ?x2 { :en.edwin_hubble } \n?x0 :astronomy.asteroid_group.asteroid_group_members ?x1 . \n?x2 :astronomy.astronomer.astronomical_objects_discovered ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 233000400,
		"question": "edwin hubble discovered an asteroid that is categorized under which asteroid groups?",
		"answer": [
			"Cybele asteroid"
		],
		"function": "none",
		"commonness": -27.057867969175838,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.asteroid_group",
					"class": "astronomy.asteroid_group",
					"friendly_name": "Asteroid Group",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "astronomy.asteroid",
					"class": "astronomy.asteroid",
					"friendly_name": "Asteroid",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.edwin_hubble",
					"class": "astronomy.astronomer",
					"friendly_name": "Edwin Hubble",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "astronomy.asteroid_group.asteroid_group_members",
					"friendly_name": "Asteroid Group Members"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "astronomy.astronomer.astronomical_objects_discovered",
					"friendly_name": "Astronomical objects discovered"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.asteroid_group . \n?x1 :type.object.type :astronomy.asteroid . \nVALUES ?x2 { :en.edwin_hubble } \n?x0 :astronomy.asteroid_group.asteroid_group_members ?x1 . \n?x2 :astronomy.astronomer.astronomical_objects_discovered ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	}
]