[
	{
		"qid": 26000201,
		"question": "which impressionist does the bush impression?",
		"answer": [
			"Dana Carvey",
			"Chris Parnell",
			"Will Ferrell",
			"Rich Little"
		],
		"function": "none",
		"commonness": -13.583295838679394,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.celebrity_impressionist",
					"class": "base.americancomedy.celebrity_impressionist",
					"friendly_name": "Celebrity impressionist",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.george_w_bush",
					"class": "base.americancomedy.impersonated_celebrity",
					"friendly_name": "bush",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.americancomedy.celebrity_impressionist.celebrities_impersonated",
					"friendly_name": "Celebrities impersonated"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.celebrity_impressionist . \nVALUES ?x1 { :en.george_w_bush } \n?x0 :base.americancomedy.celebrity_impressionist.celebrities_impersonated ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 26000202,
		"question": "which impressionist does the george w. bush impression?",
		"answer": [
			"Rich Little",
			"Dana Carvey",
			"Chris Parnell",
			"Will Ferrell"
		],
		"function": "none",
		"commonness": -13.583295838679394,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.celebrity_impressionist",
					"class": "base.americancomedy.celebrity_impressionist",
					"friendly_name": "Celebrity impressionist",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.george_w_bush",
					"class": "base.americancomedy.impersonated_celebrity",
					"friendly_name": "george w. bush",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.americancomedy.celebrity_impressionist.celebrities_impersonated",
					"friendly_name": "Celebrities impersonated"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.celebrity_impressionist . \nVALUES ?x1 { :en.george_w_bush } \n?x0 :base.americancomedy.celebrity_impressionist.celebrities_impersonated ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 26000300,
		"question": "by which impressionist was george bush impersonated?",
		"answer": [
			"Will Ferrell",
			"Rich Little",
			"Dana Carvey",
			"Chris Parnell"
		],
		"function": "none",
		"commonness": -13.583295838679394,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.celebrity_impressionist",
					"class": "base.americancomedy.celebrity_impressionist",
					"friendly_name": "Celebrity impressionist",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.george_w_bush",
					"class": "base.americancomedy.impersonated_celebrity",
					"friendly_name": "George Bush",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.americancomedy.celebrity_impressionist.celebrities_impersonated",
					"friendly_name": "Celebrities impersonated"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.celebrity_impressionist . \nVALUES ?x1 { :en.george_w_bush } \n?x0 :base.americancomedy.celebrity_impressionist.celebrities_impersonated ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 26000301,
		"question": "by which impressionist was bush impersonated?",
		"answer": [
			"Rich Little",
			"Will Ferrell",
			"Dana Carvey",
			"Chris Parnell"
		],
		"function": "none",
		"commonness": -13.583295838679394,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.celebrity_impressionist",
					"class": "base.americancomedy.celebrity_impressionist",
					"friendly_name": "Celebrity impressionist",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.george_w_bush",
					"class": "base.americancomedy.impersonated_celebrity",
					"friendly_name": "bush",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.americancomedy.celebrity_impressionist.celebrities_impersonated",
					"friendly_name": "Celebrities impersonated"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.celebrity_impressionist . \nVALUES ?x1 { :en.george_w_bush } \n?x0 :base.americancomedy.celebrity_impressionist.celebrities_impersonated ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 26000302,
		"question": "by which impressionist was george w. bush impersonated?",
		"answer": [
			"Chris Parnell",
			"Will Ferrell",
			"Dana Carvey",
			"Rich Little"
		],
		"function": "none",
		"commonness": -13.583295838679394,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.celebrity_impressionist",
					"class": "base.americancomedy.celebrity_impressionist",
					"friendly_name": "Celebrity impressionist",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.george_w_bush",
					"class": "base.americancomedy.impersonated_celebrity",
					"friendly_name": "george w. bush",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.americancomedy.celebrity_impressionist.celebrities_impersonated",
					"friendly_name": "Celebrities impersonated"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.celebrity_impressionist . \nVALUES ?x1 { :en.george_w_bush } \n?x0 :base.americancomedy.celebrity_impressionist.celebrities_impersonated ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 26000400,
		"question": "george bush has been parodied by which impressionists?",
		"answer": [
			"Will Ferrell",
			"Dana Carvey",
			"Rich Little",
			"Chris Parnell"
		],
		"function": "none",
		"commonness": -13.583295838679394,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.celebrity_impressionist",
					"class": "base.americancomedy.celebrity_impressionist",
					"friendly_name": "Celebrity impressionist",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.george_w_bush",
					"class": "base.americancomedy.impersonated_celebrity",
					"friendly_name": "George Bush",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.americancomedy.celebrity_impressionist.celebrities_impersonated",
					"friendly_name": "Celebrities impersonated"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.celebrity_impressionist . \nVALUES ?x1 { :en.george_w_bush } \n?x0 :base.americancomedy.celebrity_impressionist.celebrities_impersonated ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 26000401,
		"question": "bush has been parodied by which impressionists?",
		"answer": [
			"Dana Carvey",
			"Rich Little",
			"Will Ferrell",
			"Chris Parnell"
		],
		"function": "none",
		"commonness": -13.583295838679394,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.celebrity_impressionist",
					"class": "base.americancomedy.celebrity_impressionist",
					"friendly_name": "Celebrity impressionist",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.george_w_bush",
					"class": "base.americancomedy.impersonated_celebrity",
					"friendly_name": "bush",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.americancomedy.celebrity_impressionist.celebrities_impersonated",
					"friendly_name": "Celebrities impersonated"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.celebrity_impressionist . \nVALUES ?x1 { :en.george_w_bush } \n?x0 :base.americancomedy.celebrity_impressionist.celebrities_impersonated ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 26000402,
		"question": "george w. bush has been parodied by which impressionists?",
		"answer": [
			"Rich Little",
			"Will Ferrell",
			"Dana Carvey",
			"Chris Parnell"
		],
		"function": "none",
		"commonness": -13.583295838679394,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.celebrity_impressionist",
					"class": "base.americancomedy.celebrity_impressionist",
					"friendly_name": "Celebrity impressionist",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.george_w_bush",
					"class": "base.americancomedy.impersonated_celebrity",
					"friendly_name": "george w. bush",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.americancomedy.celebrity_impressionist.celebrities_impersonated",
					"friendly_name": "Celebrities impersonated"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.celebrity_impressionist . \nVALUES ?x1 { :en.george_w_bush } \n?x0 :base.americancomedy.celebrity_impressionist.celebrities_impersonated ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 26000500,
		"question": "who has done an impersonation of former president george bush?",
		"answer": [
			"Will Ferrell",
			"Chris Parnell",
			"Dana Carvey",
			"Rich Little"
		],
		"function": "none",
		"commonness": -13.583295838679394,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.celebrity_impressionist",
					"class": "base.americancomedy.celebrity_impressionist",
					"friendly_name": "Celebrity impressionist",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.george_w_bush",
					"class": "base.americancomedy.impersonated_celebrity",
					"friendly_name": "George Bush",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.americancomedy.celebrity_impressionist.celebrities_impersonated",
					"friendly_name": "Celebrities impersonated"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.celebrity_impressionist . \nVALUES ?x1 { :en.george_w_bush } \n?x0 :base.americancomedy.celebrity_impressionist.celebrities_impersonated ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 26000501,
		"question": "who has done an impersonation of former president bush?",
		"answer": [
			"Dana Carvey",
			"Will Ferrell",
			"Chris Parnell",
			"Rich Little"
		],
		"function": "none",
		"commonness": -13.583295838679394,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.celebrity_impressionist",
					"class": "base.americancomedy.celebrity_impressionist",
					"friendly_name": "Celebrity impressionist",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.george_w_bush",
					"class": "base.americancomedy.impersonated_celebrity",
					"friendly_name": "bush",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.americancomedy.celebrity_impressionist.celebrities_impersonated",
					"friendly_name": "Celebrities impersonated"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.celebrity_impressionist . \nVALUES ?x1 { :en.george_w_bush } \n?x0 :base.americancomedy.celebrity_impressionist.celebrities_impersonated ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 26000502,
		"question": "who has done an impersonation of former president george w. bush?",
		"answer": [
			"Dana Carvey",
			"Chris Parnell",
			"Will Ferrell",
			"Rich Little"
		],
		"function": "none",
		"commonness": -13.583295838679394,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.celebrity_impressionist",
					"class": "base.americancomedy.celebrity_impressionist",
					"friendly_name": "Celebrity impressionist",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.george_w_bush",
					"class": "base.americancomedy.impersonated_celebrity",
					"friendly_name": "george w. bush",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.americancomedy.celebrity_impressionist.celebrities_impersonated",
					"friendly_name": "Celebrities impersonated"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.celebrity_impressionist . \nVALUES ?x1 { :en.george_w_bush } \n?x0 :base.americancomedy.celebrity_impressionist.celebrities_impersonated ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 26000600,
		"question": "who has impersonated george bush?",
		"answer": [
			"Dana Carvey",
			"Rich Little",
			"Chris Parnell",
			"Will Ferrell"
		],
		"function": "none",
		"commonness": -13.583295838679394,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.celebrity_impressionist",
					"class": "base.americancomedy.celebrity_impressionist",
					"friendly_name": "Celebrity impressionist",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.george_w_bush",
					"class": "base.americancomedy.impersonated_celebrity",
					"friendly_name": "George Bush",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.americancomedy.celebrity_impressionist.celebrities_impersonated",
					"friendly_name": "Celebrities impersonated"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.celebrity_impressionist . \nVALUES ?x1 { :en.george_w_bush } \n?x0 :base.americancomedy.celebrity_impressionist.celebrities_impersonated ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 26000601,
		"question": "who has impersonated bush?",
		"answer": [
			"Dana Carvey",
			"Will Ferrell",
			"Rich Little",
			"Chris Parnell"
		],
		"function": "none",
		"commonness": -13.583295838679394,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.celebrity_impressionist",
					"class": "base.americancomedy.celebrity_impressionist",
					"friendly_name": "Celebrity impressionist",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.george_w_bush",
					"class": "base.americancomedy.impersonated_celebrity",
					"friendly_name": "bush",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.americancomedy.celebrity_impressionist.celebrities_impersonated",
					"friendly_name": "Celebrities impersonated"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.celebrity_impressionist . \nVALUES ?x1 { :en.george_w_bush } \n?x0 :base.americancomedy.celebrity_impressionist.celebrities_impersonated ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 26000602,
		"question": "who has impersonated george w. bush?",
		"answer": [
			"Rich Little",
			"Dana Carvey",
			"Will Ferrell",
			"Chris Parnell"
		],
		"function": "none",
		"commonness": -13.583295838679394,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancomedy.celebrity_impressionist",
					"class": "base.americancomedy.celebrity_impressionist",
					"friendly_name": "Celebrity impressionist",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.george_w_bush",
					"class": "base.americancomedy.impersonated_celebrity",
					"friendly_name": "george w. bush",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.americancomedy.celebrity_impressionist.celebrities_impersonated",
					"friendly_name": "Celebrities impersonated"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancomedy.celebrity_impressionist . \nVALUES ?x1 { :en.george_w_bush } \n?x0 :base.americancomedy.celebrity_impressionist.celebrities_impersonated ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 27000000,
		"question": "what kind of activisms is nazism a part of?",
		"answer": [
			"Fascism",
			"Militarism",
			"Anti-communism",
			"Totalitarianism",
			"Collectivism",
			"Nationalism",
			"Antisemitism",
			"Anti-parliamentarism",
			"Racism"
		],
		"function": "none",
		"commonness": -12.075511593165825,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.activism.activism_issue",
					"class": "base.activism.activism_issue",
					"friendly_name": "Activism issue",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nazism",
					"class": "base.activism.activism_issue",
					"friendly_name": "Nazism",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.activism.activism_issue.includes_issues",
					"friendly_name": "Includes issues"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.activism.activism_issue . \nVALUES ?x1 { :en.nazism } \n?x0 :base.activism.activism_issue.includes_issues ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 27000001,
		"question": "what kind of activisms is nazi a part of?",
		"answer": [
			"Totalitarianism",
			"Nationalism",
			"Racism",
			"Anti-parliamentarism",
			"Antisemitism",
			"Fascism",
			"Militarism",
			"Anti-communism",
			"Collectivism"
		],
		"function": "none",
		"commonness": -12.075511593165825,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.activism.activism_issue",
					"class": "base.activism.activism_issue",
					"friendly_name": "Activism issue",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nazism",
					"class": "base.activism.activism_issue",
					"friendly_name": "nazi",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.activism.activism_issue.includes_issues",
					"friendly_name": "Includes issues"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.activism.activism_issue . \nVALUES ?x1 { :en.nazism } \n?x0 :base.activism.activism_issue.includes_issues ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 27000002,
		"question": "what kind of activisms is nazis a part of?",
		"answer": [
			"Anti-communism",
			"Antisemitism",
			"Fascism",
			"Nationalism",
			"Totalitarianism",
			"Racism",
			"Collectivism",
			"Anti-parliamentarism",
			"Militarism"
		],
		"function": "none",
		"commonness": -12.075511593165825,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.activism.activism_issue",
					"class": "base.activism.activism_issue",
					"friendly_name": "Activism issue",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nazism",
					"class": "base.activism.activism_issue",
					"friendly_name": "nazis",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.activism.activism_issue.includes_issues",
					"friendly_name": "Includes issues"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.activism.activism_issue . \nVALUES ?x1 { :en.nazism } \n?x0 :base.activism.activism_issue.includes_issues ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 27000100,
		"question": "what activism issues include nazism?",
		"answer": [
			"Nationalism",
			"Anti-parliamentarism",
			"Anti-communism",
			"Antisemitism",
			"Militarism",
			"Fascism",
			"Totalitarianism",
			"Racism",
			"Collectivism"
		],
		"function": "none",
		"commonness": -12.075511593165825,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.activism.activism_issue",
					"class": "base.activism.activism_issue",
					"friendly_name": "Activism issue",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nazism",
					"class": "base.activism.activism_issue",
					"friendly_name": "Nazism",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.activism.activism_issue.includes_issues",
					"friendly_name": "Includes issues"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.activism.activism_issue . \nVALUES ?x1 { :en.nazism } \n?x0 :base.activism.activism_issue.includes_issues ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 27000101,
		"question": "what activism issues include nazi?",
		"answer": [
			"Antisemitism",
			"Nationalism",
			"Collectivism",
			"Anti-communism",
			"Fascism",
			"Militarism",
			"Anti-parliamentarism",
			"Racism",
			"Totalitarianism"
		],
		"function": "none",
		"commonness": -12.075511593165825,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.activism.activism_issue",
					"class": "base.activism.activism_issue",
					"friendly_name": "Activism issue",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nazism",
					"class": "base.activism.activism_issue",
					"friendly_name": "nazi",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.activism.activism_issue.includes_issues",
					"friendly_name": "Includes issues"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.activism.activism_issue . \nVALUES ?x1 { :en.nazism } \n?x0 :base.activism.activism_issue.includes_issues ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 27000102,
		"question": "what activism issues include nazis?",
		"answer": [
			"Anti-parliamentarism",
			"Militarism",
			"Totalitarianism",
			"Antisemitism",
			"Fascism",
			"Anti-communism",
			"Nationalism",
			"Collectivism",
			"Racism"
		],
		"function": "none",
		"commonness": -12.075511593165825,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.activism.activism_issue",
					"class": "base.activism.activism_issue",
					"friendly_name": "Activism issue",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nazism",
					"class": "base.activism.activism_issue",
					"friendly_name": "nazis",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.activism.activism_issue.includes_issues",
					"friendly_name": "Includes issues"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.activism.activism_issue . \nVALUES ?x1 { :en.nazism } \n?x0 :base.activism.activism_issue.includes_issues ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 27000200,
		"question": "what are activism issues that address nazism?",
		"answer": [
			"Antisemitism",
			"Anti-parliamentarism",
			"Collectivism",
			"Fascism",
			"Militarism",
			"Racism",
			"Nationalism",
			"Totalitarianism",
			"Anti-communism"
		],
		"function": "none",
		"commonness": -12.075511593165825,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.activism.activism_issue",
					"class": "base.activism.activism_issue",
					"friendly_name": "Activism issue",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nazism",
					"class": "base.activism.activism_issue",
					"friendly_name": "Nazism",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.activism.activism_issue.includes_issues",
					"friendly_name": "Includes issues"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.activism.activism_issue . \nVALUES ?x1 { :en.nazism } \n?x0 :base.activism.activism_issue.includes_issues ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]