[
	{
		"qid": 94000100,
		"question": "which events of electronic entertainment expo have been held?",
		"answer": [
			"Electronic Entertainment Expo 2010",
			"Electronic Entertainment Expo 2009",
			"Electronic Entertainment Expo 2011",
			"Electronic Entertainment Expo 2012"
		],
		"function": "none",
		"commonness": -15.920868772774654,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "conferences.conference",
					"class": "conferences.conference",
					"friendly_name": "Conference event",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.e3",
					"class": "conferences.conference_series",
					"friendly_name": "Electronic Entertainment Expo",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "conferences.conference_series.conference",
					"friendly_name": "Conferences"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :conferences.conference . \nVALUES ?x1 { :en.e3 } \n?x1 :conferences.conference_series.conference ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 94000101,
		"question": "which events of e3 have been held?",
		"answer": [
			"Electronic Entertainment Expo 2009",
			"Electronic Entertainment Expo 2012",
			"Electronic Entertainment Expo 2010",
			"Electronic Entertainment Expo 2011"
		],
		"function": "none",
		"commonness": -15.920868772774654,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "conferences.conference",
					"class": "conferences.conference",
					"friendly_name": "Conference event",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.e3",
					"class": "conferences.conference_series",
					"friendly_name": "e3",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "conferences.conference_series.conference",
					"friendly_name": "Conferences"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :conferences.conference . \nVALUES ?x1 { :en.e3 } \n?x1 :conferences.conference_series.conference ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 94000102,
		"question": "which events of e3 expo have been held?",
		"answer": [
			"Electronic Entertainment Expo 2010",
			"Electronic Entertainment Expo 2012",
			"Electronic Entertainment Expo 2011",
			"Electronic Entertainment Expo 2009"
		],
		"function": "none",
		"commonness": -15.920868772774654,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "conferences.conference",
					"class": "conferences.conference",
					"friendly_name": "Conference event",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.e3",
					"class": "conferences.conference_series",
					"friendly_name": "e3 expo",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "conferences.conference_series.conference",
					"friendly_name": "Conferences"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :conferences.conference . \nVALUES ?x1 { :en.e3 } \n?x1 :conferences.conference_series.conference ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 95000000,
		"question": "what is the position of hillary rodham clinton in the last cabinet?",
		"answer": [
			"United States Secretary of State"
		],
		"function": "none",
		"commonness": -13.643093409521851,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.obamabase.cabinet_position",
					"class": "base.obamabase.cabinet_position",
					"friendly_name": "Cabinet position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.hillary_rodham_clinton",
					"class": "base.obamabase.cabinet_member",
					"friendly_name": "Hillary Rodham Clinton",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.obamabase.cabinet_member.cabinet_position",
					"friendly_name": "Cabinet position"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.obamabase.cabinet_position . \nVALUES ?x1 { :en.hillary_rodham_clinton } \n?x1 :base.obamabase.cabinet_member.cabinet_position ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 95000001,
		"question": "what is the position of hillary clinton in the last cabinet?",
		"answer": [
			"United States Secretary of State"
		],
		"function": "none",
		"commonness": -13.643093409521851,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.obamabase.cabinet_position",
					"class": "base.obamabase.cabinet_position",
					"friendly_name": "Cabinet position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.hillary_rodham_clinton",
					"class": "base.obamabase.cabinet_member",
					"friendly_name": "hillary clinton",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.obamabase.cabinet_member.cabinet_position",
					"friendly_name": "Cabinet position"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.obamabase.cabinet_position . \nVALUES ?x1 { :en.hillary_rodham_clinton } \n?x1 :base.obamabase.cabinet_member.cabinet_position ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 95000002,
		"question": "what is the position of hillary in the last cabinet?",
		"answer": [
			"United States Secretary of State"
		],
		"function": "none",
		"commonness": -13.643093409521851,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.obamabase.cabinet_position",
					"class": "base.obamabase.cabinet_position",
					"friendly_name": "Cabinet position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.hillary_rodham_clinton",
					"class": "base.obamabase.cabinet_member",
					"friendly_name": "hillary",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.obamabase.cabinet_member.cabinet_position",
					"friendly_name": "Cabinet position"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.obamabase.cabinet_position . \nVALUES ?x1 { :en.hillary_rodham_clinton } \n?x1 :base.obamabase.cabinet_member.cabinet_position ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 95000100,
		"question": "what was the cabinet position held by hillary rodham clinton?",
		"answer": [
			"United States Secretary of State"
		],
		"function": "none",
		"commonness": -13.643093409521851,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.obamabase.cabinet_position",
					"class": "base.obamabase.cabinet_position",
					"friendly_name": "Cabinet position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.hillary_rodham_clinton",
					"class": "base.obamabase.cabinet_member",
					"friendly_name": "Hillary Rodham Clinton",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.obamabase.cabinet_member.cabinet_position",
					"friendly_name": "Cabinet position"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.obamabase.cabinet_position . \nVALUES ?x1 { :en.hillary_rodham_clinton } \n?x1 :base.obamabase.cabinet_member.cabinet_position ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 95000101,
		"question": "what was the cabinet position held by hillary clinton?",
		"answer": [
			"United States Secretary of State"
		],
		"function": "none",
		"commonness": -13.643093409521851,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.obamabase.cabinet_position",
					"class": "base.obamabase.cabinet_position",
					"friendly_name": "Cabinet position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.hillary_rodham_clinton",
					"class": "base.obamabase.cabinet_member",
					"friendly_name": "hillary clinton",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.obamabase.cabinet_member.cabinet_position",
					"friendly_name": "Cabinet position"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.obamabase.cabinet_position . \nVALUES ?x1 { :en.hillary_rodham_clinton } \n?x1 :base.obamabase.cabinet_member.cabinet_position ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 95000102,
		"question": "what was the cabinet position held by hillary?",
		"answer": [
			"United States Secretary of State"
		],
		"function": "none",
		"commonness": -13.643093409521851,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.obamabase.cabinet_position",
					"class": "base.obamabase.cabinet_position",
					"friendly_name": "Cabinet position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.hillary_rodham_clinton",
					"class": "base.obamabase.cabinet_member",
					"friendly_name": "hillary",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.obamabase.cabinet_member.cabinet_position",
					"friendly_name": "Cabinet position"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.obamabase.cabinet_position . \nVALUES ?x1 { :en.hillary_rodham_clinton } \n?x1 :base.obamabase.cabinet_member.cabinet_position ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 95000200,
		"question": "hillary rodham clinton held what cabinet position?",
		"answer": [
			"United States Secretary of State"
		],
		"function": "none",
		"commonness": -13.643093409521851,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.obamabase.cabinet_position",
					"class": "base.obamabase.cabinet_position",
					"friendly_name": "Cabinet position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.hillary_rodham_clinton",
					"class": "base.obamabase.cabinet_member",
					"friendly_name": "Hillary Rodham Clinton",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.obamabase.cabinet_member.cabinet_position",
					"friendly_name": "Cabinet position"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.obamabase.cabinet_position . \nVALUES ?x1 { :en.hillary_rodham_clinton } \n?x1 :base.obamabase.cabinet_member.cabinet_position ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 95000201,
		"question": "hillary clinton held what cabinet position?",
		"answer": [
			"United States Secretary of State"
		],
		"function": "none",
		"commonness": -13.643093409521851,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.obamabase.cabinet_position",
					"class": "base.obamabase.cabinet_position",
					"friendly_name": "Cabinet position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.hillary_rodham_clinton",
					"class": "base.obamabase.cabinet_member",
					"friendly_name": "hillary clinton",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.obamabase.cabinet_member.cabinet_position",
					"friendly_name": "Cabinet position"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.obamabase.cabinet_position . \nVALUES ?x1 { :en.hillary_rodham_clinton } \n?x1 :base.obamabase.cabinet_member.cabinet_position ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 95000202,
		"question": "hillary held what cabinet position?",
		"answer": [
			"United States Secretary of State"
		],
		"function": "none",
		"commonness": -13.643093409521851,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.obamabase.cabinet_position",
					"class": "base.obamabase.cabinet_position",
					"friendly_name": "Cabinet position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.hillary_rodham_clinton",
					"class": "base.obamabase.cabinet_member",
					"friendly_name": "hillary",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.obamabase.cabinet_member.cabinet_position",
					"friendly_name": "Cabinet position"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.obamabase.cabinet_position . \nVALUES ?x1 { :en.hillary_rodham_clinton } \n?x1 :base.obamabase.cabinet_member.cabinet_position ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 95000300,
		"question": "what cabinet position did hillary rodham clinton hold?",
		"answer": [
			"United States Secretary of State"
		],
		"function": "none",
		"commonness": -13.643093409521851,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.obamabase.cabinet_position",
					"class": "base.obamabase.cabinet_position",
					"friendly_name": "Cabinet position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.hillary_rodham_clinton",
					"class": "base.obamabase.cabinet_member",
					"friendly_name": "Hillary Rodham Clinton",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.obamabase.cabinet_member.cabinet_position",
					"friendly_name": "Cabinet position"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.obamabase.cabinet_position . \nVALUES ?x1 { :en.hillary_rodham_clinton } \n?x1 :base.obamabase.cabinet_member.cabinet_position ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 95000301,
		"question": "what cabinet position did hillary clinton hold?",
		"answer": [
			"United States Secretary of State"
		],
		"function": "none",
		"commonness": -13.643093409521851,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.obamabase.cabinet_position",
					"class": "base.obamabase.cabinet_position",
					"friendly_name": "Cabinet position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.hillary_rodham_clinton",
					"class": "base.obamabase.cabinet_member",
					"friendly_name": "hillary clinton",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.obamabase.cabinet_member.cabinet_position",
					"friendly_name": "Cabinet position"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.obamabase.cabinet_position . \nVALUES ?x1 { :en.hillary_rodham_clinton } \n?x1 :base.obamabase.cabinet_member.cabinet_position ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 95000302,
		"question": "what cabinet position did hillary hold?",
		"answer": [
			"United States Secretary of State"
		],
		"function": "none",
		"commonness": -13.643093409521851,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.obamabase.cabinet_position",
					"class": "base.obamabase.cabinet_position",
					"friendly_name": "Cabinet position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.hillary_rodham_clinton",
					"class": "base.obamabase.cabinet_member",
					"friendly_name": "hillary",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.obamabase.cabinet_member.cabinet_position",
					"friendly_name": "Cabinet position"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.obamabase.cabinet_position . \nVALUES ?x1 { :en.hillary_rodham_clinton } \n?x1 :base.obamabase.cabinet_member.cabinet_position ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 95000400,
		"question": "what position was hillary rodham clinton holding in the obama cabinet?",
		"answer": [
			"United States Secretary of State"
		],
		"function": "none",
		"commonness": -13.643093409521851,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.obamabase.cabinet_position",
					"class": "base.obamabase.cabinet_position",
					"friendly_name": "Cabinet position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.hillary_rodham_clinton",
					"class": "base.obamabase.cabinet_member",
					"friendly_name": "Hillary Rodham Clinton",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.obamabase.cabinet_member.cabinet_position",
					"friendly_name": "Cabinet position"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.obamabase.cabinet_position . \nVALUES ?x1 { :en.hillary_rodham_clinton } \n?x1 :base.obamabase.cabinet_member.cabinet_position ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 95000401,
		"question": "what position was hillary clinton holding in the obama cabinet?",
		"answer": [
			"United States Secretary of State"
		],
		"function": "none",
		"commonness": -13.643093409521851,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.obamabase.cabinet_position",
					"class": "base.obamabase.cabinet_position",
					"friendly_name": "Cabinet position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.hillary_rodham_clinton",
					"class": "base.obamabase.cabinet_member",
					"friendly_name": "hillary clinton",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.obamabase.cabinet_member.cabinet_position",
					"friendly_name": "Cabinet position"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.obamabase.cabinet_position . \nVALUES ?x1 { :en.hillary_rodham_clinton } \n?x1 :base.obamabase.cabinet_member.cabinet_position ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 95000402,
		"question": "what position was hillary holding in the obama cabinet?",
		"answer": [
			"United States Secretary of State"
		],
		"function": "none",
		"commonness": -13.643093409521851,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.obamabase.cabinet_position",
					"class": "base.obamabase.cabinet_position",
					"friendly_name": "Cabinet position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.hillary_rodham_clinton",
					"class": "base.obamabase.cabinet_member",
					"friendly_name": "hillary",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.obamabase.cabinet_member.cabinet_position",
					"friendly_name": "Cabinet position"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.obamabase.cabinet_position . \nVALUES ?x1 { :en.hillary_rodham_clinton } \n?x1 :base.obamabase.cabinet_member.cabinet_position ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 95000500,
		"question": "what seat on the cabinet did hillary rodham clinton have?",
		"answer": [
			"United States Secretary of State"
		],
		"function": "none",
		"commonness": -13.643093409521851,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.obamabase.cabinet_position",
					"class": "base.obamabase.cabinet_position",
					"friendly_name": "Cabinet position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.hillary_rodham_clinton",
					"class": "base.obamabase.cabinet_member",
					"friendly_name": "Hillary Rodham Clinton",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.obamabase.cabinet_member.cabinet_position",
					"friendly_name": "Cabinet position"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.obamabase.cabinet_position . \nVALUES ?x1 { :en.hillary_rodham_clinton } \n?x1 :base.obamabase.cabinet_member.cabinet_position ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 95000501,
		"question": "what seat on the cabinet did hillary clinton have?",
		"answer": [
			"United States Secretary of State"
		],
		"function": "none",
		"commonness": -13.643093409521851,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.obamabase.cabinet_position",
					"class": "base.obamabase.cabinet_position",
					"friendly_name": "Cabinet position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.hillary_rodham_clinton",
					"class": "base.obamabase.cabinet_member",
					"friendly_name": "hillary clinton",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.obamabase.cabinet_member.cabinet_position",
					"friendly_name": "Cabinet position"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.obamabase.cabinet_position . \nVALUES ?x1 { :en.hillary_rodham_clinton } \n?x1 :base.obamabase.cabinet_member.cabinet_position ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 95000502,
		"question": "what seat on the cabinet did hillary have?",
		"answer": [
			"United States Secretary of State"
		],
		"function": "none",
		"commonness": -13.643093409521851,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.obamabase.cabinet_position",
					"class": "base.obamabase.cabinet_position",
					"friendly_name": "Cabinet position",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.hillary_rodham_clinton",
					"class": "base.obamabase.cabinet_member",
					"friendly_name": "hillary",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.obamabase.cabinet_member.cabinet_position",
					"friendly_name": "Cabinet position"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.obamabase.cabinet_position . \nVALUES ?x1 { :en.hillary_rodham_clinton } \n?x1 :base.obamabase.cabinet_member.cabinet_position ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 96000000,
		"question": "what is the venue that has the largest amount of seats available?",
		"answer": [
			"Daytona International Speedway"
		],
		"function": "argmax",
		"commonness": -13.143543406313972,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.venue",
					"class": "architecture.venue",
					"friendly_name": "Venue",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "1417^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "1417",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.venue.capacity",
					"friendly_name": "Seating capacity"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.venue . \n{\nSELECT (MAX(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :architecture.venue . \n?y0 :architecture.venue.capacity ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :architecture.venue.capacity ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 96000100,
		"question": "the largest capacity of any entertainment venue can be found in what structure?",
		"answer": [
			"Daytona International Speedway"
		],
		"function": "argmax",
		"commonness": -13.143543406313972,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.venue",
					"class": "architecture.venue",
					"friendly_name": "Venue",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "1417^^http://www.w3.org/2001/XMLSchema#int",
					"class": "type.int",
					"friendly_name": "1417",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.venue.capacity",
					"friendly_name": "Seating capacity"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.venue . \n{\nSELECT (MAX(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :architecture.venue . \n?y0 :architecture.venue.capacity ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :architecture.venue.capacity ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]