[
	{
		"qid": 6000000,
		"question": "look for people who use gamesys services.",
		"answer": [
			"NI Group",
			"Heart",
			"Caesars Entertainment Corporation",
			"The Sun"
		],
		"function": "none",
		"commonness": -15.845372546238764,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "business.customer",
					"class": "business.customer",
					"friendly_name": "Customer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.gamesys",
					"class": "business.business_operation",
					"friendly_name": "Gamesys",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "business.customer.supplier",
					"friendly_name": "Supplier"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :business.customer . \nVALUES ?x1 { :en.gamesys } \n?x0 :business.customer.supplier ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 6000200,
		"question": "who are gamesys customers?",
		"answer": [
			"Heart",
			"NI Group",
			"Caesars Entertainment Corporation",
			"The Sun"
		],
		"function": "none",
		"commonness": -15.845372546238764,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "business.customer",
					"class": "business.customer",
					"friendly_name": "Customer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.gamesys",
					"class": "business.business_operation",
					"friendly_name": "Gamesys",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "business.customer.supplier",
					"friendly_name": "Supplier"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :business.customer . \nVALUES ?x1 { :en.gamesys } \n?x0 :business.customer.supplier ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 6000300,
		"question": "who are some customers of gamesys?",
		"answer": [
			"NI Group",
			"The Sun",
			"Caesars Entertainment Corporation",
			"Heart"
		],
		"function": "none",
		"commonness": -15.845372546238764,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "business.customer",
					"class": "business.customer",
					"friendly_name": "Customer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.gamesys",
					"class": "business.business_operation",
					"friendly_name": "Gamesys",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "business.customer.supplier",
					"friendly_name": "Supplier"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :business.customer . \nVALUES ?x1 { :en.gamesys } \n?x0 :business.customer.supplier ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 7000001,
		"question": "the us is the origin of which legal drug classifications?",
		"answer": [
			"Illegal",
			"Schedule III (CSA)",
			"Schedule IV (CSA)",
			"Not evaluated by FDA",
			"Schedule V (CSA)",
			"Investigational New Drug",
			"Legal",
			"Prescription drug",
			"Dietary supplement",
			"Over-the-counter drug",
			"Non-controlled substance",
			"Schedule II (CSA)",
			"Schedule I (CSA)"
		],
		"function": "none",
		"commonness": -12.149463404471973,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.drug_legal_status",
					"class": "medicine.drug_legal_status",
					"friendly_name": "Drug legal status",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.country",
					"friendly_name": "us",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.drug_legal_status.country",
					"friendly_name": "Country"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.drug_legal_status . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :medicine.drug_legal_status.country ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 7000002,
		"question": "the united states is the origin of which legal drug classifications?",
		"answer": [
			"Schedule V (CSA)",
			"Schedule II (CSA)",
			"Schedule III (CSA)",
			"Schedule IV (CSA)",
			"Not evaluated by FDA",
			"Dietary supplement",
			"Over-the-counter drug",
			"Illegal",
			"Prescription drug",
			"Legal",
			"Non-controlled substance",
			"Investigational New Drug",
			"Schedule I (CSA)"
		],
		"function": "none",
		"commonness": -12.149463404471973,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.drug_legal_status",
					"class": "medicine.drug_legal_status",
					"friendly_name": "Drug legal status",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.country",
					"friendly_name": "united states",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.drug_legal_status.country",
					"friendly_name": "Country"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.drug_legal_status . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :medicine.drug_legal_status.country ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 7000100,
		"question": "what drug legal statuses are used in the united states of america?",
		"answer": [
			"Schedule IV (CSA)",
			"Schedule I (CSA)",
			"Legal",
			"Not evaluated by FDA",
			"Schedule III (CSA)",
			"Schedule II (CSA)",
			"Dietary supplement",
			"Over-the-counter drug",
			"Schedule V (CSA)",
			"Non-controlled substance",
			"Prescription drug",
			"Illegal",
			"Investigational New Drug"
		],
		"function": "none",
		"commonness": -12.149463404471973,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.drug_legal_status",
					"class": "medicine.drug_legal_status",
					"friendly_name": "Drug legal status",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.country",
					"friendly_name": "United States of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.drug_legal_status.country",
					"friendly_name": "Country"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.drug_legal_status . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :medicine.drug_legal_status.country ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 7000101,
		"question": "what drug legal statuses are used in the us?",
		"answer": [
			"Schedule I (CSA)",
			"Prescription drug",
			"Dietary supplement",
			"Schedule IV (CSA)",
			"Schedule II (CSA)",
			"Illegal",
			"Schedule III (CSA)",
			"Non-controlled substance",
			"Not evaluated by FDA",
			"Legal",
			"Investigational New Drug",
			"Over-the-counter drug",
			"Schedule V (CSA)"
		],
		"function": "none",
		"commonness": -12.149463404471973,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.drug_legal_status",
					"class": "medicine.drug_legal_status",
					"friendly_name": "Drug legal status",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.country",
					"friendly_name": "us",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.drug_legal_status.country",
					"friendly_name": "Country"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.drug_legal_status . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :medicine.drug_legal_status.country ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 7000102,
		"question": "what drug legal statuses are used in the united states?",
		"answer": [
			"Illegal",
			"Investigational New Drug",
			"Not evaluated by FDA",
			"Schedule III (CSA)",
			"Prescription drug",
			"Non-controlled substance",
			"Schedule V (CSA)",
			"Dietary supplement",
			"Over-the-counter drug",
			"Schedule IV (CSA)",
			"Schedule II (CSA)",
			"Schedule I (CSA)",
			"Legal"
		],
		"function": "none",
		"commonness": -12.149463404471973,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.drug_legal_status",
					"class": "medicine.drug_legal_status",
					"friendly_name": "Drug legal status",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.country",
					"friendly_name": "united states",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.drug_legal_status.country",
					"friendly_name": "Country"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.drug_legal_status . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :medicine.drug_legal_status.country ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 7000200,
		"question": "which drug legal classifications originate from the united states of america?",
		"answer": [
			"Schedule V (CSA)",
			"Dietary supplement",
			"Schedule I (CSA)",
			"Schedule IV (CSA)",
			"Investigational New Drug",
			"Non-controlled substance",
			"Over-the-counter drug",
			"Legal",
			"Prescription drug",
			"Schedule III (CSA)",
			"Illegal",
			"Schedule II (CSA)",
			"Not evaluated by FDA"
		],
		"function": "none",
		"commonness": -12.149463404471973,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.drug_legal_status",
					"class": "medicine.drug_legal_status",
					"friendly_name": "Drug legal status",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.country",
					"friendly_name": "United States of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.drug_legal_status.country",
					"friendly_name": "Country"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.drug_legal_status . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :medicine.drug_legal_status.country ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 7000202,
		"question": "which drug legal classifications originate from the united states?",
		"answer": [
			"Investigational New Drug",
			"Schedule II (CSA)",
			"Dietary supplement",
			"Schedule III (CSA)",
			"Schedule IV (CSA)",
			"Legal",
			"Non-controlled substance",
			"Illegal",
			"Prescription drug",
			"Schedule V (CSA)",
			"Schedule I (CSA)",
			"Not evaluated by FDA",
			"Over-the-counter drug"
		],
		"function": "none",
		"commonness": -12.149463404471973,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.drug_legal_status",
					"class": "medicine.drug_legal_status",
					"friendly_name": "Drug legal status",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.country",
					"friendly_name": "united states",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.drug_legal_status.country",
					"friendly_name": "Country"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.drug_legal_status . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :medicine.drug_legal_status.country ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 7000300,
		"question": "what drug legal statuses are defined by the united states of america?",
		"answer": [
			"Dietary supplement",
			"Non-controlled substance",
			"Schedule III (CSA)",
			"Schedule V (CSA)",
			"Schedule II (CSA)",
			"Prescription drug",
			"Not evaluated by FDA",
			"Legal",
			"Illegal",
			"Schedule IV (CSA)",
			"Investigational New Drug",
			"Over-the-counter drug",
			"Schedule I (CSA)"
		],
		"function": "none",
		"commonness": -12.149463404471973,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.drug_legal_status",
					"class": "medicine.drug_legal_status",
					"friendly_name": "Drug legal status",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.country",
					"friendly_name": "United States of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.drug_legal_status.country",
					"friendly_name": "Country"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.drug_legal_status . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :medicine.drug_legal_status.country ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 7000301,
		"question": "what drug legal statuses are defined by the us?",
		"answer": [
			"Not evaluated by FDA",
			"Schedule V (CSA)",
			"Prescription drug",
			"Non-controlled substance",
			"Illegal",
			"Schedule IV (CSA)",
			"Legal",
			"Dietary supplement",
			"Schedule III (CSA)",
			"Over-the-counter drug",
			"Investigational New Drug",
			"Schedule II (CSA)",
			"Schedule I (CSA)"
		],
		"function": "none",
		"commonness": -12.149463404471973,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.drug_legal_status",
					"class": "medicine.drug_legal_status",
					"friendly_name": "Drug legal status",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.country",
					"friendly_name": "us",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.drug_legal_status.country",
					"friendly_name": "Country"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.drug_legal_status . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :medicine.drug_legal_status.country ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 7000302,
		"question": "what drug legal statuses are defined by the united states?",
		"answer": [
			"Investigational New Drug",
			"Prescription drug",
			"Schedule I (CSA)",
			"Not evaluated by FDA",
			"Over-the-counter drug",
			"Dietary supplement",
			"Schedule IV (CSA)",
			"Legal",
			"Illegal",
			"Schedule III (CSA)",
			"Schedule V (CSA)",
			"Schedule II (CSA)",
			"Non-controlled substance"
		],
		"function": "none",
		"commonness": -12.149463404471973,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.drug_legal_status",
					"class": "medicine.drug_legal_status",
					"friendly_name": "Drug legal status",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.country",
					"friendly_name": "united states",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.drug_legal_status.country",
					"friendly_name": "Country"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.drug_legal_status . \nVALUES ?x1 { :en.united_states_of_america } \n?x0 :medicine.drug_legal_status.country ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 8000000,
		"question": "what is the process for weaving denim?",
		"answer": [
			"Twill"
		],
		"function": "none",
		"commonness": -18.69909202577648,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fashion.weave",
					"class": "fashion.weave",
					"friendly_name": "Weave",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.denim",
					"class": "fashion.textile",
					"friendly_name": "Denim",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "fashion.weave.textiles_of_this_weave",
					"friendly_name": "Textiles of this weave"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fashion.weave . \nVALUES ?x1 { :en.denim } \n?x0 :fashion.weave.textiles_of_this_weave ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 8000100,
		"question": "what weave is used for denim?",
		"answer": [
			"Twill"
		],
		"function": "none",
		"commonness": -18.69909202577648,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fashion.weave",
					"class": "fashion.weave",
					"friendly_name": "Weave",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.denim",
					"class": "fashion.textile",
					"friendly_name": "Denim",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "fashion.weave.textiles_of_this_weave",
					"friendly_name": "Textiles of this weave"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fashion.weave . \nVALUES ?x1 { :en.denim } \n?x0 :fashion.weave.textiles_of_this_weave ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 8000200,
		"question": "what weaves are used to produce denim?",
		"answer": [
			"Twill"
		],
		"function": "none",
		"commonness": -18.69909202577648,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fashion.weave",
					"class": "fashion.weave",
					"friendly_name": "Weave",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.denim",
					"class": "fashion.textile",
					"friendly_name": "Denim",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "fashion.weave.textiles_of_this_weave",
					"friendly_name": "Textiles of this weave"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fashion.weave . \nVALUES ?x1 { :en.denim } \n?x0 :fashion.weave.textiles_of_this_weave ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 8000300,
		"question": "what is the weave of denim?",
		"answer": [
			"Twill"
		],
		"function": "none",
		"commonness": -18.69909202577648,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fashion.weave",
					"class": "fashion.weave",
					"friendly_name": "Weave",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.denim",
					"class": "fashion.textile",
					"friendly_name": "Denim",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "fashion.weave.textiles_of_this_weave",
					"friendly_name": "Textiles of this weave"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fashion.weave . \nVALUES ?x1 { :en.denim } \n?x0 :fashion.weave.textiles_of_this_weave ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 8000500,
		"question": "how is denim woven to form fabric?",
		"answer": [
			"Twill"
		],
		"function": "none",
		"commonness": -18.69909202577648,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "fashion.weave",
					"class": "fashion.weave",
					"friendly_name": "Weave",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.denim",
					"class": "fashion.textile",
					"friendly_name": "Denim",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "fashion.weave.textiles_of_this_weave",
					"friendly_name": "Textiles of this weave"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :fashion.weave . \nVALUES ?x1 { :en.denim } \n?x0 :fashion.weave.textiles_of_this_weave ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 9000000,
		"question": "what is the stance mike tyson use when boxing?",
		"answer": [
			"Orthodox stance"
		],
		"function": "none",
		"commonness": -19.263772083515807,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.boxing_stance",
					"class": "sports.boxing_stance",
					"friendly_name": "Boxing Stance",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mike_tyson",
					"class": "sports.boxer",
					"friendly_name": "Mike Tyson",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.boxing_stance.boxers_with_this_stance",
					"friendly_name": "Boxers with this stance"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.boxing_stance . \nVALUES ?x1 { :en.mike_tyson } \n?x0 :sports.boxing_stance.boxers_with_this_stance ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 9000001,
		"question": "what is the stance michael tyson use when boxing?",
		"answer": [
			"Orthodox stance"
		],
		"function": "none",
		"commonness": -19.263772083515807,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.boxing_stance",
					"class": "sports.boxing_stance",
					"friendly_name": "Boxing Stance",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mike_tyson",
					"class": "sports.boxer",
					"friendly_name": "michael tyson",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.boxing_stance.boxers_with_this_stance",
					"friendly_name": "Boxers with this stance"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.boxing_stance . \nVALUES ?x1 { :en.mike_tyson } \n?x0 :sports.boxing_stance.boxers_with_this_stance ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 9000002,
		"question": "what is the stance tyson use when boxing?",
		"answer": [
			"Orthodox stance"
		],
		"function": "none",
		"commonness": -19.263772083515807,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.boxing_stance",
					"class": "sports.boxing_stance",
					"friendly_name": "Boxing Stance",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mike_tyson",
					"class": "sports.boxer",
					"friendly_name": "tyson",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.boxing_stance.boxers_with_this_stance",
					"friendly_name": "Boxers with this stance"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.boxing_stance . \nVALUES ?x1 { :en.mike_tyson } \n?x0 :sports.boxing_stance.boxers_with_this_stance ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 9000100,
		"question": "mike tyson uses which stance?",
		"answer": [
			"Orthodox stance"
		],
		"function": "none",
		"commonness": -19.263772083515807,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.boxing_stance",
					"class": "sports.boxing_stance",
					"friendly_name": "Boxing Stance",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mike_tyson",
					"class": "sports.boxer",
					"friendly_name": "Mike Tyson",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.boxing_stance.boxers_with_this_stance",
					"friendly_name": "Boxers with this stance"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.boxing_stance . \nVALUES ?x1 { :en.mike_tyson } \n?x0 :sports.boxing_stance.boxers_with_this_stance ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 9000101,
		"question": "michael tyson uses which stance?",
		"answer": [
			"Orthodox stance"
		],
		"function": "none",
		"commonness": -19.263772083515807,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "sports.boxing_stance",
					"class": "sports.boxing_stance",
					"friendly_name": "Boxing Stance",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mike_tyson",
					"class": "sports.boxer",
					"friendly_name": "michael tyson",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.boxing_stance.boxers_with_this_stance",
					"friendly_name": "Boxers with this stance"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :sports.boxing_stance . \nVALUES ?x1 { :en.mike_tyson } \n?x0 :sports.boxing_stance.boxers_with_this_stance ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]