[
	{
		"qid": 116000100,
		"question": "how many short non-fictions have been written about united states of america?",
		"answer": [
			"8"
		],
		"function": "count",
		"commonness": -10.96133737549017,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.short_non_fiction",
					"class": "book.short_non_fiction",
					"friendly_name": "Short Non-fiction",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "book.book_subject",
					"friendly_name": "United States of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "book.book_subject.works",
					"friendly_name": "Works Written About This Topic"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.short_non_fiction . \nVALUES ?x1 { :en.united_states_of_america } \n?x1 :book.book_subject.works ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 116000101,
		"question": "how many short non-fictions have been written about us?",
		"answer": [
			"8"
		],
		"function": "count",
		"commonness": -10.96133737549017,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.short_non_fiction",
					"class": "book.short_non_fiction",
					"friendly_name": "Short Non-fiction",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "book.book_subject",
					"friendly_name": "us",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "book.book_subject.works",
					"friendly_name": "Works Written About This Topic"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.short_non_fiction . \nVALUES ?x1 { :en.united_states_of_america } \n?x1 :book.book_subject.works ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 116000102,
		"question": "how many short non-fictions have been written about united states?",
		"answer": [
			"8"
		],
		"function": "count",
		"commonness": -10.96133737549017,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.short_non_fiction",
					"class": "book.short_non_fiction",
					"friendly_name": "Short Non-fiction",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "book.book_subject",
					"friendly_name": "united states",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "book.book_subject.works",
					"friendly_name": "Works Written About This Topic"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.short_non_fiction . \nVALUES ?x1 { :en.united_states_of_america } \n?x1 :book.book_subject.works ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 116000200,
		"question": "how many short non-fictions are about the united states of america?",
		"answer": [
			"8"
		],
		"function": "count",
		"commonness": -10.96133737549017,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.short_non_fiction",
					"class": "book.short_non_fiction",
					"friendly_name": "Short Non-fiction",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "book.book_subject",
					"friendly_name": "United States of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "book.book_subject.works",
					"friendly_name": "Works Written About This Topic"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.short_non_fiction . \nVALUES ?x1 { :en.united_states_of_america } \n?x1 :book.book_subject.works ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 116000201,
		"question": "how many short non-fictions are about the us?",
		"answer": [
			"8"
		],
		"function": "count",
		"commonness": -10.96133737549017,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.short_non_fiction",
					"class": "book.short_non_fiction",
					"friendly_name": "Short Non-fiction",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "book.book_subject",
					"friendly_name": "us",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "book.book_subject.works",
					"friendly_name": "Works Written About This Topic"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.short_non_fiction . \nVALUES ?x1 { :en.united_states_of_america } \n?x1 :book.book_subject.works ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 116000202,
		"question": "how many short non-fictions are about the united states?",
		"answer": [
			"8"
		],
		"function": "count",
		"commonness": -10.96133737549017,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.short_non_fiction",
					"class": "book.short_non_fiction",
					"friendly_name": "Short Non-fiction",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "book.book_subject",
					"friendly_name": "united states",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "book.book_subject.works",
					"friendly_name": "Works Written About This Topic"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.short_non_fiction . \nVALUES ?x1 { :en.united_states_of_america } \n?x1 :book.book_subject.works ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 116000300,
		"question": "how many short books about united states of america fall under non-fiction?",
		"answer": [
			"8"
		],
		"function": "count",
		"commonness": -10.96133737549017,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.short_non_fiction",
					"class": "book.short_non_fiction",
					"friendly_name": "Short Non-fiction",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "book.book_subject",
					"friendly_name": "United States of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "book.book_subject.works",
					"friendly_name": "Works Written About This Topic"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.short_non_fiction . \nVALUES ?x1 { :en.united_states_of_america } \n?x1 :book.book_subject.works ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 116000301,
		"question": "how many short books about us fall under non-fiction?",
		"answer": [
			"8"
		],
		"function": "count",
		"commonness": -10.96133737549017,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.short_non_fiction",
					"class": "book.short_non_fiction",
					"friendly_name": "Short Non-fiction",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "book.book_subject",
					"friendly_name": "us",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "book.book_subject.works",
					"friendly_name": "Works Written About This Topic"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.short_non_fiction . \nVALUES ?x1 { :en.united_states_of_america } \n?x1 :book.book_subject.works ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 116000302,
		"question": "how many short books about united states fall under non-fiction?",
		"answer": [
			"8"
		],
		"function": "count",
		"commonness": -10.96133737549017,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.short_non_fiction",
					"class": "book.short_non_fiction",
					"friendly_name": "Short Non-fiction",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "book.book_subject",
					"friendly_name": "united states",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "book.book_subject.works",
					"friendly_name": "Works Written About This Topic"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.short_non_fiction . \nVALUES ?x1 { :en.united_states_of_america } \n?x1 :book.book_subject.works ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 116000400,
		"question": "the united states of america has how many short non-fictions about it?",
		"answer": [
			"8"
		],
		"function": "count",
		"commonness": -10.96133737549017,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.short_non_fiction",
					"class": "book.short_non_fiction",
					"friendly_name": "Short Non-fiction",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "book.book_subject",
					"friendly_name": "United States of America",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "book.book_subject.works",
					"friendly_name": "Works Written About This Topic"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.short_non_fiction . \nVALUES ?x1 { :en.united_states_of_america } \n?x1 :book.book_subject.works ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 116000401,
		"question": "the us has how many short non-fictions about it?",
		"answer": [
			"8"
		],
		"function": "count",
		"commonness": -10.96133737549017,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.short_non_fiction",
					"class": "book.short_non_fiction",
					"friendly_name": "Short Non-fiction",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "book.book_subject",
					"friendly_name": "us",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "book.book_subject.works",
					"friendly_name": "Works Written About This Topic"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.short_non_fiction . \nVALUES ?x1 { :en.united_states_of_america } \n?x1 :book.book_subject.works ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 116000402,
		"question": "the united states has how many short non-fictions about it?",
		"answer": [
			"8"
		],
		"function": "count",
		"commonness": -10.96133737549017,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "book.short_non_fiction",
					"class": "book.short_non_fiction",
					"friendly_name": "Short Non-fiction",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "book.book_subject",
					"friendly_name": "united states",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "book.book_subject.works",
					"friendly_name": "Works Written About This Topic"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :book.short_non_fiction . \nVALUES ?x1 { :en.united_states_of_america } \n?x1 :book.book_subject.works ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 117000000,
		"question": "what is the longest ship that participated in the american civil war?",
		"answer": [
			"CSS Virginia"
		],
		"function": "argmax",
		"commonness": -17.061329211024695,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancivilwar.ship",
					"class": "base.americancivilwar.ship",
					"friendly_name": "Ship",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "83.8^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "83.8",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "boats.ship.length_overall",
					"friendly_name": "Length overall"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancivilwar.ship . \n{\nSELECT (MAX(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :base.americancivilwar.ship . \n?y0 :boats.ship.length_overall ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :boats.ship.length_overall ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 117000200,
		"question": "what was the longest ship in the american civil war?",
		"answer": [
			"CSS Virginia"
		],
		"function": "argmax",
		"commonness": -17.061329211024695,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancivilwar.ship",
					"class": "base.americancivilwar.ship",
					"friendly_name": "Ship",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "83.8^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "83.8",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "boats.ship.length_overall",
					"friendly_name": "Length overall"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancivilwar.ship . \n{\nSELECT (MAX(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :base.americancivilwar.ship . \n?y0 :boats.ship.length_overall ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :boats.ship.length_overall ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 117000300,
		"question": "can you find the longest ship that exsisted in the american civil war?",
		"answer": [
			"CSS Virginia"
		],
		"function": "argmax",
		"commonness": -17.061329211024695,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancivilwar.ship",
					"class": "base.americancivilwar.ship",
					"friendly_name": "Ship",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "83.8^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "83.8",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "boats.ship.length_overall",
					"friendly_name": "Length overall"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancivilwar.ship . \n{\nSELECT (MAX(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :base.americancivilwar.ship . \n?y0 :boats.ship.length_overall ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :boats.ship.length_overall ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 117000400,
		"question": "which ship is the longest in the american civil war?",
		"answer": [
			"CSS Virginia"
		],
		"function": "argmax",
		"commonness": -17.061329211024695,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancivilwar.ship",
					"class": "base.americancivilwar.ship",
					"friendly_name": "Ship",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "83.8^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "83.8",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "boats.ship.length_overall",
					"friendly_name": "Length overall"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancivilwar.ship . \n{\nSELECT (MAX(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :base.americancivilwar.ship . \n?y0 :boats.ship.length_overall ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :boats.ship.length_overall ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 117000500,
		"question": "the ship with the longest frame in the civil war was known by what name?",
		"answer": [
			"CSS Virginia"
		],
		"function": "argmax",
		"commonness": -17.061329211024695,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.americancivilwar.ship",
					"class": "base.americancivilwar.ship",
					"friendly_name": "Ship",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "83.8^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "83.8",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "boats.ship.length_overall",
					"friendly_name": "Length overall"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.americancivilwar.ship . \n{\nSELECT (MAX(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :base.americancivilwar.ship . \n?y0 :boats.ship.length_overall ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :boats.ship.length_overall ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 119000000,
		"question": "what are the energe units that are at least 4184.0 joules per unit?",
		"answer": [
			"Kilowatt-hour",
			"Kilowatt hour",
			"Kilogram oil equivalent",
			"Tonne of oil equivalent",
			"Kiloton of TNT",
			"Barrel of oil equivalent",
			"Ton of TNT",
			"Kilocalorie",
			"Milliton of TNT",
			"Microton of TNT",
			"Megaton of TNT"
		],
		"function": ">=",
		"commonness": -16.67998986500696,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "measurement_unit.energy_unit",
					"class": "measurement_unit.energy_unit",
					"friendly_name": "Unit of Energy",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "4184.0^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "4184.0",
					"question_node": 0,
					"function": ">="
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "measurement_unit.energy_unit.energy_in_joules",
					"friendly_name": "Energy in Joules"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :measurement_unit.energy_unit . \nFILTER (?x1 >= 4184.0)\n?x0 :measurement_unit.energy_unit.energy_in_joules ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 120000000,
		"question": "i'm searching for rocket engines with a dry mass smaller than 1100.0 kg.",
		"answer": [
			"RD-221",
			"RD-112",
			"RD-212 (D-41)",
			"RD-103M",
			"RD-510",
			"RD-169",
			"RD-222",
			"RD-250M",
			"RD-214",
			"Vinci",
			"RD-217U",
			"RD-108A",
			"RD-219U",
			"RD-100",
			"RD-107MM",
			"RD-107A",
			"RD-253",
			"RD-273",
			"RD-303",
			"RD-220",
			"S5.19",
			"RD-2",
			"RD-252",
			"RD-105",
			"RD-106",
			"RD-211",
			"RD-224D",
			"S5.92",
			"RD-262",
			"RD-1",
			"RD-113",
			"RD-302",
			"RD-109",
			"RD-250",
			"RD-119",
			"RD-268",
			"RD-219",
			"RD-3",
			"RD-263",
			"RD-101",
			"RD-133",
			"RD-250P",
			"RD-185",
			"RD-210",
			"RD-275",
			"RD-108MM",
			"RD-213 (D-13)",
			"RD-103",
			"RD-161",
			"RD-214F",
			"RD-502",
			"RD-114",
			"RD-117",
			"RD-301",
			"RD-280",
			"RD-118",
			"RL10",
			"RD-134",
			"RD-0146",
			"RD-1KhZ",
			"RD-214U"
		],
		"function": "<=",
		"commonness": -17.601939640884925,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_engine",
					"class": "spaceflight.rocket_engine",
					"friendly_name": "Rocket engine",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "1100.0^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "1100.0",
					"question_node": 0,
					"function": "<="
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket_engine.dry_mass",
					"friendly_name": "Dry mass"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_engine . \nFILTER (?x1 <= 1100.0)\n?x0 :spaceflight.rocket_engine.dry_mass ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 120000100,
		"question": "the weight of what rocket engines is no more than 1100.0 kg when empty?",
		"answer": [
			"RD-114",
			"RD-1",
			"RD-221",
			"RD-210",
			"RD-107A",
			"RD-103",
			"RD-112",
			"RD-185",
			"RD-263",
			"RD-219U",
			"RD-211",
			"RD-133",
			"RD-107MM",
			"RD-250P",
			"RD-214U",
			"RD-105",
			"RD-100",
			"RD-108A",
			"RD-219",
			"RD-3",
			"RD-1KhZ",
			"RD-262",
			"RD-224D",
			"RD-118",
			"RD-214F",
			"S5.92",
			"RD-303",
			"Vinci",
			"RD-2",
			"RD-301",
			"RD-119",
			"RD-250M",
			"RD-106",
			"RD-134",
			"RD-250",
			"RD-275",
			"RD-109",
			"RD-161",
			"RD-252",
			"RL10",
			"RD-108MM",
			"RD-101",
			"RD-212 (D-41)",
			"RD-302",
			"RD-214",
			"RD-103M",
			"RD-502",
			"RD-510",
			"RD-169",
			"RD-220",
			"RD-117",
			"RD-113",
			"RD-273",
			"S5.19",
			"RD-268",
			"RD-222",
			"RD-213 (D-13)",
			"RD-253",
			"RD-280",
			"RD-0146",
			"RD-217U"
		],
		"function": "<=",
		"commonness": -17.601939640884925,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_engine",
					"class": "spaceflight.rocket_engine",
					"friendly_name": "Rocket engine",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "1100.0^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "1100.0",
					"question_node": 0,
					"function": "<="
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket_engine.dry_mass",
					"friendly_name": "Dry mass"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_engine . \nFILTER (?x1 <= 1100.0)\n?x0 :spaceflight.rocket_engine.dry_mass ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 120000300,
		"question": "what rocket engines weigh at most 1100.0 kg when empty?",
		"answer": [
			"RD-214F",
			"RD-303",
			"RD-214",
			"RD-100",
			"RD-105",
			"RD-113",
			"RD-119",
			"RD-108A",
			"RD-109",
			"Vinci",
			"RD-224D",
			"RD-101",
			"RD-161",
			"RD-214U",
			"RD-220",
			"RD-118",
			"RD-221",
			"RD-268",
			"RD-280",
			"RD-275",
			"RD-263",
			"RD-2",
			"RD-273",
			"RD-108MM",
			"RD-213 (D-13)",
			"RL10",
			"RD-510",
			"RD-3",
			"S5.19",
			"RD-103M",
			"RD-185",
			"RD-222",
			"RD-219U",
			"RD-301",
			"RD-1KhZ",
			"RD-212 (D-41)",
			"S5.92",
			"RD-250P",
			"RD-106",
			"RD-1",
			"RD-103",
			"RD-502",
			"RD-0146",
			"RD-211",
			"RD-117",
			"RD-112",
			"RD-210",
			"RD-252",
			"RD-217U",
			"RD-133",
			"RD-134",
			"RD-107A",
			"RD-250M",
			"RD-302",
			"RD-250",
			"RD-219",
			"RD-114",
			"RD-253",
			"RD-169",
			"RD-262",
			"RD-107MM"
		],
		"function": "<=",
		"commonness": -17.601939640884925,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket_engine",
					"class": "spaceflight.rocket_engine",
					"friendly_name": "Rocket engine",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "1100.0^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "1100.0",
					"question_node": 0,
					"function": "<="
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "spaceflight.rocket_engine.dry_mass",
					"friendly_name": "Dry mass"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket_engine . \nFILTER (?x1 <= 1100.0)\n?x0 :spaceflight.rocket_engine.dry_mass ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 122000000,
		"question": "list volume units greater or equal to 0.00727373 meters cubed.",
		"answer": [
			"Gallon (Scots)",
			"Peck (US)",
			"Cubic mile",
			"Beer barrel (UK)",
			"Bushel (Imperial)",
			"Cubic metre",
			"Peck (Imperial)",
			"Oil barrel",
			"Beer barrel (US)",
			"Cubic kilometer",
			"Hectoliter",
			"Cubic foot",
			"Bushel (US)"
		],
		"function": ">=",
		"commonness": -16.920730397689574,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "measurement_unit.volume_unit",
					"class": "measurement_unit.volume_unit",
					"friendly_name": "Unit Of Volume",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "0.00727373^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "0.00727373",
					"question_node": 0,
					"function": ">="
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "measurement_unit.volume_unit.volume_in_cubic_meters",
					"friendly_name": "Volume In Cubic Meters"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :measurement_unit.volume_unit . \nFILTER (?x1 >= 0.00727373)\n?x0 :measurement_unit.volume_unit.volume_in_cubic_meters ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]