[
	{
		"qid": 85000401,
		"question": "what treatment is used for hiv?",
		"answer": [
			"Lamivudine",
			"Delavirdine",
			"Protease inhibitor",
			"Emtricitabine/Tenofovir",
			"Zidovudine",
			"Efavirenz",
			"Management of HIV/AIDS",
			"Indinavir",
			"Tenofovir",
			"Saquinavir",
			"Enfuvirtide",
			"Amprenavir",
			"Nevirapine",
			"Didanosine",
			"Stavudine",
			"Abacavir",
			"Nelfinavir",
			"Ritonavir",
			"Zalcitabine",
			"Lopinavir",
			"Post-exposure prophylaxis"
		],
		"function": "none",
		"commonness": -10.549659200536258,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.medical_treatment",
					"class": "medicine.medical_treatment",
					"friendly_name": "Medical Treatment",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.aids",
					"class": "medicine.disease",
					"friendly_name": "hiv",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.medical_treatment.used_to_treat",
					"friendly_name": "Used To Treat"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.medical_treatment . \nVALUES ?x1 { :en.aids } \n?x0 :medicine.medical_treatment.used_to_treat ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 85000402,
		"question": "what treatment is used for hiv infection?",
		"answer": [
			"Enfuvirtide",
			"Indinavir",
			"Efavirenz",
			"Lopinavir",
			"Tenofovir",
			"Saquinavir",
			"Nelfinavir",
			"Nevirapine",
			"Stavudine",
			"Management of HIV/AIDS",
			"Lamivudine",
			"Zalcitabine",
			"Post-exposure prophylaxis",
			"Protease inhibitor",
			"Emtricitabine/Tenofovir",
			"Amprenavir",
			"Ritonavir",
			"Didanosine",
			"Delavirdine",
			"Zidovudine",
			"Abacavir"
		],
		"function": "none",
		"commonness": -10.549659200536258,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.medical_treatment",
					"class": "medicine.medical_treatment",
					"friendly_name": "Medical Treatment",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.aids",
					"class": "medicine.disease",
					"friendly_name": "hiv infection",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.medical_treatment.used_to_treat",
					"friendly_name": "Used To Treat"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.medical_treatment . \nVALUES ?x1 { :en.aids } \n?x0 :medicine.medical_treatment.used_to_treat ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 85000500,
		"question": "what treatment targets aids?",
		"answer": [
			"Indinavir",
			"Zidovudine",
			"Nelfinavir",
			"Emtricitabine/Tenofovir",
			"Efavirenz",
			"Amprenavir",
			"Protease inhibitor",
			"Enfuvirtide",
			"Zalcitabine",
			"Post-exposure prophylaxis",
			"Lopinavir",
			"Saquinavir",
			"Abacavir",
			"Ritonavir",
			"Nevirapine",
			"Didanosine",
			"Tenofovir",
			"Delavirdine",
			"Stavudine",
			"Management of HIV/AIDS",
			"Lamivudine"
		],
		"function": "none",
		"commonness": -10.549659200536258,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.medical_treatment",
					"class": "medicine.medical_treatment",
					"friendly_name": "Medical Treatment",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.aids",
					"class": "medicine.disease",
					"friendly_name": "AIDS",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.medical_treatment.used_to_treat",
					"friendly_name": "Used To Treat"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.medical_treatment . \nVALUES ?x1 { :en.aids } \n?x0 :medicine.medical_treatment.used_to_treat ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 85000501,
		"question": "what treatment targets hiv?",
		"answer": [
			"Emtricitabine/Tenofovir",
			"Post-exposure prophylaxis",
			"Lopinavir",
			"Abacavir",
			"Enfuvirtide",
			"Delavirdine",
			"Saquinavir",
			"Management of HIV/AIDS",
			"Indinavir",
			"Protease inhibitor",
			"Ritonavir",
			"Tenofovir",
			"Didanosine",
			"Stavudine",
			"Efavirenz",
			"Nevirapine",
			"Zidovudine",
			"Zalcitabine",
			"Lamivudine",
			"Nelfinavir",
			"Amprenavir"
		],
		"function": "none",
		"commonness": -10.549659200536258,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.medical_treatment",
					"class": "medicine.medical_treatment",
					"friendly_name": "Medical Treatment",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.aids",
					"class": "medicine.disease",
					"friendly_name": "hiv",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.medical_treatment.used_to_treat",
					"friendly_name": "Used To Treat"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.medical_treatment . \nVALUES ?x1 { :en.aids } \n?x0 :medicine.medical_treatment.used_to_treat ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 86000000,
		"question": "which spacecrafts were manufactured by the jet propulsion laboratory?",
		"answer": [
			"Galileo"
		],
		"function": "none",
		"commonness": -15.034740807992804,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.schemastaging.spacecraft_extra",
					"class": "base.schemastaging.spacecraft_extra",
					"friendly_name": "Spacecraft extra",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.jet_propulsion_laboratory",
					"class": "spaceflight.satellite_manufacturer",
					"friendly_name": "Jet Propulsion Laboratory",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.satellite_manufacturer.spacecraft_manufactured",
					"friendly_name": "Spacecraft manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.schemastaging.spacecraft_extra . \nVALUES ?x1 { :en.jet_propulsion_laboratory } \n?x1 :spaceflight.satellite_manufacturer.spacecraft_manufactured ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 86000001,
		"question": "which spacecrafts were manufactured by the jpl?",
		"answer": [
			"Galileo"
		],
		"function": "none",
		"commonness": -15.034740807992804,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.schemastaging.spacecraft_extra",
					"class": "base.schemastaging.spacecraft_extra",
					"friendly_name": "Spacecraft extra",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.jet_propulsion_laboratory",
					"class": "spaceflight.satellite_manufacturer",
					"friendly_name": "jpl",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.satellite_manufacturer.spacecraft_manufactured",
					"friendly_name": "Spacecraft manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.schemastaging.spacecraft_extra . \nVALUES ?x1 { :en.jet_propulsion_laboratory } \n?x1 :spaceflight.satellite_manufacturer.spacecraft_manufactured ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 86000002,
		"question": "which spacecrafts were manufactured by the jet propulsion lab?",
		"answer": [
			"Galileo"
		],
		"function": "none",
		"commonness": -15.034740807992804,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.schemastaging.spacecraft_extra",
					"class": "base.schemastaging.spacecraft_extra",
					"friendly_name": "Spacecraft extra",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.jet_propulsion_laboratory",
					"class": "spaceflight.satellite_manufacturer",
					"friendly_name": "jet propulsion lab",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.satellite_manufacturer.spacecraft_manufactured",
					"friendly_name": "Spacecraft manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.schemastaging.spacecraft_extra . \nVALUES ?x1 { :en.jet_propulsion_laboratory } \n?x1 :spaceflight.satellite_manufacturer.spacecraft_manufactured ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 86000100,
		"question": "the jet propulsion laboratory manufactured which spacecrafts?",
		"answer": [
			"Galileo"
		],
		"function": "none",
		"commonness": -15.034740807992804,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.schemastaging.spacecraft_extra",
					"class": "base.schemastaging.spacecraft_extra",
					"friendly_name": "Spacecraft extra",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.jet_propulsion_laboratory",
					"class": "spaceflight.satellite_manufacturer",
					"friendly_name": "Jet Propulsion Laboratory",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.satellite_manufacturer.spacecraft_manufactured",
					"friendly_name": "Spacecraft manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.schemastaging.spacecraft_extra . \nVALUES ?x1 { :en.jet_propulsion_laboratory } \n?x1 :spaceflight.satellite_manufacturer.spacecraft_manufactured ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 86000101,
		"question": "the jpl manufactured which spacecrafts?",
		"answer": [
			"Galileo"
		],
		"function": "none",
		"commonness": -15.034740807992804,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.schemastaging.spacecraft_extra",
					"class": "base.schemastaging.spacecraft_extra",
					"friendly_name": "Spacecraft extra",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.jet_propulsion_laboratory",
					"class": "spaceflight.satellite_manufacturer",
					"friendly_name": "jpl",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.satellite_manufacturer.spacecraft_manufactured",
					"friendly_name": "Spacecraft manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.schemastaging.spacecraft_extra . \nVALUES ?x1 { :en.jet_propulsion_laboratory } \n?x1 :spaceflight.satellite_manufacturer.spacecraft_manufactured ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 86000102,
		"question": "the jet propulsion lab manufactured which spacecrafts?",
		"answer": [
			"Galileo"
		],
		"function": "none",
		"commonness": -15.034740807992804,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.schemastaging.spacecraft_extra",
					"class": "base.schemastaging.spacecraft_extra",
					"friendly_name": "Spacecraft extra",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.jet_propulsion_laboratory",
					"class": "spaceflight.satellite_manufacturer",
					"friendly_name": "jet propulsion lab",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.satellite_manufacturer.spacecraft_manufactured",
					"friendly_name": "Spacecraft manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.schemastaging.spacecraft_extra . \nVALUES ?x1 { :en.jet_propulsion_laboratory } \n?x1 :spaceflight.satellite_manufacturer.spacecraft_manufactured ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 86000200,
		"question": "what spacecrafts were made at jet propulsion laboratory?",
		"answer": [
			"Galileo"
		],
		"function": "none",
		"commonness": -15.034740807992804,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.schemastaging.spacecraft_extra",
					"class": "base.schemastaging.spacecraft_extra",
					"friendly_name": "Spacecraft extra",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.jet_propulsion_laboratory",
					"class": "spaceflight.satellite_manufacturer",
					"friendly_name": "Jet Propulsion Laboratory",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.satellite_manufacturer.spacecraft_manufactured",
					"friendly_name": "Spacecraft manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.schemastaging.spacecraft_extra . \nVALUES ?x1 { :en.jet_propulsion_laboratory } \n?x1 :spaceflight.satellite_manufacturer.spacecraft_manufactured ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 86000201,
		"question": "what spacecrafts were made at jpl?",
		"answer": [
			"Galileo"
		],
		"function": "none",
		"commonness": -15.034740807992804,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.schemastaging.spacecraft_extra",
					"class": "base.schemastaging.spacecraft_extra",
					"friendly_name": "Spacecraft extra",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.jet_propulsion_laboratory",
					"class": "spaceflight.satellite_manufacturer",
					"friendly_name": "jpl",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.satellite_manufacturer.spacecraft_manufactured",
					"friendly_name": "Spacecraft manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.schemastaging.spacecraft_extra . \nVALUES ?x1 { :en.jet_propulsion_laboratory } \n?x1 :spaceflight.satellite_manufacturer.spacecraft_manufactured ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 86000300,
		"question": "what spacecrafts did the jet propulsion laboratory produce?",
		"answer": [
			"Galileo"
		],
		"function": "none",
		"commonness": -15.034740807992804,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.schemastaging.spacecraft_extra",
					"class": "base.schemastaging.spacecraft_extra",
					"friendly_name": "Spacecraft extra",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.jet_propulsion_laboratory",
					"class": "spaceflight.satellite_manufacturer",
					"friendly_name": "Jet Propulsion Laboratory",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.satellite_manufacturer.spacecraft_manufactured",
					"friendly_name": "Spacecraft manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.schemastaging.spacecraft_extra . \nVALUES ?x1 { :en.jet_propulsion_laboratory } \n?x1 :spaceflight.satellite_manufacturer.spacecraft_manufactured ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 86000301,
		"question": "what spacecrafts did the jpl produce?",
		"answer": [
			"Galileo"
		],
		"function": "none",
		"commonness": -15.034740807992804,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.schemastaging.spacecraft_extra",
					"class": "base.schemastaging.spacecraft_extra",
					"friendly_name": "Spacecraft extra",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.jet_propulsion_laboratory",
					"class": "spaceflight.satellite_manufacturer",
					"friendly_name": "jpl",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.satellite_manufacturer.spacecraft_manufactured",
					"friendly_name": "Spacecraft manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.schemastaging.spacecraft_extra . \nVALUES ?x1 { :en.jet_propulsion_laboratory } \n?x1 :spaceflight.satellite_manufacturer.spacecraft_manufactured ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 86000302,
		"question": "what spacecrafts did the jet propulsion lab produce?",
		"answer": [
			"Galileo"
		],
		"function": "none",
		"commonness": -15.034740807992804,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.schemastaging.spacecraft_extra",
					"class": "base.schemastaging.spacecraft_extra",
					"friendly_name": "Spacecraft extra",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.jet_propulsion_laboratory",
					"class": "spaceflight.satellite_manufacturer",
					"friendly_name": "jet propulsion lab",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.satellite_manufacturer.spacecraft_manufactured",
					"friendly_name": "Spacecraft manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.schemastaging.spacecraft_extra . \nVALUES ?x1 { :en.jet_propulsion_laboratory } \n?x1 :spaceflight.satellite_manufacturer.spacecraft_manufactured ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 86000400,
		"question": "what are the spacecrafts that the jet propulsion laboratory has manufactured?",
		"answer": [
			"Galileo"
		],
		"function": "none",
		"commonness": -15.034740807992804,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.schemastaging.spacecraft_extra",
					"class": "base.schemastaging.spacecraft_extra",
					"friendly_name": "Spacecraft extra",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.jet_propulsion_laboratory",
					"class": "spaceflight.satellite_manufacturer",
					"friendly_name": "Jet Propulsion Laboratory",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.satellite_manufacturer.spacecraft_manufactured",
					"friendly_name": "Spacecraft manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.schemastaging.spacecraft_extra . \nVALUES ?x1 { :en.jet_propulsion_laboratory } \n?x1 :spaceflight.satellite_manufacturer.spacecraft_manufactured ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 86000401,
		"question": "what are the spacecrafts that the jpl has manufactured?",
		"answer": [
			"Galileo"
		],
		"function": "none",
		"commonness": -15.034740807992804,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.schemastaging.spacecraft_extra",
					"class": "base.schemastaging.spacecraft_extra",
					"friendly_name": "Spacecraft extra",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.jet_propulsion_laboratory",
					"class": "spaceflight.satellite_manufacturer",
					"friendly_name": "jpl",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.satellite_manufacturer.spacecraft_manufactured",
					"friendly_name": "Spacecraft manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.schemastaging.spacecraft_extra . \nVALUES ?x1 { :en.jet_propulsion_laboratory } \n?x1 :spaceflight.satellite_manufacturer.spacecraft_manufactured ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 86000402,
		"question": "what are the spacecrafts that the jet propulsion lab has manufactured?",
		"answer": [
			"Galileo"
		],
		"function": "none",
		"commonness": -15.034740807992804,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.schemastaging.spacecraft_extra",
					"class": "base.schemastaging.spacecraft_extra",
					"friendly_name": "Spacecraft extra",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.jet_propulsion_laboratory",
					"class": "spaceflight.satellite_manufacturer",
					"friendly_name": "jet propulsion lab",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.satellite_manufacturer.spacecraft_manufactured",
					"friendly_name": "Spacecraft manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.schemastaging.spacecraft_extra . \nVALUES ?x1 { :en.jet_propulsion_laboratory } \n?x1 :spaceflight.satellite_manufacturer.spacecraft_manufactured ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 87000000,
		"question": "which organization operates the extreme ultraviolet imaging telescope?",
		"answer": [
			"NASA"
		],
		"function": "none",
		"commonness": -16.932916634611672,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.space_agency",
					"class": "spaceflight.space_agency",
					"friendly_name": "Space Agency",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.extreme_ultraviolet_imaging_telescope",
					"class": "base.virtualheliosphericobservatory.instrument",
					"friendly_name": "Extreme ultraviolet Imaging Telescope",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.virtualheliosphericobservatory.instrument.operating_organization",
					"friendly_name": "operating organization"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.space_agency . \nVALUES ?x1 { :en.extreme_ultraviolet_imaging_telescope } \n?x1 :base.virtualheliosphericobservatory.instrument.operating_organization ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 87000001,
		"question": "which organization operates the eit?",
		"answer": [
			"NASA"
		],
		"function": "none",
		"commonness": -16.932916634611672,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.space_agency",
					"class": "spaceflight.space_agency",
					"friendly_name": "Space Agency",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.extreme_ultraviolet_imaging_telescope",
					"class": "base.virtualheliosphericobservatory.instrument",
					"friendly_name": "eit",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.virtualheliosphericobservatory.instrument.operating_organization",
					"friendly_name": "operating organization"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.space_agency . \nVALUES ?x1 { :en.extreme_ultraviolet_imaging_telescope } \n?x1 :base.virtualheliosphericobservatory.instrument.operating_organization ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 87000002,
		"question": "which organization operates the nrl eit?",
		"answer": [
			"NASA"
		],
		"function": "none",
		"commonness": -16.932916634611672,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.space_agency",
					"class": "spaceflight.space_agency",
					"friendly_name": "Space Agency",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.extreme_ultraviolet_imaging_telescope",
					"class": "base.virtualheliosphericobservatory.instrument",
					"friendly_name": "nrl eit",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.virtualheliosphericobservatory.instrument.operating_organization",
					"friendly_name": "operating organization"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.space_agency . \nVALUES ?x1 { :en.extreme_ultraviolet_imaging_telescope } \n?x1 :base.virtualheliosphericobservatory.instrument.operating_organization ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 87000100,
		"question": "the extreme ultraviolet imaging telescope is being operated by whom?",
		"answer": [
			"NASA"
		],
		"function": "none",
		"commonness": -16.932916634611672,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.space_agency",
					"class": "spaceflight.space_agency",
					"friendly_name": "Space Agency",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.extreme_ultraviolet_imaging_telescope",
					"class": "base.virtualheliosphericobservatory.instrument",
					"friendly_name": "Extreme ultraviolet Imaging Telescope",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.virtualheliosphericobservatory.instrument.operating_organization",
					"friendly_name": "operating organization"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.space_agency . \nVALUES ?x1 { :en.extreme_ultraviolet_imaging_telescope } \n?x1 :base.virtualheliosphericobservatory.instrument.operating_organization ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]