[
	{
		"qid": 179000101,
		"question": "which casino has common shows with wynn hotel?",
		"answer": [
			"Encore Las Vegas",
			"The Mirage"
		],
		"function": "none",
		"commonness": -27.209408049585555,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.casinos.casino",
					"class": "base.casinos.casino",
					"friendly_name": "Casino",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.casinos.casino_show",
					"class": "base.casinos.casino_show",
					"friendly_name": "Casino Show",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.wynn_las_vegas",
					"class": "base.casinos.casino",
					"friendly_name": "wynn hotel",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.casinos.casino_show.in_casino",
					"friendly_name": "In casino"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.casinos.casino_show.in_casino",
					"friendly_name": "In casino"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.casinos.casino . \n?x1 :type.object.type :base.casinos.casino_show . \nVALUES ?x2 { :en.wynn_las_vegas } \n?x1 :base.casinos.casino_show.in_casino ?x0 . \n?x1 :base.casinos.casino_show.in_casino ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 179000102,
		"question": "which casino has common shows with the wynn?",
		"answer": [
			"The Mirage",
			"Encore Las Vegas"
		],
		"function": "none",
		"commonness": -27.209408049585555,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.casinos.casino",
					"class": "base.casinos.casino",
					"friendly_name": "Casino",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.casinos.casino_show",
					"class": "base.casinos.casino_show",
					"friendly_name": "Casino Show",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.wynn_las_vegas",
					"class": "base.casinos.casino",
					"friendly_name": "the wynn",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.casinos.casino_show.in_casino",
					"friendly_name": "In casino"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.casinos.casino_show.in_casino",
					"friendly_name": "In casino"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.casinos.casino . \n?x1 :type.object.type :base.casinos.casino_show . \nVALUES ?x2 { :en.wynn_las_vegas } \n?x1 :base.casinos.casino_show.in_casino ?x0 . \n?x1 :base.casinos.casino_show.in_casino ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 179000200,
		"question": "which casino has the same show that is performed in wynn las vegas?",
		"answer": [
			"The Mirage",
			"Encore Las Vegas"
		],
		"function": "none",
		"commonness": -27.209408049585555,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.casinos.casino",
					"class": "base.casinos.casino",
					"friendly_name": "Casino",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.casinos.casino_show",
					"class": "base.casinos.casino_show",
					"friendly_name": "Casino Show",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.wynn_las_vegas",
					"class": "base.casinos.casino",
					"friendly_name": "Wynn Las Vegas",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.casinos.casino_show.in_casino",
					"friendly_name": "In casino"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.casinos.casino_show.in_casino",
					"friendly_name": "In casino"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.casinos.casino . \n?x1 :type.object.type :base.casinos.casino_show . \nVALUES ?x2 { :en.wynn_las_vegas } \n?x1 :base.casinos.casino_show.in_casino ?x0 . \n?x1 :base.casinos.casino_show.in_casino ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 179000201,
		"question": "which casino has the same show that is performed in wynn hotel?",
		"answer": [
			"Encore Las Vegas",
			"The Mirage"
		],
		"function": "none",
		"commonness": -27.209408049585555,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.casinos.casino",
					"class": "base.casinos.casino",
					"friendly_name": "Casino",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.casinos.casino_show",
					"class": "base.casinos.casino_show",
					"friendly_name": "Casino Show",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.wynn_las_vegas",
					"class": "base.casinos.casino",
					"friendly_name": "wynn hotel",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.casinos.casino_show.in_casino",
					"friendly_name": "In casino"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.casinos.casino_show.in_casino",
					"friendly_name": "In casino"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.casinos.casino . \n?x1 :type.object.type :base.casinos.casino_show . \nVALUES ?x2 { :en.wynn_las_vegas } \n?x1 :base.casinos.casino_show.in_casino ?x0 . \n?x1 :base.casinos.casino_show.in_casino ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 179000202,
		"question": "which casino has the same show that is performed in the wynn?",
		"answer": [
			"Encore Las Vegas",
			"The Mirage"
		],
		"function": "none",
		"commonness": -27.209408049585555,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.casinos.casino",
					"class": "base.casinos.casino",
					"friendly_name": "Casino",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.casinos.casino_show",
					"class": "base.casinos.casino_show",
					"friendly_name": "Casino Show",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.wynn_las_vegas",
					"class": "base.casinos.casino",
					"friendly_name": "the wynn",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.casinos.casino_show.in_casino",
					"friendly_name": "In casino"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.casinos.casino_show.in_casino",
					"friendly_name": "In casino"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.casinos.casino . \n?x1 :type.object.type :base.casinos.casino_show . \nVALUES ?x2 { :en.wynn_las_vegas } \n?x1 :base.casinos.casino_show.in_casino ?x0 . \n?x1 :base.casinos.casino_show.in_casino ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 179000300,
		"question": "wynn las vegas has a show that is also in which casino?",
		"answer": [
			"The Mirage",
			"Encore Las Vegas"
		],
		"function": "none",
		"commonness": -27.209408049585555,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.casinos.casino",
					"class": "base.casinos.casino",
					"friendly_name": "Casino",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.casinos.casino_show",
					"class": "base.casinos.casino_show",
					"friendly_name": "Casino Show",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.wynn_las_vegas",
					"class": "base.casinos.casino",
					"friendly_name": "Wynn Las Vegas",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.casinos.casino_show.in_casino",
					"friendly_name": "In casino"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.casinos.casino_show.in_casino",
					"friendly_name": "In casino"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.casinos.casino . \n?x1 :type.object.type :base.casinos.casino_show . \nVALUES ?x2 { :en.wynn_las_vegas } \n?x1 :base.casinos.casino_show.in_casino ?x0 . \n?x1 :base.casinos.casino_show.in_casino ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 179000301,
		"question": "wynn hotel has a show that is also in which casino?",
		"answer": [
			"Encore Las Vegas",
			"The Mirage"
		],
		"function": "none",
		"commonness": -27.209408049585555,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.casinos.casino",
					"class": "base.casinos.casino",
					"friendly_name": "Casino",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.casinos.casino_show",
					"class": "base.casinos.casino_show",
					"friendly_name": "Casino Show",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.wynn_las_vegas",
					"class": "base.casinos.casino",
					"friendly_name": "wynn hotel",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.casinos.casino_show.in_casino",
					"friendly_name": "In casino"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.casinos.casino_show.in_casino",
					"friendly_name": "In casino"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.casinos.casino . \n?x1 :type.object.type :base.casinos.casino_show . \nVALUES ?x2 { :en.wynn_las_vegas } \n?x1 :base.casinos.casino_show.in_casino ?x0 . \n?x1 :base.casinos.casino_show.in_casino ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 179000302,
		"question": "the wynn has a show that is also in which casino?",
		"answer": [
			"The Mirage",
			"Encore Las Vegas"
		],
		"function": "none",
		"commonness": -27.209408049585555,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.casinos.casino",
					"class": "base.casinos.casino",
					"friendly_name": "Casino",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.casinos.casino_show",
					"class": "base.casinos.casino_show",
					"friendly_name": "Casino Show",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.wynn_las_vegas",
					"class": "base.casinos.casino",
					"friendly_name": "the wynn",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.casinos.casino_show.in_casino",
					"friendly_name": "In casino"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.casinos.casino_show.in_casino",
					"friendly_name": "In casino"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.casinos.casino . \n?x1 :type.object.type :base.casinos.casino_show . \nVALUES ?x2 { :en.wynn_las_vegas } \n?x1 :base.casinos.casino_show.in_casino ?x0 . \n?x1 :base.casinos.casino_show.in_casino ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 179000401,
		"question": "which casino has a show that is also in wynn hotel?",
		"answer": [
			"Encore Las Vegas",
			"The Mirage"
		],
		"function": "none",
		"commonness": -27.209408049585555,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.casinos.casino",
					"class": "base.casinos.casino",
					"friendly_name": "Casino",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.casinos.casino_show",
					"class": "base.casinos.casino_show",
					"friendly_name": "Casino Show",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.wynn_las_vegas",
					"class": "base.casinos.casino",
					"friendly_name": "wynn hotel",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.casinos.casino_show.in_casino",
					"friendly_name": "In casino"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.casinos.casino_show.in_casino",
					"friendly_name": "In casino"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.casinos.casino . \n?x1 :type.object.type :base.casinos.casino_show . \nVALUES ?x2 { :en.wynn_las_vegas } \n?x1 :base.casinos.casino_show.in_casino ?x0 . \n?x1 :base.casinos.casino_show.in_casino ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 179000402,
		"question": "which casino has a show that is also in the wynn?",
		"answer": [
			"The Mirage",
			"Encore Las Vegas"
		],
		"function": "none",
		"commonness": -27.209408049585555,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.casinos.casino",
					"class": "base.casinos.casino",
					"friendly_name": "Casino",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.casinos.casino_show",
					"class": "base.casinos.casino_show",
					"friendly_name": "Casino Show",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.wynn_las_vegas",
					"class": "base.casinos.casino",
					"friendly_name": "the wynn",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.casinos.casino_show.in_casino",
					"friendly_name": "In casino"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.casinos.casino_show.in_casino",
					"friendly_name": "In casino"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.casinos.casino . \n?x1 :type.object.type :base.casinos.casino_show . \nVALUES ?x2 { :en.wynn_las_vegas } \n?x1 :base.casinos.casino_show.in_casino ?x0 . \n?x1 :base.casinos.casino_show.in_casino ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 180000000,
		"question": "glen johnson played for which team in the 2010 world cup?",
		"answer": [
			"England national football team"
		],
		"function": "none",
		"commonness": -21.452641541924372,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.x2010fifaworldcupsouthafrica.world_cup_squad",
					"class": "base.x2010fifaworldcupsouthafrica.world_cup_squad",
					"friendly_name": "2010 FIFA World Cup Team",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.x2010fifaworldcupsouthafrica.current_world_cup_squad",
					"class": "base.x2010fifaworldcupsouthafrica.current_world_cup_squad",
					"friendly_name": "World Cup Squad",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.glen_johnson",
					"class": "base.x2010fifaworldcupsouthafrica.world_cup_participant",
					"friendly_name": "Glen Johnson",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.x2010fifaworldcupsouthafrica.world_cup_squad.current_world_cup_squad",
					"friendly_name": "World Cup squad"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "base.x2010fifaworldcupsouthafrica.world_cup_participant.world_cup_team",
					"friendly_name": "World Cup Team"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.x2010fifaworldcupsouthafrica.world_cup_squad . \n?x1 :type.object.type :base.x2010fifaworldcupsouthafrica.current_world_cup_squad . \nVALUES ?x2 { :en.glen_johnson } \n?x0 :base.x2010fifaworldcupsouthafrica.world_cup_squad.current_world_cup_squad ?x1 . \n?x2 :base.x2010fifaworldcupsouthafrica.world_cup_participant.world_cup_team ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 180000001,
		"question": "glen mcleod cooper johnson played for which team in the 2010 world cup?",
		"answer": [
			"England national football team"
		],
		"function": "none",
		"commonness": -21.452641541924372,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.x2010fifaworldcupsouthafrica.world_cup_squad",
					"class": "base.x2010fifaworldcupsouthafrica.world_cup_squad",
					"friendly_name": "2010 FIFA World Cup Team",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.x2010fifaworldcupsouthafrica.current_world_cup_squad",
					"class": "base.x2010fifaworldcupsouthafrica.current_world_cup_squad",
					"friendly_name": "World Cup Squad",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.glen_johnson",
					"class": "base.x2010fifaworldcupsouthafrica.world_cup_participant",
					"friendly_name": "glen mcleod cooper johnson",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.x2010fifaworldcupsouthafrica.world_cup_squad.current_world_cup_squad",
					"friendly_name": "World Cup squad"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "base.x2010fifaworldcupsouthafrica.world_cup_participant.world_cup_team",
					"friendly_name": "World Cup Team"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.x2010fifaworldcupsouthafrica.world_cup_squad . \n?x1 :type.object.type :base.x2010fifaworldcupsouthafrica.current_world_cup_squad . \nVALUES ?x2 { :en.glen_johnson } \n?x0 :base.x2010fifaworldcupsouthafrica.world_cup_squad.current_world_cup_squad ?x1 . \n?x2 :base.x2010fifaworldcupsouthafrica.world_cup_participant.world_cup_team ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 180000100,
		"question": "which team was glen johnson playing for in 2010 world cup?",
		"answer": [
			"England national football team"
		],
		"function": "none",
		"commonness": -21.452641541924372,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.x2010fifaworldcupsouthafrica.world_cup_squad",
					"class": "base.x2010fifaworldcupsouthafrica.world_cup_squad",
					"friendly_name": "2010 FIFA World Cup Team",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.x2010fifaworldcupsouthafrica.current_world_cup_squad",
					"class": "base.x2010fifaworldcupsouthafrica.current_world_cup_squad",
					"friendly_name": "World Cup Squad",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.glen_johnson",
					"class": "base.x2010fifaworldcupsouthafrica.world_cup_participant",
					"friendly_name": "Glen Johnson",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.x2010fifaworldcupsouthafrica.world_cup_squad.current_world_cup_squad",
					"friendly_name": "World Cup squad"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "base.x2010fifaworldcupsouthafrica.world_cup_participant.world_cup_team",
					"friendly_name": "World Cup Team"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.x2010fifaworldcupsouthafrica.world_cup_squad . \n?x1 :type.object.type :base.x2010fifaworldcupsouthafrica.current_world_cup_squad . \nVALUES ?x2 { :en.glen_johnson } \n?x0 :base.x2010fifaworldcupsouthafrica.world_cup_squad.current_world_cup_squad ?x1 . \n?x2 :base.x2010fifaworldcupsouthafrica.world_cup_participant.world_cup_team ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 180000101,
		"question": "which team was glen mcleod cooper johnson playing for in 2010 world cup?",
		"answer": [
			"England national football team"
		],
		"function": "none",
		"commonness": -21.452641541924372,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.x2010fifaworldcupsouthafrica.world_cup_squad",
					"class": "base.x2010fifaworldcupsouthafrica.world_cup_squad",
					"friendly_name": "2010 FIFA World Cup Team",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.x2010fifaworldcupsouthafrica.current_world_cup_squad",
					"class": "base.x2010fifaworldcupsouthafrica.current_world_cup_squad",
					"friendly_name": "World Cup Squad",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.glen_johnson",
					"class": "base.x2010fifaworldcupsouthafrica.world_cup_participant",
					"friendly_name": "glen mcleod cooper johnson",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.x2010fifaworldcupsouthafrica.world_cup_squad.current_world_cup_squad",
					"friendly_name": "World Cup squad"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "base.x2010fifaworldcupsouthafrica.world_cup_participant.world_cup_team",
					"friendly_name": "World Cup Team"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.x2010fifaworldcupsouthafrica.world_cup_squad . \n?x1 :type.object.type :base.x2010fifaworldcupsouthafrica.current_world_cup_squad . \nVALUES ?x2 { :en.glen_johnson } \n?x0 :base.x2010fifaworldcupsouthafrica.world_cup_squad.current_world_cup_squad ?x1 . \n?x2 :base.x2010fifaworldcupsouthafrica.world_cup_participant.world_cup_team ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 180000200,
		"question": "who did glen johnson play for in the 2010 world cup?",
		"answer": [
			"England national football team"
		],
		"function": "none",
		"commonness": -21.452641541924372,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.x2010fifaworldcupsouthafrica.world_cup_squad",
					"class": "base.x2010fifaworldcupsouthafrica.world_cup_squad",
					"friendly_name": "2010 FIFA World Cup Team",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.x2010fifaworldcupsouthafrica.current_world_cup_squad",
					"class": "base.x2010fifaworldcupsouthafrica.current_world_cup_squad",
					"friendly_name": "World Cup Squad",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.glen_johnson",
					"class": "base.x2010fifaworldcupsouthafrica.world_cup_participant",
					"friendly_name": "Glen Johnson",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.x2010fifaworldcupsouthafrica.world_cup_squad.current_world_cup_squad",
					"friendly_name": "World Cup squad"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "base.x2010fifaworldcupsouthafrica.world_cup_participant.world_cup_team",
					"friendly_name": "World Cup Team"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.x2010fifaworldcupsouthafrica.world_cup_squad . \n?x1 :type.object.type :base.x2010fifaworldcupsouthafrica.current_world_cup_squad . \nVALUES ?x2 { :en.glen_johnson } \n?x0 :base.x2010fifaworldcupsouthafrica.world_cup_squad.current_world_cup_squad ?x1 . \n?x2 :base.x2010fifaworldcupsouthafrica.world_cup_participant.world_cup_team ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 180000201,
		"question": "who did glen mcleod cooper johnson play for in the 2010 world cup?",
		"answer": [
			"England national football team"
		],
		"function": "none",
		"commonness": -21.452641541924372,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.x2010fifaworldcupsouthafrica.world_cup_squad",
					"class": "base.x2010fifaworldcupsouthafrica.world_cup_squad",
					"friendly_name": "2010 FIFA World Cup Team",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.x2010fifaworldcupsouthafrica.current_world_cup_squad",
					"class": "base.x2010fifaworldcupsouthafrica.current_world_cup_squad",
					"friendly_name": "World Cup Squad",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.glen_johnson",
					"class": "base.x2010fifaworldcupsouthafrica.world_cup_participant",
					"friendly_name": "glen mcleod cooper johnson",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.x2010fifaworldcupsouthafrica.world_cup_squad.current_world_cup_squad",
					"friendly_name": "World Cup squad"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "base.x2010fifaworldcupsouthafrica.world_cup_participant.world_cup_team",
					"friendly_name": "World Cup Team"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.x2010fifaworldcupsouthafrica.world_cup_squad . \n?x1 :type.object.type :base.x2010fifaworldcupsouthafrica.current_world_cup_squad . \nVALUES ?x2 { :en.glen_johnson } \n?x0 :base.x2010fifaworldcupsouthafrica.world_cup_squad.current_world_cup_squad ?x1 . \n?x2 :base.x2010fifaworldcupsouthafrica.world_cup_participant.world_cup_team ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	}
]