[
	{
		"qid": 213000300,
		"question": "in the united states of america how many american football players are also a presenter?",
		"answer": [
			"7"
		],
		"function": "count",
		"commonness": -15.490562875524642,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "american_football.football_player",
					"class": "american_football.football_player",
					"friendly_name": "American football player",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.country",
					"friendly_name": "United States of America",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.presenter",
					"class": "people.profession",
					"friendly_name": "Presenter",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.nationality",
					"friendly_name": "Country of nationality"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "people.person.profession",
					"friendly_name": "Profession"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :american_football.football_player . \nVALUES ?x1 { :en.united_states_of_america } \nVALUES ?x2 { :en.presenter } \n?x0 :people.person.nationality ?x1 . \n?x0 :people.person.profession ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 213000301,
		"question": "in the us how many american football players are also a presenter?",
		"answer": [
			"7"
		],
		"function": "count",
		"commonness": -15.490562875524642,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "american_football.football_player",
					"class": "american_football.football_player",
					"friendly_name": "American football player",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.country",
					"friendly_name": "us",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.presenter",
					"class": "people.profession",
					"friendly_name": "Presenter",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.nationality",
					"friendly_name": "Country of nationality"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "people.person.profession",
					"friendly_name": "Profession"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :american_football.football_player . \nVALUES ?x1 { :en.united_states_of_america } \nVALUES ?x2 { :en.presenter } \n?x0 :people.person.nationality ?x1 . \n?x0 :people.person.profession ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 213000302,
		"question": "in the united states how many american football players are also a presenter?",
		"answer": [
			"7"
		],
		"function": "count",
		"commonness": -15.490562875524642,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "american_football.football_player",
					"class": "american_football.football_player",
					"friendly_name": "American football player",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.country",
					"friendly_name": "united states",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.presenter",
					"class": "people.profession",
					"friendly_name": "Presenter",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.nationality",
					"friendly_name": "Country of nationality"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "people.person.profession",
					"friendly_name": "Profession"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :american_football.football_player . \nVALUES ?x1 { :en.united_states_of_america } \nVALUES ?x2 { :en.presenter } \n?x0 :people.person.nationality ?x1 . \n?x0 :people.person.profession ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 214000000,
		"question": "the isotope with the greatest magnetic moment has what particle spin?",
		"answer": [
			"9/2+"
		],
		"function": "argmax",
		"commonness": -32.8158704005543,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "chemistry.particle_spin",
					"class": "chemistry.particle_spin",
					"friendly_name": "Particle spin",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "chemistry.isotope",
					"class": "chemistry.isotope",
					"friendly_name": "Isotope",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "3.2197^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "3.2197",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "chemistry.particle_spin.isotopes",
					"friendly_name": "Isotopes"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "chemistry.isotope.magnetic_moment",
					"friendly_name": "Magnetic moment"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :chemistry.particle_spin . \n?x1 :type.object.type :chemistry.isotope . \n{\nSELECT (MAX(?y2) AS ?x2)  WHERE { \n?y0 :type.object.type :chemistry.particle_spin . \n?y1 :type.object.type :chemistry.isotope . \n?y0 :chemistry.particle_spin.isotopes ?y1 . \n?y1 :chemistry.isotope.magnetic_moment ?y2 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y1 != ?y2  )\n}\n}\n?x0 :chemistry.particle_spin.isotopes ?x1 . \n?x1 :chemistry.isotope.magnetic_moment ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 214000100,
		"question": "what particle spin does the isotope with the largest magnetic moment have?",
		"answer": [
			"9/2+"
		],
		"function": "argmax",
		"commonness": -32.8158704005543,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "chemistry.particle_spin",
					"class": "chemistry.particle_spin",
					"friendly_name": "Particle spin",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "chemistry.isotope",
					"class": "chemistry.isotope",
					"friendly_name": "Isotope",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "3.2197^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "3.2197",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "chemistry.particle_spin.isotopes",
					"friendly_name": "Isotopes"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "chemistry.isotope.magnetic_moment",
					"friendly_name": "Magnetic moment"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :chemistry.particle_spin . \n?x1 :type.object.type :chemistry.isotope . \n{\nSELECT (MAX(?y2) AS ?x2)  WHERE { \n?y0 :type.object.type :chemistry.particle_spin . \n?y1 :type.object.type :chemistry.isotope . \n?y0 :chemistry.particle_spin.isotopes ?y1 . \n?y1 :chemistry.isotope.magnetic_moment ?y2 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y1 != ?y2  )\n}\n}\n?x0 :chemistry.particle_spin.isotopes ?x1 . \n?x1 :chemistry.isotope.magnetic_moment ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 214000300,
		"question": "the isotope possessing the biggest magnetic moment has what particle spin?",
		"answer": [
			"9/2+"
		],
		"function": "argmax",
		"commonness": -32.8158704005543,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "chemistry.particle_spin",
					"class": "chemistry.particle_spin",
					"friendly_name": "Particle spin",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "chemistry.isotope",
					"class": "chemistry.isotope",
					"friendly_name": "Isotope",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "literal",
					"id": "3.2197^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "3.2197",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "chemistry.particle_spin.isotopes",
					"friendly_name": "Isotopes"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "chemistry.isotope.magnetic_moment",
					"friendly_name": "Magnetic moment"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :chemistry.particle_spin . \n?x1 :type.object.type :chemistry.isotope . \n{\nSELECT (MAX(?y2) AS ?x2)  WHERE { \n?y0 :type.object.type :chemistry.particle_spin . \n?y1 :type.object.type :chemistry.isotope . \n?y0 :chemistry.particle_spin.isotopes ?y1 . \n?y1 :chemistry.isotope.magnetic_moment ?y2 . \nFILTER ( ?y0 != ?y1 && ?y0 != ?y2 && ?y1 != ?y2  )\n}\n}\n?x0 :chemistry.particle_spin.isotopes ?x1 . \n?x1 :chemistry.isotope.magnetic_moment ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 215000000,
		"question": "how many other medical trials are also funded by the sponsor of the physicians' health study?",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -34.34327748361274,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.medical_trial",
					"class": "medicine.medical_trial",
					"friendly_name": "Medical trial",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "medicine.medical_trial_sponsor",
					"class": "medicine.medical_trial_sponsor",
					"friendly_name": "Medical trial sponsor",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.physicians_health_study",
					"class": "medicine.medical_trial",
					"friendly_name": "Physicians' Health Study",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.medical_trial.sponsor",
					"friendly_name": "Sponsor"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "medicine.medical_trial_sponsor.trials_sponsored",
					"friendly_name": "Trials sponsored"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.medical_trial . \n?x1 :type.object.type :medicine.medical_trial_sponsor . \nVALUES ?x2 { :en.physicians_health_study } \n?x0 :medicine.medical_trial.sponsor ?x1 . \n?x1 :medicine.medical_trial_sponsor.trials_sponsored ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 215000001,
		"question": "how many other medical trials are also funded by the sponsor of the phs?",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -34.34327748361274,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.medical_trial",
					"class": "medicine.medical_trial",
					"friendly_name": "Medical trial",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "medicine.medical_trial_sponsor",
					"class": "medicine.medical_trial_sponsor",
					"friendly_name": "Medical trial sponsor",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.physicians_health_study",
					"class": "medicine.medical_trial",
					"friendly_name": "phs",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.medical_trial.sponsor",
					"friendly_name": "Sponsor"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "medicine.medical_trial_sponsor.trials_sponsored",
					"friendly_name": "Trials sponsored"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.medical_trial . \n?x1 :type.object.type :medicine.medical_trial_sponsor . \nVALUES ?x2 { :en.physicians_health_study } \n?x0 :medicine.medical_trial.sponsor ?x1 . \n?x1 :medicine.medical_trial_sponsor.trials_sponsored ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 215000100,
		"question": "what medical trails have sponsors in common with physicians' health study?",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -34.34327748361274,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.medical_trial",
					"class": "medicine.medical_trial",
					"friendly_name": "Medical trial",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "medicine.medical_trial_sponsor",
					"class": "medicine.medical_trial_sponsor",
					"friendly_name": "Medical trial sponsor",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.physicians_health_study",
					"class": "medicine.medical_trial",
					"friendly_name": "Physicians' Health Study",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.medical_trial.sponsor",
					"friendly_name": "Sponsor"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "medicine.medical_trial_sponsor.trials_sponsored",
					"friendly_name": "Trials sponsored"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.medical_trial . \n?x1 :type.object.type :medicine.medical_trial_sponsor . \nVALUES ?x2 { :en.physicians_health_study } \n?x0 :medicine.medical_trial.sponsor ?x1 . \n?x1 :medicine.medical_trial_sponsor.trials_sponsored ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 215000101,
		"question": "what medical trails have sponsors in common with phs?",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -34.34327748361274,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.medical_trial",
					"class": "medicine.medical_trial",
					"friendly_name": "Medical trial",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "medicine.medical_trial_sponsor",
					"class": "medicine.medical_trial_sponsor",
					"friendly_name": "Medical trial sponsor",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.physicians_health_study",
					"class": "medicine.medical_trial",
					"friendly_name": "phs",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.medical_trial.sponsor",
					"friendly_name": "Sponsor"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "medicine.medical_trial_sponsor.trials_sponsored",
					"friendly_name": "Trials sponsored"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.medical_trial . \n?x1 :type.object.type :medicine.medical_trial_sponsor . \nVALUES ?x2 { :en.physicians_health_study } \n?x0 :medicine.medical_trial.sponsor ?x1 . \n?x1 :medicine.medical_trial_sponsor.trials_sponsored ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 215000200,
		"question": "how many medical trials have common sponsors with physicians' health study?",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -34.34327748361274,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.medical_trial",
					"class": "medicine.medical_trial",
					"friendly_name": "Medical trial",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "medicine.medical_trial_sponsor",
					"class": "medicine.medical_trial_sponsor",
					"friendly_name": "Medical trial sponsor",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.physicians_health_study",
					"class": "medicine.medical_trial",
					"friendly_name": "Physicians' Health Study",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.medical_trial.sponsor",
					"friendly_name": "Sponsor"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "medicine.medical_trial_sponsor.trials_sponsored",
					"friendly_name": "Trials sponsored"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.medical_trial . \n?x1 :type.object.type :medicine.medical_trial_sponsor . \nVALUES ?x2 { :en.physicians_health_study } \n?x0 :medicine.medical_trial.sponsor ?x1 . \n?x1 :medicine.medical_trial_sponsor.trials_sponsored ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 215000201,
		"question": "how many medical trials have common sponsors with phs?",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -34.34327748361274,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.medical_trial",
					"class": "medicine.medical_trial",
					"friendly_name": "Medical trial",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "medicine.medical_trial_sponsor",
					"class": "medicine.medical_trial_sponsor",
					"friendly_name": "Medical trial sponsor",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.physicians_health_study",
					"class": "medicine.medical_trial",
					"friendly_name": "phs",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.medical_trial.sponsor",
					"friendly_name": "Sponsor"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "medicine.medical_trial_sponsor.trials_sponsored",
					"friendly_name": "Trials sponsored"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.medical_trial . \n?x1 :type.object.type :medicine.medical_trial_sponsor . \nVALUES ?x2 { :en.physicians_health_study } \n?x0 :medicine.medical_trial.sponsor ?x1 . \n?x1 :medicine.medical_trial_sponsor.trials_sponsored ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 215000300,
		"question": "how many medical trials are supported by a sponsor who also provides funding for the physicians' health study?",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -34.34327748361274,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.medical_trial",
					"class": "medicine.medical_trial",
					"friendly_name": "Medical trial",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "medicine.medical_trial_sponsor",
					"class": "medicine.medical_trial_sponsor",
					"friendly_name": "Medical trial sponsor",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.physicians_health_study",
					"class": "medicine.medical_trial",
					"friendly_name": "Physicians' Health Study",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.medical_trial.sponsor",
					"friendly_name": "Sponsor"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "medicine.medical_trial_sponsor.trials_sponsored",
					"friendly_name": "Trials sponsored"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.medical_trial . \n?x1 :type.object.type :medicine.medical_trial_sponsor . \nVALUES ?x2 { :en.physicians_health_study } \n?x0 :medicine.medical_trial.sponsor ?x1 . \n?x1 :medicine.medical_trial_sponsor.trials_sponsored ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 215000301,
		"question": "how many medical trials are supported by a sponsor who also provides funding for the phs?",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -34.34327748361274,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "medicine.medical_trial",
					"class": "medicine.medical_trial",
					"friendly_name": "Medical trial",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "medicine.medical_trial_sponsor",
					"class": "medicine.medical_trial_sponsor",
					"friendly_name": "Medical trial sponsor",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.physicians_health_study",
					"class": "medicine.medical_trial",
					"friendly_name": "phs",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "medicine.medical_trial.sponsor",
					"friendly_name": "Sponsor"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "medicine.medical_trial_sponsor.trials_sponsored",
					"friendly_name": "Trials sponsored"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :medicine.medical_trial . \n?x1 :type.object.type :medicine.medical_trial_sponsor . \nVALUES ?x2 { :en.physicians_health_study } \n?x0 :medicine.medical_trial.sponsor ?x1 . \n?x1 :medicine.medical_trial_sponsor.trials_sponsored ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 216000000,
		"question": "how many tv stations are controlled by the company that owns msnbc?",
		"answer": [
			"29"
		],
		"function": "count",
		"commonness": -22.171230393929925,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "broadcast.tv_station",
					"class": "broadcast.tv_station",
					"friendly_name": "TV Station",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "broadcast.tv_station_owner",
					"class": "broadcast.tv_station_owner",
					"friendly_name": "TV station owner",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.msnbc",
					"class": "broadcast.tv_station",
					"friendly_name": "MSNBC",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.tv_station.owner",
					"friendly_name": "Owner"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "broadcast.tv_station_owner.tv_stations",
					"friendly_name": "TV stations owned"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :broadcast.tv_station . \n?x1 :type.object.type :broadcast.tv_station_owner . \nVALUES ?x2 { :en.msnbc } \n?x0 :broadcast.tv_station.owner ?x1 . \n?x1 :broadcast.tv_station_owner.tv_stations ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 216000001,
		"question": "how many tv stations are controlled by the company that owns msnbc tv?",
		"answer": [
			"29"
		],
		"function": "count",
		"commonness": -22.171230393929925,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "broadcast.tv_station",
					"class": "broadcast.tv_station",
					"friendly_name": "TV Station",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "broadcast.tv_station_owner",
					"class": "broadcast.tv_station_owner",
					"friendly_name": "TV station owner",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.msnbc",
					"class": "broadcast.tv_station",
					"friendly_name": "msnbc tv",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.tv_station.owner",
					"friendly_name": "Owner"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "broadcast.tv_station_owner.tv_stations",
					"friendly_name": "TV stations owned"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :broadcast.tv_station . \n?x1 :type.object.type :broadcast.tv_station_owner . \nVALUES ?x2 { :en.msnbc } \n?x0 :broadcast.tv_station.owner ?x1 . \n?x1 :broadcast.tv_station_owner.tv_stations ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 216000100,
		"question": "how many tv stations does the owner of msnbc possess?",
		"answer": [
			"29"
		],
		"function": "count",
		"commonness": -22.171230393929925,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "broadcast.tv_station",
					"class": "broadcast.tv_station",
					"friendly_name": "TV Station",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "broadcast.tv_station_owner",
					"class": "broadcast.tv_station_owner",
					"friendly_name": "TV station owner",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.msnbc",
					"class": "broadcast.tv_station",
					"friendly_name": "MSNBC",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.tv_station.owner",
					"friendly_name": "Owner"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "broadcast.tv_station_owner.tv_stations",
					"friendly_name": "TV stations owned"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :broadcast.tv_station . \n?x1 :type.object.type :broadcast.tv_station_owner . \nVALUES ?x2 { :en.msnbc } \n?x0 :broadcast.tv_station.owner ?x1 . \n?x1 :broadcast.tv_station_owner.tv_stations ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	}
]