[
	{
		"qid": 240000101,
		"question": "what are the cereal grains in challah that people on gluten free are not allowed to eat?",
		"answer": [
			"Wheat"
		],
		"function": "none",
		"commonness": -39.47646987193651,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.cerealgrains.cereal_grain",
					"class": "base.cerealgrains.cereal_grain",
					"friendly_name": "Cereal Grain",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.challah",
					"class": "food.dish",
					"friendly_name": "Challah",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "food.ingredient",
					"class": "food.ingredient",
					"friendly_name": "Ingredient",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.gluten-free_diet",
					"class": "food.dietary_restriction",
					"friendly_name": "gluten free",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.cerealgrains.cereal_grain.produced_into_breads",
					"friendly_name": "Produced into breads"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.cerealgrains.cereal_grain.milled_into",
					"friendly_name": "milled into"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "food.dietary_restriction.incompatible_ingredients",
					"friendly_name": "Incompatible ingredients"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.cerealgrains.cereal_grain . \nVALUES ?x1 { :en.challah } \n?x2 :type.object.type :food.ingredient . \nVALUES ?x3 { :en.gluten-free_diet } \n?x0 :base.cerealgrains.cereal_grain.produced_into_breads ?x1 . \n?x0 :base.cerealgrains.cereal_grain.milled_into ?x2 . \n?x3 :food.dietary_restriction.incompatible_ingredients ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 240000200,
		"question": "what cereal grain can be used to produce challah, and people on gluten-free diet could not eat?",
		"answer": [
			"Wheat"
		],
		"function": "none",
		"commonness": -39.47646987193651,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.cerealgrains.cereal_grain",
					"class": "base.cerealgrains.cereal_grain",
					"friendly_name": "Cereal Grain",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.challah",
					"class": "food.dish",
					"friendly_name": "Challah",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "food.ingredient",
					"class": "food.ingredient",
					"friendly_name": "Ingredient",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.gluten-free_diet",
					"class": "food.dietary_restriction",
					"friendly_name": "Gluten-free diet",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.cerealgrains.cereal_grain.produced_into_breads",
					"friendly_name": "Produced into breads"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.cerealgrains.cereal_grain.milled_into",
					"friendly_name": "milled into"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "food.dietary_restriction.incompatible_ingredients",
					"friendly_name": "Incompatible ingredients"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.cerealgrains.cereal_grain . \nVALUES ?x1 { :en.challah } \n?x2 :type.object.type :food.ingredient . \nVALUES ?x3 { :en.gluten-free_diet } \n?x0 :base.cerealgrains.cereal_grain.produced_into_breads ?x1 . \n?x0 :base.cerealgrains.cereal_grain.milled_into ?x2 . \n?x3 :food.dietary_restriction.incompatible_ingredients ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 240000201,
		"question": "what cereal grain can be used to produce challah, and people on gluten free could not eat?",
		"answer": [
			"Wheat"
		],
		"function": "none",
		"commonness": -39.47646987193651,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.cerealgrains.cereal_grain",
					"class": "base.cerealgrains.cereal_grain",
					"friendly_name": "Cereal Grain",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.challah",
					"class": "food.dish",
					"friendly_name": "Challah",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "food.ingredient",
					"class": "food.ingredient",
					"friendly_name": "Ingredient",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.gluten-free_diet",
					"class": "food.dietary_restriction",
					"friendly_name": "gluten free",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.cerealgrains.cereal_grain.produced_into_breads",
					"friendly_name": "Produced into breads"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.cerealgrains.cereal_grain.milled_into",
					"friendly_name": "milled into"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "food.dietary_restriction.incompatible_ingredients",
					"friendly_name": "Incompatible ingredients"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.cerealgrains.cereal_grain . \nVALUES ?x1 { :en.challah } \n?x2 :type.object.type :food.ingredient . \nVALUES ?x3 { :en.gluten-free_diet } \n?x0 :base.cerealgrains.cereal_grain.produced_into_breads ?x1 . \n?x0 :base.cerealgrains.cereal_grain.milled_into ?x2 . \n?x3 :food.dietary_restriction.incompatible_ingredients ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 240000300,
		"question": "which cereal grain which can be utilized for making challah is unable to be consumed by those on a gluten-free diet?",
		"answer": [
			"Wheat"
		],
		"function": "none",
		"commonness": -39.47646987193651,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.cerealgrains.cereal_grain",
					"class": "base.cerealgrains.cereal_grain",
					"friendly_name": "Cereal Grain",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.challah",
					"class": "food.dish",
					"friendly_name": "Challah",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "food.ingredient",
					"class": "food.ingredient",
					"friendly_name": "Ingredient",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.gluten-free_diet",
					"class": "food.dietary_restriction",
					"friendly_name": "Gluten-free diet",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.cerealgrains.cereal_grain.produced_into_breads",
					"friendly_name": "Produced into breads"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.cerealgrains.cereal_grain.milled_into",
					"friendly_name": "milled into"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "food.dietary_restriction.incompatible_ingredients",
					"friendly_name": "Incompatible ingredients"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.cerealgrains.cereal_grain . \nVALUES ?x1 { :en.challah } \n?x2 :type.object.type :food.ingredient . \nVALUES ?x3 { :en.gluten-free_diet } \n?x0 :base.cerealgrains.cereal_grain.produced_into_breads ?x1 . \n?x0 :base.cerealgrains.cereal_grain.milled_into ?x2 . \n?x3 :food.dietary_restriction.incompatible_ingredients ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 240000301,
		"question": "which cereal grain which can be utilized for making challah is unable to be consumed by those on a gluten free?",
		"answer": [
			"Wheat"
		],
		"function": "none",
		"commonness": -39.47646987193651,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.cerealgrains.cereal_grain",
					"class": "base.cerealgrains.cereal_grain",
					"friendly_name": "Cereal Grain",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.challah",
					"class": "food.dish",
					"friendly_name": "Challah",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "food.ingredient",
					"class": "food.ingredient",
					"friendly_name": "Ingredient",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.gluten-free_diet",
					"class": "food.dietary_restriction",
					"friendly_name": "gluten free",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.cerealgrains.cereal_grain.produced_into_breads",
					"friendly_name": "Produced into breads"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.cerealgrains.cereal_grain.milled_into",
					"friendly_name": "milled into"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "food.dietary_restriction.incompatible_ingredients",
					"friendly_name": "Incompatible ingredients"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.cerealgrains.cereal_grain . \nVALUES ?x1 { :en.challah } \n?x2 :type.object.type :food.ingredient . \nVALUES ?x3 { :en.gluten-free_diet } \n?x0 :base.cerealgrains.cereal_grain.produced_into_breads ?x1 . \n?x0 :base.cerealgrains.cereal_grain.milled_into ?x2 . \n?x3 :food.dietary_restriction.incompatible_ingredients ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 240000400,
		"question": "what's the cereal grain used in challah that can't be consumed by those on a gluten-free diet?",
		"answer": [
			"Wheat"
		],
		"function": "none",
		"commonness": -39.47646987193651,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.cerealgrains.cereal_grain",
					"class": "base.cerealgrains.cereal_grain",
					"friendly_name": "Cereal Grain",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.challah",
					"class": "food.dish",
					"friendly_name": "Challah",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "food.ingredient",
					"class": "food.ingredient",
					"friendly_name": "Ingredient",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.gluten-free_diet",
					"class": "food.dietary_restriction",
					"friendly_name": "Gluten-free diet",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.cerealgrains.cereal_grain.produced_into_breads",
					"friendly_name": "Produced into breads"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.cerealgrains.cereal_grain.milled_into",
					"friendly_name": "milled into"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "food.dietary_restriction.incompatible_ingredients",
					"friendly_name": "Incompatible ingredients"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.cerealgrains.cereal_grain . \nVALUES ?x1 { :en.challah } \n?x2 :type.object.type :food.ingredient . \nVALUES ?x3 { :en.gluten-free_diet } \n?x0 :base.cerealgrains.cereal_grain.produced_into_breads ?x1 . \n?x0 :base.cerealgrains.cereal_grain.milled_into ?x2 . \n?x3 :food.dietary_restriction.incompatible_ingredients ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 240000401,
		"question": "what's the cereal grain used in challah that can't be consumed by those on a gluten free?",
		"answer": [
			"Wheat"
		],
		"function": "none",
		"commonness": -39.47646987193651,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.cerealgrains.cereal_grain",
					"class": "base.cerealgrains.cereal_grain",
					"friendly_name": "Cereal Grain",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.challah",
					"class": "food.dish",
					"friendly_name": "Challah",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "food.ingredient",
					"class": "food.ingredient",
					"friendly_name": "Ingredient",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.gluten-free_diet",
					"class": "food.dietary_restriction",
					"friendly_name": "gluten free",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.cerealgrains.cereal_grain.produced_into_breads",
					"friendly_name": "Produced into breads"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "base.cerealgrains.cereal_grain.milled_into",
					"friendly_name": "milled into"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "food.dietary_restriction.incompatible_ingredients",
					"friendly_name": "Incompatible ingredients"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.cerealgrains.cereal_grain . \nVALUES ?x1 { :en.challah } \n?x2 :type.object.type :food.ingredient . \nVALUES ?x3 { :en.gluten-free_diet } \n?x0 :base.cerealgrains.cereal_grain.produced_into_breads ?x1 . \n?x0 :base.cerealgrains.cereal_grain.milled_into ?x2 . \n?x3 :food.dietary_restriction.incompatible_ingredients ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 241000000,
		"question": "an amusement ride with the same theme as haunted mansion was designed by who?",
		"answer": [
			"Walt Disney Imagineering"
		],
		"function": "none",
		"commonness": -35.55893972064999,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "amusement_parks.ride_designer",
					"class": "amusement_parks.ride_designer",
					"friendly_name": "Amusement Ride Designer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "amusement_parks.ride",
					"class": "amusement_parks.ride",
					"friendly_name": "Amusement Ride",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "amusement_parks.ride_theme",
					"class": "amusement_parks.ride_theme",
					"friendly_name": "Amusement Ride Theme",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.haunted_mansion",
					"class": "amusement_parks.ride",
					"friendly_name": "Haunted Mansion",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "amusement_parks.ride.designer",
					"friendly_name": "Designer"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "amusement_parks.ride.theme",
					"friendly_name": "Theme"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "amusement_parks.ride.theme",
					"friendly_name": "Theme"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :amusement_parks.ride_designer . \n?x1 :type.object.type :amusement_parks.ride . \n?x2 :type.object.type :amusement_parks.ride_theme . \nVALUES ?x3 { :en.haunted_mansion } \n?x1 :amusement_parks.ride.designer ?x0 . \n?x3 :amusement_parks.ride.theme ?x2 . \n?x1 :amusement_parks.ride.theme ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 241000001,
		"question": "an amusement ride with the same theme as mansion was designed by who?",
		"answer": [
			"Walt Disney Imagineering"
		],
		"function": "none",
		"commonness": -35.55893972064999,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "amusement_parks.ride_designer",
					"class": "amusement_parks.ride_designer",
					"friendly_name": "Amusement Ride Designer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "amusement_parks.ride",
					"class": "amusement_parks.ride",
					"friendly_name": "Amusement Ride",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "amusement_parks.ride_theme",
					"class": "amusement_parks.ride_theme",
					"friendly_name": "Amusement Ride Theme",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.haunted_mansion",
					"class": "amusement_parks.ride",
					"friendly_name": "mansion",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "amusement_parks.ride.designer",
					"friendly_name": "Designer"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "amusement_parks.ride.theme",
					"friendly_name": "Theme"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "amusement_parks.ride.theme",
					"friendly_name": "Theme"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :amusement_parks.ride_designer . \n?x1 :type.object.type :amusement_parks.ride . \n?x2 :type.object.type :amusement_parks.ride_theme . \nVALUES ?x3 { :en.haunted_mansion } \n?x1 :amusement_parks.ride.designer ?x0 . \n?x3 :amusement_parks.ride.theme ?x2 . \n?x1 :amusement_parks.ride.theme ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 241000002,
		"question": "an amusement ride with the same theme as haunted manison was designed by who?",
		"answer": [
			"Walt Disney Imagineering"
		],
		"function": "none",
		"commonness": -35.55893972064999,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "amusement_parks.ride_designer",
					"class": "amusement_parks.ride_designer",
					"friendly_name": "Amusement Ride Designer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "amusement_parks.ride",
					"class": "amusement_parks.ride",
					"friendly_name": "Amusement Ride",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "amusement_parks.ride_theme",
					"class": "amusement_parks.ride_theme",
					"friendly_name": "Amusement Ride Theme",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.haunted_mansion",
					"class": "amusement_parks.ride",
					"friendly_name": "haunted manison",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "amusement_parks.ride.designer",
					"friendly_name": "Designer"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "amusement_parks.ride.theme",
					"friendly_name": "Theme"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "amusement_parks.ride.theme",
					"friendly_name": "Theme"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :amusement_parks.ride_designer . \n?x1 :type.object.type :amusement_parks.ride . \n?x2 :type.object.type :amusement_parks.ride_theme . \nVALUES ?x3 { :en.haunted_mansion } \n?x1 :amusement_parks.ride.designer ?x0 . \n?x3 :amusement_parks.ride.theme ?x2 . \n?x1 :amusement_parks.ride.theme ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 241000100,
		"question": "who made a ride that is like the haunted mansion ride?",
		"answer": [
			"Walt Disney Imagineering"
		],
		"function": "none",
		"commonness": -35.55893972064999,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "amusement_parks.ride_designer",
					"class": "amusement_parks.ride_designer",
					"friendly_name": "Amusement Ride Designer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "amusement_parks.ride",
					"class": "amusement_parks.ride",
					"friendly_name": "Amusement Ride",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "amusement_parks.ride_theme",
					"class": "amusement_parks.ride_theme",
					"friendly_name": "Amusement Ride Theme",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.haunted_mansion",
					"class": "amusement_parks.ride",
					"friendly_name": "Haunted Mansion",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "amusement_parks.ride.designer",
					"friendly_name": "Designer"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "amusement_parks.ride.theme",
					"friendly_name": "Theme"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "amusement_parks.ride.theme",
					"friendly_name": "Theme"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :amusement_parks.ride_designer . \n?x1 :type.object.type :amusement_parks.ride . \n?x2 :type.object.type :amusement_parks.ride_theme . \nVALUES ?x3 { :en.haunted_mansion } \n?x1 :amusement_parks.ride.designer ?x0 . \n?x3 :amusement_parks.ride.theme ?x2 . \n?x1 :amusement_parks.ride.theme ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 241000101,
		"question": "who made a ride that is like the mansion ride?",
		"answer": [
			"Walt Disney Imagineering"
		],
		"function": "none",
		"commonness": -35.55893972064999,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "amusement_parks.ride_designer",
					"class": "amusement_parks.ride_designer",
					"friendly_name": "Amusement Ride Designer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "amusement_parks.ride",
					"class": "amusement_parks.ride",
					"friendly_name": "Amusement Ride",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "amusement_parks.ride_theme",
					"class": "amusement_parks.ride_theme",
					"friendly_name": "Amusement Ride Theme",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.haunted_mansion",
					"class": "amusement_parks.ride",
					"friendly_name": "mansion",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "amusement_parks.ride.designer",
					"friendly_name": "Designer"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "amusement_parks.ride.theme",
					"friendly_name": "Theme"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "amusement_parks.ride.theme",
					"friendly_name": "Theme"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :amusement_parks.ride_designer . \n?x1 :type.object.type :amusement_parks.ride . \n?x2 :type.object.type :amusement_parks.ride_theme . \nVALUES ?x3 { :en.haunted_mansion } \n?x1 :amusement_parks.ride.designer ?x0 . \n?x3 :amusement_parks.ride.theme ?x2 . \n?x1 :amusement_parks.ride.theme ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 241000102,
		"question": "who made a ride that is like the haunted manison ride?",
		"answer": [
			"Walt Disney Imagineering"
		],
		"function": "none",
		"commonness": -35.55893972064999,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "amusement_parks.ride_designer",
					"class": "amusement_parks.ride_designer",
					"friendly_name": "Amusement Ride Designer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "amusement_parks.ride",
					"class": "amusement_parks.ride",
					"friendly_name": "Amusement Ride",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "amusement_parks.ride_theme",
					"class": "amusement_parks.ride_theme",
					"friendly_name": "Amusement Ride Theme",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.haunted_mansion",
					"class": "amusement_parks.ride",
					"friendly_name": "haunted manison",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "amusement_parks.ride.designer",
					"friendly_name": "Designer"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "amusement_parks.ride.theme",
					"friendly_name": "Theme"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "amusement_parks.ride.theme",
					"friendly_name": "Theme"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :amusement_parks.ride_designer . \n?x1 :type.object.type :amusement_parks.ride . \n?x2 :type.object.type :amusement_parks.ride_theme . \nVALUES ?x3 { :en.haunted_mansion } \n?x1 :amusement_parks.ride.designer ?x0 . \n?x3 :amusement_parks.ride.theme ?x2 . \n?x1 :amusement_parks.ride.theme ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	}
]