[
	{
		"qid": 207000002,
		"question": "in 1912 summer olympics and 2008 olympic games which official games were contested?",
		"answer": [
			"Track and field athletics",
			"Shooting sport",
			"Artistic gymnastics",
			"Rowing"
		],
		"function": "none",
		"commonness": -25.10133091784399,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "olympics.olympic_sport",
					"class": "olympics.olympic_sport",
					"friendly_name": "Olympic discipline",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.1912_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "1912 Summer Olympics",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "2008 olympic games",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "olympics.olympic_games.sports",
					"friendly_name": "Sports"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "olympics.olympic_sport.olympic_games_contested",
					"friendly_name": "Olympic games contested"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :olympics.olympic_sport . \nVALUES ?x1 { :en.1912_summer_olympics } \nVALUES ?x2 { :en.2008_summer_olympics } \n?x1 :olympics.olympic_games.sports ?x0 . \n?x0 :olympics.olympic_sport.olympic_games_contested ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 207000100,
		"question": "in both the 1912 summer olympics and the 2008 summer olympics, what sports have been contested as being official sports?",
		"answer": [
			"Shooting sport",
			"Rowing",
			"Track and field athletics",
			"Artistic gymnastics"
		],
		"function": "none",
		"commonness": -25.10133091784399,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "olympics.olympic_sport",
					"class": "olympics.olympic_sport",
					"friendly_name": "Olympic discipline",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.1912_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "1912 Summer Olympics",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "2008 Summer Olympics",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "olympics.olympic_games.sports",
					"friendly_name": "Sports"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "olympics.olympic_sport.olympic_games_contested",
					"friendly_name": "Olympic games contested"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :olympics.olympic_sport . \nVALUES ?x1 { :en.1912_summer_olympics } \nVALUES ?x2 { :en.2008_summer_olympics } \n?x1 :olympics.olympic_games.sports ?x0 . \n?x0 :olympics.olympic_sport.olympic_games_contested ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 207000101,
		"question": "in both the 1912 summer olympics and the beijing olympics, what sports have been contested as being official sports?",
		"answer": [
			"Shooting sport",
			"Rowing",
			"Track and field athletics",
			"Artistic gymnastics"
		],
		"function": "none",
		"commonness": -25.10133091784399,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "olympics.olympic_sport",
					"class": "olympics.olympic_sport",
					"friendly_name": "Olympic discipline",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.1912_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "1912 Summer Olympics",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "beijing olympics",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "olympics.olympic_games.sports",
					"friendly_name": "Sports"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "olympics.olympic_sport.olympic_games_contested",
					"friendly_name": "Olympic games contested"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :olympics.olympic_sport . \nVALUES ?x1 { :en.1912_summer_olympics } \nVALUES ?x2 { :en.2008_summer_olympics } \n?x1 :olympics.olympic_games.sports ?x0 . \n?x0 :olympics.olympic_sport.olympic_games_contested ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 207000102,
		"question": "in both the 1912 summer olympics and the 2008 olympic games, what sports have been contested as being official sports?",
		"answer": [
			"Rowing",
			"Artistic gymnastics",
			"Track and field athletics",
			"Shooting sport"
		],
		"function": "none",
		"commonness": -25.10133091784399,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "olympics.olympic_sport",
					"class": "olympics.olympic_sport",
					"friendly_name": "Olympic discipline",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.1912_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "1912 Summer Olympics",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "2008 olympic games",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "olympics.olympic_games.sports",
					"friendly_name": "Sports"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "olympics.olympic_sport.olympic_games_contested",
					"friendly_name": "Olympic games contested"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :olympics.olympic_sport . \nVALUES ?x1 { :en.1912_summer_olympics } \nVALUES ?x2 { :en.2008_summer_olympics } \n?x1 :olympics.olympic_games.sports ?x0 . \n?x0 :olympics.olympic_sport.olympic_games_contested ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 207000200,
		"question": "what sports were in both the 1912 summer olympics and the 2008 summer olympics?",
		"answer": [
			"Shooting sport",
			"Artistic gymnastics",
			"Rowing",
			"Track and field athletics"
		],
		"function": "none",
		"commonness": -25.10133091784399,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "olympics.olympic_sport",
					"class": "olympics.olympic_sport",
					"friendly_name": "Olympic discipline",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.1912_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "1912 Summer Olympics",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "2008 Summer Olympics",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "olympics.olympic_games.sports",
					"friendly_name": "Sports"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "olympics.olympic_sport.olympic_games_contested",
					"friendly_name": "Olympic games contested"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :olympics.olympic_sport . \nVALUES ?x1 { :en.1912_summer_olympics } \nVALUES ?x2 { :en.2008_summer_olympics } \n?x1 :olympics.olympic_games.sports ?x0 . \n?x0 :olympics.olympic_sport.olympic_games_contested ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 207000201,
		"question": "what sports were in both the 1912 summer olympics and the beijing olympics?",
		"answer": [
			"Artistic gymnastics",
			"Track and field athletics",
			"Rowing",
			"Shooting sport"
		],
		"function": "none",
		"commonness": -25.10133091784399,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "olympics.olympic_sport",
					"class": "olympics.olympic_sport",
					"friendly_name": "Olympic discipline",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.1912_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "1912 Summer Olympics",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "beijing olympics",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "olympics.olympic_games.sports",
					"friendly_name": "Sports"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "olympics.olympic_sport.olympic_games_contested",
					"friendly_name": "Olympic games contested"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :olympics.olympic_sport . \nVALUES ?x1 { :en.1912_summer_olympics } \nVALUES ?x2 { :en.2008_summer_olympics } \n?x1 :olympics.olympic_games.sports ?x0 . \n?x0 :olympics.olympic_sport.olympic_games_contested ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 207000202,
		"question": "what sports were in both the 1912 summer olympics and the 2008 olympic games?",
		"answer": [
			"Artistic gymnastics",
			"Shooting sport",
			"Rowing",
			"Track and field athletics"
		],
		"function": "none",
		"commonness": -25.10133091784399,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "olympics.olympic_sport",
					"class": "olympics.olympic_sport",
					"friendly_name": "Olympic discipline",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.1912_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "1912 Summer Olympics",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "2008 olympic games",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "olympics.olympic_games.sports",
					"friendly_name": "Sports"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "olympics.olympic_sport.olympic_games_contested",
					"friendly_name": "Olympic games contested"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :olympics.olympic_sport . \nVALUES ?x1 { :en.1912_summer_olympics } \nVALUES ?x2 { :en.2008_summer_olympics } \n?x1 :olympics.olympic_games.sports ?x0 . \n?x0 :olympics.olympic_sport.olympic_games_contested ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 207000300,
		"question": "what are some sports which have been contested as official in both the 1912 summer olympics and the 2008 summer olympics?",
		"answer": [
			"Shooting sport",
			"Track and field athletics",
			"Artistic gymnastics",
			"Rowing"
		],
		"function": "none",
		"commonness": -25.10133091784399,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "olympics.olympic_sport",
					"class": "olympics.olympic_sport",
					"friendly_name": "Olympic discipline",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.1912_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "1912 Summer Olympics",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "2008 Summer Olympics",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "olympics.olympic_games.sports",
					"friendly_name": "Sports"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "olympics.olympic_sport.olympic_games_contested",
					"friendly_name": "Olympic games contested"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :olympics.olympic_sport . \nVALUES ?x1 { :en.1912_summer_olympics } \nVALUES ?x2 { :en.2008_summer_olympics } \n?x1 :olympics.olympic_games.sports ?x0 . \n?x0 :olympics.olympic_sport.olympic_games_contested ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 207000301,
		"question": "what are some sports which have been contested as official in both the 1912 summer olympics and the beijing olympics?",
		"answer": [
			"Shooting sport",
			"Artistic gymnastics",
			"Rowing",
			"Track and field athletics"
		],
		"function": "none",
		"commonness": -25.10133091784399,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "olympics.olympic_sport",
					"class": "olympics.olympic_sport",
					"friendly_name": "Olympic discipline",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.1912_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "1912 Summer Olympics",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "beijing olympics",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "olympics.olympic_games.sports",
					"friendly_name": "Sports"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "olympics.olympic_sport.olympic_games_contested",
					"friendly_name": "Olympic games contested"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :olympics.olympic_sport . \nVALUES ?x1 { :en.1912_summer_olympics } \nVALUES ?x2 { :en.2008_summer_olympics } \n?x1 :olympics.olympic_games.sports ?x0 . \n?x0 :olympics.olympic_sport.olympic_games_contested ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 207000302,
		"question": "what are some sports which have been contested as official in both the 1912 summer olympics and the 2008 olympic games?",
		"answer": [
			"Rowing",
			"Track and field athletics",
			"Artistic gymnastics",
			"Shooting sport"
		],
		"function": "none",
		"commonness": -25.10133091784399,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "olympics.olympic_sport",
					"class": "olympics.olympic_sport",
					"friendly_name": "Olympic discipline",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.1912_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "1912 Summer Olympics",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "2008 olympic games",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "olympics.olympic_games.sports",
					"friendly_name": "Sports"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "olympics.olympic_sport.olympic_games_contested",
					"friendly_name": "Olympic games contested"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :olympics.olympic_sport . \nVALUES ?x1 { :en.1912_summer_olympics } \nVALUES ?x2 { :en.2008_summer_olympics } \n?x1 :olympics.olympic_games.sports ?x0 . \n?x0 :olympics.olympic_sport.olympic_games_contested ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 207000400,
		"question": "what have been contested as official sports in both the 1912 summer olympics and the 2008 summer olympics?",
		"answer": [
			"Artistic gymnastics",
			"Rowing",
			"Track and field athletics",
			"Shooting sport"
		],
		"function": "none",
		"commonness": -25.10133091784399,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "olympics.olympic_sport",
					"class": "olympics.olympic_sport",
					"friendly_name": "Olympic discipline",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.1912_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "1912 Summer Olympics",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "2008 Summer Olympics",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "olympics.olympic_games.sports",
					"friendly_name": "Sports"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "olympics.olympic_sport.olympic_games_contested",
					"friendly_name": "Olympic games contested"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :olympics.olympic_sport . \nVALUES ?x1 { :en.1912_summer_olympics } \nVALUES ?x2 { :en.2008_summer_olympics } \n?x1 :olympics.olympic_games.sports ?x0 . \n?x0 :olympics.olympic_sport.olympic_games_contested ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 207000401,
		"question": "what have been contested as official sports in both the 1912 summer olympics and the beijing olympics?",
		"answer": [
			"Shooting sport",
			"Track and field athletics",
			"Rowing",
			"Artistic gymnastics"
		],
		"function": "none",
		"commonness": -25.10133091784399,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "olympics.olympic_sport",
					"class": "olympics.olympic_sport",
					"friendly_name": "Olympic discipline",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.1912_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "1912 Summer Olympics",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "beijing olympics",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "olympics.olympic_games.sports",
					"friendly_name": "Sports"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "olympics.olympic_sport.olympic_games_contested",
					"friendly_name": "Olympic games contested"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :olympics.olympic_sport . \nVALUES ?x1 { :en.1912_summer_olympics } \nVALUES ?x2 { :en.2008_summer_olympics } \n?x1 :olympics.olympic_games.sports ?x0 . \n?x0 :olympics.olympic_sport.olympic_games_contested ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 207000402,
		"question": "what have been contested as official sports in both the 1912 summer olympics and the 2008 olympic games?",
		"answer": [
			"Track and field athletics",
			"Rowing",
			"Artistic gymnastics",
			"Shooting sport"
		],
		"function": "none",
		"commonness": -25.10133091784399,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "olympics.olympic_sport",
					"class": "olympics.olympic_sport",
					"friendly_name": "Olympic discipline",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.1912_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "1912 Summer Olympics",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "2008 olympic games",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "olympics.olympic_games.sports",
					"friendly_name": "Sports"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "olympics.olympic_sport.olympic_games_contested",
					"friendly_name": "Olympic games contested"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :olympics.olympic_sport . \nVALUES ?x1 { :en.1912_summer_olympics } \nVALUES ?x2 { :en.2008_summer_olympics } \n?x1 :olympics.olympic_games.sports ?x0 . \n?x0 :olympics.olympic_sport.olympic_games_contested ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 207000500,
		"question": "what kind of disciplines do the 1912 summer olympics and the 2008 summer olympics have in common?",
		"answer": [
			"Shooting sport",
			"Rowing",
			"Track and field athletics",
			"Artistic gymnastics"
		],
		"function": "none",
		"commonness": -25.10133091784399,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "olympics.olympic_sport",
					"class": "olympics.olympic_sport",
					"friendly_name": "Olympic discipline",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.1912_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "1912 Summer Olympics",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "2008 Summer Olympics",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "olympics.olympic_games.sports",
					"friendly_name": "Sports"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "olympics.olympic_sport.olympic_games_contested",
					"friendly_name": "Olympic games contested"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :olympics.olympic_sport . \nVALUES ?x1 { :en.1912_summer_olympics } \nVALUES ?x2 { :en.2008_summer_olympics } \n?x1 :olympics.olympic_games.sports ?x0 . \n?x0 :olympics.olympic_sport.olympic_games_contested ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 207000501,
		"question": "what kind of disciplines do the 1912 summer olympics and the beijing olympics have in common?",
		"answer": [
			"Rowing",
			"Track and field athletics",
			"Shooting sport",
			"Artistic gymnastics"
		],
		"function": "none",
		"commonness": -25.10133091784399,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "olympics.olympic_sport",
					"class": "olympics.olympic_sport",
					"friendly_name": "Olympic discipline",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.1912_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "1912 Summer Olympics",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "beijing olympics",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "olympics.olympic_games.sports",
					"friendly_name": "Sports"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "olympics.olympic_sport.olympic_games_contested",
					"friendly_name": "Olympic games contested"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :olympics.olympic_sport . \nVALUES ?x1 { :en.1912_summer_olympics } \nVALUES ?x2 { :en.2008_summer_olympics } \n?x1 :olympics.olympic_games.sports ?x0 . \n?x0 :olympics.olympic_sport.olympic_games_contested ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 207000502,
		"question": "what kind of disciplines do the 1912 summer olympics and the 2008 olympic games have in common?",
		"answer": [
			"Track and field athletics",
			"Shooting sport",
			"Rowing",
			"Artistic gymnastics"
		],
		"function": "none",
		"commonness": -25.10133091784399,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "olympics.olympic_sport",
					"class": "olympics.olympic_sport",
					"friendly_name": "Olympic discipline",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.1912_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "1912 Summer Olympics",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "2008 olympic games",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "olympics.olympic_games.sports",
					"friendly_name": "Sports"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "olympics.olympic_sport.olympic_games_contested",
					"friendly_name": "Olympic games contested"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :olympics.olympic_sport . \nVALUES ?x1 { :en.1912_summer_olympics } \nVALUES ?x2 { :en.2008_summer_olympics } \n?x1 :olympics.olympic_games.sports ?x0 . \n?x0 :olympics.olympic_sport.olympic_games_contested ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	}
]