[
	{
		"qid": 223000200,
		"question": "which batman comic book was written by frank miller?",
		"answer": [
			"Batman: The Dark Knight Returns"
		],
		"function": "none",
		"commonness": -21.89634449799579,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_series",
					"class": "comic_books.comic_book_series",
					"friendly_name": "Comic Book Series",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.frank_miller",
					"class": "comic_books.comic_book_creator",
					"friendly_name": "Frank Miller",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.batman",
					"class": "comic_books.comic_book_character",
					"friendly_name": "Batman",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "comic_books.comic_book_creator.series_created",
					"friendly_name": "Series Created"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "comic_books.comic_book_series.featured_characters",
					"friendly_name": "Featured Characters"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_series . \nVALUES ?x1 { :en.frank_miller } \nVALUES ?x2 { :en.batman } \n?x1 :comic_books.comic_book_creator.series_created ?x0 . \n?x0 :comic_books.comic_book_series.featured_characters ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 223000201,
		"question": "which bruce wayne comic book was written by frank miller?",
		"answer": [
			"Batman: The Dark Knight Returns"
		],
		"function": "none",
		"commonness": -21.89634449799579,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_series",
					"class": "comic_books.comic_book_series",
					"friendly_name": "Comic Book Series",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.frank_miller",
					"class": "comic_books.comic_book_creator",
					"friendly_name": "Frank Miller",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.batman",
					"class": "comic_books.comic_book_character",
					"friendly_name": "bruce wayne",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "comic_books.comic_book_creator.series_created",
					"friendly_name": "Series Created"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "comic_books.comic_book_series.featured_characters",
					"friendly_name": "Featured Characters"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_series . \nVALUES ?x1 { :en.frank_miller } \nVALUES ?x2 { :en.batman } \n?x1 :comic_books.comic_book_creator.series_created ?x0 . \n?x0 :comic_books.comic_book_series.featured_characters ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 223000202,
		"question": "which batman comic book was written by miller?",
		"answer": [
			"Batman: The Dark Knight Returns"
		],
		"function": "none",
		"commonness": -21.89634449799579,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_series",
					"class": "comic_books.comic_book_series",
					"friendly_name": "Comic Book Series",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.frank_miller",
					"class": "comic_books.comic_book_creator",
					"friendly_name": "miller",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.batman",
					"class": "comic_books.comic_book_character",
					"friendly_name": "Batman",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "comic_books.comic_book_creator.series_created",
					"friendly_name": "Series Created"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "comic_books.comic_book_series.featured_characters",
					"friendly_name": "Featured Characters"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_series . \nVALUES ?x1 { :en.frank_miller } \nVALUES ?x2 { :en.batman } \n?x1 :comic_books.comic_book_creator.series_created ?x0 . \n?x0 :comic_books.comic_book_series.featured_characters ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 223000300,
		"question": "which comic book series of frank miller is about batman?",
		"answer": [
			"Batman: The Dark Knight Returns"
		],
		"function": "none",
		"commonness": -21.89634449799579,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_series",
					"class": "comic_books.comic_book_series",
					"friendly_name": "Comic Book Series",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.frank_miller",
					"class": "comic_books.comic_book_creator",
					"friendly_name": "Frank Miller",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.batman",
					"class": "comic_books.comic_book_character",
					"friendly_name": "Batman",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "comic_books.comic_book_creator.series_created",
					"friendly_name": "Series Created"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "comic_books.comic_book_series.featured_characters",
					"friendly_name": "Featured Characters"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_series . \nVALUES ?x1 { :en.frank_miller } \nVALUES ?x2 { :en.batman } \n?x1 :comic_books.comic_book_creator.series_created ?x0 . \n?x0 :comic_books.comic_book_series.featured_characters ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 223000301,
		"question": "which comic book series of frank miller is about bruce wayne?",
		"answer": [
			"Batman: The Dark Knight Returns"
		],
		"function": "none",
		"commonness": -21.89634449799579,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_series",
					"class": "comic_books.comic_book_series",
					"friendly_name": "Comic Book Series",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.frank_miller",
					"class": "comic_books.comic_book_creator",
					"friendly_name": "Frank Miller",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.batman",
					"class": "comic_books.comic_book_character",
					"friendly_name": "bruce wayne",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "comic_books.comic_book_creator.series_created",
					"friendly_name": "Series Created"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "comic_books.comic_book_series.featured_characters",
					"friendly_name": "Featured Characters"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_series . \nVALUES ?x1 { :en.frank_miller } \nVALUES ?x2 { :en.batman } \n?x1 :comic_books.comic_book_creator.series_created ?x0 . \n?x0 :comic_books.comic_book_series.featured_characters ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 223000302,
		"question": "which comic book series of miller is about batman?",
		"answer": [
			"Batman: The Dark Knight Returns"
		],
		"function": "none",
		"commonness": -21.89634449799579,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_series",
					"class": "comic_books.comic_book_series",
					"friendly_name": "Comic Book Series",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.frank_miller",
					"class": "comic_books.comic_book_creator",
					"friendly_name": "miller",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.batman",
					"class": "comic_books.comic_book_character",
					"friendly_name": "Batman",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "comic_books.comic_book_creator.series_created",
					"friendly_name": "Series Created"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "comic_books.comic_book_series.featured_characters",
					"friendly_name": "Featured Characters"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_series . \nVALUES ?x1 { :en.frank_miller } \nVALUES ?x2 { :en.batman } \n?x1 :comic_books.comic_book_creator.series_created ?x0 . \n?x0 :comic_books.comic_book_series.featured_characters ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 223000400,
		"question": "which of frank miller's comic series is about batman?",
		"answer": [
			"Batman: The Dark Knight Returns"
		],
		"function": "none",
		"commonness": -21.89634449799579,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_series",
					"class": "comic_books.comic_book_series",
					"friendly_name": "Comic Book Series",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.frank_miller",
					"class": "comic_books.comic_book_creator",
					"friendly_name": "Frank Miller",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.batman",
					"class": "comic_books.comic_book_character",
					"friendly_name": "Batman",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "comic_books.comic_book_creator.series_created",
					"friendly_name": "Series Created"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "comic_books.comic_book_series.featured_characters",
					"friendly_name": "Featured Characters"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_series . \nVALUES ?x1 { :en.frank_miller } \nVALUES ?x2 { :en.batman } \n?x1 :comic_books.comic_book_creator.series_created ?x0 . \n?x0 :comic_books.comic_book_series.featured_characters ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 223000401,
		"question": "which of frank miller's comic series is about bruce wayne?",
		"answer": [
			"Batman: The Dark Knight Returns"
		],
		"function": "none",
		"commonness": -21.89634449799579,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_series",
					"class": "comic_books.comic_book_series",
					"friendly_name": "Comic Book Series",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.frank_miller",
					"class": "comic_books.comic_book_creator",
					"friendly_name": "Frank Miller",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.batman",
					"class": "comic_books.comic_book_character",
					"friendly_name": "bruce wayne",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "comic_books.comic_book_creator.series_created",
					"friendly_name": "Series Created"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "comic_books.comic_book_series.featured_characters",
					"friendly_name": "Featured Characters"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_series . \nVALUES ?x1 { :en.frank_miller } \nVALUES ?x2 { :en.batman } \n?x1 :comic_books.comic_book_creator.series_created ?x0 . \n?x0 :comic_books.comic_book_series.featured_characters ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 223000402,
		"question": "which of miller's comic series is about batman?",
		"answer": [
			"Batman: The Dark Knight Returns"
		],
		"function": "none",
		"commonness": -21.89634449799579,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_series",
					"class": "comic_books.comic_book_series",
					"friendly_name": "Comic Book Series",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.frank_miller",
					"class": "comic_books.comic_book_creator",
					"friendly_name": "miller",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.batman",
					"class": "comic_books.comic_book_character",
					"friendly_name": "Batman",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "comic_books.comic_book_creator.series_created",
					"friendly_name": "Series Created"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "comic_books.comic_book_series.featured_characters",
					"friendly_name": "Featured Characters"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_series . \nVALUES ?x1 { :en.frank_miller } \nVALUES ?x2 { :en.batman } \n?x1 :comic_books.comic_book_creator.series_created ?x0 . \n?x0 :comic_books.comic_book_series.featured_characters ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 223000500,
		"question": "frank miller wrote what comic book series about batman?",
		"answer": [
			"Batman: The Dark Knight Returns"
		],
		"function": "none",
		"commonness": -21.89634449799579,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_series",
					"class": "comic_books.comic_book_series",
					"friendly_name": "Comic Book Series",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.frank_miller",
					"class": "comic_books.comic_book_creator",
					"friendly_name": "Frank Miller",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.batman",
					"class": "comic_books.comic_book_character",
					"friendly_name": "Batman",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "comic_books.comic_book_creator.series_created",
					"friendly_name": "Series Created"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "comic_books.comic_book_series.featured_characters",
					"friendly_name": "Featured Characters"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_series . \nVALUES ?x1 { :en.frank_miller } \nVALUES ?x2 { :en.batman } \n?x1 :comic_books.comic_book_creator.series_created ?x0 . \n?x0 :comic_books.comic_book_series.featured_characters ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 223000501,
		"question": "frank miller wrote what comic book series about bruce wayne?",
		"answer": [
			"Batman: The Dark Knight Returns"
		],
		"function": "none",
		"commonness": -21.89634449799579,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_series",
					"class": "comic_books.comic_book_series",
					"friendly_name": "Comic Book Series",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.frank_miller",
					"class": "comic_books.comic_book_creator",
					"friendly_name": "Frank Miller",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.batman",
					"class": "comic_books.comic_book_character",
					"friendly_name": "bruce wayne",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "comic_books.comic_book_creator.series_created",
					"friendly_name": "Series Created"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "comic_books.comic_book_series.featured_characters",
					"friendly_name": "Featured Characters"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_series . \nVALUES ?x1 { :en.frank_miller } \nVALUES ?x2 { :en.batman } \n?x1 :comic_books.comic_book_creator.series_created ?x0 . \n?x0 :comic_books.comic_book_series.featured_characters ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 223000600,
		"question": "what one of the comics by frank miller is about batman?",
		"answer": [
			"Batman: The Dark Knight Returns"
		],
		"function": "none",
		"commonness": -21.89634449799579,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_series",
					"class": "comic_books.comic_book_series",
					"friendly_name": "Comic Book Series",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.frank_miller",
					"class": "comic_books.comic_book_creator",
					"friendly_name": "Frank Miller",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.batman",
					"class": "comic_books.comic_book_character",
					"friendly_name": "Batman",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "comic_books.comic_book_creator.series_created",
					"friendly_name": "Series Created"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "comic_books.comic_book_series.featured_characters",
					"friendly_name": "Featured Characters"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_series . \nVALUES ?x1 { :en.frank_miller } \nVALUES ?x2 { :en.batman } \n?x1 :comic_books.comic_book_creator.series_created ?x0 . \n?x0 :comic_books.comic_book_series.featured_characters ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 223000601,
		"question": "what one of the comics by frank miller is about bruce wayne?",
		"answer": [
			"Batman: The Dark Knight Returns"
		],
		"function": "none",
		"commonness": -21.89634449799579,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_series",
					"class": "comic_books.comic_book_series",
					"friendly_name": "Comic Book Series",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.frank_miller",
					"class": "comic_books.comic_book_creator",
					"friendly_name": "Frank Miller",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.batman",
					"class": "comic_books.comic_book_character",
					"friendly_name": "bruce wayne",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "comic_books.comic_book_creator.series_created",
					"friendly_name": "Series Created"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "comic_books.comic_book_series.featured_characters",
					"friendly_name": "Featured Characters"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_series . \nVALUES ?x1 { :en.frank_miller } \nVALUES ?x2 { :en.batman } \n?x1 :comic_books.comic_book_creator.series_created ?x0 . \n?x0 :comic_books.comic_book_series.featured_characters ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 223000602,
		"question": "what one of the comics by miller is about batman?",
		"answer": [
			"Batman: The Dark Knight Returns"
		],
		"function": "none",
		"commonness": -21.89634449799579,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_series",
					"class": "comic_books.comic_book_series",
					"friendly_name": "Comic Book Series",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.frank_miller",
					"class": "comic_books.comic_book_creator",
					"friendly_name": "miller",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.batman",
					"class": "comic_books.comic_book_character",
					"friendly_name": "Batman",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "comic_books.comic_book_creator.series_created",
					"friendly_name": "Series Created"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "comic_books.comic_book_series.featured_characters",
					"friendly_name": "Featured Characters"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_series . \nVALUES ?x1 { :en.frank_miller } \nVALUES ?x2 { :en.batman } \n?x1 :comic_books.comic_book_creator.series_created ?x0 . \n?x0 :comic_books.comic_book_series.featured_characters ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 223000700,
		"question": "batman is found in which comic book series by frank miller?",
		"answer": [
			"Batman: The Dark Knight Returns"
		],
		"function": "none",
		"commonness": -21.89634449799579,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_series",
					"class": "comic_books.comic_book_series",
					"friendly_name": "Comic Book Series",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.frank_miller",
					"class": "comic_books.comic_book_creator",
					"friendly_name": "Frank Miller",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.batman",
					"class": "comic_books.comic_book_character",
					"friendly_name": "Batman",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "comic_books.comic_book_creator.series_created",
					"friendly_name": "Series Created"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "comic_books.comic_book_series.featured_characters",
					"friendly_name": "Featured Characters"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_series . \nVALUES ?x1 { :en.frank_miller } \nVALUES ?x2 { :en.batman } \n?x1 :comic_books.comic_book_creator.series_created ?x0 . \n?x0 :comic_books.comic_book_series.featured_characters ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 223000701,
		"question": "bruce wayne is found in which comic book series by frank miller?",
		"answer": [
			"Batman: The Dark Knight Returns"
		],
		"function": "none",
		"commonness": -21.89634449799579,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_series",
					"class": "comic_books.comic_book_series",
					"friendly_name": "Comic Book Series",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.frank_miller",
					"class": "comic_books.comic_book_creator",
					"friendly_name": "Frank Miller",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.batman",
					"class": "comic_books.comic_book_character",
					"friendly_name": "bruce wayne",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "comic_books.comic_book_creator.series_created",
					"friendly_name": "Series Created"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "comic_books.comic_book_series.featured_characters",
					"friendly_name": "Featured Characters"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_series . \nVALUES ?x1 { :en.frank_miller } \nVALUES ?x2 { :en.batman } \n?x1 :comic_books.comic_book_creator.series_created ?x0 . \n?x0 :comic_books.comic_book_series.featured_characters ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 223000702,
		"question": "batman is found in which comic book series by miller?",
		"answer": [
			"Batman: The Dark Knight Returns"
		],
		"function": "none",
		"commonness": -21.89634449799579,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "comic_books.comic_book_series",
					"class": "comic_books.comic_book_series",
					"friendly_name": "Comic Book Series",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.frank_miller",
					"class": "comic_books.comic_book_creator",
					"friendly_name": "miller",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.batman",
					"class": "comic_books.comic_book_character",
					"friendly_name": "Batman",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "comic_books.comic_book_creator.series_created",
					"friendly_name": "Series Created"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "comic_books.comic_book_series.featured_characters",
					"friendly_name": "Featured Characters"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :comic_books.comic_book_series . \nVALUES ?x1 { :en.frank_miller } \nVALUES ?x2 { :en.batman } \n?x1 :comic_books.comic_book_creator.series_created ?x0 . \n?x0 :comic_books.comic_book_series.featured_characters ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	}
]