[
	{
		"qid": 59000202,
		"question": "what chemical classifications include vitamine?",
		"answer": [
			"Organic compound"
		],
		"function": "none",
		"commonness": -15.775155317841211,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "chemistry.chemical_classification",
					"class": "chemistry.chemical_classification",
					"friendly_name": "Chemical Classification",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.vitamin",
					"class": "chemistry.chemical_classification",
					"friendly_name": "vitamine",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "chemistry.chemical_classification.lower_classifications",
					"friendly_name": "Lower Classifications"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :chemistry.chemical_classification . \nVALUES ?x1 { :en.vitamin } \n?x0 :chemistry.chemical_classification.lower_classifications ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 59000300,
		"question": "vitamin is part of which chemical classifications?",
		"answer": [
			"Organic compound"
		],
		"function": "none",
		"commonness": -15.775155317841211,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "chemistry.chemical_classification",
					"class": "chemistry.chemical_classification",
					"friendly_name": "Chemical Classification",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.vitamin",
					"class": "chemistry.chemical_classification",
					"friendly_name": "Vitamin",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "chemistry.chemical_classification.lower_classifications",
					"friendly_name": "Lower Classifications"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :chemistry.chemical_classification . \nVALUES ?x1 { :en.vitamin } \n?x0 :chemistry.chemical_classification.lower_classifications ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 59000301,
		"question": "vitamins is part of which chemical classifications?",
		"answer": [
			"Organic compound"
		],
		"function": "none",
		"commonness": -15.775155317841211,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "chemistry.chemical_classification",
					"class": "chemistry.chemical_classification",
					"friendly_name": "Chemical Classification",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.vitamin",
					"class": "chemistry.chemical_classification",
					"friendly_name": "vitamins",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "chemistry.chemical_classification.lower_classifications",
					"friendly_name": "Lower Classifications"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :chemistry.chemical_classification . \nVALUES ?x1 { :en.vitamin } \n?x0 :chemistry.chemical_classification.lower_classifications ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 59000302,
		"question": "vitamine is part of which chemical classifications?",
		"answer": [
			"Organic compound"
		],
		"function": "none",
		"commonness": -15.775155317841211,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "chemistry.chemical_classification",
					"class": "chemistry.chemical_classification",
					"friendly_name": "Chemical Classification",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.vitamin",
					"class": "chemistry.chemical_classification",
					"friendly_name": "vitamine",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "chemistry.chemical_classification.lower_classifications",
					"friendly_name": "Lower Classifications"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :chemistry.chemical_classification . \nVALUES ?x1 { :en.vitamin } \n?x0 :chemistry.chemical_classification.lower_classifications ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 60000000,
		"question": "where will the mars exploration rover arrive at the end of its trip?",
		"answer": [
			"Mars"
		],
		"function": "none",
		"commonness": -14.111542566181667,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.mission_destination",
					"class": "spaceflight.mission_destination",
					"friendly_name": "Mission destination",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mars_exploration_rover",
					"class": "spaceflight.space_mission",
					"friendly_name": "Mars Exploration Rover",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.space_mission.destination",
					"friendly_name": "Destination"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.mission_destination . \nVALUES ?x1 { :en.mars_exploration_rover } \n?x1 :spaceflight.space_mission.destination ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 60000001,
		"question": "where will the mer arrive at the end of its trip?",
		"answer": [
			"Mars"
		],
		"function": "none",
		"commonness": -14.111542566181667,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.mission_destination",
					"class": "spaceflight.mission_destination",
					"friendly_name": "Mission destination",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mars_exploration_rover",
					"class": "spaceflight.space_mission",
					"friendly_name": "mer",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.space_mission.destination",
					"friendly_name": "Destination"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.mission_destination . \nVALUES ?x1 { :en.mars_exploration_rover } \n?x1 :spaceflight.space_mission.destination ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 60000002,
		"question": "where will the spirit and opportunity arrive at the end of its trip?",
		"answer": [
			"Mars"
		],
		"function": "none",
		"commonness": -14.111542566181667,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.mission_destination",
					"class": "spaceflight.mission_destination",
					"friendly_name": "Mission destination",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mars_exploration_rover",
					"class": "spaceflight.space_mission",
					"friendly_name": "spirit and opportunity",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.space_mission.destination",
					"friendly_name": "Destination"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.mission_destination . \nVALUES ?x1 { :en.mars_exploration_rover } \n?x1 :spaceflight.space_mission.destination ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 60000100,
		"question": "where will the mars exploration rover journey to?",
		"answer": [
			"Mars"
		],
		"function": "none",
		"commonness": -14.111542566181667,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.mission_destination",
					"class": "spaceflight.mission_destination",
					"friendly_name": "Mission destination",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mars_exploration_rover",
					"class": "spaceflight.space_mission",
					"friendly_name": "Mars Exploration Rover",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.space_mission.destination",
					"friendly_name": "Destination"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.mission_destination . \nVALUES ?x1 { :en.mars_exploration_rover } \n?x1 :spaceflight.space_mission.destination ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 60000101,
		"question": "where will the mer journey to?",
		"answer": [
			"Mars"
		],
		"function": "none",
		"commonness": -14.111542566181667,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.mission_destination",
					"class": "spaceflight.mission_destination",
					"friendly_name": "Mission destination",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mars_exploration_rover",
					"class": "spaceflight.space_mission",
					"friendly_name": "mer",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.space_mission.destination",
					"friendly_name": "Destination"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.mission_destination . \nVALUES ?x1 { :en.mars_exploration_rover } \n?x1 :spaceflight.space_mission.destination ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 60000102,
		"question": "where will the spirit and opportunity journey to?",
		"answer": [
			"Mars"
		],
		"function": "none",
		"commonness": -14.111542566181667,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.mission_destination",
					"class": "spaceflight.mission_destination",
					"friendly_name": "Mission destination",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mars_exploration_rover",
					"class": "spaceflight.space_mission",
					"friendly_name": "spirit and opportunity",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.space_mission.destination",
					"friendly_name": "Destination"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.mission_destination . \nVALUES ?x1 { :en.mars_exploration_rover } \n?x1 :spaceflight.space_mission.destination ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 60000200,
		"question": "where does mars exploration rover aim to land?",
		"answer": [
			"Mars"
		],
		"function": "none",
		"commonness": -14.111542566181667,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.mission_destination",
					"class": "spaceflight.mission_destination",
					"friendly_name": "Mission destination",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mars_exploration_rover",
					"class": "spaceflight.space_mission",
					"friendly_name": "Mars Exploration Rover",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.space_mission.destination",
					"friendly_name": "Destination"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.mission_destination . \nVALUES ?x1 { :en.mars_exploration_rover } \n?x1 :spaceflight.space_mission.destination ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 60000201,
		"question": "where does mer aim to land?",
		"answer": [
			"Mars"
		],
		"function": "none",
		"commonness": -14.111542566181667,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.mission_destination",
					"class": "spaceflight.mission_destination",
					"friendly_name": "Mission destination",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mars_exploration_rover",
					"class": "spaceflight.space_mission",
					"friendly_name": "mer",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.space_mission.destination",
					"friendly_name": "Destination"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.mission_destination . \nVALUES ?x1 { :en.mars_exploration_rover } \n?x1 :spaceflight.space_mission.destination ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 60000202,
		"question": "where does spirit and opportunity aim to land?",
		"answer": [
			"Mars"
		],
		"function": "none",
		"commonness": -14.111542566181667,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.mission_destination",
					"class": "spaceflight.mission_destination",
					"friendly_name": "Mission destination",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mars_exploration_rover",
					"class": "spaceflight.space_mission",
					"friendly_name": "spirit and opportunity",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.space_mission.destination",
					"friendly_name": "Destination"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.mission_destination . \nVALUES ?x1 { :en.mars_exploration_rover } \n?x1 :spaceflight.space_mission.destination ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 60000300,
		"question": "what's the destination of the mars exploration rover?",
		"answer": [
			"Mars"
		],
		"function": "none",
		"commonness": -14.111542566181667,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.mission_destination",
					"class": "spaceflight.mission_destination",
					"friendly_name": "Mission destination",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mars_exploration_rover",
					"class": "spaceflight.space_mission",
					"friendly_name": "Mars Exploration Rover",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.space_mission.destination",
					"friendly_name": "Destination"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.mission_destination . \nVALUES ?x1 { :en.mars_exploration_rover } \n?x1 :spaceflight.space_mission.destination ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 60000301,
		"question": "what's the destination of the mer?",
		"answer": [
			"Mars"
		],
		"function": "none",
		"commonness": -14.111542566181667,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.mission_destination",
					"class": "spaceflight.mission_destination",
					"friendly_name": "Mission destination",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mars_exploration_rover",
					"class": "spaceflight.space_mission",
					"friendly_name": "mer",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.space_mission.destination",
					"friendly_name": "Destination"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.mission_destination . \nVALUES ?x1 { :en.mars_exploration_rover } \n?x1 :spaceflight.space_mission.destination ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 60000302,
		"question": "what's the destination of the spirit and opportunity?",
		"answer": [
			"Mars"
		],
		"function": "none",
		"commonness": -14.111542566181667,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.mission_destination",
					"class": "spaceflight.mission_destination",
					"friendly_name": "Mission destination",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mars_exploration_rover",
					"class": "spaceflight.space_mission",
					"friendly_name": "spirit and opportunity",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.space_mission.destination",
					"friendly_name": "Destination"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.mission_destination . \nVALUES ?x1 { :en.mars_exploration_rover } \n?x1 :spaceflight.space_mission.destination ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 60000400,
		"question": "where is the mars exploration rover headed?",
		"answer": [
			"Mars"
		],
		"function": "none",
		"commonness": -14.111542566181667,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.mission_destination",
					"class": "spaceflight.mission_destination",
					"friendly_name": "Mission destination",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mars_exploration_rover",
					"class": "spaceflight.space_mission",
					"friendly_name": "Mars Exploration Rover",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.space_mission.destination",
					"friendly_name": "Destination"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.mission_destination . \nVALUES ?x1 { :en.mars_exploration_rover } \n?x1 :spaceflight.space_mission.destination ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 60000401,
		"question": "where is the mer headed?",
		"answer": [
			"Mars"
		],
		"function": "none",
		"commonness": -14.111542566181667,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.mission_destination",
					"class": "spaceflight.mission_destination",
					"friendly_name": "Mission destination",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mars_exploration_rover",
					"class": "spaceflight.space_mission",
					"friendly_name": "mer",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.space_mission.destination",
					"friendly_name": "Destination"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.mission_destination . \nVALUES ?x1 { :en.mars_exploration_rover } \n?x1 :spaceflight.space_mission.destination ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 60000402,
		"question": "where is the spirit and opportunity headed?",
		"answer": [
			"Mars"
		],
		"function": "none",
		"commonness": -14.111542566181667,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.mission_destination",
					"class": "spaceflight.mission_destination",
					"friendly_name": "Mission destination",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.mars_exploration_rover",
					"class": "spaceflight.space_mission",
					"friendly_name": "spirit and opportunity",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.space_mission.destination",
					"friendly_name": "Destination"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.mission_destination . \nVALUES ?x1 { :en.mars_exploration_rover } \n?x1 :spaceflight.space_mission.destination ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 61000000,
		"question": "which organizations and individuals have contributed data to wordnet?",
		"answer": [
			"Randee Tengi",
			"Helen Langone",
			"Pamela Wakefield",
			"Christiane Fellbaum",
			"Benjamin R. Haskell",
			"George A. Miller"
		],
		"function": "none",
		"commonness": -16.318339719259637,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.database.data_contributor",
					"class": "base.database.data_contributor",
					"friendly_name": "Data contributor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.wordnet",
					"class": "base.database.database",
					"friendly_name": "WordNet",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.database.database.data_contributor_s",
					"friendly_name": "Data contributor(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.database.data_contributor . \nVALUES ?x1 { :en.wordnet } \n?x1 :base.database.database.data_contributor_s ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 61000100,
		"question": "who is credited with contributing to the creation of wordnet?",
		"answer": [
			"Randee Tengi",
			"Christiane Fellbaum",
			"Benjamin R. Haskell",
			"George A. Miller",
			"Pamela Wakefield",
			"Helen Langone"
		],
		"function": "none",
		"commonness": -16.318339719259637,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.database.data_contributor",
					"class": "base.database.data_contributor",
					"friendly_name": "Data contributor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.wordnet",
					"class": "base.database.database",
					"friendly_name": "WordNet",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.database.database.data_contributor_s",
					"friendly_name": "Data contributor(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.database.data_contributor . \nVALUES ?x1 { :en.wordnet } \n?x1 :base.database.database.data_contributor_s ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 61000101,
		"question": "who is credited with contributing to the creation of princeton wordnet?",
		"answer": [
			"Randee Tengi",
			"Pamela Wakefield",
			"Benjamin R. Haskell",
			"Christiane Fellbaum",
			"Helen Langone",
			"George A. Miller"
		],
		"function": "none",
		"commonness": -16.318339719259637,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.database.data_contributor",
					"class": "base.database.data_contributor",
					"friendly_name": "Data contributor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.wordnet",
					"class": "base.database.database",
					"friendly_name": "princeton wordnet",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.database.database.data_contributor_s",
					"friendly_name": "Data contributor(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.database.data_contributor . \nVALUES ?x1 { :en.wordnet } \n?x1 :base.database.database.data_contributor_s ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 61000200,
		"question": "who have contributed data to wordnet?",
		"answer": [
			"Benjamin R. Haskell",
			"George A. Miller",
			"Pamela Wakefield",
			"Christiane Fellbaum",
			"Randee Tengi",
			"Helen Langone"
		],
		"function": "none",
		"commonness": -16.318339719259637,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.database.data_contributor",
					"class": "base.database.data_contributor",
					"friendly_name": "Data contributor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.wordnet",
					"class": "base.database.database",
					"friendly_name": "WordNet",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.database.database.data_contributor_s",
					"friendly_name": "Data contributor(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.database.data_contributor . \nVALUES ?x1 { :en.wordnet } \n?x1 :base.database.database.data_contributor_s ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 61000201,
		"question": "who have contributed data to princeton wordnet?",
		"answer": [
			"Pamela Wakefield",
			"Helen Langone",
			"Randee Tengi",
			"George A. Miller",
			"Benjamin R. Haskell",
			"Christiane Fellbaum"
		],
		"function": "none",
		"commonness": -16.318339719259637,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.database.data_contributor",
					"class": "base.database.data_contributor",
					"friendly_name": "Data contributor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.wordnet",
					"class": "base.database.database",
					"friendly_name": "princeton wordnet",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.database.database.data_contributor_s",
					"friendly_name": "Data contributor(s)"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.database.data_contributor . \nVALUES ?x1 { :en.wordnet } \n?x1 :base.database.database.data_contributor_s ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]