[
	{
		"qid": 177000102,
		"question": "what astronimical discoverty projects did geoffrey w. marcy participate in?",
		"answer": [
			"Eta-Earth Survey for Low Mass Planets"
		],
		"function": "none",
		"commonness": -25.741619783117866,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.astronomical_survey_project_organization",
					"class": "astronomy.astronomical_survey_project_organization",
					"friendly_name": "Astronomical Survey/Project Organization",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "astronomy.astronomical_discovery",
					"class": "astronomy.astronomical_discovery",
					"friendly_name": "Astronomical Discovery",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.geoffrey_marcy",
					"class": "astronomy.astronomer",
					"friendly_name": "geoffrey w. marcy",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "astronomy.astronomical_discovery.discovery_organization",
					"friendly_name": "Discovery Organization"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "astronomy.astronomer.astronomical_objects_discovered",
					"friendly_name": "Astronomical objects discovered"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.astronomical_survey_project_organization . \n?x1 :type.object.type :astronomy.astronomical_discovery . \nVALUES ?x2 { :en.geoffrey_marcy } \n?x1 :astronomy.astronomical_discovery.discovery_organization ?x0 . \n?x2 :astronomy.astronomer.astronomical_objects_discovered ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 177000200,
		"question": "what are the astronomical discovery projects to which geoffrey marcy contributed?",
		"answer": [
			"Eta-Earth Survey for Low Mass Planets"
		],
		"function": "none",
		"commonness": -25.741619783117866,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.astronomical_survey_project_organization",
					"class": "astronomy.astronomical_survey_project_organization",
					"friendly_name": "Astronomical Survey/Project Organization",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "astronomy.astronomical_discovery",
					"class": "astronomy.astronomical_discovery",
					"friendly_name": "Astronomical Discovery",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.geoffrey_marcy",
					"class": "astronomy.astronomer",
					"friendly_name": "Geoffrey Marcy",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "astronomy.astronomical_discovery.discovery_organization",
					"friendly_name": "Discovery Organization"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "astronomy.astronomer.astronomical_objects_discovered",
					"friendly_name": "Astronomical objects discovered"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.astronomical_survey_project_organization . \n?x1 :type.object.type :astronomy.astronomical_discovery . \nVALUES ?x2 { :en.geoffrey_marcy } \n?x1 :astronomy.astronomical_discovery.discovery_organization ?x0 . \n?x2 :astronomy.astronomer.astronomical_objects_discovered ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 177000201,
		"question": "what are the astronomical discovery projects to which geoff marcy contributed?",
		"answer": [
			"Eta-Earth Survey for Low Mass Planets"
		],
		"function": "none",
		"commonness": -25.741619783117866,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.astronomical_survey_project_organization",
					"class": "astronomy.astronomical_survey_project_organization",
					"friendly_name": "Astronomical Survey/Project Organization",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "astronomy.astronomical_discovery",
					"class": "astronomy.astronomical_discovery",
					"friendly_name": "Astronomical Discovery",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.geoffrey_marcy",
					"class": "astronomy.astronomer",
					"friendly_name": "geoff marcy",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "astronomy.astronomical_discovery.discovery_organization",
					"friendly_name": "Discovery Organization"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "astronomy.astronomer.astronomical_objects_discovered",
					"friendly_name": "Astronomical objects discovered"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.astronomical_survey_project_organization . \n?x1 :type.object.type :astronomy.astronomical_discovery . \nVALUES ?x2 { :en.geoffrey_marcy } \n?x1 :astronomy.astronomical_discovery.discovery_organization ?x0 . \n?x2 :astronomy.astronomer.astronomical_objects_discovered ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 177000202,
		"question": "what are the astronomical discovery projects to which geoffrey w. marcy contributed?",
		"answer": [
			"Eta-Earth Survey for Low Mass Planets"
		],
		"function": "none",
		"commonness": -25.741619783117866,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.astronomical_survey_project_organization",
					"class": "astronomy.astronomical_survey_project_organization",
					"friendly_name": "Astronomical Survey/Project Organization",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "astronomy.astronomical_discovery",
					"class": "astronomy.astronomical_discovery",
					"friendly_name": "Astronomical Discovery",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.geoffrey_marcy",
					"class": "astronomy.astronomer",
					"friendly_name": "geoffrey w. marcy",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "astronomy.astronomical_discovery.discovery_organization",
					"friendly_name": "Discovery Organization"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "astronomy.astronomer.astronomical_objects_discovered",
					"friendly_name": "Astronomical objects discovered"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.astronomical_survey_project_organization . \n?x1 :type.object.type :astronomy.astronomical_discovery . \nVALUES ?x2 { :en.geoffrey_marcy } \n?x1 :astronomy.astronomical_discovery.discovery_organization ?x0 . \n?x2 :astronomy.astronomer.astronomical_objects_discovered ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 178000000,
		"question": "what kinds of tv programs use symphony no.9 as theme song?",
		"answer": [
			"Comedy",
			"Sitcom",
			"Comedy film"
		],
		"function": "none",
		"commonness": -22.50492187100238,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "tv.tv_genre",
					"class": "tv.tv_genre",
					"friendly_name": "TV Genre",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "tv.tv_program",
					"class": "tv.tv_program",
					"friendly_name": "TV Program",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.symphony_no_9",
					"class": "tv.tv_theme_song",
					"friendly_name": "Symphony No.9",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "tv.tv_program.genre",
					"friendly_name": "Genre"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "tv.tv_theme_song.theme_song_for",
					"friendly_name": "Theme Song For"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :tv.tv_genre . \n?x1 :type.object.type :tv.tv_program . \nVALUES ?x2 { :en.symphony_no_9 } \n?x1 :tv.tv_program.genre ?x0 . \n?x2 :tv.tv_theme_song.theme_song_for ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 178000001,
		"question": "what kinds of tv programs use beethoven's ninth symphony as theme song?",
		"answer": [
			"Comedy",
			"Comedy film",
			"Sitcom"
		],
		"function": "none",
		"commonness": -22.50492187100238,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "tv.tv_genre",
					"class": "tv.tv_genre",
					"friendly_name": "TV Genre",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "tv.tv_program",
					"class": "tv.tv_program",
					"friendly_name": "TV Program",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.symphony_no_9",
					"class": "tv.tv_theme_song",
					"friendly_name": "beethoven's ninth symphony",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "tv.tv_program.genre",
					"friendly_name": "Genre"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "tv.tv_theme_song.theme_song_for",
					"friendly_name": "Theme Song For"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :tv.tv_genre . \n?x1 :type.object.type :tv.tv_program . \nVALUES ?x2 { :en.symphony_no_9 } \n?x1 :tv.tv_program.genre ?x0 . \n?x2 :tv.tv_theme_song.theme_song_for ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 178000002,
		"question": "what kinds of tv programs use beethoven's ninth as theme song?",
		"answer": [
			"Sitcom",
			"Comedy film",
			"Comedy"
		],
		"function": "none",
		"commonness": -22.50492187100238,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "tv.tv_genre",
					"class": "tv.tv_genre",
					"friendly_name": "TV Genre",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "tv.tv_program",
					"class": "tv.tv_program",
					"friendly_name": "TV Program",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.symphony_no_9",
					"class": "tv.tv_theme_song",
					"friendly_name": "beethoven's ninth",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "tv.tv_program.genre",
					"friendly_name": "Genre"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "tv.tv_theme_song.theme_song_for",
					"friendly_name": "Theme Song For"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :tv.tv_genre . \n?x1 :type.object.type :tv.tv_program . \nVALUES ?x2 { :en.symphony_no_9 } \n?x1 :tv.tv_program.genre ?x0 . \n?x2 :tv.tv_theme_song.theme_song_for ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 178000100,
		"question": "symphony no.9 is used as a theme song for what types of television programs?",
		"answer": [
			"Sitcom",
			"Comedy film",
			"Comedy"
		],
		"function": "none",
		"commonness": -22.50492187100238,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "tv.tv_genre",
					"class": "tv.tv_genre",
					"friendly_name": "TV Genre",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "tv.tv_program",
					"class": "tv.tv_program",
					"friendly_name": "TV Program",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.symphony_no_9",
					"class": "tv.tv_theme_song",
					"friendly_name": "Symphony No.9",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "tv.tv_program.genre",
					"friendly_name": "Genre"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "tv.tv_theme_song.theme_song_for",
					"friendly_name": "Theme Song For"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :tv.tv_genre . \n?x1 :type.object.type :tv.tv_program . \nVALUES ?x2 { :en.symphony_no_9 } \n?x1 :tv.tv_program.genre ?x0 . \n?x2 :tv.tv_theme_song.theme_song_for ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 178000101,
		"question": "beethoven's ninth symphony is used as a theme song for what types of television programs?",
		"answer": [
			"Sitcom",
			"Comedy",
			"Comedy film"
		],
		"function": "none",
		"commonness": -22.50492187100238,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "tv.tv_genre",
					"class": "tv.tv_genre",
					"friendly_name": "TV Genre",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "tv.tv_program",
					"class": "tv.tv_program",
					"friendly_name": "TV Program",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.symphony_no_9",
					"class": "tv.tv_theme_song",
					"friendly_name": "beethoven's ninth symphony",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "tv.tv_program.genre",
					"friendly_name": "Genre"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "tv.tv_theme_song.theme_song_for",
					"friendly_name": "Theme Song For"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :tv.tv_genre . \n?x1 :type.object.type :tv.tv_program . \nVALUES ?x2 { :en.symphony_no_9 } \n?x1 :tv.tv_program.genre ?x0 . \n?x2 :tv.tv_theme_song.theme_song_for ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 178000102,
		"question": "beethoven's ninth is used as a theme song for what types of television programs?",
		"answer": [
			"Sitcom",
			"Comedy film",
			"Comedy"
		],
		"function": "none",
		"commonness": -22.50492187100238,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "tv.tv_genre",
					"class": "tv.tv_genre",
					"friendly_name": "TV Genre",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "tv.tv_program",
					"class": "tv.tv_program",
					"friendly_name": "TV Program",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.symphony_no_9",
					"class": "tv.tv_theme_song",
					"friendly_name": "beethoven's ninth",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "tv.tv_program.genre",
					"friendly_name": "Genre"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "tv.tv_theme_song.theme_song_for",
					"friendly_name": "Theme Song For"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :tv.tv_genre . \n?x1 :type.object.type :tv.tv_program . \nVALUES ?x2 { :en.symphony_no_9 } \n?x1 :tv.tv_program.genre ?x0 . \n?x2 :tv.tv_theme_song.theme_song_for ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 178000200,
		"question": "what are the genres of tv programs for which symphony no.9 has been used as the theme song?",
		"answer": [
			"Comedy film",
			"Sitcom",
			"Comedy"
		],
		"function": "none",
		"commonness": -22.50492187100238,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "tv.tv_genre",
					"class": "tv.tv_genre",
					"friendly_name": "TV Genre",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "tv.tv_program",
					"class": "tv.tv_program",
					"friendly_name": "TV Program",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.symphony_no_9",
					"class": "tv.tv_theme_song",
					"friendly_name": "Symphony No.9",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "tv.tv_program.genre",
					"friendly_name": "Genre"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "tv.tv_theme_song.theme_song_for",
					"friendly_name": "Theme Song For"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :tv.tv_genre . \n?x1 :type.object.type :tv.tv_program . \nVALUES ?x2 { :en.symphony_no_9 } \n?x1 :tv.tv_program.genre ?x0 . \n?x2 :tv.tv_theme_song.theme_song_for ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 178000201,
		"question": "what are the genres of tv programs for which beethoven's ninth symphony has been used as the theme song?",
		"answer": [
			"Sitcom",
			"Comedy",
			"Comedy film"
		],
		"function": "none",
		"commonness": -22.50492187100238,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "tv.tv_genre",
					"class": "tv.tv_genre",
					"friendly_name": "TV Genre",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "tv.tv_program",
					"class": "tv.tv_program",
					"friendly_name": "TV Program",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.symphony_no_9",
					"class": "tv.tv_theme_song",
					"friendly_name": "beethoven's ninth symphony",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "tv.tv_program.genre",
					"friendly_name": "Genre"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "tv.tv_theme_song.theme_song_for",
					"friendly_name": "Theme Song For"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :tv.tv_genre . \n?x1 :type.object.type :tv.tv_program . \nVALUES ?x2 { :en.symphony_no_9 } \n?x1 :tv.tv_program.genre ?x0 . \n?x2 :tv.tv_theme_song.theme_song_for ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 178000202,
		"question": "what are the genres of tv programs for which beethoven's ninth has been used as the theme song?",
		"answer": [
			"Sitcom",
			"Comedy film",
			"Comedy"
		],
		"function": "none",
		"commonness": -22.50492187100238,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "tv.tv_genre",
					"class": "tv.tv_genre",
					"friendly_name": "TV Genre",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "tv.tv_program",
					"class": "tv.tv_program",
					"friendly_name": "TV Program",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.symphony_no_9",
					"class": "tv.tv_theme_song",
					"friendly_name": "beethoven's ninth",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "tv.tv_program.genre",
					"friendly_name": "Genre"
				},
				{
					"start": 2,
					"end": 1,
					"relation": "tv.tv_theme_song.theme_song_for",
					"friendly_name": "Theme Song For"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :tv.tv_genre . \n?x1 :type.object.type :tv.tv_program . \nVALUES ?x2 { :en.symphony_no_9 } \n?x1 :tv.tv_program.genre ?x0 . \n?x2 :tv.tv_theme_song.theme_song_for ?x1 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 179000000,
		"question": "in which casino we can see a show that is also played in wynn las vegas?",
		"answer": [
			"Encore Las Vegas",
			"The Mirage"
		],
		"function": "none",
		"commonness": -27.209408049585555,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.casinos.casino",
					"class": "base.casinos.casino",
					"friendly_name": "Casino",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.casinos.casino_show",
					"class": "base.casinos.casino_show",
					"friendly_name": "Casino Show",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.wynn_las_vegas",
					"class": "base.casinos.casino",
					"friendly_name": "Wynn Las Vegas",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.casinos.casino_show.in_casino",
					"friendly_name": "In casino"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.casinos.casino_show.in_casino",
					"friendly_name": "In casino"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.casinos.casino . \n?x1 :type.object.type :base.casinos.casino_show . \nVALUES ?x2 { :en.wynn_las_vegas } \n?x1 :base.casinos.casino_show.in_casino ?x0 . \n?x1 :base.casinos.casino_show.in_casino ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 179000001,
		"question": "in which casino we can see a show that is also played in wynn hotel?",
		"answer": [
			"The Mirage",
			"Encore Las Vegas"
		],
		"function": "none",
		"commonness": -27.209408049585555,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.casinos.casino",
					"class": "base.casinos.casino",
					"friendly_name": "Casino",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.casinos.casino_show",
					"class": "base.casinos.casino_show",
					"friendly_name": "Casino Show",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.wynn_las_vegas",
					"class": "base.casinos.casino",
					"friendly_name": "wynn hotel",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.casinos.casino_show.in_casino",
					"friendly_name": "In casino"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.casinos.casino_show.in_casino",
					"friendly_name": "In casino"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.casinos.casino . \n?x1 :type.object.type :base.casinos.casino_show . \nVALUES ?x2 { :en.wynn_las_vegas } \n?x1 :base.casinos.casino_show.in_casino ?x0 . \n?x1 :base.casinos.casino_show.in_casino ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 179000002,
		"question": "in which casino we can see a show that is also played in the wynn?",
		"answer": [
			"Encore Las Vegas",
			"The Mirage"
		],
		"function": "none",
		"commonness": -27.209408049585555,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.casinos.casino",
					"class": "base.casinos.casino",
					"friendly_name": "Casino",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.casinos.casino_show",
					"class": "base.casinos.casino_show",
					"friendly_name": "Casino Show",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.wynn_las_vegas",
					"class": "base.casinos.casino",
					"friendly_name": "the wynn",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.casinos.casino_show.in_casino",
					"friendly_name": "In casino"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.casinos.casino_show.in_casino",
					"friendly_name": "In casino"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.casinos.casino . \n?x1 :type.object.type :base.casinos.casino_show . \nVALUES ?x2 { :en.wynn_las_vegas } \n?x1 :base.casinos.casino_show.in_casino ?x0 . \n?x1 :base.casinos.casino_show.in_casino ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 179000100,
		"question": "which casino has common shows with wynn las vegas?",
		"answer": [
			"The Mirage",
			"Encore Las Vegas"
		],
		"function": "none",
		"commonness": -27.209408049585555,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.casinos.casino",
					"class": "base.casinos.casino",
					"friendly_name": "Casino",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "base.casinos.casino_show",
					"class": "base.casinos.casino_show",
					"friendly_name": "Casino Show",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.wynn_las_vegas",
					"class": "base.casinos.casino",
					"friendly_name": "Wynn Las Vegas",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "base.casinos.casino_show.in_casino",
					"friendly_name": "In casino"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "base.casinos.casino_show.in_casino",
					"friendly_name": "In casino"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.casinos.casino . \n?x1 :type.object.type :base.casinos.casino_show . \nVALUES ?x2 { :en.wynn_las_vegas } \n?x1 :base.casinos.casino_show.in_casino ?x0 . \n?x1 :base.casinos.casino_show.in_casino ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	}
]