[
	{
		"qid": 157000101,
		"question": "who was the show idol produced by?",
		"answer": [
			"19 Entertainment"
		],
		"function": "none",
		"commonness": -11.985498092691113,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "broadcast.producer",
					"class": "broadcast.producer",
					"friendly_name": "Broadcast Producer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.american_idol",
					"class": "broadcast.content",
					"friendly_name": "idol",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.producer.produces",
					"friendly_name": "Produces"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :broadcast.producer . \nVALUES ?x1 { :en.american_idol } \n?x0 :broadcast.producer.produces ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 157000102,
		"question": "who was the show america idol produced by?",
		"answer": [
			"19 Entertainment"
		],
		"function": "none",
		"commonness": -11.985498092691113,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "broadcast.producer",
					"class": "broadcast.producer",
					"friendly_name": "Broadcast Producer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.american_idol",
					"class": "broadcast.content",
					"friendly_name": "america idol",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.producer.produces",
					"friendly_name": "Produces"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :broadcast.producer . \nVALUES ?x1 { :en.american_idol } \n?x0 :broadcast.producer.produces ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 157000200,
		"question": "who was the person that produced american idol?",
		"answer": [
			"19 Entertainment"
		],
		"function": "none",
		"commonness": -11.985498092691113,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "broadcast.producer",
					"class": "broadcast.producer",
					"friendly_name": "Broadcast Producer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.american_idol",
					"class": "broadcast.content",
					"friendly_name": "American Idol",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.producer.produces",
					"friendly_name": "Produces"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :broadcast.producer . \nVALUES ?x1 { :en.american_idol } \n?x0 :broadcast.producer.produces ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 157000201,
		"question": "who was the person that produced idol?",
		"answer": [
			"19 Entertainment"
		],
		"function": "none",
		"commonness": -11.985498092691113,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "broadcast.producer",
					"class": "broadcast.producer",
					"friendly_name": "Broadcast Producer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.american_idol",
					"class": "broadcast.content",
					"friendly_name": "idol",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.producer.produces",
					"friendly_name": "Produces"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :broadcast.producer . \nVALUES ?x1 { :en.american_idol } \n?x0 :broadcast.producer.produces ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 157000202,
		"question": "who was the person that produced america idol?",
		"answer": [
			"19 Entertainment"
		],
		"function": "none",
		"commonness": -11.985498092691113,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "broadcast.producer",
					"class": "broadcast.producer",
					"friendly_name": "Broadcast Producer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.american_idol",
					"class": "broadcast.content",
					"friendly_name": "america idol",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.producer.produces",
					"friendly_name": "Produces"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :broadcast.producer . \nVALUES ?x1 { :en.american_idol } \n?x0 :broadcast.producer.produces ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 157000300,
		"question": "who is the broadcast producer of american idol?",
		"answer": [
			"19 Entertainment"
		],
		"function": "none",
		"commonness": -11.985498092691113,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "broadcast.producer",
					"class": "broadcast.producer",
					"friendly_name": "Broadcast Producer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.american_idol",
					"class": "broadcast.content",
					"friendly_name": "American Idol",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.producer.produces",
					"friendly_name": "Produces"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :broadcast.producer . \nVALUES ?x1 { :en.american_idol } \n?x0 :broadcast.producer.produces ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 157000301,
		"question": "who is the broadcast producer of idol?",
		"answer": [
			"19 Entertainment"
		],
		"function": "none",
		"commonness": -11.985498092691113,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "broadcast.producer",
					"class": "broadcast.producer",
					"friendly_name": "Broadcast Producer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.american_idol",
					"class": "broadcast.content",
					"friendly_name": "idol",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.producer.produces",
					"friendly_name": "Produces"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :broadcast.producer . \nVALUES ?x1 { :en.american_idol } \n?x0 :broadcast.producer.produces ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 157000302,
		"question": "who is the broadcast producer of america idol?",
		"answer": [
			"19 Entertainment"
		],
		"function": "none",
		"commonness": -11.985498092691113,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "broadcast.producer",
					"class": "broadcast.producer",
					"friendly_name": "Broadcast Producer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.american_idol",
					"class": "broadcast.content",
					"friendly_name": "america idol",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.producer.produces",
					"friendly_name": "Produces"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :broadcast.producer . \nVALUES ?x1 { :en.american_idol } \n?x0 :broadcast.producer.produces ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 157000400,
		"question": "who made american idol?",
		"answer": [
			"19 Entertainment"
		],
		"function": "none",
		"commonness": -11.985498092691113,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "broadcast.producer",
					"class": "broadcast.producer",
					"friendly_name": "Broadcast Producer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.american_idol",
					"class": "broadcast.content",
					"friendly_name": "American Idol",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.producer.produces",
					"friendly_name": "Produces"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :broadcast.producer . \nVALUES ?x1 { :en.american_idol } \n?x0 :broadcast.producer.produces ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 157000402,
		"question": "who made america idol?",
		"answer": [
			"19 Entertainment"
		],
		"function": "none",
		"commonness": -11.985498092691113,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "broadcast.producer",
					"class": "broadcast.producer",
					"friendly_name": "Broadcast Producer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.american_idol",
					"class": "broadcast.content",
					"friendly_name": "america idol",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.producer.produces",
					"friendly_name": "Produces"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :broadcast.producer . \nVALUES ?x1 { :en.american_idol } \n?x0 :broadcast.producer.produces ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 157000500,
		"question": "who produced american idol?",
		"answer": [
			"19 Entertainment"
		],
		"function": "none",
		"commonness": -11.985498092691113,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "broadcast.producer",
					"class": "broadcast.producer",
					"friendly_name": "Broadcast Producer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.american_idol",
					"class": "broadcast.content",
					"friendly_name": "American Idol",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.producer.produces",
					"friendly_name": "Produces"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :broadcast.producer . \nVALUES ?x1 { :en.american_idol } \n?x0 :broadcast.producer.produces ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 157000502,
		"question": "who produced america idol?",
		"answer": [
			"19 Entertainment"
		],
		"function": "none",
		"commonness": -11.985498092691113,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "broadcast.producer",
					"class": "broadcast.producer",
					"friendly_name": "Broadcast Producer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.american_idol",
					"class": "broadcast.content",
					"friendly_name": "america idol",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "broadcast.producer.produces",
					"friendly_name": "Produces"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :broadcast.producer . \nVALUES ?x1 { :en.american_idol } \n?x0 :broadcast.producer.produces ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 158000000,
		"question": "what is the function of white house?",
		"answer": [
			"Palace",
			"Office",
			"Residential building"
		],
		"function": "none",
		"commonness": -11.732297848230546,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.building_function",
					"class": "architecture.building_function",
					"friendly_name": "Building function",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.white_house",
					"class": "architecture.building",
					"friendly_name": "White House",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.building_function.buildings",
					"friendly_name": "Buildings"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.building_function . \nVALUES ?x1 { :en.white_house } \n?x0 :architecture.building_function.buildings ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 158000100,
		"question": "the white house is used for what purpose?",
		"answer": [
			"Residential building",
			"Office",
			"Palace"
		],
		"function": "none",
		"commonness": -11.732297848230546,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.building_function",
					"class": "architecture.building_function",
					"friendly_name": "Building function",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.white_house",
					"class": "architecture.building",
					"friendly_name": "White House",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.building_function.buildings",
					"friendly_name": "Buildings"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.building_function . \nVALUES ?x1 { :en.white_house } \n?x0 :architecture.building_function.buildings ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 158000200,
		"question": "what is the use of the white house?",
		"answer": [
			"Office",
			"Residential building",
			"Palace"
		],
		"function": "none",
		"commonness": -11.732297848230546,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.building_function",
					"class": "architecture.building_function",
					"friendly_name": "Building function",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.white_house",
					"class": "architecture.building",
					"friendly_name": "White House",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.building_function.buildings",
					"friendly_name": "Buildings"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.building_function . \nVALUES ?x1 { :en.white_house } \n?x0 :architecture.building_function.buildings ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 158000300,
		"question": "what purposes does the white house have justified its existence?",
		"answer": [
			"Residential building",
			"Palace",
			"Office"
		],
		"function": "none",
		"commonness": -11.732297848230546,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.building_function",
					"class": "architecture.building_function",
					"friendly_name": "Building function",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.white_house",
					"class": "architecture.building",
					"friendly_name": "White House",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.building_function.buildings",
					"friendly_name": "Buildings"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.building_function . \nVALUES ?x1 { :en.white_house } \n?x0 :architecture.building_function.buildings ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 158000400,
		"question": "what is the white house used for?",
		"answer": [
			"Residential building",
			"Office",
			"Palace"
		],
		"function": "none",
		"commonness": -11.732297848230546,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "architecture.building_function",
					"class": "architecture.building_function",
					"friendly_name": "Building function",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.white_house",
					"class": "architecture.building",
					"friendly_name": "White House",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "architecture.building_function.buildings",
					"friendly_name": "Buildings"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :architecture.building_function . \nVALUES ?x1 { :en.white_house } \n?x0 :architecture.building_function.buildings ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 160000000,
		"question": "who are the developers of the microsoft windows operating system?",
		"answer": [
			"Microsoft"
		],
		"function": "none",
		"commonness": -9.49162595443204,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.operating_system_developer",
					"class": "computer.operating_system_developer",
					"friendly_name": "Operating System Developer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.microsoft_windows",
					"class": "computer.operating_system",
					"friendly_name": "Microsoft Windows",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "computer.operating_system_developer.operating_systems_developed",
					"friendly_name": "Operating Systems Developed"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.operating_system_developer . \nVALUES ?x1 { :en.microsoft_windows } \n?x0 :computer.operating_system_developer.operating_systems_developed ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 160000001,
		"question": "who are the developers of the windows operating system?",
		"answer": [
			"Microsoft"
		],
		"function": "none",
		"commonness": -9.49162595443204,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.operating_system_developer",
					"class": "computer.operating_system_developer",
					"friendly_name": "Operating System Developer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.microsoft_windows",
					"class": "computer.operating_system",
					"friendly_name": "windows",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "computer.operating_system_developer.operating_systems_developed",
					"friendly_name": "Operating Systems Developed"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.operating_system_developer . \nVALUES ?x1 { :en.microsoft_windows } \n?x0 :computer.operating_system_developer.operating_systems_developed ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 160000002,
		"question": "who are the developers of the ms windows operating system?",
		"answer": [
			"Microsoft"
		],
		"function": "none",
		"commonness": -9.49162595443204,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.operating_system_developer",
					"class": "computer.operating_system_developer",
					"friendly_name": "Operating System Developer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.microsoft_windows",
					"class": "computer.operating_system",
					"friendly_name": "ms windows",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "computer.operating_system_developer.operating_systems_developed",
					"friendly_name": "Operating Systems Developed"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.operating_system_developer . \nVALUES ?x1 { :en.microsoft_windows } \n?x0 :computer.operating_system_developer.operating_systems_developed ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 160000100,
		"question": "who developed the microsoft windows os?",
		"answer": [
			"Microsoft"
		],
		"function": "none",
		"commonness": -9.49162595443204,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.operating_system_developer",
					"class": "computer.operating_system_developer",
					"friendly_name": "Operating System Developer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.microsoft_windows",
					"class": "computer.operating_system",
					"friendly_name": "Microsoft Windows",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "computer.operating_system_developer.operating_systems_developed",
					"friendly_name": "Operating Systems Developed"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.operating_system_developer . \nVALUES ?x1 { :en.microsoft_windows } \n?x0 :computer.operating_system_developer.operating_systems_developed ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 160000101,
		"question": "who developed the windows os?",
		"answer": [
			"Microsoft"
		],
		"function": "none",
		"commonness": -9.49162595443204,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.operating_system_developer",
					"class": "computer.operating_system_developer",
					"friendly_name": "Operating System Developer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.microsoft_windows",
					"class": "computer.operating_system",
					"friendly_name": "windows",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "computer.operating_system_developer.operating_systems_developed",
					"friendly_name": "Operating Systems Developed"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.operating_system_developer . \nVALUES ?x1 { :en.microsoft_windows } \n?x0 :computer.operating_system_developer.operating_systems_developed ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 160000102,
		"question": "who developed the ms windows os?",
		"answer": [
			"Microsoft"
		],
		"function": "none",
		"commonness": -9.49162595443204,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.operating_system_developer",
					"class": "computer.operating_system_developer",
					"friendly_name": "Operating System Developer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.microsoft_windows",
					"class": "computer.operating_system",
					"friendly_name": "ms windows",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "computer.operating_system_developer.operating_systems_developed",
					"friendly_name": "Operating Systems Developed"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.operating_system_developer . \nVALUES ?x1 { :en.microsoft_windows } \n?x0 :computer.operating_system_developer.operating_systems_developed ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 160000200,
		"question": "microsoft windows was developed by who?",
		"answer": [
			"Microsoft"
		],
		"function": "none",
		"commonness": -9.49162595443204,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "computer.operating_system_developer",
					"class": "computer.operating_system_developer",
					"friendly_name": "Operating System Developer",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.microsoft_windows",
					"class": "computer.operating_system",
					"friendly_name": "Microsoft Windows",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "computer.operating_system_developer.operating_systems_developed",
					"friendly_name": "Operating Systems Developed"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :computer.operating_system_developer . \nVALUES ?x1 { :en.microsoft_windows } \n?x0 :computer.operating_system_developer.operating_systems_developed ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]