[
	{
		"qid": 73000502,
		"question": "what motif does disneyland's haunted manison feature?",
		"answer": [
			"Haunted house"
		],
		"function": "none",
		"commonness": -14.63675919580269,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "amusement_parks.ride_theme",
					"class": "amusement_parks.ride_theme",
					"friendly_name": "Amusement Ride Theme",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.haunted_mansion",
					"class": "amusement_parks.ride",
					"friendly_name": "haunted manison",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "amusement_parks.ride_theme.rides",
					"friendly_name": "Rides"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :amusement_parks.ride_theme . \nVALUES ?x1 { :en.haunted_mansion } \n?x0 :amusement_parks.ride_theme.rides ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 74000000,
		"question": "what is the status of the internet domain tm?",
		"answer": [
			"Active"
		],
		"function": "none",
		"commonness": -20.510332665302677,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "internet.top_level_domain_status",
					"class": "internet.top_level_domain_status",
					"friendly_name": "Top Level Domain Status",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.03y2w5",
					"class": "internet.top_level_domain",
					"friendly_name": "tm",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "internet.top_level_domain.status",
					"friendly_name": "Status"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :internet.top_level_domain_status . \nVALUES ?x1 { :m.03y2w5 } \n?x1 :internet.top_level_domain.status ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 74000100,
		"question": "what's the current situation of the tm domain?",
		"answer": [
			"Active"
		],
		"function": "none",
		"commonness": -20.510332665302677,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "internet.top_level_domain_status",
					"class": "internet.top_level_domain_status",
					"friendly_name": "Top Level Domain Status",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.03y2w5",
					"class": "internet.top_level_domain",
					"friendly_name": "tm",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "internet.top_level_domain.status",
					"friendly_name": "Status"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :internet.top_level_domain_status . \nVALUES ?x1 { :m.03y2w5 } \n?x1 :internet.top_level_domain.status ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 74000200,
		"question": "what status is the tm domain in?",
		"answer": [
			"Active"
		],
		"function": "none",
		"commonness": -20.510332665302677,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "internet.top_level_domain_status",
					"class": "internet.top_level_domain_status",
					"friendly_name": "Top Level Domain Status",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.03y2w5",
					"class": "internet.top_level_domain",
					"friendly_name": "tm",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "internet.top_level_domain.status",
					"friendly_name": "Status"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :internet.top_level_domain_status . \nVALUES ?x1 { :m.03y2w5 } \n?x1 :internet.top_level_domain.status ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 75000000,
		"question": "what magic sets were developed by aaron forsythe?",
		"answer": [
			"New Phyrexia",
			"Magic 2014"
		],
		"function": "none",
		"commonness": -20.865913182547885,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.mtgbase.magic_set",
					"class": "base.mtgbase.magic_set",
					"friendly_name": "Magic Set",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.0hnbhrc",
					"class": "base.mtgbase.magic_developer",
					"friendly_name": "Aaron Forsythe",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.mtgbase.magic_set.developer",
					"friendly_name": "Developer"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.mtgbase.magic_set . \nVALUES ?x1 { :m.0hnbhrc } \n?x0 :base.mtgbase.magic_set.developer ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 75000100,
		"question": "what magic sets has aaron forsythe developed?",
		"answer": [
			"New Phyrexia",
			"Magic 2014"
		],
		"function": "none",
		"commonness": -20.865913182547885,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.mtgbase.magic_set",
					"class": "base.mtgbase.magic_set",
					"friendly_name": "Magic Set",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.0hnbhrc",
					"class": "base.mtgbase.magic_developer",
					"friendly_name": "Aaron Forsythe",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.mtgbase.magic_set.developer",
					"friendly_name": "Developer"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.mtgbase.magic_set . \nVALUES ?x1 { :m.0hnbhrc } \n?x0 :base.mtgbase.magic_set.developer ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 75000200,
		"question": "what magic expansions has aaron forsythe developed?",
		"answer": [
			"Magic 2014",
			"New Phyrexia"
		],
		"function": "none",
		"commonness": -20.865913182547885,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.mtgbase.magic_set",
					"class": "base.mtgbase.magic_set",
					"friendly_name": "Magic Set",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.0hnbhrc",
					"class": "base.mtgbase.magic_developer",
					"friendly_name": "Aaron Forsythe",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.mtgbase.magic_set.developer",
					"friendly_name": "Developer"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.mtgbase.magic_set . \nVALUES ?x1 { :m.0hnbhrc } \n?x0 :base.mtgbase.magic_set.developer ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 75000300,
		"question": "aaron forsythe is the developer of which magic sets?",
		"answer": [
			"Magic 2014",
			"New Phyrexia"
		],
		"function": "none",
		"commonness": -20.865913182547885,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.mtgbase.magic_set",
					"class": "base.mtgbase.magic_set",
					"friendly_name": "Magic Set",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "m.0hnbhrc",
					"class": "base.mtgbase.magic_developer",
					"friendly_name": "Aaron Forsythe",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.mtgbase.magic_set.developer",
					"friendly_name": "Developer"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.mtgbase.magic_set . \nVALUES ?x1 { :m.0hnbhrc } \n?x0 :base.mtgbase.magic_set.developer ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 76000000,
		"question": "roe v. wade is a legal case about what?",
		"answer": [
			"Privacy",
			"Forced abortion"
		],
		"function": "none",
		"commonness": -14.835292995396896,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.legal_subject",
					"class": "law.legal_subject",
					"friendly_name": "Legal subject",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.roe_v_wade",
					"class": "law.legal_case",
					"friendly_name": "Roe v. Wade",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.legal_case.subject",
					"friendly_name": "Subject"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.legal_subject . \nVALUES ?x1 { :en.roe_v_wade } \n?x1 :law.legal_case.subject ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 76000001,
		"question": "roe vs. wade is a legal case about what?",
		"answer": [
			"Forced abortion",
			"Privacy"
		],
		"function": "none",
		"commonness": -14.835292995396896,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.legal_subject",
					"class": "law.legal_subject",
					"friendly_name": "Legal subject",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.roe_v_wade",
					"class": "law.legal_case",
					"friendly_name": "roe vs. wade",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.legal_case.subject",
					"friendly_name": "Subject"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.legal_subject . \nVALUES ?x1 { :en.roe_v_wade } \n?x1 :law.legal_case.subject ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 76000100,
		"question": "the court case roe v. wade deals with what issue?",
		"answer": [
			"Privacy",
			"Forced abortion"
		],
		"function": "none",
		"commonness": -14.835292995396896,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.legal_subject",
					"class": "law.legal_subject",
					"friendly_name": "Legal subject",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.roe_v_wade",
					"class": "law.legal_case",
					"friendly_name": "Roe v. Wade",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.legal_case.subject",
					"friendly_name": "Subject"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.legal_subject . \nVALUES ?x1 { :en.roe_v_wade } \n?x1 :law.legal_case.subject ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 76000200,
		"question": "what is the subject of the roe v. wade legal case?",
		"answer": [
			"Forced abortion",
			"Privacy"
		],
		"function": "none",
		"commonness": -14.835292995396896,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.legal_subject",
					"class": "law.legal_subject",
					"friendly_name": "Legal subject",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.roe_v_wade",
					"class": "law.legal_case",
					"friendly_name": "Roe v. Wade",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.legal_case.subject",
					"friendly_name": "Subject"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.legal_subject . \nVALUES ?x1 { :en.roe_v_wade } \n?x1 :law.legal_case.subject ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 76000201,
		"question": "what is the subject of the roe vs. wade legal case?",
		"answer": [
			"Privacy",
			"Forced abortion"
		],
		"function": "none",
		"commonness": -14.835292995396896,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.legal_subject",
					"class": "law.legal_subject",
					"friendly_name": "Legal subject",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.roe_v_wade",
					"class": "law.legal_case",
					"friendly_name": "roe vs. wade",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.legal_case.subject",
					"friendly_name": "Subject"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.legal_subject . \nVALUES ?x1 { :en.roe_v_wade } \n?x1 :law.legal_case.subject ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 76000300,
		"question": "what is the legal case roe v. wade about?",
		"answer": [
			"Forced abortion",
			"Privacy"
		],
		"function": "none",
		"commonness": -14.835292995396896,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.legal_subject",
					"class": "law.legal_subject",
					"friendly_name": "Legal subject",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.roe_v_wade",
					"class": "law.legal_case",
					"friendly_name": "Roe v. Wade",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.legal_case.subject",
					"friendly_name": "Subject"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.legal_subject . \nVALUES ?x1 { :en.roe_v_wade } \n?x1 :law.legal_case.subject ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 76000301,
		"question": "what is the legal case roe vs. wade about?",
		"answer": [
			"Forced abortion",
			"Privacy"
		],
		"function": "none",
		"commonness": -14.835292995396896,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.legal_subject",
					"class": "law.legal_subject",
					"friendly_name": "Legal subject",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.roe_v_wade",
					"class": "law.legal_case",
					"friendly_name": "roe vs. wade",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.legal_case.subject",
					"friendly_name": "Subject"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.legal_subject . \nVALUES ?x1 { :en.roe_v_wade } \n?x1 :law.legal_case.subject ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 76000400,
		"question": "what is the legal subject addressed by roe v. wade?",
		"answer": [
			"Forced abortion",
			"Privacy"
		],
		"function": "none",
		"commonness": -14.835292995396896,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.legal_subject",
					"class": "law.legal_subject",
					"friendly_name": "Legal subject",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.roe_v_wade",
					"class": "law.legal_case",
					"friendly_name": "Roe v. Wade",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.legal_case.subject",
					"friendly_name": "Subject"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.legal_subject . \nVALUES ?x1 { :en.roe_v_wade } \n?x1 :law.legal_case.subject ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 76000401,
		"question": "what is the legal subject addressed by roe vs. wade?",
		"answer": [
			"Privacy",
			"Forced abortion"
		],
		"function": "none",
		"commonness": -14.835292995396896,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.legal_subject",
					"class": "law.legal_subject",
					"friendly_name": "Legal subject",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.roe_v_wade",
					"class": "law.legal_case",
					"friendly_name": "roe vs. wade",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.legal_case.subject",
					"friendly_name": "Subject"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.legal_subject . \nVALUES ?x1 { :en.roe_v_wade } \n?x1 :law.legal_case.subject ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 76000500,
		"question": "what subject was the roe v. wade case centered around?",
		"answer": [
			"Privacy",
			"Forced abortion"
		],
		"function": "none",
		"commonness": -14.835292995396896,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.legal_subject",
					"class": "law.legal_subject",
					"friendly_name": "Legal subject",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.roe_v_wade",
					"class": "law.legal_case",
					"friendly_name": "Roe v. Wade",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.legal_case.subject",
					"friendly_name": "Subject"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.legal_subject . \nVALUES ?x1 { :en.roe_v_wade } \n?x1 :law.legal_case.subject ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 76000501,
		"question": "what subject was the roe vs. wade case centered around?",
		"answer": [
			"Privacy",
			"Forced abortion"
		],
		"function": "none",
		"commonness": -14.835292995396896,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.legal_subject",
					"class": "law.legal_subject",
					"friendly_name": "Legal subject",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.roe_v_wade",
					"class": "law.legal_case",
					"friendly_name": "roe vs. wade",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.legal_case.subject",
					"friendly_name": "Subject"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.legal_subject . \nVALUES ?x1 { :en.roe_v_wade } \n?x1 :law.legal_case.subject ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 76000600,
		"question": "in the case roe v. wade, what legal subjects are concerned?",
		"answer": [
			"Privacy",
			"Forced abortion"
		],
		"function": "none",
		"commonness": -14.835292995396896,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.legal_subject",
					"class": "law.legal_subject",
					"friendly_name": "Legal subject",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.roe_v_wade",
					"class": "law.legal_case",
					"friendly_name": "Roe v. Wade",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.legal_case.subject",
					"friendly_name": "Subject"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.legal_subject . \nVALUES ?x1 { :en.roe_v_wade } \n?x1 :law.legal_case.subject ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 76000601,
		"question": "in the case roe vs. wade, what legal subjects are concerned?",
		"answer": [
			"Forced abortion",
			"Privacy"
		],
		"function": "none",
		"commonness": -14.835292995396896,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "law.legal_subject",
					"class": "law.legal_subject",
					"friendly_name": "Legal subject",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.roe_v_wade",
					"class": "law.legal_case",
					"friendly_name": "roe vs. wade",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "law.legal_case.subject",
					"friendly_name": "Subject"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :law.legal_subject . \nVALUES ?x1 { :en.roe_v_wade } \n?x1 :law.legal_case.subject ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 77000001,
		"question": "ub313 is in which discovery status?",
		"answer": [
			"Published"
		],
		"function": "none",
		"commonness": -22.408345197865902,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.astronomical_discovery_status",
					"class": "astronomy.astronomical_discovery_status",
					"friendly_name": "Astronomical Discovery Status",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.eris",
					"class": "astronomy.astronomical_discovery",
					"friendly_name": "ub313",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "astronomy.astronomical_discovery.status",
					"friendly_name": "Status"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.astronomical_discovery_status . \nVALUES ?x1 { :en.eris } \n?x1 :astronomy.astronomical_discovery.status ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 77000002,
		"question": "2003ub313 is in which discovery status?",
		"answer": [
			"Published"
		],
		"function": "none",
		"commonness": -22.408345197865902,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.astronomical_discovery_status",
					"class": "astronomy.astronomical_discovery_status",
					"friendly_name": "Astronomical Discovery Status",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.eris",
					"class": "astronomy.astronomical_discovery",
					"friendly_name": "2003ub313",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "astronomy.astronomical_discovery.status",
					"friendly_name": "Status"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.astronomical_discovery_status . \nVALUES ?x1 { :en.eris } \n?x1 :astronomy.astronomical_discovery.status ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 77000100,
		"question": "what is the current discovery status of eris?",
		"answer": [
			"Published"
		],
		"function": "none",
		"commonness": -22.408345197865902,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.astronomical_discovery_status",
					"class": "astronomy.astronomical_discovery_status",
					"friendly_name": "Astronomical Discovery Status",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.eris",
					"class": "astronomy.astronomical_discovery",
					"friendly_name": "Eris",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "astronomy.astronomical_discovery.status",
					"friendly_name": "Status"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.astronomical_discovery_status . \nVALUES ?x1 { :en.eris } \n?x1 :astronomy.astronomical_discovery.status ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 77000101,
		"question": "what is the current discovery status of ub313?",
		"answer": [
			"Published"
		],
		"function": "none",
		"commonness": -22.408345197865902,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "astronomy.astronomical_discovery_status",
					"class": "astronomy.astronomical_discovery_status",
					"friendly_name": "Astronomical Discovery Status",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.eris",
					"class": "astronomy.astronomical_discovery",
					"friendly_name": "ub313",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "astronomy.astronomical_discovery.status",
					"friendly_name": "Status"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :astronomy.astronomical_discovery_status . \nVALUES ?x1 { :en.eris } \n?x1 :astronomy.astronomical_discovery.status ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]