[
	{
		"qid": 107000300,
		"question": "what distilled spirits have a abv that is at most 40.0?",
		"answer": [
			"New Holland Beer Barrel Bourbon",
			"Kubanskaya",
			"Mekhong",
			"Ten High",
			"Old Crow",
			"Basil Hayden's",
			"Cougar Bourbon",
			"Frysk Hynder",
			"Père François V.S.",
			"Green Spot",
			"Alberta Premium",
			"Virginia Gentleman"
		],
		"function": "<=",
		"commonness": -17.031402011683234,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "distilled_spirits.distilled_spirit",
					"class": "distilled_spirits.distilled_spirit",
					"friendly_name": "Distilled spirit",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "40.0^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "40.0",
					"question_node": 0,
					"function": "<="
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "distilled_spirits.distilled_spirit.abv",
					"friendly_name": "Alcohol content"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :distilled_spirits.distilled_spirit . \nFILTER (?x1 <= 40.0)\n?x0 :distilled_spirits.distilled_spirit.abv ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 107000400,
		"question": "what distilled spirits have a percentage of alcohol by volume no higher than 40.0?",
		"answer": [
			"Frysk Hynder",
			"Cougar Bourbon",
			"New Holland Beer Barrel Bourbon",
			"Père François V.S.",
			"Virginia Gentleman",
			"Ten High",
			"Kubanskaya",
			"Basil Hayden's",
			"Mekhong",
			"Old Crow",
			"Alberta Premium",
			"Green Spot"
		],
		"function": "<=",
		"commonness": -17.031402011683234,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "distilled_spirits.distilled_spirit",
					"class": "distilled_spirits.distilled_spirit",
					"friendly_name": "Distilled spirit",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "40.0^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "40.0",
					"question_node": 0,
					"function": "<="
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "distilled_spirits.distilled_spirit.abv",
					"friendly_name": "Alcohol content"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :distilled_spirits.distilled_spirit . \nFILTER (?x1 <= 40.0)\n?x0 :distilled_spirits.distilled_spirit.abv ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 108000000,
		"question": "which lake is the longest?",
		"answer": [
			"Lake Tanganyika"
		],
		"function": "argmax",
		"commonness": -14.37345134131234,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.lakebase.lake",
					"class": "base.lakebase.lake",
					"friendly_name": "Lake",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "35.0^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "35.0",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "geography.lake.length",
					"friendly_name": "Max. length"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.lakebase.lake . \n{\nSELECT (MAX(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :base.lakebase.lake . \n?y0 :geography.lake.length ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :geography.lake.length ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 108000100,
		"question": "what is the name of the longest lake that there is?",
		"answer": [
			"Lake Tanganyika"
		],
		"function": "argmax",
		"commonness": -14.37345134131234,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.lakebase.lake",
					"class": "base.lakebase.lake",
					"friendly_name": "Lake",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "35.0^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "35.0",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "geography.lake.length",
					"friendly_name": "Max. length"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.lakebase.lake . \n{\nSELECT (MAX(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :base.lakebase.lake . \n?y0 :geography.lake.length ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :geography.lake.length ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 108000200,
		"question": "the longest lake is what?",
		"answer": [
			"Lake Tanganyika"
		],
		"function": "argmax",
		"commonness": -14.37345134131234,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.lakebase.lake",
					"class": "base.lakebase.lake",
					"friendly_name": "Lake",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "35.0^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "35.0",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "geography.lake.length",
					"friendly_name": "Max. length"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.lakebase.lake . \n{\nSELECT (MAX(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :base.lakebase.lake . \n?y0 :geography.lake.length ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :geography.lake.length ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 108000300,
		"question": "what is the longest lake?",
		"answer": [
			"Lake Tanganyika"
		],
		"function": "argmax",
		"commonness": -14.37345134131234,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.lakebase.lake",
					"class": "base.lakebase.lake",
					"friendly_name": "Lake",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "literal",
					"id": "35.0^^http://www.w3.org/2001/XMLSchema#double",
					"class": "type.float",
					"friendly_name": "35.0",
					"question_node": 0,
					"function": "argmax"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "geography.lake.length",
					"friendly_name": "Max. length"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.lakebase.lake . \n{\nSELECT (MAX(?y1) AS ?x1)  WHERE { \n?y0 :type.object.type :base.lakebase.lake . \n?y0 :geography.lake.length ?y1 . \nFILTER ( ?y0 != ?y1  )\n}\n}\n?x0 :geography.lake.length ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 110000000,
		"question": "how many spacecrafts are made by nasa?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -13.42642065655897,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.spacecraft",
					"class": "spaceflight.spacecraft",
					"friendly_name": "Spacecraft",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nasa",
					"class": "spaceflight.satellite_manufacturer",
					"friendly_name": "NASA",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.satellite_manufacturer.spacecraft_manufactured",
					"friendly_name": "Spacecraft manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.spacecraft . \nVALUES ?x1 { :en.nasa } \n?x1 :spaceflight.satellite_manufacturer.spacecraft_manufactured ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 110000001,
		"question": "how many spacecrafts are made by national aeronautics and space administration?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -13.42642065655897,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.spacecraft",
					"class": "spaceflight.spacecraft",
					"friendly_name": "Spacecraft",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nasa",
					"class": "spaceflight.satellite_manufacturer",
					"friendly_name": "national aeronautics and space administration",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.satellite_manufacturer.spacecraft_manufactured",
					"friendly_name": "Spacecraft manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.spacecraft . \nVALUES ?x1 { :en.nasa } \n?x1 :spaceflight.satellite_manufacturer.spacecraft_manufactured ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 110000002,
		"question": "how many spacecrafts are made by national aeronautic and space administration?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -13.42642065655897,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.spacecraft",
					"class": "spaceflight.spacecraft",
					"friendly_name": "Spacecraft",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nasa",
					"class": "spaceflight.satellite_manufacturer",
					"friendly_name": "national aeronautic and space administration",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.satellite_manufacturer.spacecraft_manufactured",
					"friendly_name": "Spacecraft manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.spacecraft . \nVALUES ?x1 { :en.nasa } \n?x1 :spaceflight.satellite_manufacturer.spacecraft_manufactured ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 110000100,
		"question": "how many different spacecrafts has nasa made?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -13.42642065655897,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.spacecraft",
					"class": "spaceflight.spacecraft",
					"friendly_name": "Spacecraft",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nasa",
					"class": "spaceflight.satellite_manufacturer",
					"friendly_name": "NASA",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.satellite_manufacturer.spacecraft_manufactured",
					"friendly_name": "Spacecraft manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.spacecraft . \nVALUES ?x1 { :en.nasa } \n?x1 :spaceflight.satellite_manufacturer.spacecraft_manufactured ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 110000101,
		"question": "how many different spacecrafts has national aeronautics and space administration made?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -13.42642065655897,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.spacecraft",
					"class": "spaceflight.spacecraft",
					"friendly_name": "Spacecraft",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nasa",
					"class": "spaceflight.satellite_manufacturer",
					"friendly_name": "national aeronautics and space administration",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.satellite_manufacturer.spacecraft_manufactured",
					"friendly_name": "Spacecraft manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.spacecraft . \nVALUES ?x1 { :en.nasa } \n?x1 :spaceflight.satellite_manufacturer.spacecraft_manufactured ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 110000102,
		"question": "how many different spacecrafts has national aeronautic and space administration made?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -13.42642065655897,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.spacecraft",
					"class": "spaceflight.spacecraft",
					"friendly_name": "Spacecraft",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nasa",
					"class": "spaceflight.satellite_manufacturer",
					"friendly_name": "national aeronautic and space administration",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.satellite_manufacturer.spacecraft_manufactured",
					"friendly_name": "Spacecraft manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.spacecraft . \nVALUES ?x1 { :en.nasa } \n?x1 :spaceflight.satellite_manufacturer.spacecraft_manufactured ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 110000200,
		"question": "nasa produced how many spacecrafts?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -13.42642065655897,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.spacecraft",
					"class": "spaceflight.spacecraft",
					"friendly_name": "Spacecraft",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nasa",
					"class": "spaceflight.satellite_manufacturer",
					"friendly_name": "NASA",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.satellite_manufacturer.spacecraft_manufactured",
					"friendly_name": "Spacecraft manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.spacecraft . \nVALUES ?x1 { :en.nasa } \n?x1 :spaceflight.satellite_manufacturer.spacecraft_manufactured ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 110000201,
		"question": "national aeronautics and space administration produced how many spacecrafts?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -13.42642065655897,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.spacecraft",
					"class": "spaceflight.spacecraft",
					"friendly_name": "Spacecraft",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nasa",
					"class": "spaceflight.satellite_manufacturer",
					"friendly_name": "national aeronautics and space administration",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.satellite_manufacturer.spacecraft_manufactured",
					"friendly_name": "Spacecraft manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.spacecraft . \nVALUES ?x1 { :en.nasa } \n?x1 :spaceflight.satellite_manufacturer.spacecraft_manufactured ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 110000202,
		"question": "national aeronautic and space administration produced how many spacecrafts?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -13.42642065655897,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.spacecraft",
					"class": "spaceflight.spacecraft",
					"friendly_name": "Spacecraft",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nasa",
					"class": "spaceflight.satellite_manufacturer",
					"friendly_name": "national aeronautic and space administration",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.satellite_manufacturer.spacecraft_manufactured",
					"friendly_name": "Spacecraft manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.spacecraft . \nVALUES ?x1 { :en.nasa } \n?x1 :spaceflight.satellite_manufacturer.spacecraft_manufactured ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 110000300,
		"question": "nasa is responsible for the creation of how many spacecraft?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -13.42642065655897,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.spacecraft",
					"class": "spaceflight.spacecraft",
					"friendly_name": "Spacecraft",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nasa",
					"class": "spaceflight.satellite_manufacturer",
					"friendly_name": "NASA",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.satellite_manufacturer.spacecraft_manufactured",
					"friendly_name": "Spacecraft manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.spacecraft . \nVALUES ?x1 { :en.nasa } \n?x1 :spaceflight.satellite_manufacturer.spacecraft_manufactured ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 110000301,
		"question": "national aeronautics and space administration is responsible for the creation of how many spacecraft?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -13.42642065655897,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.spacecraft",
					"class": "spaceflight.spacecraft",
					"friendly_name": "Spacecraft",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nasa",
					"class": "spaceflight.satellite_manufacturer",
					"friendly_name": "national aeronautics and space administration",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.satellite_manufacturer.spacecraft_manufactured",
					"friendly_name": "Spacecraft manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.spacecraft . \nVALUES ?x1 { :en.nasa } \n?x1 :spaceflight.satellite_manufacturer.spacecraft_manufactured ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 110000400,
		"question": "nasa has fabricated how many different spacecrafts?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -13.42642065655897,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.spacecraft",
					"class": "spaceflight.spacecraft",
					"friendly_name": "Spacecraft",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nasa",
					"class": "spaceflight.satellite_manufacturer",
					"friendly_name": "NASA",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.satellite_manufacturer.spacecraft_manufactured",
					"friendly_name": "Spacecraft manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.spacecraft . \nVALUES ?x1 { :en.nasa } \n?x1 :spaceflight.satellite_manufacturer.spacecraft_manufactured ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 110000401,
		"question": "national aeronautics and space administration has fabricated how many different spacecrafts?",
		"answer": [
			"2"
		],
		"function": "count",
		"commonness": -13.42642065655897,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.spacecraft",
					"class": "spaceflight.spacecraft",
					"friendly_name": "Spacecraft",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.nasa",
					"class": "spaceflight.satellite_manufacturer",
					"friendly_name": "national aeronautics and space administration",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.satellite_manufacturer.spacecraft_manufactured",
					"friendly_name": "Spacecraft manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.spacecraft . \nVALUES ?x1 { :en.nasa } \n?x1 :spaceflight.satellite_manufacturer.spacecraft_manufactured ?x0 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 111000000,
		"question": "the north carolina wildlife action plan describes how many landcover classification systems?",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -20.422892642808407,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.landcover.classification_system",
					"class": "base.landcover.classification_system",
					"friendly_name": "Classification system",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.north_carolina_wildlife_action_plan",
					"class": "base.landcover.classification_publication",
					"friendly_name": "North Carolina Wildlife Action Plan",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.landcover.classification_system.classification_publication",
					"friendly_name": "Classification publication"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.landcover.classification_system . \nVALUES ?x1 { :en.north_carolina_wildlife_action_plan } \n?x0 :base.landcover.classification_system.classification_publication ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 111000100,
		"question": "what is the number of landcover classification systems defined by the north carolina wildlife action plan?",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -20.422892642808407,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.landcover.classification_system",
					"class": "base.landcover.classification_system",
					"friendly_name": "Classification system",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.north_carolina_wildlife_action_plan",
					"class": "base.landcover.classification_publication",
					"friendly_name": "North Carolina Wildlife Action Plan",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.landcover.classification_system.classification_publication",
					"friendly_name": "Classification publication"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.landcover.classification_system . \nVALUES ?x1 { :en.north_carolina_wildlife_action_plan } \n?x0 :base.landcover.classification_system.classification_publication ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 111000200,
		"question": "how many landcover classification systems are published by north carolina wildlife action plan?",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -20.422892642808407,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.landcover.classification_system",
					"class": "base.landcover.classification_system",
					"friendly_name": "Classification system",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.north_carolina_wildlife_action_plan",
					"class": "base.landcover.classification_publication",
					"friendly_name": "North Carolina Wildlife Action Plan",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.landcover.classification_system.classification_publication",
					"friendly_name": "Classification publication"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.landcover.classification_system . \nVALUES ?x1 { :en.north_carolina_wildlife_action_plan } \n?x0 :base.landcover.classification_system.classification_publication ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 111000300,
		"question": "how many landcover classification systems are described in the north carolina wildlife action plan?",
		"answer": [
			"3"
		],
		"function": "count",
		"commonness": -20.422892642808407,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.landcover.classification_system",
					"class": "base.landcover.classification_system",
					"friendly_name": "Classification system",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.north_carolina_wildlife_action_plan",
					"class": "base.landcover.classification_publication",
					"friendly_name": "North Carolina Wildlife Action Plan",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.landcover.classification_system.classification_publication",
					"friendly_name": "Classification publication"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.landcover.classification_system . \nVALUES ?x1 { :en.north_carolina_wildlife_action_plan } \n?x0 :base.landcover.classification_system.classification_publication ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]