[
	{
		"qid": 18000101,
		"question": "which tournaments has west indies won?",
		"answer": [
			"2012 ICC World Twenty20",
			"1979 Cricket World Cup"
		],
		"function": "none",
		"commonness": -16.18711506680925,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "cricket.cricket_tournament_event",
					"class": "cricket.cricket_tournament_event",
					"friendly_name": "Cricket Tournament Event",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.west_indian_cricket_team",
					"class": "sports.sports_team",
					"friendly_name": "west indies",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.sports_championship_event.champion",
					"friendly_name": "Champion"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :cricket.cricket_tournament_event . \nVALUES ?x1 { :en.west_indian_cricket_team } \n?x0 :sports.sports_championship_event.champion ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 18000102,
		"question": "which tournaments has windies won?",
		"answer": [
			"2012 ICC World Twenty20",
			"1979 Cricket World Cup"
		],
		"function": "none",
		"commonness": -16.18711506680925,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "cricket.cricket_tournament_event",
					"class": "cricket.cricket_tournament_event",
					"friendly_name": "Cricket Tournament Event",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.west_indian_cricket_team",
					"class": "sports.sports_team",
					"friendly_name": "windies",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.sports_championship_event.champion",
					"friendly_name": "Champion"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :cricket.cricket_tournament_event . \nVALUES ?x1 { :en.west_indian_cricket_team } \n?x0 :sports.sports_championship_event.champion ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 18000200,
		"question": "what are the tournaments that west indies cricket team was the champion?",
		"answer": [
			"1979 Cricket World Cup",
			"2012 ICC World Twenty20"
		],
		"function": "none",
		"commonness": -16.18711506680925,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "cricket.cricket_tournament_event",
					"class": "cricket.cricket_tournament_event",
					"friendly_name": "Cricket Tournament Event",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.west_indian_cricket_team",
					"class": "sports.sports_team",
					"friendly_name": "West Indies cricket team",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.sports_championship_event.champion",
					"friendly_name": "Champion"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :cricket.cricket_tournament_event . \nVALUES ?x1 { :en.west_indian_cricket_team } \n?x0 :sports.sports_championship_event.champion ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 18000201,
		"question": "what are the tournaments that west indies was the champion?",
		"answer": [
			"1979 Cricket World Cup",
			"2012 ICC World Twenty20"
		],
		"function": "none",
		"commonness": -16.18711506680925,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "cricket.cricket_tournament_event",
					"class": "cricket.cricket_tournament_event",
					"friendly_name": "Cricket Tournament Event",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.west_indian_cricket_team",
					"class": "sports.sports_team",
					"friendly_name": "west indies",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.sports_championship_event.champion",
					"friendly_name": "Champion"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :cricket.cricket_tournament_event . \nVALUES ?x1 { :en.west_indian_cricket_team } \n?x0 :sports.sports_championship_event.champion ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 18000202,
		"question": "what are the tournaments that windies was the champion?",
		"answer": [
			"1979 Cricket World Cup",
			"2012 ICC World Twenty20"
		],
		"function": "none",
		"commonness": -16.18711506680925,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "cricket.cricket_tournament_event",
					"class": "cricket.cricket_tournament_event",
					"friendly_name": "Cricket Tournament Event",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.west_indian_cricket_team",
					"class": "sports.sports_team",
					"friendly_name": "windies",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.sports_championship_event.champion",
					"friendly_name": "Champion"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :cricket.cricket_tournament_event . \nVALUES ?x1 { :en.west_indian_cricket_team } \n?x0 :sports.sports_championship_event.champion ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 18000300,
		"question": "which championships did the west indies cricket team win during tournament play?",
		"answer": [
			"1979 Cricket World Cup",
			"2012 ICC World Twenty20"
		],
		"function": "none",
		"commonness": -16.18711506680925,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "cricket.cricket_tournament_event",
					"class": "cricket.cricket_tournament_event",
					"friendly_name": "Cricket Tournament Event",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.west_indian_cricket_team",
					"class": "sports.sports_team",
					"friendly_name": "West Indies cricket team",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.sports_championship_event.champion",
					"friendly_name": "Champion"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :cricket.cricket_tournament_event . \nVALUES ?x1 { :en.west_indian_cricket_team } \n?x0 :sports.sports_championship_event.champion ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 18000301,
		"question": "which championships did the west indies win during tournament play?",
		"answer": [
			"2012 ICC World Twenty20",
			"1979 Cricket World Cup"
		],
		"function": "none",
		"commonness": -16.18711506680925,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "cricket.cricket_tournament_event",
					"class": "cricket.cricket_tournament_event",
					"friendly_name": "Cricket Tournament Event",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.west_indian_cricket_team",
					"class": "sports.sports_team",
					"friendly_name": "west indies",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.sports_championship_event.champion",
					"friendly_name": "Champion"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :cricket.cricket_tournament_event . \nVALUES ?x1 { :en.west_indian_cricket_team } \n?x0 :sports.sports_championship_event.champion ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 18000302,
		"question": "which championships did the windies win during tournament play?",
		"answer": [
			"2012 ICC World Twenty20",
			"1979 Cricket World Cup"
		],
		"function": "none",
		"commonness": -16.18711506680925,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "cricket.cricket_tournament_event",
					"class": "cricket.cricket_tournament_event",
					"friendly_name": "Cricket Tournament Event",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.west_indian_cricket_team",
					"class": "sports.sports_team",
					"friendly_name": "windies",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "sports.sports_championship_event.champion",
					"friendly_name": "Champion"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :cricket.cricket_tournament_event . \nVALUES ?x1 { :en.west_indian_cricket_team } \n?x0 :sports.sports_championship_event.champion ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 19000000,
		"question": "find the child literary genres of science fiction.",
		"answer": [
			"Soft science fiction",
			"Post-holocaust",
			"Future history",
			"Sword and planet",
			"Steampunk",
			"Cyberpunk",
			"Military science fiction",
			"Science fantasy",
			"Feminist science fiction",
			"Edisonade",
			"Space opera",
			"Hard science fiction",
			"Cosy catastrophe",
			"Planetary romance"
		],
		"function": "none",
		"commonness": -12.287833733329597,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "media_common.literary_genre",
					"class": "media_common.literary_genre",
					"friendly_name": "Literary Genre",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.science_fiction",
					"class": "media_common.media_genre",
					"friendly_name": "Science Fiction",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "media_common.media_genre.parent_genre",
					"friendly_name": "Parent genre"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :media_common.literary_genre . \nVALUES ?x1 { :en.science_fiction } \n?x0 :media_common.media_genre.parent_genre ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 19000100,
		"question": "what literary genres are borne from science fiction?",
		"answer": [
			"Post-holocaust",
			"Cyberpunk",
			"Cosy catastrophe",
			"Edisonade",
			"Future history",
			"Military science fiction",
			"Science fantasy",
			"Planetary romance",
			"Feminist science fiction",
			"Soft science fiction",
			"Sword and planet",
			"Hard science fiction",
			"Steampunk",
			"Space opera"
		],
		"function": "none",
		"commonness": -12.287833733329597,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "media_common.literary_genre",
					"class": "media_common.literary_genre",
					"friendly_name": "Literary Genre",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.science_fiction",
					"class": "media_common.media_genre",
					"friendly_name": "Science Fiction",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "media_common.media_genre.parent_genre",
					"friendly_name": "Parent genre"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :media_common.literary_genre . \nVALUES ?x1 { :en.science_fiction } \n?x0 :media_common.media_genre.parent_genre ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 19000101,
		"question": "what literary genres are borne from sci-fi?",
		"answer": [
			"Post-holocaust",
			"Soft science fiction",
			"Steampunk",
			"Planetary romance",
			"Cosy catastrophe",
			"Military science fiction",
			"Science fantasy",
			"Sword and planet",
			"Hard science fiction",
			"Feminist science fiction",
			"Future history",
			"Space opera",
			"Edisonade",
			"Cyberpunk"
		],
		"function": "none",
		"commonness": -12.287833733329597,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "media_common.literary_genre",
					"class": "media_common.literary_genre",
					"friendly_name": "Literary Genre",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.science_fiction",
					"class": "media_common.media_genre",
					"friendly_name": "sci-fi",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "media_common.media_genre.parent_genre",
					"friendly_name": "Parent genre"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :media_common.literary_genre . \nVALUES ?x1 { :en.science_fiction } \n?x0 :media_common.media_genre.parent_genre ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 19000200,
		"question": "which literary genres are child genre of science fiction?",
		"answer": [
			"Edisonade",
			"Cosy catastrophe",
			"Cyberpunk",
			"Feminist science fiction",
			"Military science fiction",
			"Steampunk",
			"Hard science fiction",
			"Future history",
			"Science fantasy",
			"Soft science fiction",
			"Post-holocaust",
			"Sword and planet",
			"Planetary romance",
			"Space opera"
		],
		"function": "none",
		"commonness": -12.287833733329597,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "media_common.literary_genre",
					"class": "media_common.literary_genre",
					"friendly_name": "Literary Genre",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.science_fiction",
					"class": "media_common.media_genre",
					"friendly_name": "Science Fiction",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "media_common.media_genre.parent_genre",
					"friendly_name": "Parent genre"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :media_common.literary_genre . \nVALUES ?x1 { :en.science_fiction } \n?x0 :media_common.media_genre.parent_genre ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 19000201,
		"question": "which literary genres are child genre of sci-fi?",
		"answer": [
			"Science fantasy",
			"Soft science fiction",
			"Space opera",
			"Military science fiction",
			"Feminist science fiction",
			"Post-holocaust",
			"Planetary romance",
			"Sword and planet",
			"Steampunk",
			"Hard science fiction",
			"Cyberpunk",
			"Cosy catastrophe",
			"Edisonade",
			"Future history"
		],
		"function": "none",
		"commonness": -12.287833733329597,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "media_common.literary_genre",
					"class": "media_common.literary_genre",
					"friendly_name": "Literary Genre",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.science_fiction",
					"class": "media_common.media_genre",
					"friendly_name": "sci-fi",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "media_common.media_genre.parent_genre",
					"friendly_name": "Parent genre"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :media_common.literary_genre . \nVALUES ?x1 { :en.science_fiction } \n?x0 :media_common.media_genre.parent_genre ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 20000000,
		"question": "gossip girl's serena van der woodsen is played by who?",
		"answer": [
			"Blake Lively"
		],
		"function": "none",
		"commonness": -16.335288345723843,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gossipgirl.actor",
					"class": "base.gossipgirl.actor",
					"friendly_name": "Actor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.serena_van_der_woodsen",
					"class": "base.gossipgirl.character",
					"friendly_name": "Serena van der Woodsen",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.gossipgirl.actor.plays",
					"friendly_name": "plays"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gossipgirl.actor . \nVALUES ?x1 { :en.serena_van_der_woodsen } \n?x0 :base.gossipgirl.actor.plays ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 20000001,
		"question": "gossip girl's serena is played by who?",
		"answer": [
			"Blake Lively"
		],
		"function": "none",
		"commonness": -16.335288345723843,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gossipgirl.actor",
					"class": "base.gossipgirl.actor",
					"friendly_name": "Actor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.serena_van_der_woodsen",
					"class": "base.gossipgirl.character",
					"friendly_name": "serena",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.gossipgirl.actor.plays",
					"friendly_name": "plays"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gossipgirl.actor . \nVALUES ?x1 { :en.serena_van_der_woodsen } \n?x0 :base.gossipgirl.actor.plays ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 20000100,
		"question": "by whom serena van der woodsen is portrayed?",
		"answer": [
			"Blake Lively"
		],
		"function": "none",
		"commonness": -16.335288345723843,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gossipgirl.actor",
					"class": "base.gossipgirl.actor",
					"friendly_name": "Actor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.serena_van_der_woodsen",
					"class": "base.gossipgirl.character",
					"friendly_name": "Serena van der Woodsen",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.gossipgirl.actor.plays",
					"friendly_name": "plays"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gossipgirl.actor . \nVALUES ?x1 { :en.serena_van_der_woodsen } \n?x0 :base.gossipgirl.actor.plays ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 20000101,
		"question": "by whom serena is portrayed?",
		"answer": [
			"Blake Lively"
		],
		"function": "none",
		"commonness": -16.335288345723843,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gossipgirl.actor",
					"class": "base.gossipgirl.actor",
					"friendly_name": "Actor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.serena_van_der_woodsen",
					"class": "base.gossipgirl.character",
					"friendly_name": "serena",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.gossipgirl.actor.plays",
					"friendly_name": "plays"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gossipgirl.actor . \nVALUES ?x1 { :en.serena_van_der_woodsen } \n?x0 :base.gossipgirl.actor.plays ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 20000200,
		"question": "which actress portrays serena van der woodsen in gossip girl?",
		"answer": [
			"Blake Lively"
		],
		"function": "none",
		"commonness": -16.335288345723843,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gossipgirl.actor",
					"class": "base.gossipgirl.actor",
					"friendly_name": "Actor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.serena_van_der_woodsen",
					"class": "base.gossipgirl.character",
					"friendly_name": "Serena van der Woodsen",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.gossipgirl.actor.plays",
					"friendly_name": "plays"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gossipgirl.actor . \nVALUES ?x1 { :en.serena_van_der_woodsen } \n?x0 :base.gossipgirl.actor.plays ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 20000201,
		"question": "which actress portrays serena in gossip girl?",
		"answer": [
			"Blake Lively"
		],
		"function": "none",
		"commonness": -16.335288345723843,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gossipgirl.actor",
					"class": "base.gossipgirl.actor",
					"friendly_name": "Actor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.serena_van_der_woodsen",
					"class": "base.gossipgirl.character",
					"friendly_name": "serena",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.gossipgirl.actor.plays",
					"friendly_name": "plays"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gossipgirl.actor . \nVALUES ?x1 { :en.serena_van_der_woodsen } \n?x0 :base.gossipgirl.actor.plays ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 20000300,
		"question": "who plays serena van der woodsen in gossip girl?",
		"answer": [
			"Blake Lively"
		],
		"function": "none",
		"commonness": -16.335288345723843,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gossipgirl.actor",
					"class": "base.gossipgirl.actor",
					"friendly_name": "Actor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.serena_van_der_woodsen",
					"class": "base.gossipgirl.character",
					"friendly_name": "Serena van der Woodsen",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.gossipgirl.actor.plays",
					"friendly_name": "plays"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gossipgirl.actor . \nVALUES ?x1 { :en.serena_van_der_woodsen } \n?x0 :base.gossipgirl.actor.plays ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 20000301,
		"question": "who plays serena in gossip girl?",
		"answer": [
			"Blake Lively"
		],
		"function": "none",
		"commonness": -16.335288345723843,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gossipgirl.actor",
					"class": "base.gossipgirl.actor",
					"friendly_name": "Actor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.serena_van_der_woodsen",
					"class": "base.gossipgirl.character",
					"friendly_name": "serena",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.gossipgirl.actor.plays",
					"friendly_name": "plays"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gossipgirl.actor . \nVALUES ?x1 { :en.serena_van_der_woodsen } \n?x0 :base.gossipgirl.actor.plays ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 20000500,
		"question": "in the show gossip girl, what actress plays serena van der woodsen?",
		"answer": [
			"Blake Lively"
		],
		"function": "none",
		"commonness": -16.335288345723843,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gossipgirl.actor",
					"class": "base.gossipgirl.actor",
					"friendly_name": "Actor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.serena_van_der_woodsen",
					"class": "base.gossipgirl.character",
					"friendly_name": "Serena van der Woodsen",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.gossipgirl.actor.plays",
					"friendly_name": "plays"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gossipgirl.actor . \nVALUES ?x1 { :en.serena_van_der_woodsen } \n?x0 :base.gossipgirl.actor.plays ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	},
	{
		"qid": 20000501,
		"question": "in the show gossip girl, what actress plays serena?",
		"answer": [
			"Blake Lively"
		],
		"function": "none",
		"commonness": -16.335288345723843,
		"num_node": 2,
		"num_edge": 1,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "base.gossipgirl.actor",
					"class": "base.gossipgirl.actor",
					"friendly_name": "Actor",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.serena_van_der_woodsen",
					"class": "base.gossipgirl.character",
					"friendly_name": "serena",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "base.gossipgirl.actor.plays",
					"friendly_name": "plays"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :base.gossipgirl.actor . \nVALUES ?x1 { :en.serena_van_der_woodsen } \n?x0 :base.gossipgirl.actor.plays ?x1 . \nFILTER ( ?x0 != ?x1  )\n}\n}"
	}
]