[
	{
		"qid": 191000000,
		"question": "find rockets made by chrysler group llc that support low earth orbit.",
		"answer": [
			"Saturn I",
			"Saturn IB"
		],
		"function": "none",
		"commonness": -25.76461195221662,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket",
					"class": "spaceflight.rocket",
					"friendly_name": "Rocket",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.low_earth_orbit",
					"class": "spaceflight.rocket_function",
					"friendly_name": "Low Earth orbit",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.chrysler",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "Chrysler Group LLC",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.rocket_function.rockets_supporting_this_function",
					"friendly_name": "Rockets supporting this function"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket . \nVALUES ?x1 { :en.low_earth_orbit } \nVALUES ?x2 { :en.chrysler } \n?x1 :spaceflight.rocket_function.rockets_supporting_this_function ?x0 . \n?x2 :spaceflight.rocket_manufacturer.rockets_manufactured ?x0 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 191000100,
		"question": "low earth orbit is supported by which chrysler group llc's rockets?",
		"answer": [
			"Saturn I",
			"Saturn IB"
		],
		"function": "none",
		"commonness": -25.76461195221662,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket",
					"class": "spaceflight.rocket",
					"friendly_name": "Rocket",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.low_earth_orbit",
					"class": "spaceflight.rocket_function",
					"friendly_name": "Low Earth orbit",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.chrysler",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "Chrysler Group LLC",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.rocket_function.rockets_supporting_this_function",
					"friendly_name": "Rockets supporting this function"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket . \nVALUES ?x1 { :en.low_earth_orbit } \nVALUES ?x2 { :en.chrysler } \n?x1 :spaceflight.rocket_function.rockets_supporting_this_function ?x0 . \n?x2 :spaceflight.rocket_manufacturer.rockets_manufactured ?x0 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 191000101,
		"question": "low earth orbit is supported by which chrysler's rockets?",
		"answer": [
			"Saturn IB",
			"Saturn I"
		],
		"function": "none",
		"commonness": -25.76461195221662,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket",
					"class": "spaceflight.rocket",
					"friendly_name": "Rocket",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.low_earth_orbit",
					"class": "spaceflight.rocket_function",
					"friendly_name": "Low Earth orbit",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.chrysler",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "chrysler",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.rocket_function.rockets_supporting_this_function",
					"friendly_name": "Rockets supporting this function"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket . \nVALUES ?x1 { :en.low_earth_orbit } \nVALUES ?x2 { :en.chrysler } \n?x1 :spaceflight.rocket_function.rockets_supporting_this_function ?x0 . \n?x2 :spaceflight.rocket_manufacturer.rockets_manufactured ?x0 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 191000102,
		"question": "low earth orbit is supported by which chrysler llc's rockets?",
		"answer": [
			"Saturn IB",
			"Saturn I"
		],
		"function": "none",
		"commonness": -25.76461195221662,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket",
					"class": "spaceflight.rocket",
					"friendly_name": "Rocket",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.low_earth_orbit",
					"class": "spaceflight.rocket_function",
					"friendly_name": "Low Earth orbit",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.chrysler",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "chrysler llc",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.rocket_function.rockets_supporting_this_function",
					"friendly_name": "Rockets supporting this function"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket . \nVALUES ?x1 { :en.low_earth_orbit } \nVALUES ?x2 { :en.chrysler } \n?x1 :spaceflight.rocket_function.rockets_supporting_this_function ?x0 . \n?x2 :spaceflight.rocket_manufacturer.rockets_manufactured ?x0 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 191000300,
		"question": "which rockets did chrysler group llc produce that allowed low earth orbit?",
		"answer": [
			"Saturn I",
			"Saturn IB"
		],
		"function": "none",
		"commonness": -25.76461195221662,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket",
					"class": "spaceflight.rocket",
					"friendly_name": "Rocket",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.low_earth_orbit",
					"class": "spaceflight.rocket_function",
					"friendly_name": "Low Earth orbit",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.chrysler",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "Chrysler Group LLC",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.rocket_function.rockets_supporting_this_function",
					"friendly_name": "Rockets supporting this function"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket . \nVALUES ?x1 { :en.low_earth_orbit } \nVALUES ?x2 { :en.chrysler } \n?x1 :spaceflight.rocket_function.rockets_supporting_this_function ?x0 . \n?x2 :spaceflight.rocket_manufacturer.rockets_manufactured ?x0 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 191000301,
		"question": "which rockets did chrysler produce that allowed low earth orbit?",
		"answer": [
			"Saturn IB",
			"Saturn I"
		],
		"function": "none",
		"commonness": -25.76461195221662,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket",
					"class": "spaceflight.rocket",
					"friendly_name": "Rocket",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.low_earth_orbit",
					"class": "spaceflight.rocket_function",
					"friendly_name": "Low Earth orbit",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.chrysler",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "chrysler",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.rocket_function.rockets_supporting_this_function",
					"friendly_name": "Rockets supporting this function"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket . \nVALUES ?x1 { :en.low_earth_orbit } \nVALUES ?x2 { :en.chrysler } \n?x1 :spaceflight.rocket_function.rockets_supporting_this_function ?x0 . \n?x2 :spaceflight.rocket_manufacturer.rockets_manufactured ?x0 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 191000302,
		"question": "which rockets did chrysler llc produce that allowed low earth orbit?",
		"answer": [
			"Saturn I",
			"Saturn IB"
		],
		"function": "none",
		"commonness": -25.76461195221662,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket",
					"class": "spaceflight.rocket",
					"friendly_name": "Rocket",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.low_earth_orbit",
					"class": "spaceflight.rocket_function",
					"friendly_name": "Low Earth orbit",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.chrysler",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "chrysler llc",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.rocket_function.rockets_supporting_this_function",
					"friendly_name": "Rockets supporting this function"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket . \nVALUES ?x1 { :en.low_earth_orbit } \nVALUES ?x2 { :en.chrysler } \n?x1 :spaceflight.rocket_function.rockets_supporting_this_function ?x0 . \n?x2 :spaceflight.rocket_manufacturer.rockets_manufactured ?x0 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 191000400,
		"question": "which of chrysler group llc's rockets are capable of low earth orbit?",
		"answer": [
			"Saturn IB",
			"Saturn I"
		],
		"function": "none",
		"commonness": -25.76461195221662,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket",
					"class": "spaceflight.rocket",
					"friendly_name": "Rocket",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.low_earth_orbit",
					"class": "spaceflight.rocket_function",
					"friendly_name": "Low Earth orbit",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.chrysler",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "Chrysler Group LLC",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.rocket_function.rockets_supporting_this_function",
					"friendly_name": "Rockets supporting this function"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket . \nVALUES ?x1 { :en.low_earth_orbit } \nVALUES ?x2 { :en.chrysler } \n?x1 :spaceflight.rocket_function.rockets_supporting_this_function ?x0 . \n?x2 :spaceflight.rocket_manufacturer.rockets_manufactured ?x0 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 191000401,
		"question": "which of chrysler's rockets are capable of low earth orbit?",
		"answer": [
			"Saturn IB",
			"Saturn I"
		],
		"function": "none",
		"commonness": -25.76461195221662,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket",
					"class": "spaceflight.rocket",
					"friendly_name": "Rocket",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.low_earth_orbit",
					"class": "spaceflight.rocket_function",
					"friendly_name": "Low Earth orbit",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.chrysler",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "chrysler",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.rocket_function.rockets_supporting_this_function",
					"friendly_name": "Rockets supporting this function"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket . \nVALUES ?x1 { :en.low_earth_orbit } \nVALUES ?x2 { :en.chrysler } \n?x1 :spaceflight.rocket_function.rockets_supporting_this_function ?x0 . \n?x2 :spaceflight.rocket_manufacturer.rockets_manufactured ?x0 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 191000402,
		"question": "which of chrysler llc's rockets are capable of low earth orbit?",
		"answer": [
			"Saturn I",
			"Saturn IB"
		],
		"function": "none",
		"commonness": -25.76461195221662,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket",
					"class": "spaceflight.rocket",
					"friendly_name": "Rocket",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.low_earth_orbit",
					"class": "spaceflight.rocket_function",
					"friendly_name": "Low Earth orbit",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.chrysler",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "chrysler llc",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.rocket_function.rockets_supporting_this_function",
					"friendly_name": "Rockets supporting this function"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket . \nVALUES ?x1 { :en.low_earth_orbit } \nVALUES ?x2 { :en.chrysler } \n?x1 :spaceflight.rocket_function.rockets_supporting_this_function ?x0 . \n?x2 :spaceflight.rocket_manufacturer.rockets_manufactured ?x0 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 191000500,
		"question": "which low earth orbit rockets are made by chrysler group llc?",
		"answer": [
			"Saturn I",
			"Saturn IB"
		],
		"function": "none",
		"commonness": -25.76461195221662,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket",
					"class": "spaceflight.rocket",
					"friendly_name": "Rocket",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.low_earth_orbit",
					"class": "spaceflight.rocket_function",
					"friendly_name": "Low Earth orbit",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.chrysler",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "Chrysler Group LLC",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.rocket_function.rockets_supporting_this_function",
					"friendly_name": "Rockets supporting this function"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket . \nVALUES ?x1 { :en.low_earth_orbit } \nVALUES ?x2 { :en.chrysler } \n?x1 :spaceflight.rocket_function.rockets_supporting_this_function ?x0 . \n?x2 :spaceflight.rocket_manufacturer.rockets_manufactured ?x0 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 191000501,
		"question": "which low earth orbit rockets are made by chrysler?",
		"answer": [
			"Saturn I",
			"Saturn IB"
		],
		"function": "none",
		"commonness": -25.76461195221662,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket",
					"class": "spaceflight.rocket",
					"friendly_name": "Rocket",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.low_earth_orbit",
					"class": "spaceflight.rocket_function",
					"friendly_name": "Low Earth orbit",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.chrysler",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "chrysler",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.rocket_function.rockets_supporting_this_function",
					"friendly_name": "Rockets supporting this function"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket . \nVALUES ?x1 { :en.low_earth_orbit } \nVALUES ?x2 { :en.chrysler } \n?x1 :spaceflight.rocket_function.rockets_supporting_this_function ?x0 . \n?x2 :spaceflight.rocket_manufacturer.rockets_manufactured ?x0 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 191000502,
		"question": "which low earth orbit rockets are made by chrysler llc?",
		"answer": [
			"Saturn IB",
			"Saturn I"
		],
		"function": "none",
		"commonness": -25.76461195221662,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket",
					"class": "spaceflight.rocket",
					"friendly_name": "Rocket",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.low_earth_orbit",
					"class": "spaceflight.rocket_function",
					"friendly_name": "Low Earth orbit",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.chrysler",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "chrysler llc",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.rocket_function.rockets_supporting_this_function",
					"friendly_name": "Rockets supporting this function"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket . \nVALUES ?x1 { :en.low_earth_orbit } \nVALUES ?x2 { :en.chrysler } \n?x1 :spaceflight.rocket_function.rockets_supporting_this_function ?x0 . \n?x2 :spaceflight.rocket_manufacturer.rockets_manufactured ?x0 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 191000600,
		"question": "what rockets that support low earth orbit are made by chrysler group llc?",
		"answer": [
			"Saturn I",
			"Saturn IB"
		],
		"function": "none",
		"commonness": -25.76461195221662,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket",
					"class": "spaceflight.rocket",
					"friendly_name": "Rocket",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.low_earth_orbit",
					"class": "spaceflight.rocket_function",
					"friendly_name": "Low Earth orbit",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.chrysler",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "Chrysler Group LLC",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.rocket_function.rockets_supporting_this_function",
					"friendly_name": "Rockets supporting this function"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket . \nVALUES ?x1 { :en.low_earth_orbit } \nVALUES ?x2 { :en.chrysler } \n?x1 :spaceflight.rocket_function.rockets_supporting_this_function ?x0 . \n?x2 :spaceflight.rocket_manufacturer.rockets_manufactured ?x0 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 191000601,
		"question": "what rockets that support low earth orbit are made by chrysler?",
		"answer": [
			"Saturn IB",
			"Saturn I"
		],
		"function": "none",
		"commonness": -25.76461195221662,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket",
					"class": "spaceflight.rocket",
					"friendly_name": "Rocket",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.low_earth_orbit",
					"class": "spaceflight.rocket_function",
					"friendly_name": "Low Earth orbit",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.chrysler",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "chrysler",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.rocket_function.rockets_supporting_this_function",
					"friendly_name": "Rockets supporting this function"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket . \nVALUES ?x1 { :en.low_earth_orbit } \nVALUES ?x2 { :en.chrysler } \n?x1 :spaceflight.rocket_function.rockets_supporting_this_function ?x0 . \n?x2 :spaceflight.rocket_manufacturer.rockets_manufactured ?x0 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 191000602,
		"question": "what rockets that support low earth orbit are made by chrysler llc?",
		"answer": [
			"Saturn IB",
			"Saturn I"
		],
		"function": "none",
		"commonness": -25.76461195221662,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "spaceflight.rocket",
					"class": "spaceflight.rocket",
					"friendly_name": "Rocket",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.low_earth_orbit",
					"class": "spaceflight.rocket_function",
					"friendly_name": "Low Earth orbit",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.chrysler",
					"class": "spaceflight.rocket_manufacturer",
					"friendly_name": "chrysler llc",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "spaceflight.rocket_function.rockets_supporting_this_function",
					"friendly_name": "Rockets supporting this function"
				},
				{
					"start": 2,
					"end": 0,
					"relation": "spaceflight.rocket_manufacturer.rockets_manufactured",
					"friendly_name": "Rockets Manufactured"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :spaceflight.rocket . \nVALUES ?x1 { :en.low_earth_orbit } \nVALUES ?x2 { :en.chrysler } \n?x1 :spaceflight.rocket_function.rockets_supporting_this_function ?x0 . \n?x2 :spaceflight.rocket_manufacturer.rockets_manufactured ?x0 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 192000000,
		"question": "united airlines provides which mode of transportation?",
		"answer": [
			"Air travel"
		],
		"function": "none",
		"commonness": -19.613355269160756,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "travel.transportation_mode",
					"class": "travel.transportation_mode",
					"friendly_name": "Transportation mode",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "travel.transportation",
					"class": "travel.transportation",
					"friendly_name": "Transportation",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.united_airlines",
					"class": "travel.transport_operator",
					"friendly_name": "United Airlines",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "travel.transportation.mode_of_transportation",
					"friendly_name": "Mode of transportation"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "travel.transportation.transport_operator",
					"friendly_name": "Transport operator"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :travel.transportation_mode . \n?x1 :type.object.type :travel.transportation . \nVALUES ?x2 { :en.united_airlines } \n?x1 :travel.transportation.mode_of_transportation ?x0 . \n?x1 :travel.transportation.transport_operator ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	}
]