[
	{
		"qid": 210000302,
		"question": "how many cities placed a bid on hosting the 2008 olympic games?",
		"answer": [
			"5"
		],
		"function": "count",
		"commonness": -21.34560336979508,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "olympics.olympic_bidding_city",
					"class": "olympics.olympic_bidding_city",
					"friendly_name": "Olympic bidding city",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "olympics.olympic_city_bid",
					"class": "olympics.olympic_city_bid",
					"friendly_name": "Olympic city bid",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "2008 olympic games",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "olympics.olympic_bidding_city.olympics_bid_on",
					"friendly_name": "Olympics bid on"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "olympics.olympic_city_bid.olympic_games",
					"friendly_name": "Olympic games"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :olympics.olympic_bidding_city . \n?x1 :type.object.type :olympics.olympic_city_bid . \nVALUES ?x2 { :en.2008_summer_olympics } \n?x0 :olympics.olympic_bidding_city.olympics_bid_on ?x1 . \n?x1 :olympics.olympic_city_bid.olympic_games ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 210000400,
		"question": "how many cities bid for the 2008 summer olympics?",
		"answer": [
			"5"
		],
		"function": "count",
		"commonness": -21.34560336979508,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "olympics.olympic_bidding_city",
					"class": "olympics.olympic_bidding_city",
					"friendly_name": "Olympic bidding city",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "olympics.olympic_city_bid",
					"class": "olympics.olympic_city_bid",
					"friendly_name": "Olympic city bid",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "2008 Summer Olympics",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "olympics.olympic_bidding_city.olympics_bid_on",
					"friendly_name": "Olympics bid on"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "olympics.olympic_city_bid.olympic_games",
					"friendly_name": "Olympic games"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :olympics.olympic_bidding_city . \n?x1 :type.object.type :olympics.olympic_city_bid . \nVALUES ?x2 { :en.2008_summer_olympics } \n?x0 :olympics.olympic_bidding_city.olympics_bid_on ?x1 . \n?x1 :olympics.olympic_city_bid.olympic_games ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 210000401,
		"question": "how many cities bid for the beijing olympics?",
		"answer": [
			"5"
		],
		"function": "count",
		"commonness": -21.34560336979508,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "olympics.olympic_bidding_city",
					"class": "olympics.olympic_bidding_city",
					"friendly_name": "Olympic bidding city",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "olympics.olympic_city_bid",
					"class": "olympics.olympic_city_bid",
					"friendly_name": "Olympic city bid",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "beijing olympics",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "olympics.olympic_bidding_city.olympics_bid_on",
					"friendly_name": "Olympics bid on"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "olympics.olympic_city_bid.olympic_games",
					"friendly_name": "Olympic games"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :olympics.olympic_bidding_city . \n?x1 :type.object.type :olympics.olympic_city_bid . \nVALUES ?x2 { :en.2008_summer_olympics } \n?x0 :olympics.olympic_bidding_city.olympics_bid_on ?x1 . \n?x1 :olympics.olympic_city_bid.olympic_games ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 210000402,
		"question": "how many cities bid for the 2008 olympic games?",
		"answer": [
			"5"
		],
		"function": "count",
		"commonness": -21.34560336979508,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "olympics.olympic_bidding_city",
					"class": "olympics.olympic_bidding_city",
					"friendly_name": "Olympic bidding city",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "olympics.olympic_city_bid",
					"class": "olympics.olympic_city_bid",
					"friendly_name": "Olympic city bid",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "2008 olympic games",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "olympics.olympic_bidding_city.olympics_bid_on",
					"friendly_name": "Olympics bid on"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "olympics.olympic_city_bid.olympic_games",
					"friendly_name": "Olympic games"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :olympics.olympic_bidding_city . \n?x1 :type.object.type :olympics.olympic_city_bid . \nVALUES ?x2 { :en.2008_summer_olympics } \n?x0 :olympics.olympic_bidding_city.olympics_bid_on ?x1 . \n?x1 :olympics.olympic_city_bid.olympic_games ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 210000501,
		"question": "beijing olympics was bid on by which cities?",
		"answer": [
			"5"
		],
		"function": "count",
		"commonness": -21.34560336979508,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "olympics.olympic_bidding_city",
					"class": "olympics.olympic_bidding_city",
					"friendly_name": "Olympic bidding city",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "olympics.olympic_city_bid",
					"class": "olympics.olympic_city_bid",
					"friendly_name": "Olympic city bid",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "beijing olympics",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "olympics.olympic_bidding_city.olympics_bid_on",
					"friendly_name": "Olympics bid on"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "olympics.olympic_city_bid.olympic_games",
					"friendly_name": "Olympic games"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :olympics.olympic_bidding_city . \n?x1 :type.object.type :olympics.olympic_city_bid . \nVALUES ?x2 { :en.2008_summer_olympics } \n?x0 :olympics.olympic_bidding_city.olympics_bid_on ?x1 . \n?x1 :olympics.olympic_city_bid.olympic_games ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 210000502,
		"question": "2008 olympic games was bid on by which cities?",
		"answer": [
			"5"
		],
		"function": "count",
		"commonness": -21.34560336979508,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "olympics.olympic_bidding_city",
					"class": "olympics.olympic_bidding_city",
					"friendly_name": "Olympic bidding city",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "olympics.olympic_city_bid",
					"class": "olympics.olympic_city_bid",
					"friendly_name": "Olympic city bid",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "2008 olympic games",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "olympics.olympic_bidding_city.olympics_bid_on",
					"friendly_name": "Olympics bid on"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "olympics.olympic_city_bid.olympic_games",
					"friendly_name": "Olympic games"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :olympics.olympic_bidding_city . \n?x1 :type.object.type :olympics.olympic_city_bid . \nVALUES ?x2 { :en.2008_summer_olympics } \n?x0 :olympics.olympic_bidding_city.olympics_bid_on ?x1 . \n?x1 :olympics.olympic_city_bid.olympic_games ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 210000600,
		"question": "how many countries have bid for the 2008 summer olympics?",
		"answer": [
			"5"
		],
		"function": "count",
		"commonness": -21.34560336979508,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "olympics.olympic_bidding_city",
					"class": "olympics.olympic_bidding_city",
					"friendly_name": "Olympic bidding city",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "olympics.olympic_city_bid",
					"class": "olympics.olympic_city_bid",
					"friendly_name": "Olympic city bid",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "2008 Summer Olympics",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "olympics.olympic_bidding_city.olympics_bid_on",
					"friendly_name": "Olympics bid on"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "olympics.olympic_city_bid.olympic_games",
					"friendly_name": "Olympic games"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :olympics.olympic_bidding_city . \n?x1 :type.object.type :olympics.olympic_city_bid . \nVALUES ?x2 { :en.2008_summer_olympics } \n?x0 :olympics.olympic_bidding_city.olympics_bid_on ?x1 . \n?x1 :olympics.olympic_city_bid.olympic_games ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 210000601,
		"question": "how many countries have bid for the beijing olympics?",
		"answer": [
			"5"
		],
		"function": "count",
		"commonness": -21.34560336979508,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "olympics.olympic_bidding_city",
					"class": "olympics.olympic_bidding_city",
					"friendly_name": "Olympic bidding city",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "olympics.olympic_city_bid",
					"class": "olympics.olympic_city_bid",
					"friendly_name": "Olympic city bid",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "beijing olympics",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "olympics.olympic_bidding_city.olympics_bid_on",
					"friendly_name": "Olympics bid on"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "olympics.olympic_city_bid.olympic_games",
					"friendly_name": "Olympic games"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :olympics.olympic_bidding_city . \n?x1 :type.object.type :olympics.olympic_city_bid . \nVALUES ?x2 { :en.2008_summer_olympics } \n?x0 :olympics.olympic_bidding_city.olympics_bid_on ?x1 . \n?x1 :olympics.olympic_city_bid.olympic_games ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 210000602,
		"question": "how many countries have bid for the 2008 olympic games?",
		"answer": [
			"5"
		],
		"function": "count",
		"commonness": -21.34560336979508,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "olympics.olympic_bidding_city",
					"class": "olympics.olympic_bidding_city",
					"friendly_name": "Olympic bidding city",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "olympics.olympic_city_bid",
					"class": "olympics.olympic_city_bid",
					"friendly_name": "Olympic city bid",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "2008 olympic games",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "olympics.olympic_bidding_city.olympics_bid_on",
					"friendly_name": "Olympics bid on"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "olympics.olympic_city_bid.olympic_games",
					"friendly_name": "Olympic games"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :olympics.olympic_bidding_city . \n?x1 :type.object.type :olympics.olympic_city_bid . \nVALUES ?x2 { :en.2008_summer_olympics } \n?x0 :olympics.olympic_bidding_city.olympics_bid_on ?x1 . \n?x1 :olympics.olympic_city_bid.olympic_games ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 210000700,
		"question": "how many cities applied to host the 2008 summer olympics?",
		"answer": [
			"5"
		],
		"function": "count",
		"commonness": -21.34560336979508,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "olympics.olympic_bidding_city",
					"class": "olympics.olympic_bidding_city",
					"friendly_name": "Olympic bidding city",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "olympics.olympic_city_bid",
					"class": "olympics.olympic_city_bid",
					"friendly_name": "Olympic city bid",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "2008 Summer Olympics",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "olympics.olympic_bidding_city.olympics_bid_on",
					"friendly_name": "Olympics bid on"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "olympics.olympic_city_bid.olympic_games",
					"friendly_name": "Olympic games"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :olympics.olympic_bidding_city . \n?x1 :type.object.type :olympics.olympic_city_bid . \nVALUES ?x2 { :en.2008_summer_olympics } \n?x0 :olympics.olympic_bidding_city.olympics_bid_on ?x1 . \n?x1 :olympics.olympic_city_bid.olympic_games ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 210000702,
		"question": "how many cities applied to host the 2008 olympic games?",
		"answer": [
			"5"
		],
		"function": "count",
		"commonness": -21.34560336979508,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "olympics.olympic_bidding_city",
					"class": "olympics.olympic_bidding_city",
					"friendly_name": "Olympic bidding city",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "olympics.olympic_city_bid",
					"class": "olympics.olympic_city_bid",
					"friendly_name": "Olympic city bid",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.2008_summer_olympics",
					"class": "olympics.olympic_games",
					"friendly_name": "2008 olympic games",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "olympics.olympic_bidding_city.olympics_bid_on",
					"friendly_name": "Olympics bid on"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "olympics.olympic_city_bid.olympic_games",
					"friendly_name": "Olympic games"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :olympics.olympic_bidding_city . \n?x1 :type.object.type :olympics.olympic_city_bid . \nVALUES ?x2 { :en.2008_summer_olympics } \n?x0 :olympics.olympic_bidding_city.olympics_bid_on ?x1 . \n?x1 :olympics.olympic_city_bid.olympic_games ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 213000000,
		"question": "how many american football players from the united states of america is also a presenter?",
		"answer": [
			"7"
		],
		"function": "count",
		"commonness": -15.490562875524642,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "american_football.football_player",
					"class": "american_football.football_player",
					"friendly_name": "American football player",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.country",
					"friendly_name": "United States of America",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.presenter",
					"class": "people.profession",
					"friendly_name": "Presenter",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.nationality",
					"friendly_name": "Country of nationality"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "people.person.profession",
					"friendly_name": "Profession"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :american_football.football_player . \nVALUES ?x1 { :en.united_states_of_america } \nVALUES ?x2 { :en.presenter } \n?x0 :people.person.nationality ?x1 . \n?x0 :people.person.profession ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 213000001,
		"question": "how many american football players from the us is also a presenter?",
		"answer": [
			"7"
		],
		"function": "count",
		"commonness": -15.490562875524642,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "american_football.football_player",
					"class": "american_football.football_player",
					"friendly_name": "American football player",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.country",
					"friendly_name": "us",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.presenter",
					"class": "people.profession",
					"friendly_name": "Presenter",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.nationality",
					"friendly_name": "Country of nationality"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "people.person.profession",
					"friendly_name": "Profession"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :american_football.football_player . \nVALUES ?x1 { :en.united_states_of_america } \nVALUES ?x2 { :en.presenter } \n?x0 :people.person.nationality ?x1 . \n?x0 :people.person.profession ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 213000002,
		"question": "how many american football players from the united states is also a presenter?",
		"answer": [
			"7"
		],
		"function": "count",
		"commonness": -15.490562875524642,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "american_football.football_player",
					"class": "american_football.football_player",
					"friendly_name": "American football player",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.country",
					"friendly_name": "united states",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.presenter",
					"class": "people.profession",
					"friendly_name": "Presenter",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.nationality",
					"friendly_name": "Country of nationality"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "people.person.profession",
					"friendly_name": "Profession"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :american_football.football_player . \nVALUES ?x1 { :en.united_states_of_america } \nVALUES ?x2 { :en.presenter } \n?x0 :people.person.nationality ?x1 . \n?x0 :people.person.profession ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 213000100,
		"question": "of all american football players in the united states of america, how many of them are also a presenter?",
		"answer": [
			"7"
		],
		"function": "count",
		"commonness": -15.490562875524642,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "american_football.football_player",
					"class": "american_football.football_player",
					"friendly_name": "American football player",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.country",
					"friendly_name": "United States of America",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.presenter",
					"class": "people.profession",
					"friendly_name": "Presenter",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.nationality",
					"friendly_name": "Country of nationality"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "people.person.profession",
					"friendly_name": "Profession"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :american_football.football_player . \nVALUES ?x1 { :en.united_states_of_america } \nVALUES ?x2 { :en.presenter } \n?x0 :people.person.nationality ?x1 . \n?x0 :people.person.profession ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 213000101,
		"question": "of all american football players in the us, how many of them are also a presenter?",
		"answer": [
			"7"
		],
		"function": "count",
		"commonness": -15.490562875524642,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "american_football.football_player",
					"class": "american_football.football_player",
					"friendly_name": "American football player",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.country",
					"friendly_name": "us",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.presenter",
					"class": "people.profession",
					"friendly_name": "Presenter",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.nationality",
					"friendly_name": "Country of nationality"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "people.person.profession",
					"friendly_name": "Profession"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :american_football.football_player . \nVALUES ?x1 { :en.united_states_of_america } \nVALUES ?x2 { :en.presenter } \n?x0 :people.person.nationality ?x1 . \n?x0 :people.person.profession ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	},
	{
		"qid": 213000102,
		"question": "of all american football players in the united states, how many of them are also a presenter?",
		"answer": [
			"7"
		],
		"function": "count",
		"commonness": -15.490562875524642,
		"num_node": 3,
		"num_edge": 2,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "american_football.football_player",
					"class": "american_football.football_player",
					"friendly_name": "American football player",
					"question_node": 1,
					"function": "count"
				},
				{
					"nid": 1,
					"node_type": "entity",
					"id": "en.united_states_of_america",
					"class": "location.country",
					"friendly_name": "united states",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "entity",
					"id": "en.presenter",
					"class": "people.profession",
					"friendly_name": "Presenter",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 0,
					"end": 1,
					"relation": "people.person.nationality",
					"friendly_name": "Country of nationality"
				},
				{
					"start": 0,
					"end": 2,
					"relation": "people.person.profession",
					"friendly_name": "Profession"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (COUNT(?x0) AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :american_football.football_player . \nVALUES ?x1 { :en.united_states_of_america } \nVALUES ?x2 { :en.presenter } \n?x0 :people.person.nationality ?x1 . \n?x0 :people.person.profession ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x1 != ?x2  )\n}\n}"
	}
]