[
	{
		"qid": 244000100,
		"question": "who managed the 2007 world series runner up?",
		"answer": [
			"Jim Leyland",
			"Don Baylor",
			"Clint Hurdle"
		],
		"function": "none",
		"commonness": -33.313388228157265,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "baseball.baseball_manager",
					"class": "baseball.baseball_manager",
					"friendly_name": "Baseball Manager",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "baseball.baseball_historical_managerial_position",
					"class": "baseball.baseball_historical_managerial_position",
					"friendly_name": "Baseball Historical Managerial Position",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "baseball.baseball_team",
					"class": "baseball.baseball_team",
					"friendly_name": "Baseball Team",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.2007_world_series",
					"class": "sports.sports_championship_event",
					"friendly_name": "2007 World Series",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "baseball.baseball_historical_managerial_position.manager",
					"friendly_name": "Manager"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "baseball.baseball_historical_managerial_position.team",
					"friendly_name": "Team"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "sports.sports_championship_event.runner_up",
					"friendly_name": "Runner-up"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :baseball.baseball_manager . \n?x1 :type.object.type :baseball.baseball_historical_managerial_position . \n?x2 :type.object.type :baseball.baseball_team . \nVALUES ?x3 { :en.2007_world_series } \n?x1 :baseball.baseball_historical_managerial_position.manager ?x0 . \n?x1 :baseball.baseball_historical_managerial_position.team ?x2 . \n?x3 :sports.sports_championship_event.runner_up ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 244000101,
		"question": "who managed the ws07 runner up?",
		"answer": [
			"Jim Leyland",
			"Don Baylor",
			"Clint Hurdle"
		],
		"function": "none",
		"commonness": -33.313388228157265,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "baseball.baseball_manager",
					"class": "baseball.baseball_manager",
					"friendly_name": "Baseball Manager",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "baseball.baseball_historical_managerial_position",
					"class": "baseball.baseball_historical_managerial_position",
					"friendly_name": "Baseball Historical Managerial Position",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "baseball.baseball_team",
					"class": "baseball.baseball_team",
					"friendly_name": "Baseball Team",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.2007_world_series",
					"class": "sports.sports_championship_event",
					"friendly_name": "ws07",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "baseball.baseball_historical_managerial_position.manager",
					"friendly_name": "Manager"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "baseball.baseball_historical_managerial_position.team",
					"friendly_name": "Team"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "sports.sports_championship_event.runner_up",
					"friendly_name": "Runner-up"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :baseball.baseball_manager . \n?x1 :type.object.type :baseball.baseball_historical_managerial_position . \n?x2 :type.object.type :baseball.baseball_team . \nVALUES ?x3 { :en.2007_world_series } \n?x1 :baseball.baseball_historical_managerial_position.manager ?x0 . \n?x1 :baseball.baseball_historical_managerial_position.team ?x2 . \n?x3 :sports.sports_championship_event.runner_up ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 244000200,
		"question": "who was the manager of the losing team in the 2007 world series?",
		"answer": [
			"Jim Leyland",
			"Clint Hurdle",
			"Don Baylor"
		],
		"function": "none",
		"commonness": -33.313388228157265,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "baseball.baseball_manager",
					"class": "baseball.baseball_manager",
					"friendly_name": "Baseball Manager",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "baseball.baseball_historical_managerial_position",
					"class": "baseball.baseball_historical_managerial_position",
					"friendly_name": "Baseball Historical Managerial Position",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "baseball.baseball_team",
					"class": "baseball.baseball_team",
					"friendly_name": "Baseball Team",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.2007_world_series",
					"class": "sports.sports_championship_event",
					"friendly_name": "2007 World Series",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "baseball.baseball_historical_managerial_position.manager",
					"friendly_name": "Manager"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "baseball.baseball_historical_managerial_position.team",
					"friendly_name": "Team"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "sports.sports_championship_event.runner_up",
					"friendly_name": "Runner-up"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :baseball.baseball_manager . \n?x1 :type.object.type :baseball.baseball_historical_managerial_position . \n?x2 :type.object.type :baseball.baseball_team . \nVALUES ?x3 { :en.2007_world_series } \n?x1 :baseball.baseball_historical_managerial_position.manager ?x0 . \n?x1 :baseball.baseball_historical_managerial_position.team ?x2 . \n?x3 :sports.sports_championship_event.runner_up ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 244000201,
		"question": "who was the manager of the losing team in the ws07?",
		"answer": [
			"Clint Hurdle",
			"Jim Leyland",
			"Don Baylor"
		],
		"function": "none",
		"commonness": -33.313388228157265,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "baseball.baseball_manager",
					"class": "baseball.baseball_manager",
					"friendly_name": "Baseball Manager",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "baseball.baseball_historical_managerial_position",
					"class": "baseball.baseball_historical_managerial_position",
					"friendly_name": "Baseball Historical Managerial Position",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "baseball.baseball_team",
					"class": "baseball.baseball_team",
					"friendly_name": "Baseball Team",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.2007_world_series",
					"class": "sports.sports_championship_event",
					"friendly_name": "ws07",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "baseball.baseball_historical_managerial_position.manager",
					"friendly_name": "Manager"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "baseball.baseball_historical_managerial_position.team",
					"friendly_name": "Team"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "sports.sports_championship_event.runner_up",
					"friendly_name": "Runner-up"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :baseball.baseball_manager . \n?x1 :type.object.type :baseball.baseball_historical_managerial_position . \n?x2 :type.object.type :baseball.baseball_team . \nVALUES ?x3 { :en.2007_world_series } \n?x1 :baseball.baseball_historical_managerial_position.manager ?x0 . \n?x1 :baseball.baseball_historical_managerial_position.team ?x2 . \n?x3 :sports.sports_championship_event.runner_up ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 244000300,
		"question": "who manage the team which won the runner-up of 2007 world series?",
		"answer": [
			"Don Baylor",
			"Jim Leyland",
			"Clint Hurdle"
		],
		"function": "none",
		"commonness": -33.313388228157265,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "baseball.baseball_manager",
					"class": "baseball.baseball_manager",
					"friendly_name": "Baseball Manager",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "baseball.baseball_historical_managerial_position",
					"class": "baseball.baseball_historical_managerial_position",
					"friendly_name": "Baseball Historical Managerial Position",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "baseball.baseball_team",
					"class": "baseball.baseball_team",
					"friendly_name": "Baseball Team",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.2007_world_series",
					"class": "sports.sports_championship_event",
					"friendly_name": "2007 World Series",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "baseball.baseball_historical_managerial_position.manager",
					"friendly_name": "Manager"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "baseball.baseball_historical_managerial_position.team",
					"friendly_name": "Team"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "sports.sports_championship_event.runner_up",
					"friendly_name": "Runner-up"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :baseball.baseball_manager . \n?x1 :type.object.type :baseball.baseball_historical_managerial_position . \n?x2 :type.object.type :baseball.baseball_team . \nVALUES ?x3 { :en.2007_world_series } \n?x1 :baseball.baseball_historical_managerial_position.manager ?x0 . \n?x1 :baseball.baseball_historical_managerial_position.team ?x2 . \n?x3 :sports.sports_championship_event.runner_up ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 244000301,
		"question": "who manage the team which won the runner-up of ws07?",
		"answer": [
			"Jim Leyland",
			"Don Baylor",
			"Clint Hurdle"
		],
		"function": "none",
		"commonness": -33.313388228157265,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "baseball.baseball_manager",
					"class": "baseball.baseball_manager",
					"friendly_name": "Baseball Manager",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "baseball.baseball_historical_managerial_position",
					"class": "baseball.baseball_historical_managerial_position",
					"friendly_name": "Baseball Historical Managerial Position",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "baseball.baseball_team",
					"class": "baseball.baseball_team",
					"friendly_name": "Baseball Team",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.2007_world_series",
					"class": "sports.sports_championship_event",
					"friendly_name": "ws07",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "baseball.baseball_historical_managerial_position.manager",
					"friendly_name": "Manager"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "baseball.baseball_historical_managerial_position.team",
					"friendly_name": "Team"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "sports.sports_championship_event.runner_up",
					"friendly_name": "Runner-up"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :baseball.baseball_manager . \n?x1 :type.object.type :baseball.baseball_historical_managerial_position . \n?x2 :type.object.type :baseball.baseball_team . \nVALUES ?x3 { :en.2007_world_series } \n?x1 :baseball.baseball_historical_managerial_position.manager ?x0 . \n?x1 :baseball.baseball_historical_managerial_position.team ?x2 . \n?x3 :sports.sports_championship_event.runner_up ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 244000400,
		"question": "in the 2007 world series who was the manager of the team that was the runner-up?",
		"answer": [
			"Don Baylor",
			"Clint Hurdle",
			"Jim Leyland"
		],
		"function": "none",
		"commonness": -33.313388228157265,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "baseball.baseball_manager",
					"class": "baseball.baseball_manager",
					"friendly_name": "Baseball Manager",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "baseball.baseball_historical_managerial_position",
					"class": "baseball.baseball_historical_managerial_position",
					"friendly_name": "Baseball Historical Managerial Position",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "baseball.baseball_team",
					"class": "baseball.baseball_team",
					"friendly_name": "Baseball Team",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.2007_world_series",
					"class": "sports.sports_championship_event",
					"friendly_name": "2007 World Series",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "baseball.baseball_historical_managerial_position.manager",
					"friendly_name": "Manager"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "baseball.baseball_historical_managerial_position.team",
					"friendly_name": "Team"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "sports.sports_championship_event.runner_up",
					"friendly_name": "Runner-up"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :baseball.baseball_manager . \n?x1 :type.object.type :baseball.baseball_historical_managerial_position . \n?x2 :type.object.type :baseball.baseball_team . \nVALUES ?x3 { :en.2007_world_series } \n?x1 :baseball.baseball_historical_managerial_position.manager ?x0 . \n?x1 :baseball.baseball_historical_managerial_position.team ?x2 . \n?x3 :sports.sports_championship_event.runner_up ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 244000401,
		"question": "in the ws07 who was the manager of the team that was the runner-up?",
		"answer": [
			"Don Baylor",
			"Jim Leyland",
			"Clint Hurdle"
		],
		"function": "none",
		"commonness": -33.313388228157265,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "baseball.baseball_manager",
					"class": "baseball.baseball_manager",
					"friendly_name": "Baseball Manager",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "baseball.baseball_historical_managerial_position",
					"class": "baseball.baseball_historical_managerial_position",
					"friendly_name": "Baseball Historical Managerial Position",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "baseball.baseball_team",
					"class": "baseball.baseball_team",
					"friendly_name": "Baseball Team",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.2007_world_series",
					"class": "sports.sports_championship_event",
					"friendly_name": "ws07",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "baseball.baseball_historical_managerial_position.manager",
					"friendly_name": "Manager"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "baseball.baseball_historical_managerial_position.team",
					"friendly_name": "Team"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "sports.sports_championship_event.runner_up",
					"friendly_name": "Runner-up"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :baseball.baseball_manager . \n?x1 :type.object.type :baseball.baseball_historical_managerial_position . \n?x2 :type.object.type :baseball.baseball_team . \nVALUES ?x3 { :en.2007_world_series } \n?x1 :baseball.baseball_historical_managerial_position.manager ?x0 . \n?x1 :baseball.baseball_historical_managerial_position.team ?x2 . \n?x3 :sports.sports_championship_event.runner_up ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 244000500,
		"question": "what is the name of the manager of the second-place baseball team in the 2007 world series?",
		"answer": [
			"Jim Leyland",
			"Don Baylor",
			"Clint Hurdle"
		],
		"function": "none",
		"commonness": -33.313388228157265,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "baseball.baseball_manager",
					"class": "baseball.baseball_manager",
					"friendly_name": "Baseball Manager",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "baseball.baseball_historical_managerial_position",
					"class": "baseball.baseball_historical_managerial_position",
					"friendly_name": "Baseball Historical Managerial Position",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "baseball.baseball_team",
					"class": "baseball.baseball_team",
					"friendly_name": "Baseball Team",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.2007_world_series",
					"class": "sports.sports_championship_event",
					"friendly_name": "2007 World Series",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "baseball.baseball_historical_managerial_position.manager",
					"friendly_name": "Manager"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "baseball.baseball_historical_managerial_position.team",
					"friendly_name": "Team"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "sports.sports_championship_event.runner_up",
					"friendly_name": "Runner-up"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :baseball.baseball_manager . \n?x1 :type.object.type :baseball.baseball_historical_managerial_position . \n?x2 :type.object.type :baseball.baseball_team . \nVALUES ?x3 { :en.2007_world_series } \n?x1 :baseball.baseball_historical_managerial_position.manager ?x0 . \n?x1 :baseball.baseball_historical_managerial_position.team ?x2 . \n?x3 :sports.sports_championship_event.runner_up ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 244000501,
		"question": "what is the name of the manager of the second-place baseball team in the ws07?",
		"answer": [
			"Jim Leyland",
			"Clint Hurdle",
			"Don Baylor"
		],
		"function": "none",
		"commonness": -33.313388228157265,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "baseball.baseball_manager",
					"class": "baseball.baseball_manager",
					"friendly_name": "Baseball Manager",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "baseball.baseball_historical_managerial_position",
					"class": "baseball.baseball_historical_managerial_position",
					"friendly_name": "Baseball Historical Managerial Position",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "baseball.baseball_team",
					"class": "baseball.baseball_team",
					"friendly_name": "Baseball Team",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.2007_world_series",
					"class": "sports.sports_championship_event",
					"friendly_name": "ws07",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "baseball.baseball_historical_managerial_position.manager",
					"friendly_name": "Manager"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "baseball.baseball_historical_managerial_position.team",
					"friendly_name": "Team"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "sports.sports_championship_event.runner_up",
					"friendly_name": "Runner-up"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :baseball.baseball_manager . \n?x1 :type.object.type :baseball.baseball_historical_managerial_position . \n?x2 :type.object.type :baseball.baseball_team . \nVALUES ?x3 { :en.2007_world_series } \n?x1 :baseball.baseball_historical_managerial_position.manager ?x0 . \n?x1 :baseball.baseball_historical_managerial_position.team ?x2 . \n?x3 :sports.sports_championship_event.runner_up ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 244000600,
		"question": "the 2007 world series runner-up was managed by who?",
		"answer": [
			"Jim Leyland",
			"Clint Hurdle",
			"Don Baylor"
		],
		"function": "none",
		"commonness": -33.313388228157265,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "baseball.baseball_manager",
					"class": "baseball.baseball_manager",
					"friendly_name": "Baseball Manager",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "baseball.baseball_historical_managerial_position",
					"class": "baseball.baseball_historical_managerial_position",
					"friendly_name": "Baseball Historical Managerial Position",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "baseball.baseball_team",
					"class": "baseball.baseball_team",
					"friendly_name": "Baseball Team",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.2007_world_series",
					"class": "sports.sports_championship_event",
					"friendly_name": "2007 World Series",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "baseball.baseball_historical_managerial_position.manager",
					"friendly_name": "Manager"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "baseball.baseball_historical_managerial_position.team",
					"friendly_name": "Team"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "sports.sports_championship_event.runner_up",
					"friendly_name": "Runner-up"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :baseball.baseball_manager . \n?x1 :type.object.type :baseball.baseball_historical_managerial_position . \n?x2 :type.object.type :baseball.baseball_team . \nVALUES ?x3 { :en.2007_world_series } \n?x1 :baseball.baseball_historical_managerial_position.manager ?x0 . \n?x1 :baseball.baseball_historical_managerial_position.team ?x2 . \n?x3 :sports.sports_championship_event.runner_up ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	},
	{
		"qid": 244000601,
		"question": "the ws07 runner-up was managed by who?",
		"answer": [
			"Don Baylor",
			"Clint Hurdle",
			"Jim Leyland"
		],
		"function": "none",
		"commonness": -33.313388228157265,
		"num_node": 4,
		"num_edge": 3,
		"graph_query": {
			"nodes": [
				{
					"nid": 0,
					"node_type": "class",
					"id": "baseball.baseball_manager",
					"class": "baseball.baseball_manager",
					"friendly_name": "Baseball Manager",
					"question_node": 1,
					"function": "none"
				},
				{
					"nid": 1,
					"node_type": "class",
					"id": "baseball.baseball_historical_managerial_position",
					"class": "baseball.baseball_historical_managerial_position",
					"friendly_name": "Baseball Historical Managerial Position",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 2,
					"node_type": "class",
					"id": "baseball.baseball_team",
					"class": "baseball.baseball_team",
					"friendly_name": "Baseball Team",
					"question_node": 0,
					"function": "none"
				},
				{
					"nid": 3,
					"node_type": "entity",
					"id": "en.2007_world_series",
					"class": "sports.sports_championship_event",
					"friendly_name": "ws07",
					"question_node": 0,
					"function": "none"
				}
			],
			"edges": [
				{
					"start": 1,
					"end": 0,
					"relation": "baseball.baseball_historical_managerial_position.manager",
					"friendly_name": "Manager"
				},
				{
					"start": 1,
					"end": 2,
					"relation": "baseball.baseball_historical_managerial_position.team",
					"friendly_name": "Team"
				},
				{
					"start": 3,
					"end": 2,
					"relation": "sports.sports_championship_event.runner_up",
					"friendly_name": "Runner-up"
				}
			]
		},
		"sparql_query": "PREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX : <http://rdf.freebase.com/ns/> \nSELECT (?x0 AS ?value) WHERE {\nSELECT DISTINCT ?x0  WHERE { \n?x0 :type.object.type :baseball.baseball_manager . \n?x1 :type.object.type :baseball.baseball_historical_managerial_position . \n?x2 :type.object.type :baseball.baseball_team . \nVALUES ?x3 { :en.2007_world_series } \n?x1 :baseball.baseball_historical_managerial_position.manager ?x0 . \n?x1 :baseball.baseball_historical_managerial_position.team ?x2 . \n?x3 :sports.sports_championship_event.runner_up ?x2 . \nFILTER ( ?x0 != ?x1 && ?x0 != ?x2 && ?x0 != ?x3 && ?x1 != ?x2 && ?x1 != ?x3 && ?x2 != ?x3  )\n}\n}"
	}
]